#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СодержимоеОбщегоМакета(Знач ИмяМакета) Экспорт

	СодержимоеМакета = ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();     
	Возврат СодержимоеМакета; 
	
КонецФункции

Функция СовместимостьВнешнейКомпонентыИзФайла(Знач ИмяМакета) Экспорт
	
	ВремИмяМакета = СтрРазделить(ИмяМакета,".", Ложь);
	ВремИмяМакета = ВремИмяМакета[ВремИмяМакета.ВГраница()];
	ДвоичныеДанные = ПолучитьОбщийМакет(ВремИмяМакета);
		
	Результат = ВнешниеКомпонентыБПО.ИнформацияОКомпонентеИзФайла(ДвоичныеДанные, Ложь);
	Если Результат.Разобрано Тогда
		Возврат Результат.Реквизиты;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПоставляемыеДрайверы() Экспорт
	
	МодулиОбновления = Новый Массив();
	Если ОбщегоНазначенияБПО.ИспользуетсяУстройстваВвода() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеУстройстваВвода"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеПлатежныеСистемы"));       
	КонецЕсли;          
	Если ОбщегоНазначенияБПО.ИспользуетсяДисплеиПокупателя() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеДисплеиПокупателя"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяВесовоеОборудование() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеВесовоеОборудование"));       
	КонецЕсли;                          
// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеТерминалыСбораДанных"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяПринтерыЭтикеток() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеПринтерыЭтикеток"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяСчитывательRFID() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеСчитывательRFID"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуетсяУстройствоРаспознавания() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеУстройствоРаспознавания"));       
	КонецЕсли;
	Если ОбщегоНазначенияБПО.ИспользуютсяОблачныеККТ() Тогда
		МодулиОбновления.Добавить(ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеОблачныеККТ"));       
	КонецЕсли;
// -- НеМобильноеПриложение
	ДрайверыОборудования = МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования();
	Для Каждого МодульОбновления Из МодулиОбновления Цикл
		МодульОбновления.ОбновитьПоставляемыеДрайвера(ДрайверыОборудования);
	КонецЦикла;
	
	Возврат ДрайверыОборудования;
	
КонецФункции

Функция ИдентификаторыДрайверов() Экспорт
	
	ДрайверыОборудования = ПоставляемыеДрайверы();
	
	ДрайверыОборудования.Свернуть("ИдентификаторОбъекта, СнятСПоддержки");
	Результат = Новый Массив();
	Для каждого Элемент Из ДрайверыОборудования Цикл
		Если Не Элемент.СнятСПоддержки Тогда
			Результат.Добавить(Элемент.ИдентификаторОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыТипыОборудования() Экспорт
	
	Результат = Новый Структура();
	ДоступныеТипы = ВсеТипыОборудования(Истина);
	Для каждого Значение Из ДоступныеТипы Цикл
		
		ИмяЗначения = ОбщегоНазначенияБПО.ИмяЗначенияПеречисления(Значение);
		Результат.Вставить(ИмяЗначения, Ложь);
		
	КонецЦикла;
	
	// Дополнение типов оборудования
	Результат.Вставить("ФискальныйРегистратор", Ложь);
	
	Возврат Результат;

КонецФункции

// Получить соответствие типов оборудования
//
// Возвращаемое значение:
//   Соответствие -
//
Функция СоответствиеТиповОборудования() Экспорт
	
	Результат = Новый Соответствие();
	
	ДоступныеТипы = ВсеТипыОборудования(Истина);
	Для каждого Значение Из ДоступныеТипы Цикл
		
		ИмяЗначения = ОбщегоНазначенияБПО.ИмяЗначенияПеречисления(Значение);
		Результат.Вставить(ИмяЗначения, Значение);
		
	КонецЦикла;
	
	// Russian alphabet. Не локализовывать
	Результат.Вставить("УстройствоВвода"       , Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода); //@NON-NLS-1 @NON-NLS-2   
	
	// English alphabet. 
	Результат.Вставить("BarcodeScanner"        , Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода); //@NON-NLS-1 @NON-NLS-2      
	Результат.Вставить("CardReader"            , Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("KKT"                   , Перечисления.ТипыПодключаемогоОборудования.ККТ); //@NON-NLS-1 @NON-NLS-2    
	Результат.Вставить("FiscalRegistrar"       , Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("ReceiptPrinter"        , Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("CustomerDisplay"       , Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("DataCollectionTerminal", Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("POSTerminal"           , Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("WeighingScales"        , Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("LabelPrintingScale"    , Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("LabelPrinter"          , Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток); //@NON-NLS-1 @NON-NLS-2   
	Результат.Вставить("RFIDReader"            , Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID); //@NON-NLS-1 @NON-NLS-2    
	Результат.Вставить("Recognizer"            , Перечисления.ТипыПодключаемогоОборудования.УстройствоРаспознавания); //@NON-NLS-1 @NON-NLS-2       
	
	Возврат Результат;
	
КонецФункции

// Возвращает список доступных типов оборудования.
//
// Параметры:
//  ВключаяНеиспользуемые - Булево - по умолчанию Ложь, добавить неиспользуемые типы, для совместимости
// 
// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.ТипыПодключаемогоОборудования - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ДоступныеТипыОборудования(ВключаяНеиспользуемые = Ложь) Экспорт
	
	СписокТиповОборудования = Новый Массив;
	СтандартнаяОбработка = Истина;
	
	МенеджерОборудованияВызовСервераПереопределяемый.ДоступныеТипыОборудования(СписокТиповОборудования, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СписокТиповОборудования.Очистить();
		Если ОбщегоНазначенияБПО.ИспользуетсяУстройстваВвода() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
		// ++ НеМобильноеПриложение
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт);
		// -- НеМобильноеПриложение     
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
			Если ВключаяНеиспользуемые Тогда
				СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
			КонецЕсли;
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяДисплеиПокупателя() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя);
		КонецЕсли;
		// ++ НеМобильноеПриложение
		Если ОбщегоНазначенияБПО.ИспользуетсяТерминалыСбораДанных() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных);
		КонецЕсли;
		// -- НеМобильноеПриложение     
		Если ОбщегоНазначенияБПО.ИспользуетсяПлатежныеСистемы() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяВесовоеОборудование() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы);  
		// ++ НеМобильноеПриложение
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
		// -- НеМобильноеПриложение     
		КонецЕсли;
		// ++ НеМобильноеПриложение
		Если ОбщегоНазначенияБПО.ИспользуетсяПринтерыЭтикеток() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяСчитывательRFID() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID);
		КонецЕсли;
		Если ОбщегоНазначенияБПО.ИспользуетсяУстройствоРаспознавания() Тогда
			СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.УстройствоРаспознавания);
		КонецЕсли;
		
		Если ОбщегоНазначенияБПО.ИспользуетсяНесертифицированноеОборудование() Тогда
			МодульОборудованиеНесертифицированное = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеНесертифицированное");
			Если ВключаяНеиспользуемые Или МодульОборудованиеНесертифицированное.ДоступноНесертифицированноеОборудование() Тогда
				ТипыОборудования = МенеджерОборудования.ДоступныеТипыНесертифицированногоОборудования();
				Для Каждого Элемент Из ТипыОборудования Цикл
					СписокТиповОборудования.Добавить(Элемент);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// -- НеМобильноеПриложение     
	КонецЕсли;
	
	// ++ НеМобильноеПриложение
	УдалитьККМОфлайн = СписокТиповОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.УдалитьККМОфлайн);
	Если УдалитьККМОфлайн <> Неопределено Тогда
		СписокТиповОборудования.Удалить(УдалитьККМОфлайн);
	КонецЕсли;
	
	// -- НеМобильноеПриложение     
	Возврат СписокТиповОборудования;
	
КонецФункции

// Возвращает список всех типов оборудования.
//
// Параметры:
//  ВключаяНеиспользуемые - Булево - по умолчанию Ложь, добавить неиспользуемые типы, для совместимости
// 
// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.ТипыПодключаемогоОборудования - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ВсеТипыОборудования(ВключаяНеиспользуемые = Ложь) Экспорт
	
	СписокТиповОборудования = Новый Массив;
	СтандартнаяОбработка = Истина;
	
	СписокТиповОборудования.Очистить();
	Для Каждого ТипОборудования Из Перечисления.ТипыПодключаемогоОборудования Цикл
		
		Если ВключаяНеиспользуемые И 
			(ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокТиповОборудования.Добавить(ТипОборудования);
		
	КонецЦикла;
	
	// ++ НеМобильноеПриложение
	Если ОбщегоНазначенияБПО.ИспользуетсяНесертифицированноеОборудование() Тогда
		МодульОборудованиеНесертифицированное = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеНесертифицированное");
		Если ВключаяНеиспользуемые Или МодульОборудованиеНесертифицированное.ДоступноНесертифицированноеОборудование() Тогда
			ТипыОборудования = МенеджерОборудования.ДоступныеТипыНесертифицированногоОборудования();
			Для Каждого Элемент Из ТипыОборудования Цикл
				СписокТиповОборудования.Добавить(Элемент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// -- НеМобильноеПриложение     
	
	// ++ НеМобильноеПриложение
	УдалитьККМОфлайн = СписокТиповОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.УдалитьККМОфлайн);
	Если УдалитьККМОфлайн <> Неопределено Тогда
		СписокТиповОборудования.Удалить(УдалитьККМОфлайн);
	КонецЕсли;
	
	// -- НеМобильноеПриложение     
	Возврат СписокТиповОборудования;
	
КонецФункции

#Область КлассификацияОшибок

Функция НовыйКлассОшибки(Класс, КраткоеОписание, ПодробноеОписание, Получатель, ЛокальнаяОбработкаОшибки = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Группа", Класс);
	Результат.Вставить("МаскиПоиска", Новый Массив);
	Результат.Вставить("КраткоеОписание", КраткоеОписание);
	Результат.Вставить("ПодробноеОписание", ПодробноеОписание);
	Результат.Вставить("Получатель", Получатель);
	Результат.Вставить("ЛокальнаяОбработкаОшибки", ЛокальнаяОбработкаОшибки);
	Возврат Результат;
	
КонецФункции

Функция КлассификаторОшибок() Экспорт
	
	Результат = Новый Массив;
	ТаблицаГрупп = Новый Соответствие;
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаМаркировкиБлокировка",
		НСтр("ru = 'Ошибка маркировки';
			|en = 'Marking error'"),
		НСтр("ru = 'Касса заблокировала продажу маркированных товаров, так как в течение длительного времени не удаётся передать уведомления о продаже или получить квитанции от системы маркировки. Обычно блокировка возникает при отсутствии обмена с ИСМ в течение около месяца. Необходимо восстановить передачу уведомлений и выполнить синхронизацию.';
			|en = 'The cash register locked sales of marked goods, as it was impossible to send sales notifications or receive receipts from the marking system for a long time. Usually, a lock occurs when there is no exchange with the information marking system for about a month. Restore notification transmission and synchronize.'"),
		"Пользователь",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаМаркировкиБлокировка", НСтр("ru = 'маркиров.*заблокирована';
																	|en = 'marking.*locked'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Ложь;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаМаркировки",
		НСтр("ru = 'Ошибка маркировки';
			|en = 'Marking error'"),
		НСтр("ru = 'Код маркировки не может быть обработан или проверен ККТ. Проверьте корректность КМ, а также отсутствие ограничений или блокировок по работе с маркировкой. После исправления данных повторите операцию. Если эти действия не помогли, обратитесь в техническую поддержку программы.';
			|en = 'The marking code cannot be processed or verified by the cash register. Check that the marking code is correct, as well as that there are no restrictions or locks on operating with marking. After correcting the data, try again. If these steps do not help, contact the technical support of the program.'"),
		"ТехподдержкаПрограммы",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаМаркировки", НСтр("ru = 'отсутствует.*КМ|маркировк|контрольн.*марка|код.*товара.*не распозн|маркир|работа.*маркированн|буфер чека';
														|en = 'missing.*Marking code|marking|control*mark|product.*code.*not recognized|marking|work.*marked|receipt buffer'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаМаркировки", НСтр("ru = 'КМ.*ранее не проверялся';
														|en = 'Marking code.*was not checked before'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаСвязи",
		НСтр("ru = 'Ошибка связи';
			|en = 'Connection error'"),
		НСтр("ru = 'Связь с ККТ или ФН отсутствует либо потеряна. Проверьте питание, кабели, порты и сетевое соединение. После восстановления связи повторите операцию. Если проблема сохраняется, обратитесь в техподдержку компании, обслуживающей оборудование.';
			|en = 'Connection to the cash register or fiscal storage is missing or lost. Check the power supply, cables, ports, and network connection. After the connection is restored, try again. If the issue persists, contact the technical support of the equipment maintenance company.'"),
		"Пользователь",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаСвязи", НСтр("ru = 'соединение не установлено|ошибка.*обмена|устройство.*(не отвечает|занято)';
													|en = 'connection failed|error.*exchange|device.*(not responding|busy)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаСвязи", НСтр("ru = 'сетевого обмена|соединение.*потеряно|не отвечает или недоступна|порт не *.|доступ.*интернет';
													|en = 'network exchange|connection.*lost|not responding or unavailable|port is not *.|access.*Internet'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаСвязи", НСтр("ru = 'нет\s+связи|timeout|timed\s*out|ком\s*порт|port|устройство\s+не\s+найдено|превышен\s+интервал|failed to connect|connection';
													|en = 'no\s+connection|timeout|timed\s*out|com\s*port|port|device\s+not\s+found|exceeded\s+interval|failed to connect|connection'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаСтатусаККТ",
		НСтр("ru = 'Ошибка статуса';
			|en = 'Status error'"),
		НСтр("ru = 'Операция невозможна в текущем статусе ККТ. Приведите кассу в рабочее состояние, завершив оформление документов или закрыв смену. После этого повторите действие. Если проблема сохраняется, обратитесь в техническую поддержку компании, обслуживающей оборудование.';
			|en = 'The operation is impossible in the current cash register status. Make the cash register operational by completing document registration or closing the shift. Then try again. If the error persists, contact the technical support of the equipment maintenance company.'"),
		"Пользователь",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаСтатусаККТ", НСтр("ru = '73h|24\s*час|Некорректное состояние ККТ|ККТ не зарегистрирована с указанной системой';
														|en = '73h|24\s*hour|Incorrect cash register status|cash register is not registered under the specified system'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаСтатусаККТ", НСтр("ru = 'смена.*(закрыта|открыта|не открыта|истекла)|отчет.*прерван|документ.*(закрыт|открыт|не закрыт)|функция.*не выполнима|invalid\s*mode';
														|en = 'shift.*(closed|open|not open|expired)|report.*aborted|document.*(closed|open|not closed)|function.*not feasible|invalid\s*mode'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаПользовательскихРеквизитов",
		НСтр("ru = 'Ошибка реквизитов';
			|en = 'Attribute error'"),
		НСтр("ru = 'Некоторые обязательные поля документа отсутствуют либо заполнены некорректно. Проверьте реквизиты и исправьте ошибочные данные. После внесения исправлений повторите операцию. Если эти действия не помогли, обратитесь в техническую поддержку программы.';
			|en = 'Some required document fields are missing or filled in incorrectly. Check the attributes and correct the errors. Then try again. If these steps do not help, contact the technical support of the program.'"),
		"Пользователь",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПользовательскихРеквизитов", НСтр("ru = '(кассир|инн|адрес|организация).*не заполнен';
																		|en = '(cashier|tin|address|company).*not filled in'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПользовательскихРеквизитов", СтрШаблон(НСтр("ru = 'ошибка передачи %1';
																					|en = '%1 transfer error'"), "CustomerEmail"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПользовательскихРеквизитов", НСтр("ru = 'не указан.*(ИНН|дата)';
																		|en = 'not specified.*(TIN|date)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПользовательскихРеквизитов", НСтр("ru = 'не соответствует установкам при регистрации';
																		|en = 'does not match the settings during registration'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПользовательскихРеквизитов", НСтр("ru = 'нет денег для выплаты|не.*(достаточно|хватает) наличности в кассе';
																		|en = 'no money to pay|not.*enough cash in cash register'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаРазмерЧека",
		НСтр("ru = 'Ошибка размера чека';
			|en = 'Receipt size error'"),
		НСтр("ru = 'Размер кассового чека превышает допустимый предел из‑за избыточного количества позиций. Для устранения проблемы сократите число позиций в чеке: разделите одну крупную покупку на несколько чеков меньшего объёма. Если это не помогло, обратитесь в техническую поддержку программы.';
			|en = 'The cash receipt size exceeds the acceptable limit due to the excessive number of items. To fix the issue, reduce the number of items in the receipt: divide one large purchase into several smaller receipts. If this does not help, contact the technical support of the program.'"),
		"Пользователь",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаРазмерЧека", НСтр("ru = 'превышение размеров TLV';
														|en = 'TLV size excess'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаРазмерЧека", НСтр("ru = 'позиций.*превысило.*лимит';
														|en = 'items.*exceeded.*limit'"));
	
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Ложь;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаПрограмныхРеквизитов",
		НСтр("ru = 'Ошибка реквизитов';
			|en = 'Attribute error'"),
		НСтр("ru = 'Некоторые обязательные поля документа отсутствуют либо заполнены некорректно. Проверьте реквизиты и исправьте ошибочные данные. После внесения исправлений повторите операцию. Если проблема сохраняется, обратитесь в техническую поддержку программы.';
			|en = 'Some required document fields are missing or filled in incorrectly. Check the attributes and correct the errors. Then try again. If the issue persists, contact the technical support of the program.'"),
		"ТехподдержкаПрограммы",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПрограмныхРеквизитов", НСтр("ru = '(неверн|корректн).*(сумм|количеств)';
																	|en = '(incorrect|correct).*(amount|quantity)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПрограмныхРеквизитов", НСтр("ru = '(неверный|нулевой) итог чека';
																	|en = '(incorrect|zero) receipt total'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПрограмныхРеквизитов", НСтр("ru = 'сумма.*(больше|меньше|не равна)';
																	|en = 'amount.*(greater than|less than|not equal to)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаПрограмныхРеквизитов", НСтр("ru = 'невозможно записать реквизит агента|оплата по данному чеку не требуется|необходимо указать оплату';
																	|en = 'cannot record the agent''s attribute|payment on this receipt is not required|payment must be specified'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Ложь;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаФН",
		НСтр("ru = 'Ошибка ФН';
			|en = 'Fiscal storage error'"),
		НСтр("ru = 'Фискальный накопитель не смог выполнить операцию из‑за ошибки ресурса или сбоя внутреннего интерфейса. Проверьте состояние ФН. При необходимости произведите замену ФН. Если проблема сохраняется, обратитесь в техническую поддержку компании, обслуживающей оборудование.';
			|en = 'The fiscal storage was unable to perform the operation due to a resource error or an internal interface failure. Check the fiscal storage state. If necessary, replace the fiscal storage. If the issue persists, contact the technical support of the equipment maintenance company.'"),
		"ТехподдержкаККТ",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаФН", НСтр("ru = 'фн закрыт|нет ответа от фн';
												|en = 'fiscal storage is closed|no response from fiscal storage'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаФН", НСтр("ru = 'исчерпан.*ресурс.*|ресурс.*исчерпан.*|ресурс.*(фн|фд)';
												|en = 'exhausted.*resource.*|resource.*exhausted.*|resource.*(fiscal storage|fiscal document)'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Ложь;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаВремениФН",
		НСтр("ru = 'Ошибка времени ФН';
			|en = 'Fiscal storage time error'"),
		НСтр("ru = 'Произошло расхождение системного времени ККТ и фискального накопителя из‑за сбоя часов реального времени или некорректных настроек. Для устранения проблемы необходимо установить корректную дату и время в настройках ККТ. Также следует проверить синхронизацию с сервером времени и сверить текущую дату и время на оборудовании. Если проблема сохраняется, обратитесь в техническую поддержку компании, обслуживающей оборудование.';
			|en = 'There was a discrepancy between the cash register time and the fiscal storage time due to a failure of the real‑time clock or incorrect settings. To fix the issue, set the correct date and time in the cash register settings. Also check the synchronization with the time server and check the current date and time on the hardware. If the issue persists, contact the technical support of the equipment maintenance company.'"),
		"ТехподдержкаККТ",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаВремениФН", НСтр("ru = 'сбой часов|неверн.*(дата|время|фн|фд)|(разница|расхожден).*времен|проверьте (дату|время)';
														|en = 'clock failure|incorrect*(date|time|fiscal storage|fiscal document)|(difference|discrepancy).*time|check (date|time)'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Ложь;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаБиблиотеки",
		НСтр("ru = 'Ошибка БПО';
			|en = 'PEL error'"),
		НСтр("ru = 'Ошибка возникла во внутренних механизмах программы при обработке данных устройства. Встроенная библиотека не смогла корректно обработать параметры или идентификатор устройства. Для устранения проблемы обратитесь в техническую поддержку программы.';
			|en = 'The error occurred in the internal system procedures when processing device data. The built-in library failed to correctly process the device parameters or ID. To fix the issue, contact the technical support of the program.'"),
		"ТехподдержкаБПО",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаБиблиотеки", НСтр("ru = 'неверн.*идент|не найден.*устройств|идустройств|ошибка.*разбор.*xml|xml.*ошибка';
														|en = 'incorrect.*ID|not found.*device|device id|error.*analysis.*xml|xml.*error'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаАппаратная",
		НСтр("ru = 'Ошибка аппаратная';
			|en = 'Hardware error'"),
		НСтр("ru = 'Печатающий механизм ККТ не готов к работе. Проверьте наличие бумаги, закрытие крышки и отсутствие механических блокировок. После устранения проблемы повторите операцию.';
			|en = 'The cash register printing device is not ready for operation. Check for paper, lid closure, and mechanical interlocks. Then try again.'"),
		"Пользователь",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаАппаратная", НСтр("ru = 'бумаги|принтер|крышк|механическ|отрезчик|питани';
														|en = 'paper|printer|lid|mechanic|cutter|feed'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаУстаревшийДрайвер",
		НСтр("ru = 'Ошибка утаревший драйвера';
			|en = 'Outdated driver error'"),
		НСтр("ru = 'Обновите основную поставку драйвера, выполните обновление прошивки ККТ. Если проблема повторяется, требуется обращение в техническую поддержку разработчика драйвера.';
			|en = 'Update the main distribution package of the driver and the cash register firmware. If the issue persists, contact the technical support of the driver developer.'"),
		"ТехподдержкаККТ",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаУстаревшийДрайвер", НСтр("ru = 'значение.*tax.*';
																|en = 'value.*tax.*'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Истина;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаДрайвераККТ",
		НСтр("ru = 'Ошибка драйвера';
			|en = 'Driver error'"),
		НСтр("ru = 'Во время выполнения операции драйвер ККТ или программный модуль вернул ошибку. Перезапустите драйвер или кассу и убедитесь в корректности установленных обновлений. Выполните обновление прошивки ККТ. Если проблема повторяется, требуется обращение в техническую поддержку разработчика драйвера.';
			|en = 'During the operation, the cash register driver or the software module returned an error. Restart the driver or cash register and make sure that the installed updates are correct. Update the cash register firmware. If the error persists, contact the technical support of the driver developer.'"),
		"ТехподдержкаККТ",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'некорректн(ая|ые|ый) (формат|параметр|операция)';
															|en = 'incorrect (format|parameter|operation)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'неверн(ая|ые|ый) (формат|параметр|операция)';
															|en = 'incorrect (format|parameter|operation)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'неверн(ый|ое) (формат|значение) (команды|параметра)';
															|en = 'incorrect (command|parameter) (format|value)'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'ошибка программирования реквизита|ошибка записи заголовка пакета|поле.*отсутствует|некоррект.*поля|нет больше данных';
															|en = 'attribute programming error|error writing package header|field.*missing|incorrect.*fields|no more data'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = '(модель|ккт|команда).*не поддерживается|не поддерживает данную команду|команда не разрешена|ошибка.*драйвер|прошивка ККТ не поддерживает|FFFFFFF8h';
															|en = '(model|cash register|command).*not supported|does not support this command|command is not allowed|error.*driver|cash register firmware does not support|FFFFFFF8h'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'ошибка лицензии|обновите прошивку';
															|en = 'license error|update firmware'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'фатальная ошибка ККТ|неизвестная ошибка|ошибка ККТ.*неверн|ошибка.*движка ккт';
															|en = 'fatal cash register error|unknown error|cash register error.*incorrect|error.*cash register engine'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'ожидание команды продолжения печати|идет печать предыдущей команды';
															|en = 'waiting for print continuation command|previous command is being printed'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'нет устройства|сбой таблицы настроек|не поддерживается в данном режиме|не поддерживается в данной версии';
															|en = 'no device|settings table failure|not supported in this mode|not supported in this version'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвераККТ", НСтр("ru = 'Invalid password|Inout error|Command is invalid|служб.*UEMA';
															|en = 'Invalid password|Inout error|Command is invalid|service.*UEMA'"));
	Результат.Добавить(КлассОшибки);
	
	ЛокальнаяОбработкаОшибки = Ложь;
	КлассОшибки = НовыйКлассОшибки(
		"ОшибкаДрайвера",
		НСтр("ru = 'Ошибка драйвера';
			|en = 'Driver error'"),
		НСтр("ru = 'Во время выполнения операции драйвер ККТ или программный модуль вернул ошибку. Перезапустите драйвер или кассу и убедитесь в корректности установленных обновлений. Выполните обновление прошивки ККТ. Если проблема повторяется, требуется обращение в техническую поддержку разработчика драйвера.';
			|en = 'During the operation, the cash register driver or the software module returned an error. Restart the driver or cash register and make sure that the installed updates are correct. Update the cash register firmware. If the error persists, contact the technical support of the driver developer.'"),
		"ТехподдержкаККТ",
		ЛокальнаяОбработкаОшибки);
	ТаблицаГрупп.Вставить(КлассОшибки.Группа, КлассОшибки);
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвера", НСтр("ru = 'ошибка печати товарной позициии|превышение длины реквизита|короткий пакет';
														|en = 'item printing error|attribute length excess|short package'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвера", НСтр("ru = 'ошибка передачи тега|ошибка чтения данных';
														|en = 'tag transmission error|data reading error'"));
	ДобавитьМаску(ТаблицаГрупп, "ОшибкаДрайвера", НСтр("ru = 'Недопустимый номер ставки налога';
														|en = 'Invalid tax rate number'"));
	Результат.Добавить(КлассОшибки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КлассификацияОшибок

Процедура ДобавитьМаску(Классификатор, Группа, Маска)
	Классификатор[Группа].МаскиПоиска.Добавить(НРег(Маска));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

