
#Область ПрограммныйИнтерфейс

// Функция возвращает используемые аналитики статьи бюджетов, разделенные " / "
//
// Параметры:
// 	 РеквизитыСтатьиБюджетов - Структура, ВыборкаИзРезультатаЗапроса, СтрокаТаблицыЗначений  - реквизиты статьи бюджетов.
//
// Возвращаемое значение:
// 	 Строка - Представление.
//
Функция ПредставлениеАналитикСтатьиБюджетов(РеквизитыСтатьиБюджетов) Экспорт
	
	Представление = "";
	
	Для НомерАналитики = 1 По РеквизитыСтатьиБюджетов.КоличествоИспользуемыхАналитик Цикл
		Если ЗначениеЗаполнено(РеквизитыСтатьиБюджетов["ВидАналитики" + НомерАналитики]) Тогда
			Представление = Представление 
				+ ?(Представление = "", "", " / ") 
				+ РеквизитыСтатьиБюджетов["ВидАналитики" + НомерАналитики];
		КонецЕсли;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

// Заполняет представление типа значения объекта
//
// Параметры:
// 	 Объект - ПланВидовХарактеристикОбъект.АналитикиСтатейБюджетов  - объект, реквизит которого будет заполнен.
//
// Возвращаемое значение:
// 	 Строка - представление типа
//
Функция ПредставлениеТипаЗначения(Объект) Экспорт
	
	ПредставлениеТипаЗначения = "";
	
	Если ЗначениеЗаполнено(Объект.ДополнительноеСвойство) Тогда
		ПредставлениеТипаЗначения = Строка(Объект.ДополнительноеСвойство);
	Иначе
		ПредставлениеТипаЗначения = Строка(Объект.ТипЗначения);
	КонецЕсли;
	
	Возврат ПредставлениеТипаЗначения;
	
КонецФункции

// Возвращает значение настройки СКД.
// 
// Параметры:
// 	КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - Компоновщик настроек.
// 	ИмяНастройки - Строка - Имя настройки.
// Возвращаемое значение:
// 	Произвольный - значение настройки.
Функция ЗначениеНастройкиСКД(КомпоновщикНастроек, ИмяНастройки) Экспорт
	
	Для Каждого ПользовательскаяНастройка Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ПользовательскаяНастройка) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И Строка(ПользовательскаяНастройка.Параметр) = ИмяНастройки Тогда
			Возврат ПользовательскаяНастройка.Значение;
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого ПользовательскаяНастройка Из КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы Цикл
		Если Строка(ПользовательскаяНастройка.Параметр) = ИмяНастройки Тогда
			Возврат ПользовательскаяНастройка.Значение;
		КонецЕсли;
	КонецЦикла;
		
КонецФункции

#Область ПреобразованиеТиповАналитики

// Возвращает значение аналитики, приведенное к типу. Тип аналитики может включать или не включать тип Неопределено.
// Значение будет приведено к исходному типу, без неопределено. Но если приведенное значение пустое, то оно приводится к
// неопределено.
//
// Параметры:
// 	ЗначениеАналитики - Произвольный - Значение, которое необходимо привести к типу.
// 	ОписаниеТиповАналитики - ОписаниеТипов - Описание типов, к которому необходимо привести значение
// 						Но если приведенное значение - пустое, оно будет приведено к Неопределено.
//
// Возвращаемое значение:
// 	Произвольный - Значение аналитики, приведенное к типу. Если значение аналитики не заполнено, то вернется Неопределено,
// 						вне зависимости от исходного описания типов.
//
Функция ПриведенноеЗначениеАналитики(Знач ЗначениеАналитики, Знач ОписаниеТиповАналитики) Экспорт
	
	ЗначениеАналитики = ОписаниеТиповАналитики.ПривестиЗначение(ЗначениеАналитики);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеАналитики) Тогда
		ЗначениеАналитики = ПустоеЗначениеАналитики();
	КонецЕсли;
	
	Возврат ЗначениеАналитики;
КонецФункции

// Возвращает пустое значение аналитики статей бюджетов
//
// Возвращаемое значение:
//  Неопределено
//
Функция ПустоеЗначениеАналитики() Экспорт
	Возврат Неопределено;
КонецФункции

// Возвращает количество аналитик в бюджетировании
//
// Возвращаемое значение:
// 	Число - Количество поддерживаемых в бюджетировании аналитик.
//
Функция МаксимальноеКоличествоАналитик() Экспорт
	Возврат 6;
КонецФункции

#КонецОбласти

// Возвращает в виде строки массив имен реквизитов бюджета для сопоставления первичного бюджета с его корректировками.
//
// Возвращаемое значение:
//  Строка
//
Функция ИменаРеквизитовБюджета() Экспорт
	
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("МодельБюджетирования");
	ИменаРеквизитов.Добавить("ВидБюджета");
	ИменаРеквизитов.Добавить("НачалоПериода");
	ИменаРеквизитов.Добавить("ОкончаниеПериода");
	ИменаРеквизитов.Добавить("Организация");
	ИменаРеквизитов.Добавить("Подразделение");
	ИменаРеквизитов.Добавить("Сценарий");
	Для Счетчик = 1 По МаксимальноеКоличествоАналитик() Цикл
		ИменаРеквизитов.Добавить("Аналитика" + Счетчик);
	КонецЦикла;
	ИменаРеквизитов.Добавить("Дата");
	
	Возврат СтрСоединить(ИменаРеквизитов, ",");
	
КонецФункции

#КонецОбласти
