#Область ПрограммныйИнтерфейс

// Используется для получения кэша механизма контроля качества в формах документов в контексте объекта,
// например: Шапка или Товары.
// Параметры:
//  Кэш - См. КонтрольКачества.КэшДанныхМеханизма
//  Ключ - Строка - ключ источника данных в объекте, в котором используется кэш
// Возвращаемое значение:
//   Структура - структура с полями:
//    * Ключ - Строка
//    * ЗаполнитьПроконтролироватьКачествоДатаПодтвержденияКачества - См. КонтрольКачества.НовыйПараметрыДействия
//    * ЗаполнитьПодлежитРазблокировкеДатаПодтвержденияКачества - См. КонтрольКачества.НовыйПараметрыДействия
//    * ЗаполнитьКонтролируемуюПартиюОтправителя - См. КонтрольКачества.НовыйПараметрыДействия
Функция КэшПоКлючу(Кэш, Ключ = Неопределено) Экспорт
	
	Если Ключ = Неопределено Или ТипЗнч(Кэш) <> Тип("ФиксированныйМассив") Тогда
		Возврат Кэш;
	Иначе
		Для Каждого Элемент Из Кэш Цикл
			Если Элемент.Ключ = Ключ Тогда
				Возврат Элемент.Параметры;
			КонецЕсли;
		КонецЦикла;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Формирует представление элемента справочника "КонтролируемыеПартии".
// Параметры:
//  Реквизиты - см. КонтрольКачества.НовыйРеквизитыКонтролируемойПартии
//  КодЯзыка - Строка,Неопределено - код языка, если не указан, то представление будет на языке пользователя.
// Возвращаемое значение:
//  Строка - представление контролируемой партии.
Функция ПредставлениеКонтролируемойПартии(Реквизиты, КодЯзыка = Неопределено) Экспорт
	
	Если Не ТипЗнч(Реквизиты.Партия) = Тип("СправочникСсылка.СоглашенияСПоставщиками")
			И Не ТипЗнч(Реквизиты.Партия) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Партия = Реквизиты.Партия;
		ХозяйственнаяОперация = Реквизиты.ХозяйственнаяОперация;
		ТипДокумента = НСтр("ru = 'Неизвестный документ';
							|en = 'Unknown document'", КодЯзыка);
		Если ТипЗнч(Партия) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			ТипДокумента = НСтр("ru = 'Возврат товаров от клиента';
								|en = 'Sales return'", КодЯзыка);
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента") Тогда
			ТипДокумента = НСтр("ru = 'Поступление товаров от клиента';
								|en = 'Goods receipt from customer'", КодЯзыка);
		
		//++ НЕ УТ
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда
			
			Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой") Тогда
				ТипДокумента = НСтр("ru = 'Передача продукции из кладовой';
									|en = 'Transfer of products from shop floor stockroom'", КодЯзыка);
			ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую") Тогда
				ТипДокумента = НСтр("ru = 'Передача материалов в кладовую';
									|en = 'Transfer of materials to shop floor stockroom'", КодЯзыка);
			ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой") Тогда
				ТипДокумента = НСтр("ru = 'Возврат материалов из кладовой';
									|en = 'Return of materials from shop floor stockroom'", КодЯзыка);
			ИначеЕсли  ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов") Тогда
				ТипДокумента = НСтр("ru = 'Перемещение полуфабрикатов';
									|en = 'Transfer of semi-finished products'", КодЯзыка);
			ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами") Тогда
				ТипДокумента = НСтр("ru = 'Перемещение полуфабрикатов';
									|en = 'Transfer of semi-finished products'", КодЯзыка);
			КонецЕсли;
			
		//-- НЕ УТ
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ТипДокумента = НСтр("ru = 'Перемещение товаров';
								|en = 'Goods transfer'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") Тогда
			ТипДокумента = НСтр("ru = 'Поступление товаров на склад';
								|en = 'Warehouse receipt'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
			
			Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОтХранителя") Тогда
				ТипДокумента = НСтр("ru = 'Возврат от хранителя';
									|en = 'VMI pick-up'", КодЯзыка);
			ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера") Тогда
				ТипДокумента = НСтр("ru = 'Возврат от комиссионера';
									|en = 'Consignment pick-up'", КодЯзыка);
			
			//++ НЕ УТ
			
			ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5") Тогда
				ТипДокумента = НСтр("ru = 'Возврат от переработчика';
									|en = 'Materials pick-up from subcontractor'", КодЯзыка);
			ИначеЕсли  ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5") Тогда
				ТипДокумента = НСтр("ru = 'Поступление от переработчика';
									|en = 'Goods receipt — External subcontracting'", КодЯзыка);
			
			//-- НЕ УТ
			
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
			
			Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи") Тогда
				ТипДокумента = НСтр("ru = 'Прием на хранение с правом продажи';
									|en = 'VMI procurement'", КодЯзыка);
			
			//++ НЕ УТКА
			
			ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОтДавальца2_5") Тогда
				ТипДокумента = НСтр("ru = 'Поступление от давальца';
									|en = 'Receipt from material provider'", КодЯзыка);
			
			//-- НЕ УТКА
			
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			ТипДокумента = НСтр("ru = 'Приобретение товаров и услуг';
								|en = 'Vendor invoice'", КодЯзыка);
		
		//++ НЕ УТ
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
			ТипДокумента = НСтр("ru = 'Производство без заказа';
								|en = 'Backflush production'", КодЯзыка);
		
		//-- НЕ УТ
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПрочееОприходованиеТоваров") Тогда
			ТипДокумента = НСтр("ru = 'Прочее оприходование товаров';
								|en = 'Other receipt of goods'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.СборкаТоваров") Тогда
			ТипДокумента = НСтр("ru = 'Сборка (разборка) товаров';
								|en = 'Product kitting'", КодЯзыка);
		
		//++ НЕ УТКА
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
			ТипДокумента = НСтр("ru = 'Этап производства';
								|en = 'Production stage'", КодЯзыка);
		
		//-- НЕ УТКА
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров") Тогда
			ТипДокумента = НСтр("ru = 'Заявка на контроль качества';
								|en = 'Request for quality control'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ТипДокумента = НСтр("ru = 'Заказ поставщику';
								|en = 'Purchase order'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			ТипДокумента = НСтр("ru = 'Заявка на возврат товаров от клиента';
								|en = 'Sales return request'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
			ТипДокумента = НСтр("ru = 'Заказ на сборку (разборку)';
								|en = 'Kitting order'", КодЯзыка);
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			ТипДокумента = НСтр("ru = 'Заказ на перемещение';
								|en = 'Transfer order'", КодЯзыка);
		
		//++ НЕ УТ
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаказПереработчику2_5") Тогда
			ТипДокумента = НСтр("ru = 'Заказ переработчику';
								|en = 'Subcontracting purchase order'", КодЯзыка);
		
		//-- НЕ УТ
		
		//++ НЕ УТКА
		
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаказДавальца2_5") Тогда
			ТипДокумента = НСтр("ru = 'Заказ давальца';
								|en = 'Subcontracting sales order'", КодЯзыка);
			
		//-- НЕ УТКА
		
		КонецЕсли;
		
		Представление = НСтр("ru = '%1 %2 от %3';
							|en = '%1 %2 dated %3'", КодЯзыка);
		Представление = СтрШаблон(Представление,
			ТипДокумента,
			Реквизиты.НомерДокументаПоступления,
			Формат(Реквизиты.ДатаДокументаПоступления, "ДЛФ=D;"));
		
	ИначеЕсли ЗначениеЗаполнено(Реквизиты.Договор) Тогда // партия - договор
		
		Представление = НСтр("ru = 'Договор: %1';
							|en = 'Contract: %1'", КодЯзыка);
		Представление = СтрШаблон(Представление, Реквизиты.Договор);
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Структура параметров для заполнения табличной части "Товары" рабочего места ТоварыНаКонтролеКачества.
// Возвращаемое значение:
//  Структура - структура с полями:
//   * НастройкиКомпоновки - НастройкиКомпоновкиДанных - настройки компоновки данных
//   * Отбор - Структура - структура с полями:
//      ** Склад - СправочникСсылка.Склады, Неопределено - отбор по складу.
//      ** Номенклатура - СправочникСсылка.Номенклатура, Неопределено - отбор по номенклатуре.
//      ** Назначение - СправочникСсылка.Назначения, Неопределено - отбор по назначению.
//      ** ЗаявкаОформлена - Булево, Неопределено - отбор для отображения только заявок или не заявок.
Функция ПараметрыЗаполненияТоваровДляКонтроляКачества() Экспорт
	
	ПараметрыЗаполнения = Новый Структура();
	ПоляОтбора = Новый Структура();
	ПоляОтбора.Вставить("Склад");
	ПоляОтбора.Вставить("Номенклатура");
	ПоляОтбора.Вставить("Назначение");
	ПоляОтбора.Вставить("ЗаявкаОформлена");
	ПараметрыЗаполнения.Вставить("Отбор", ПоляОтбора);
	ПараметрыЗаполнения.Вставить("НастройкиКомпоновки", Новый НастройкиКомпоновкиДанных);
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Конструктор структуры для передачи данных заполнения заявки на контроль качества товаров в форму документа.
// Возвращаемое значение:
//  Структура - структура с полями:
//   * ПричинаБлокировкиТовара - СправочникСсылка.ПричиныБлокировкиТоваров
Функция НовыеДанныеЗаполненияЗаявкиНаКонтрольКачестваТоваров() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ПричинаБлокировкиТовара", ПредопределенноеЗначение("Справочник.ПричиныБлокировкиТоваров.ПустаяСсылка"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти