
#Область ПрограммныйИнтерфейс

#Область КартыИсследованияТоваров

// Возвращает параметры выбора КартИсследованияТоваров для номенклатуры.
// 
// Возвращаемое значение:
// 	Структура - из:
//  * СвязиПараметровВыбора - Соответствие Из КлючИЗначение:
//	 ** Ключ - Строка - Вид настройки для которого необходимо получить ключ связи.
//	 ** Значение - Строка - Уникальный идентификатор.
//  * РеквизитыКартыИсследованияТоваров - Строка - список реквизитов КартыИсследованияТоваров
//
Функция ПараметрыВыбораНазначенияИсследованийКонструктор() Экспорт
	
	ПараметрыВыбора = Новый Структура();
	
	ПараметрыВыбора.Вставить("СвязиПараметровВыбора", Новый Соответствие);
	
	// Для получения реквизитов подбираемой карты исследования товаров
	ПараметрыВыбора.Вставить("РеквизитыКартыИсследованияТоваров", "");
	
	Возврат ПараметрыВыбора;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Автовыбор_ОтборПоСвойствам

// Возвращает предопределенный ключ связи для отбора по свойствам в зависимости от вида настройки.
//
// Параметры:
//   ВидНастройки - Строка - Вид настройки для которого необходимо получить ключ связи
//
// Возвращаемое значение:
//   УникальныйИдентификатор - Ключ связи для отбора по свойствам
Функция ОтборПоСвойствамКлючСвязиПредопределенный(ВидНастройки) Экспорт
		
	Если ВидНастройки = "Номенклатура" Тогда
		
		Возврат Новый УникальныйИдентификатор("5550a108-5e2e-11f0-9fe2-0242ac120002");
		
	ИначеЕсли ВидНастройки = "Характеристика" Тогда
		
		Возврат Новый УникальныйИдентификатор("6a39e714-5e2e-11f0-9fe2-0242ac120002");
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Для получения ключа отбора по свойствам передан неверный вид настройки.';
								|en = 'An invalid setting kind was passed to receive a filter key by properties'");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Формирует массив условий отбора по свойствам
// 
// Возвращаемое значение:
// 	Массив из Структура - из:
// 		* Идентификатор - Строка - идентификатор условия
// 		* Представление - Строка - представление условия
// 		* Сравнение - Булево - признак условия сравнения
// 		* Шаблон - Строка - шаблон условия
Функция СписокУсловийОтбораПоСвойствамНоменклатуры()
	
	Результат = Новый Массив;
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "Равно");
	Условие.Вставить("Представление", НСтр("ru = 'Равно';
											|en = 'Equal to'"));
	Условие.Вставить("Сравнение", Ложь);
	Условие.Вставить("Шаблон", "%1 = %2");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "НеРавно");
	Условие.Вставить("Представление", НСтр("ru = 'Не равно';
											|en = 'Not equal to'"));
	Условие.Вставить("Сравнение", Ложь);
	Условие.Вставить("Шаблон", "%1 <> %2");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "Больше");
	Условие.Вставить("Представление", НСтр("ru = 'Больше';
											|en = 'Greater than'"));
	Условие.Вставить("Сравнение", Истина);
	Условие.Вставить("Шаблон", "%1 > %2");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "БольшеИлиРавно");
	Условие.Вставить("Представление", НСтр("ru = 'Больше или равно';
											|en = 'Greater than or equal'"));
	Условие.Вставить("Сравнение", Истина);
	Условие.Вставить("Шаблон", "%1 >= %2");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "Меньше");
	Условие.Вставить("Представление", НСтр("ru = 'Меньше';
											|en = 'Less'"));
	Условие.Вставить("Сравнение", Истина);
	Условие.Вставить("Шаблон", "%1 < %2");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "МеньшеИлиРавно");
	Условие.Вставить("Представление", НСтр("ru = 'Меньше или равно';
											|en = 'Less than or equal'"));
	Условие.Вставить("Сравнение", Истина);
	Условие.Вставить("Шаблон", "%1 <= %2");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "ВСписке");
	Условие.Вставить("Представление", НСтр("ru = 'В списке';
											|en = 'In list'"));
	Условие.Вставить("Сравнение", Ложь);
	Условие.Вставить("Шаблон", "%1 В (%2)");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "НеВСписке");
	Условие.Вставить("Представление", НСтр("ru = 'Не в списке';
											|en = 'Not in list'"));
	Условие.Вставить("Сравнение", Ложь);
	Условие.Вставить("Шаблон", "НЕ %1 В (%2)");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "ВИнтервале");
	Условие.Вставить("Представление", НСтр("ru = 'В интервале (>,<)';
											|en = 'Within interval (>,<)'"));
	Условие.Вставить("Сравнение", Истина);
	Условие.Вставить("Шаблон", "%1 > %2 И %1 < %3");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "ВИнтервалеВключая");
	Условие.Вставить("Представление", НСтр("ru = 'В интервале (>=,<=)';
											|en = 'Within interval (>=,<=)'"));
	Условие.Вставить("Сравнение", Истина);
	Условие.Вставить("Шаблон", "%1 >= %2 И %1 <= %3");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "Заполнено");
	Условие.Вставить("Представление", НСтр("ru = 'Заполнено';
											|en = 'Filled'"));
	Условие.Вставить("Сравнение", Ложь);
	Условие.Вставить("Шаблон", "НЕ %1 В (НЕОПРЕДЕЛЕНО, ЛОЖЬ, 0)");
	Результат.Добавить(Условие);
	
	Условие = Новый Структура;
	Условие.Вставить("Идентификатор", "НеЗаполнено");
	Условие.Вставить("Представление", НСтр("ru = 'Не заполнено';
											|en = 'Not filled'"));
	Условие.Вставить("Сравнение", Ложь);
	Условие.Вставить("Шаблон", "%1 В (НЕОПРЕДЕЛЕНО, ЛОЖЬ, 0)");
	Результат.Добавить(Условие);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураУсловийОтбораПоСвойствамНоменклатуры() Экспорт
	
	СтруктураУсловий = Новый Структура;
	
	Условия = СписокУсловийОтбораПоСвойствамНоменклатуры();
	Для каждого Условие Из Условия Цикл
		
		СвойстваУсловия = СтруктураУсловияОтбораПоСвойствамНоменклатуры(Условие);
		
		СтруктураУсловий.Вставить(Условие.Идентификатор, СвойстваУсловия);
		
	КонецЦикла;
	
	Возврат СтруктураУсловий;
	
КонецФункции

// Конструктор структуры условия отбора по свойствам
// 
// Параметры:
// 	Условие - Структура - из:
// 		* Идентификатор - Строка - идентификатор условия
// 		* Представление - Строка - представление условия
// 		* Сравнение - Булево - признак условия сравнения
// 		* Шаблон - Строка - шаблон условия
// Возвращаемое значение:
// 	Структура - из:
//		* Идентификатор - Строка - идентификатор условия
//		* Представление - Строка - представление условия
//		* Сравнение - Булево - признак условия сравнения
//		* Шаблон - Строка - шаблон условия
//		* Список - Булево - признак условия работы со списком
//		* Интервал - Булево - признак интервального условия
//		* Заполненность - Булево - признак условия проверки заполненности
//		* Включая - Булево - признак условия с включением границы
//		* Обратное - Булево - признак инверсии в условии
Функция СтруктураУсловияОтбораПоСвойствамНоменклатуры(Условие) Экспорт
	
	УсловияВключая  = СтрРазделить("Равно,ВСписке,БольшеИлиРавно,МеньшеИлиРавно,ВИнтервалеВключая", ",");
	УсловияОбратные = СтрРазделить("НеРавно,НеВСписке", ",");
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор", Условие.Идентификатор);
	Результат.Вставить("Представление", Условие.Представление);
	Результат.Вставить("Сравнение",     Условие.Сравнение);
	Результат.Вставить("Шаблон",        Условие.Шаблон);
	Результат.Вставить("Список",        СтрНайти(Условие.Идентификатор, "ВСписке") > 0);
	Результат.Вставить("Интервал",      СтрНайти(Условие.Идентификатор, "ВИнтервале") > 0);
	Результат.Вставить("Заполненность", СтрНайти(Условие.Идентификатор, "Заполнено") > 0);
	Результат.Вставить("Включая",       УсловияВключая.Найти(Условие.Идентификатор) <> Неопределено);
	Результат.Вставить("Обратное",      УсловияОбратные.Найти(Условие.Идентификатор) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти