
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает минимально возможное значение периода отчета РасчетСтоимостиЧистыхАктивов. Отчет использует
// алгоритмы бухгалтерской отчетности за 1кв2025 и не поддерживает более ранние версии. Кроме того, более
// ранние версии бухгалтерской отчетности имеют собственные формы определения стоимости чистых активов
//
// Возвращаемое значение:
//   Дата
//
Функция ОграничениеСнизуПериодаОтчета() Экспорт
	
	ОграничениеСнизуПериодаОтчета = '20250131';
	Возврат ОграничениеСнизуПериодаОтчета;
	
КонецФункции

// Возвращает имя регламентированного отчета, по данным которого можно построить отчет
// РасчетСтоимостиЧистыхАктивов. Для построения отчета критично наличие итогов по разделам
// баланса. Упрощенная отчетность (РегламентированныйОтчетБухОтчетностьМП) не содержит
// этих данных, ограничиваясь общими итогами по активам и пассивам, поэтому расчет стоимости
// чистых активов на ее основе не поддерживается
//
// Возвращаемое значение:
//   Строка
//
Функция ИсточникБухгалтерскойОтчетности() Экспорт

	ИсточникБухгалтерскойОтчетности = "РегламентированныйОтчетБухОтчетность";
	Возврат ИсточникБухгалтерскойОтчетности;

КонецФункции

#КонецОбласти