////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Амортизация ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения - Строка, Неопределено - Текст, используемый для заполнения документа. 
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект.АмортизацияОС2_4 - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.АмортизацияОС2_4 - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ Локализация
	Отчеты.СправкаРасчетАмортизацииОС2_4.ДобавитьКомандуОтчетаПоДокументуАмортизацииОС(КомандыОтчетов);
	//-- Локализация
	
КонецПроцедуры

// Добавляет команды печати.
// 
// Параметры:
// 	КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПроводкиРегУчета

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	//++ Локализация

	СписокЗапросов = Новый Массив;
	
	ВнеоборотныеАктивыЛокализация.ТекстОтраженияВРеглУчетеНачисленияАмортизацииОС(СписокЗапросов);
	ВнеоборотныеАктивыЛокализация.ТекстОтраженияВРеглУчетеАмортизационнойПремии(СписокЗапросов);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());

	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, необходимых для отражения в регламентированном учете.
//
// Возвращаемое значение:
//   Строка - сформированный текст запроса.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";

	//++ Локализация

	СписокЗапросов = Новый Массив;
	
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаВТНачислениеАмортизацииОС(СписокЗапросов);
	
	СписокЗапросов.Добавить(Символы.ПС);

	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	
	ТекстЗапросаТаблицаСтоимостьОС(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПрочиеДоходы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПорядокОтраженияПрочихОпераций(Запрос, ТекстыЗапроса, Регистры);
	
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете_Амортизация(Запрос, ТекстыЗапроса, Регистры);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура СформироватьЗаданияКЗакрытиюМесяца(Объект) Экспорт

	//++ Локализация
	
	ПериодРасчета = РасчетИмущественныхНалоговУП.ПериодРасчетаНалогаНаИмущество(Объект.Организация, Объект.Дата);
	Если ПериодРасчета <> Неопределено Тогда
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписьРегистра(
			ПериодРасчета, Объект.Ссылка, Объект.Организация, Справочники.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	КонецЕсли;
	
	ПериодРасчета = УчетАрендованныхОСЛокализация.СледующийПериодПризнанияВНУАрендныхПлатежей(Объект.Организация, Объект.Дата);
	Если ПериодРасчета <> Неопределено Тогда
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписьРегистра(
			ПериодРасчета, Объект.Ссылка, Объект.Организация, Справочники.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеАрендныхПлатежей);
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(СписокЗапросовОбъединение) Экспорт
	
	//++ Локализация
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                              КАК Регистратор,
	|	ДанныеДокумента.Период                              КАК Период,
	|	АмортизационнаяПремия.Организация                   КАК Организация,
	|	АмортизационнаяПремия.Подразделение                 КАК Подразделение,
	|	АмортизационнаяПремия.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                         КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-АмортизационнаяПремия.Сумма КАК ВременнаяРазница,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|
	|	АмортизационнаяПремия.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АмортизационнаяПремия КАК АмортизационнаяПремия
	|		ПО АмортизационнаяПремия.Организация = ДанныеДокумента.Организация
	|			И АмортизационнаяПремия.НомерПакета = ДанныеДокумента.НомерПакета
	|	
	|ГДЕ
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                               КАК Регистратор,
	|	ДанныеДокумента.Период                               КАК Период,
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов  КАК Организация,
	|	АмортизационнаяПремия.КорПодразделение               КАК Подразделение,
	|	АмортизационнаяПремия.КорНаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВыделенномуИмуществу) КАК Статья,
	|	АмортизационнаяПремия.Организация                    КАК Аналитика,
	|	НЕОПРЕДЕЛЕНО                                          КАК НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	-АмортизационнаяПремия.Сумма КАК ВременнаяРазница,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|
	|	АмортизационнаяПремия.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АмортизационнаяПремия КАК АмортизационнаяПремия
	|		ПО АмортизационнаяПремия.Организация = ДанныеДокумента.Организация
	|			И АмортизационнаяПремия.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|ГДЕ
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
		
	//-- Локализация
	
КонецПроцедуры
 
Процедура ДополнитьТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(СписокЗапросовОбъединение, ДополнительныеПоля = "") Экспорт
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Период                            КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)            КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА АмортизационнаяПремия.ПередаватьРасходыВДругуюОрганизацию
	|			ТОГДА АмортизационнаяПремия.ОрганизацияПолучательРасходов
	|		ИНАЧЕ АмортизационнаяПремия.Организация
	|	КОНЕЦ                                             КАК Организация,
	|	АмортизационнаяПремия.КорПодразделение            КАК Подразделение,
	|	АмортизационнаяПремия.СтатьяРасходов              КАК СтатьяРасходов,
	|	АмортизационнаяПремия.АналитикаРасходов           КАК АналитикаРасходов,
	|	АмортизационнаяПремия.КорНаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                      КАК ВидДеятельностиНДС,
	|
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСУпр,
	|	0 КАК СуммаСНДСРегл,
	|	0 КАК СуммаБезНДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	-АмортизационнаяПремия.Сумма КАК ВременнаяРазница,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеАмортизационнойПремииВРасходы) КАК ХозяйственнаяОперация,
	|
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	АмортизационнаяПремия.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации,
	|
	|	ДанныеДокумента.Ссылка                       КАК Регистратор,
	|	ДАТАВРЕМЯ(1,1,1)                             КАК ПериодОтклонения
	|
	|	,&ДополнительныеПоля
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АмортизационнаяПремия КАК АмортизационнаяПремия
	|		ПО АмортизационнаяПремия.Организация = ДанныеДокумента.Организация
	|			И АмортизационнаяПремия.НомерПакета = ДанныеДокумента.НомерПакета
	|
	|";

	ВнеоборотныеАктивыСлужебный.ЗаменитьДополнительныеПоляВЗапросе(ТекстЗапроса, ДополнительныеПоля, "Регистратор,ПериодОтклонения");	

	СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
	
	//-- Локализация
	
КонецПроцедуры

//++ Локализация

Функция ТекстЗапросаТаблицаСтоимостьОС(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "СтоимостьОС";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Период                              КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	АмортизационнаяПремия.Организация                   КАК Организация,
	|	АмортизационнаяПремия.Подразделение                 КАК Подразделение,
	|	АмортизационнаяПремия.ОсновноеСредство              КАК ОсновноеСредство,
	|	АмортизационнаяПремия.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	АмортизационнаяПремия.ГруппаФинансовогоУчета        КАК ГруппаФинансовогоУчета,
	|	АмортизационнаяПремия.Арендатор                     КАК Арендатор,
	|
	|	АмортизационнаяПремия.Сумма                         КАК СтоимостьНУ,
	|	-АмортизационнаяПремия.Сумма                        КАК СтоимостьВР,
	|	АмортизационнаяПремия.Сумма                         КАК АмортизационнаяПремия,
	|
	|	АмортизационнаяПремия.ОрганизацияПолучательРасходов КАК КорОрганизация,
	|	АмортизационнаяПремия.КорПодразделение              КАК КорПодразделение,
	|	АмортизационнаяПремия.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	АмортизационнаяПремия.СтатьяРасходов                КАК КорСтатьяРасходов,
	|	АмортизационнаяПремия.АналитикаРасходов             КАК КорАналитикаРасходов,
	|	
	|	АмортизационнаяПремия.ИдентификаторСтроки           КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеАмортизационнойПремииВРасходы) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АмортизационнаяПремия КАК АмортизационнаяПремия
	|		ПО АмортизационнаяПремия.Организация = ДанныеДокумента.Организация
	|			И АмортизационнаяПремия.НомерПакета = ДанныеДокумента.НомерПакета
	|	
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ТекстЗапросаТаблицаПрочиеДоходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеДоходы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтПараметрыЦелевогоФинансированияОС(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачисленнаяАмортизация.ПериодРасчета КАК Период,
	|	ДанныеДокумента.Ссылка КАК Регистратор,
	|	
	|	НачисленнаяАмортизация.Организация КАК Организация,
	|
	|	НачисленнаяАмортизация.КорПодразделение КАК Подразделение,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПараметрыЦФ.СтатьяДоходов КАК СтатьяДоходов,
	|	ПараметрыЦФ.АналитикаДоходов КАК АналитикаДоходов,
	|	
	|	НачисленнаяАмортизация.СуммаЦФ КАК СуммаРегл,
	|
	|	ЛОЖЬ КАК РасчетСебестоимости,
	|
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|	&Настройка_ХО КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Организация = НачисленнаяАмортизация.Организация
	|			И ДанныеДокумента.НомерПакета = НачисленнаяАмортизация.НомерПакета
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыЦелевогоФинансированияОС КАК ПараметрыЦФ
	|		ПО ПараметрыЦФ.ОсновноеСредство = НачисленнаяАмортизация.ОсновноеСредство
	|
	|ГДЕ
	|	НЕ НачисленнаяАмортизация.НачислятьИзнос
	|	И НачисленнаяАмортизация.СуммаЦФ <> 0
	|	И &ИспользоватьУчетПрочихДоходовРасходов
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПорядокОтраженияПрочихОпераций(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ПорядокОтраженияПрочихОпераций";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтатьиПрочихОпераций.Ссылка КАК Ссылка
	|
	|ПОМЕСТИТЬ СтатьиПрочихОпераций
	|
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиПрочихОпераций
	|
	|ГДЕ
	|	СтатьиПрочихОпераций.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	И СтатьиПрочихОпераций.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВтСтатьиПрочихОпераций");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Период КАК Дата,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Ссылка КАК Документ,
	|	"""" КАК ИдентификаторСтроки
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			НачисленнаяАмортизация КАК Т
	|		ГДЕ
	|			Т.Организация = ДанныеДокумента.Организация
	|			И Т.НомерПакета = ДанныеДокумента.НомерПакета
	|			И Т.СтатьяРасходов В (ВЫБРАТЬ СтатьиПрочихОпераций.Ссылка ИЗ СтатьиПрочихОпераций))
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаТаблицаВтПараметрыЦелевогоФинансированияОС(ТекстыЗапроса)
	
	ИмяТаблицы = "втПараметрыЦелевогоФинансированияОС";
	
	Если ПроведениеДокументов.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтСписокОС(ТекстыЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПараметрыЦелевогоФинансированияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыЦелевогоФинансированияОС.СтатьяДоходов КАК СтатьяДоходов,
	|	ПараметрыЦелевогоФинансированияОС.АналитикаДоходов КАК АналитикаДоходов
	|
	|ПОМЕСТИТЬ втПараметрыЦелевогоФинансированияОС
	|
	|ИЗ
	|	РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
	|			&Период,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					СписокОС.ОсновноеСредство
	|				ИЗ
	|					втСписокОС КАК СписокОС)) КАК ПараметрыЦелевогоФинансированияОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтСписокОС(ТекстыЗапроса)
	
	ИмяТаблицы = "втСписокОС";
	
	Если ПроведениеДокументов.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленнаяАмортизация.Организация КАК Организация,
	|	НачисленнаяАмортизация.ОсновноеСредство КАК ОсновноеСредство
	|
	|ПОМЕСТИТЬ втСписокОС
	|
	|ИЗ
	|	НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|
	|ГДЕ
	|	НЕ НачисленнаяАмортизация.НачислятьИзнос
	|	И НачисленнаяАмортизация.СуммаЦФ <> 0
	|
	|	И ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|		ГДЕ
	|			ДанныеДокумента.Организация = НачисленнаяАмортизация.Организация
	|			И ДанныеДокумента.НомерПакета = НачисленнаяАмортизация.НомерПакета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы);
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#Область РасчетАмортизации

// 
// Параметры:
// 	СписокЗапросов - Массив из Строка - Список запросов, который нужно дозаполнить.
// 	ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
Процедура ДополнитьТекстЗапросаПараметрыРасчетаАмортизации(СписокЗапросов, ПараметрыРасчета) Экспорт
	
	//++ Локализация
	
	#Область ДатыПоследнегоИзмененияБУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.НачалоМесяца КАК НачалоМесяца,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	|	
	|	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	|	МАКСИМУМ(ВложенныйЗапрос.РежимИсправленияСПрошлойДатыБУ) КАК РежимИсправленияСПрошлойДатыБУ,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДокументаПринятияКУчетуБУ) КАК ДатаДокументаПринятияКУчетуБУ,
	|	МАКСИМУМ(ВложенныйЗапрос.РежимИсправленияСПрошлойДатыНУ) КАК РежимИсправленияСПрошлойДатыНУ,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДокументаПринятияКУчетуНУ) КАК ДатаДокументаПринятияКУчетуНУ
	|
	|ПОМЕСТИТЬ ДатыПоследнегоИзмененияБУ
	|
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		ПараметрыАмортизацииОСБУ.НачалоМесяца КАК НачалоМесяца,
	|		ПараметрыАмортизацииОСБУ.Организация КАК Организация,
	|		ПараметрыАмортизацииОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	
	|		ВЫБОР
	|			КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|				ТОГДА ВЫБОР 
	|						КОГДА ЕСТЬNULL(УчетнаяПолитикаБухУчета.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|							ТОГДА ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
	|					КОНЕЦ
	|
	|			КОГДА ЕСТЬNULL(УчетнаяПолитикаБухУчета.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|				ТОГДА ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения
	|
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
	|
	|		КОНЕЦ КАК Дата,
	|
	|		ЕСТЬNULL(ПринятиеКУчетуОС_БУ.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС_БУ.ОтражатьВБУ, ЛОЖЬ) КАК РежимИсправленияСПрошлойДатыБУ,
	|
	|		ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчетуБУ,
	|
	|		ЕСТЬNULL(ПринятиеКУчетуОС_НУ.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС_НУ.ОтражатьВНУ, ЛОЖЬ) КАК РежимИсправленияСПрошлойДатыНУ,
	|
	|		ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчетуНУ
	|
	|	ИЗ
	|		ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|			ПО (ПервоначальныеСведенияОС.Организация = ПараметрыАмортизацииОСБУ.Организация)
	|				И (ПервоначальныеСведенияОС.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство)
	|				И (ПервоначальныеСведенияОС.НачалоМесяца = ПараметрыАмортизацииОСБУ.НачалоМесяца)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС_БУ
	|			ПО (ПринятиеКУчетуОС_БУ.Ссылка = ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС_НУ
	|			ПО (ПринятиеКУчетуОС_НУ.Ссылка = ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ)
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитикаБухУчета
	|			ПО УчетнаяПолитикаБухУчета.Организация = ПараметрыАмортизацииОСБУ.Организация.ГоловнаяОрганизация
	|				И УчетнаяПолитикаБухУчета.Период = &КонецПредыдущегоМесяца
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НачалоМесяца,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачалоМесяца,
	|	Организация,
	|	ОсновноеСредство";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область АмортизацияОСПриПереходеКЛинейномуМетоду
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НелинейныйМетод.Организация КАК Организация,
	|	ЕСТЬNULL(МИНИМУМ(ЛинейныйМетод.Период), ДАТАВРЕМЯ(2009, 1, 1)) КАК Дата
	|
	|ПОМЕСТИТЬ ДатыПереходаКЛинейномуМетоду
	|
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(
	|		&НачалоМесяца, 
	|		МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)) КАК НелинейныйМетод
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль КАК ЛинейныйМетод
	|		ПО ЛинейныйМетод.Организация = НелинейныйМетод.Организация
	|			И ЛинейныйМетод.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|			И ЛинейныйМетод.Период МЕЖДУ ДАТАВРЕМЯ(2009, 1, 1) И &НачалоМесяца
	|			И ЛинейныйМетод.Период > НелинейныйМетод.Период
	| 
	|СГРУППИРОВАТЬ ПО
	|	НелинейныйМетод.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОС.Организация КАК Организация,
	|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВЫБОР КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА -АмортизацияОС.АмортизацияНУ
	|		ИНАЧЕ АмортизацияОС.АмортизацияНУ
	|	КОНЕЦ) КАК АмортизацияНУ
	|
	|ПОМЕСТИТЬ АмортизацияОСПриПереходеКЛинейномуМетоду
	|
	|ИЗ
	|
	|	ДатыПереходаКЛинейномуМетоду КАК ДатыПереходаКЛинейномуМетоду
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК АмортизацияОС
	|		ПО АмортизацияОС.Организация.ГоловнаяОрганизация = ДатыПереходаКЛинейномуМетоду.Организация
	|			И АмортизацияОС.Период < ДатыПереходаКЛинейномуМетоду.Дата
	|			И АмортизацияОС.Активность
	|
	|ГДЕ
	|	ДатыПереходаКЛинейномуМетоду.Дата > ДАТАВРЕМЯ(2009, 1, 1)
	|	И (АмортизацияОС.Организация, АмортизацияОС.ОсновноеСредство) В
	|			(ВЫБРАТЬ
	|				СписокОС.Организация,
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_НУ КАК СписокОС)
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОС.Организация,
	|	АмортизацияОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	#Область ГрафикиАмортизацииОС
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииОСБУ.Организация       КАК Организация,
	|	ПараметрыАмортизацииОСБУ.ОсновноеСредство  КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБУ.ГрафикАмортизации КАК ГрафикАмортизации,
	|
	|	&КоэффициентПериода КАК КоэффициентПериода
	|
	|ПОМЕСТИТЬ ГрафикиАмортизацииОС
	|
	|ИЗ
	|	ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГодовыеГрафикиАмортизацииОС КАК ГодовыеГрафикиАмортизацииОС
	|		ПО ПараметрыАмортизацииОСБУ.ГрафикАмортизации = ГодовыеГрафикиАмортизацииОС.Ссылка 
	|
	|ГДЕ
	|	ПараметрыАмортизацииОСБУ.ГрафикАмортизации <> ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоэффициентПериода", ВнеоборотныеАктивыСлужебный.ТекстПоляКоэффициентПериода("&НачалоМесяца"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
		
	#Область КорректировкаАмортизацииБУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&НачалоМесяца               КАК НачалоМесяца,
	|	ТаблицаОС.Организация       КАК Организация,
	|	ТаблицаОС.ОсновноеСредство  КАК ОсновноеСредство,
	|
	|	СУММА(ТаблицаОС.АмортизацияРегл) КАК АмортизацияРегл,
	|	СУММА(ТаблицаОС.АмортизацияПР) КАК АмортизацияПР,
	|	СУММА(ТаблицаОС.АмортизацияНУ) КАК АмортизацияНУ
	|
	|ПОМЕСТИТЬ КорректировкаАмортизацииБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		Корректировка.Организация   КАК Организация,
	|		ТаблицаОС.ОсновноеСредство  КАК ОсновноеСредство,
	|
	|		ТаблицаОС.АмортизацияБУ + ТаблицаОС.АмортизацияЦФ КАК АмортизацияРегл,
	|		ТаблицаОС.АмортизацияПР + ТаблицаОС.АмортизацияЦФ КАК АмортизацияПР,
	|		ТаблицаОС.АмортизацияНУ КАК АмортизацияНУ
	|
	|	ИЗ
	|		Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = Корректировка.Ссылка)
	|
	|	ГДЕ
	|		Корректировка.Проведен
	|		И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И Корректировка.ОтражатьВБУ
	|		И Корректировка.РежимИсправленияСПрошлойДаты
	|
	|		И ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|				ГДЕ
	|					ДатыПоследнегоИзменения.НачалоМесяца = &НачалоМесяца
	|					И ДатыПоследнегоИзменения.Организация = Корректировка.Организация
	|					И ДатыПоследнегоИзменения.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
	|					И ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|					И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, ДЕНЬ) = НАЧАЛОПЕРИОДА(Корректировка.Дата, ДЕНЬ))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаОС.Организация       КАК Организация,
	|		ТаблицаОС.ОсновноеСредство  КАК ОсновноеСредство,
	|
	|		ТаблицаОС.СуммаБУ + ТаблицаОС.СуммаЦФ КАК АмортизацияРегл,
	|		ТаблицаОС.СуммаПР + ТаблицаОС.СуммаПРЦФ КАК АмортизацияПР,
	|		ТаблицаОС.СуммаНУ КАК АмортизацияНУ
	|
	|	ИЗ
	|		КорректировкаАмортизацииЗаПрошлыйПериод ТаблицаОС
	|
	|	) КАК ТаблицаОС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОС.Организация,
	|	ТаблицаОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область Изменения_БУ
	
	#Область ИзменениеПараметров
	ТекстЗапроса =
	// ПараметрыАмортизацииОСБУ
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ДанныеРегистра.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ДанныеРегистра.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемНаработки,
	|	ДанныеРегистра.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	ДанныеРегистра.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ДанныеРегистра.КоэффициентАмортизацииБУ,
	|	ДанныеРегистра.КоэффициентУскорения КАК КоэффициентУскоренияБУ,
	|	ДанныеРегистра.ГрафикАмортизации,
	|	ДанныеРегистра.ЛиквидационнаяСтоимость
	|
	|ПОМЕСТИТЬ ПараметрыАмортизацииОСБУ_Изменения
	|
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБУ КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ДанныеРегистра.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользования,
	|	ДанныеРегистра.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемНаработки,
	|	ДанныеРегистра.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	ДанныеРегистра.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ДанныеРегистра.КоэффициентАмортизацииБУ,
	|	ДанныеРегистра.КоэффициентУскорения КАК КоэффициентУскоренияБУ,
	|	ДанныеРегистра.ГрафикАмортизации,
	|	ДанныеРегистра.ЛиквидационнаяСтоимость
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБУ КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|	И ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&ТипыДокументовУчитываемыеПослеДоначисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПервоначальныеСведенияОС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.МетодНачисленияАмортизацииБУ,
	|	ДанныеРегистра.ПорядокУчетаБУ
	|
	|ПОМЕСТИТЬ ПервоначальныеСведенияОС_ИзмененияБУ
	|
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.МетодНачисленияАмортизацииБУ,
	|	ДанныеРегистра.ПорядокУчетаБУ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|	И ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&ТипыДокументовУчитываемыеПослеДоначисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПорядокУчетаОС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.ПоказательНаработки,
	|	ДанныеРегистра.ОбъемНаработки
	|
	|ПОМЕСТИТЬ ПорядокУчетаОС_ИзмененияБУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОС КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.ПоказательНаработки,
	|	ДанныеРегистра.ОбъемНаработки
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОС КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|	И ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&ТипыДокументовУчитываемыеПослеДоначисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// ПорядокУчетаОСБУ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.СостояниеБУ,
	|	ДанныеРегистра.НачислятьАмортизациюБУ,
	|	ДанныеРегистра.СпособОтраженияАмортизацииБУ,
	|	ДанныеРегистра.СтатьяРасходовБУ,
	|	ДанныеРегистра.АналитикаРасходовБУ,
	|	ДанныеРегистра.ПодразделениеБУ,
	|	ДанныеРегистра.НаправлениеДеятельностиБУ,
	|	ДанныеРегистра.ПередаватьРасходыВДругуюОрганизацию,
	|	ДанныеРегистра.ОрганизацияПолучательРасходов,
	|	ДанныеРегистра.АмортизационнаяГруппа
	|
	|ПОМЕСТИТЬ ПорядокУчетаОСБУ_Изменения
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПредыдущегоМесяца КАК НачалоМесяца,
	|	&КонецПозапрошлогоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.СостояниеБУ,
	|	ДанныеРегистра.НачислятьАмортизациюБУ,
	|	ДанныеРегистра.СпособОтраженияАмортизацииБУ,
	|	ДанныеРегистра.СтатьяРасходовБУ,
	|	ДанныеРегистра.АналитикаРасходовБУ,
	|	ДанныеРегистра.ПодразделениеБУ,
	|	ДанныеРегистра.НаправлениеДеятельностиБУ,
	|	ДанныеРегистра.ПередаватьРасходыВДругуюОрганизацию,
	|	ДанныеРегистра.ОрганизацияПолучательРасходов,
	|	ДанныеРегистра.АмортизационнаяГруппа
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОбъектовУчета_Доначисление_БУ КАК Доначисление
	|		ПО ДанныеРегистра.ОсновноеСредство = Доначисление.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ДанныеРегистра.Период >= Доначисление.Период
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|	И ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&ТипыДокументовУчитываемыеПослеДоначисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// МестонахождениеОС
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.МоментВремени,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.ОсновноеСредство,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Местонахождение
	|
	|ПОМЕСТИТЬ МестонахождениеОС_ИзмененияБУ
	|
	|ИЗ
	|	РегистрСведений.МестонахождениеОС КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Активность
	|	И ДанныеРегистра.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеРегистра.ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПринятиеКУчетуУзловКомпонентовАмортизации
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|	И НЕ ДанныеРегистра.Регистратор ССЫЛКА Документ.ВводОстатковУзловКомпонентовАмортизации
	|
	|	И ДанныеРегистра.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеСтоимости
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтоимостьОС.НачалоМесяца КАК НачалоМесяца,
	|	СтоимостьОС.ПериодПараметров КАК ПериодПараметров,
	|	СтоимостьОС.Период КАК Период,
	|	СтоимостьОС.Регистратор КАК Регистратор,
	|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОС.Организация КАК Организация,
	|
	|	СУММА(СтоимостьОС.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(СтоимостьОС.СтоимостьПР) КАК СтоимостьПР
	|
	|ПОМЕСТИТЬ СтоимостьОС_ИзмененияБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоМесяца КАК НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата КАК Период,
	|		ДанныеДокумента.Ссылка КАК Регистратор,
	|		ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|		ДанныеДокумента.Организация КАК Организация,
	|		ЕСТЬNULL(ТаблицаОС.СтоимостьБУ, 0) КАК СтоимостьРегл,
	|		ЕСТЬNULL(ТаблицаОС.СтоимостьПР, 0) КАК СтоимостьПР
	|	ИЗ
	|		Документ.МодернизацияОС2_4 КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС2_4.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ОтражатьВРеглУчете
	|		И НЕ ДанныеДокумента.СписатьЗатратыНаМодернизацию
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца КАК НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата КАК Период,
	|		ДанныеДокумента.Ссылка КАК Регистратор,
	|		ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|		ДанныеДокумента.Организация КАК Организация,
	|		ЕСТЬNULL(ТаблицаОС.СуммаБУ, 0) КАК СтоимостьРегл,
	|		ЕСТЬNULL(ТаблицаОС.СуммаПР, 0) КАК СтоимостьПР
	|	ИЗ
	|		Документ.ОтнесениеОтклоненийВСтоимостьОС КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтнесениеОтклоненийВСтоимостьОС.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ОтражатьВРеглУчете
	|		И НЕ ДанныеДокумента.СписатьОтклоненияНаРасходы
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		ДанныеДокумента.Организация,
	|		-ТаблицаОС.СуммаСписанияБУ,
	|		-ТаблицаОС.СуммаСписанияПР
	|	ИЗ
	|		Документ.СписаниеОС2_4 КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеОС2_4.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное)
	|		И ТаблицаОС.СуммаСписанияБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.ОсновноеСредство,
	|		ДанныеДокумента.Организация,
	|		-СУММА(ТаблицаОС.СтоимостьБУ),
	|		-СУММА(ТаблицаОС.СтоимостьПР)
	|	ИЗ
	|		Документ.РазукомплектацияОС КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ОтражатьВРеглУчете
	|
	|		И ДанныеДокумента.ХозяйственнаяОперация В(
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазукомплектацияОСЧастичная),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации))
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.ОсновноеСредство,
	|		ДанныеДокумента.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		ДанныеДокумента.Организация,
	|		ТаблицаОС.СтоимостьБУ,
	|		0
	|	ИЗ
	|		Документ.ПереоценкаОС2_4 КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ОтражатьВРеглУчете
	|		И ТаблицаОС.СтоимостьБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		ДанныеДокумента.Организация,
	|		ТаблицаОС.СтоимостьБУ,
	|		0
	|	ИЗ
	|		Документ.ИзменениеУсловийДоговораАренды КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийДоговораАренды.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ТаблицаОС.СтоимостьБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.Ссылка,
	|		ТаблицаОС.ОсновноеСредство,
	|		ДанныеДокумента.Организация,
	|		ТаблицаОС.СтоимостьБУ,
	|		ТаблицаОС.СтоимостьПР
	|	ИЗ
	|		Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|			ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ДанныеДокумента.Проведен
	|		И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И ДанныеДокумента.ОтражатьВБУ
	|		И ТаблицаОС.СтоимостьБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		СтоимостьОС.Период,
	|		СтоимостьОС.Регистратор,
	|		СтоимостьОС.ОсновноеСредство,
	|		СтоимостьОС.Организация,
	|		СтоимостьОС.СтоимостьРегл,
	|		СтоимостьОС.СтоимостьПР
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|
	|	ГДЕ
	|		СтоимостьОС.Активность
	|		И СтоимостьОС.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И СтоимостьОС.Регистратор ССЫЛКА Документ.НачислениеСписаниеРезервовПредстоящихРасходов
	|		И СтоимостьОС.СтоимостьРегл <> 0
	|
	|		И (СтоимостьОС.Организация, СтоимостьОС.ОсновноеСредство) В
	|			(ВЫБРАТЬ
	|				СписокОС.Организация,
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&НачалоМесяца,
	|		&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|		ИнвестицииВАренду.Период,
	|		ИнвестицииВАренду.Ссылка,
	|		ИнвестицииВАренду.ОсновноеСредство,
	|		ИнвестицииВАренду.Организация,
	|		ИнвестицииВАренду.СтоимостьРегл,
	|		0
	|	ИЗ
	|		ИнвестицииВАренду КАК ИнвестицииВАренду
	|
	|	ГДЕ
	|		ИнвестицииВАренду.ОтражатьВРеглУчете
	|		И ИнвестицииВАренду.СтоимостьРегл <> 0
	|
	|		И ИнвестицииВАренду.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|	) КАК СтоимостьОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОС.НачалоМесяца,
	|	СтоимостьОС.ПериодПараметров,
	|	СтоимостьОС.Период,
	|	СтоимостьОС.Регистратор,
	|	СтоимостьОС.ОсновноеСредство,
	|	СтоимостьОС.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтоимостьОС.СтоимостьРегл) <> 0
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИзменениеАмортизации
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&НачалоМесяца КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца КАК ПериодПараметров,
	|	Корректировка.Дата КАК Период,
	|	Корректировка.Ссылка КАК Регистратор,
	|	Корректировка.ОсновноеСредство КАК ОсновноеСредство,
	|	Корректировка.Организация КАК Организация,
	|
	|	СУММА(Корректировка.АмортизацияБУ) КАК АмортизацияРегл,
	|	СУММА(Корректировка.АмортизацияПР) КАК АмортизацияПР
	|
	|ПОМЕСТИТЬ АмортизацияОС_ИзмененияБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		Корректировка.Дата КАК Дата,
	|		Корректировка.Ссылка КАК Ссылка,
	|		Корректировка.Организация КАК Организация,
	|		ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|
	|		ТаблицаОС.АмортизацияБУ КАК АмортизацияБУ,
	|		ТаблицаОС.АмортизацияПР КАК АмортизацияПР
	|
	|	ИЗ
	|		Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|			ПО (ТаблицаОС.Ссылка = Корректировка.Ссылка)
	|
	|	ГДЕ
	|		Корректировка.Проведен
	|		И Корректировка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|		И Корректировка.ОтражатьВБУ
	|		И ТаблицаОС.АмортизацияБУ <> 0
	|
	|		И ТаблицаОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				СписокОС.ОсновноеСредство
	|			ИЗ
	|				СписокОбъектовУчета_БУ КАК СписокОС
	|			ГДЕ
	|				СписокОС.НачалоМесяца = &НачалоМесяца
	|				И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&НачалоМесяца КАК Дата,
	|		ЗНАЧЕНИЕ(Документ.КорректировкаСтоимостиИАмортизацииОС.ПустаяСсылка) КАК Ссылка,
	|		КорректировкаАмортизацииЗаПрошлыйПериод.Организация КАК Организация,
	|		КорректировкаАмортизацииЗаПрошлыйПериод.ОсновноеСредство КАК ОсновноеСредство,
	|
	|		КорректировкаАмортизацииЗаПрошлыйПериод.СуммаБУ + КорректировкаАмортизацииЗаПрошлыйПериод.СуммаЦФ КАК АмортизацияБУ,
	|		КорректировкаАмортизацииЗаПрошлыйПериод.СуммаПР + КорректировкаАмортизацииЗаПрошлыйПериод.СуммаПРЦФ КАК АмортизацияПР
	|	ИЗ
	|		КорректировкаАмортизацииЗаПрошлыйПериод КАК КорректировкаАмортизацииЗаПрошлыйПериод
	|
	|	) КАК Корректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	Корректировка.Дата,
	|	Корректировка.Ссылка,
	|	Корректировка.ОсновноеСредство,
	|	Корректировка.Организация
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ОбъединениеВсехИзменений
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|	ТаблицаИзменений.Регистратор,
	|	МАКСИМУМ(ТаблицаИзменений.Период) КАК Период,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТаблицаИзменений.Период, МЕСЯЦ, 1), МЕСЯЦ)) КАК НачалоСледующегоМесяца,
	|	ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	МАКСИМУМ(ПервоначальныеСведенияОС_Последнее.Период) КАК ПервоначальныеСведенияОС_ПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаОС_Последнее.Период) КАК ПорядокУчетаОС_ПоследнееПериод,
	|	МАКСИМУМ(ПорядокУчетаОСБУ_Последнее.Период) КАК ПорядокУчетаОСБУ_ПоследнееПериод,
	|	МАКСИМУМ(ПараметрыАмортизацииОСБУ_Последнее.Период) КАК ПараметрыАмортизацииОСБУ_ПоследнееПериод,
	|	МАКСИМУМ(МестонахождениеОС_Последнее.Период) КАК МестонахождениеОС_ПоследнееПериод
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период КАК Период,
	|		ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|		ТаблицаИзменений.Организация КАК Организация
	|	ИЗ
	|		ПараметрыАмортизацииОСБУ_Изменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор КАК Регистратор,
	|		ТаблицаИзменений.Период КАК Период,
	|		ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|		ТаблицаИзменений.Организация КАК Организация
	|	ИЗ
	|		ПервоначальныеСведенияОС_ИзмененияБУ КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаОС_ИзмененияБУ КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		ПорядокУчетаОСБУ_Изменения КАК ТаблицаИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		МестонахождениеОС_ИзмененияБУ КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		СтоимостьОС_ИзмененияБУ КАК ТаблицаИзменений
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаИзменений.НачалоМесяца,
	|		ТаблицаИзменений.ПериодПараметров КАК ПериодПараметров,
	|		ТаблицаИзменений.Регистратор,
	|		ТаблицаИзменений.Период,
	|		ТаблицаИзменений.ОсновноеСредство,
	|		ТаблицаИзменений.Организация
	|	ИЗ
	|		АмортизацияОС_ИзмененияБУ КАК ТаблицаИзменений
	|
	|	) КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_ИзмененияБУ КАК ПервоначальныеСведенияОС_Последнее
	|		ПО (ПервоначальныеСведенияОС_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияОС_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Изменения КАК ПараметрыАмортизацииОСБУ_Последнее
	|		ПО (ПараметрыАмортизацииОСБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииОСБУ_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС_ИзмененияБУ КАК ПорядокУчетаОС_Последнее
	|		ПО (ПорядокУчетаОС_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОС_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОС_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Изменения КАК ПорядокУчетаОСБУ_Последнее
	|		ПО (ПорядокУчетаОСБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаОСБУ_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_ИзмененияБУ КАК МестонахождениеОС_Последнее
	|		ПО (МестонахождениеОС_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестонахождениеОС_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (МестонахождениеОС_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестонахождениеОС_Последнее.Период <= ТаблицаИзменений.Период)
	|
	|ГДЕ
	|	ТаблицаИзменений.ОсновноеСредство В (
	|		ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			СписокОбъектовУчета_БУ КАК СписокОС)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.ПериодПараметров,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство,
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	МИНИМУМ(ТаблицаИзмененийСледующее.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийСледующееБУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийБУ КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Период > ТаблицаИзменений.Период
	|				ИЛИ ТаблицаИзмененийСледующее.Период = ТаблицаИзменений.Период
	|						И ТаблицаИзмененийСледующее.Регистратор > ТаблицаИзменений.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.НачалоМесяца,
	|	ТаблицаИзменений.Регистратор,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство,
	|	МИНИМУМ(ТаблицаИзменений.Период) КАК ПериодСледующее
	|
	|ПОМЕСТИТЬ ТаблицаИзмененийВЭтомМесяцеБУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ КАК ТаблицаИзменений
	|ГДЕ
	|	(ТаблицаИзменений.НачалоМесяца = &НачалоМесяца)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ОсновноеСредство";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область Изменения_БУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.НачалоМесяца КАК НачалоМесяца,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = ТаблицаИзменений.НачалоМесяца
	|				И НЕ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|			ТОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, ДЕНЬ)
	|		ИНАЧЕ ТаблицаИзменений.ПериодПараметров 
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.НачалоМесяца, МЕСЯЦ) КАК КонецМесяца,
	|	КОНЕЦПЕРИОДА(ТаблицаИзменений.Период, ДЕНЬ) КАК ДатаИзменений,
	|	ТаблицаИзменений.Регистратор КАК Регистратор,
	|	ТаблицаИзменений.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	ЕСТЬNULL(РеестрДокументов.ХозяйственнаяОперация, НЕОПРЕДЕЛЕНО) КАК ХозяйственнаяОперация,
	|
	|	(НЕ ОбъединениеОС.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ РазукомплектацияОС.Ссылка ЕСТЬ NULL) КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	ВЫБОР 
	|		КОГДА ТаблицаИзменений.НачалоМесяца = &НачалоПредыдущегоМесяца
	|
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, &КонецМесяца), ДЕНЬ) = &НачалоМесяца
	|						ТОГДА &НачалоМесяца 
	|					ИНАЧЕ ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийВЭтомМесяце.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца)
	|				КОНЕЦ
	| 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(ТаблицаИзмененийСледующее.ПериодСледующее, &КонецМесяца), ДЕНЬ) = &НачалоМесяца
	|
	|			ТОГДА &НачалоМесяца
	| 
	|		ИНАЧЕ ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ТаблицаИзмененийСледующее.ПериодСледующее, ДЕНЬ, -1), &КонецМесяца)
	| 
	|	КОНЕЦ КАК Период,
	|
	|	РАЗНОСТЬДАТ(ТаблицаИзменений.Период, ЕСТЬNULL(ТаблицаИзмененийСледующее.ПериодСледующее, ТаблицаИзменений.НачалоСледующегоМесяца), ДЕНЬ) КАК СрокДействия,
	|
	|	ЕСТЬNULL(СтоимостьОСИзменения.СтоимостьРегл, 0) КАК СтоимостьРеглИзменение,
	|	ЕСТЬNULL(АмортизацияОСИзменения.АмортизацияРегл, 0) КАК АмортизацияРеглИзменение,
	|	ЕСТЬNULL(СтоимостьОСИзменения.СтоимостьПР, 0) КАК СтоимостьПРИзменение,
	|	ЕСТЬNULL(АмортизацияОСИзменения.АмортизацияПР, 0) КАК АмортизацияПРИзменение,
	|
	|	ПараметрыАмортизацииОСБУ_Последнее.ДатаПоследнегоИзменения,
	|	ПараметрыАмортизацииОСБУ_Последнее.СрокИспользования,
	|	ПараметрыАмортизацииОСБУ_Последнее.ОбъемНаработки,
	|	ПараметрыАмортизацииОСБУ_Последнее.КоэффициентАмортизацииБУ,
	|	ПараметрыАмортизацииОСБУ_Последнее.КоэффициентУскоренияБУ,
	|	ПараметрыАмортизацииОСБУ_Последнее.ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизацииОСБУ_Последнее.ГрафикАмортизации,
	|	ПараметрыАмортизацииОСБУ_Последнее.ПРДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ_Последнее.СтоимостьДляВычисленияАмортизации,
	|
	|	ПервоначальныеСведенияОС_Последнее.МетодНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияОС_Последнее.ПорядокУчетаБУ,
	|
	|	ПорядокУчетаОС_Последнее.ГруппаФинансовогоУчета,
	|	ПорядокУчетаОС_Последнее.НаправлениеДеятельности,
	|	ПорядокУчетаОС_Последнее.ПоказательНаработки,
	|
	|	ПорядокУчетаОСБУ_Последнее.СостояниеБУ,
	|	ПорядокУчетаОСБУ_Последнее.НачислятьАмортизациюБУ,
	|	ПорядокУчетаОСБУ_Последнее.СпособОтраженияАмортизацииБУ,
	|	ПорядокУчетаОСБУ_Последнее.СтатьяРасходовБУ,
	|	ПорядокУчетаОСБУ_Последнее.АналитикаРасходовБУ,
	|	ПорядокУчетаОСБУ_Последнее.ПодразделениеБУ,
	|	ПорядокУчетаОСБУ_Последнее.НаправлениеДеятельностиБУ,
	|	ПорядокУчетаОСБУ_Последнее.ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОСБУ_Последнее.ОрганизацияПолучательРасходов,
	|	ПорядокУчетаОСБУ_Последнее.АмортизационнаяГруппа,
	|
	|	МестонахождениеОС_Последнее.Местонахождение,
	|	&КоэффициентПериода КАК КоэффициентПериода
	|
	|ПОМЕСТИТЬ Изменения_БУ
	|
	|ИЗ
	|	ТаблицаИзмененийБУ КАК ТаблицаИзменений
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийСледующееБУ КАК ТаблицаИзмененийСледующее
	|		ПО (ТаблицаИзмененийСледующее.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийСледующее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ТаблицаИзмененийСледующее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ТаблицаИзмененийСледующее.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзмененийВЭтомМесяцеБУ КАК ТаблицаИзмененийВЭтомМесяце
	|		ПО (ТаблицаИзмененийВЭтомМесяце.Организация = ТаблицаИзменений.Организация)
	|			И (ТаблицаИзмененийВЭтомМесяце.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_ИзмененияБУ КАК ПервоначальныеСведенияОС_Последнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_ИзмененияБУ КАК ПервоначальныеСведенияОС_Следующее
	|			ПО (ПервоначальныеСведенияОС_Следующее.Организация = ПервоначальныеСведенияОС_Последнее.Организация)
	|				И (ПервоначальныеСведенияОС_Следующее.ОсновноеСредство = ПервоначальныеСведенияОС_Последнее.ОсновноеСредство)
	|				И (ПервоначальныеСведенияОС_Следующее.НачалоМесяца = ПервоначальныеСведенияОС_Последнее.НачалоМесяца)
	|				И (ПервоначальныеСведенияОС_Следующее.Период = ПервоначальныеСведенияОС_Последнее.Период)
	|				И (ПервоначальныеСведенияОС_Следующее.МоментВремени > ПервоначальныеСведенияОС_Последнее.МоментВремени)
	|		ПО (ПервоначальныеСведенияОС_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПервоначальныеСведенияОС_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС_Последнее.Период = ТаблицаИзменений.ПервоначальныеСведенияОС_ПоследнееПериод)
	|			И (ПервоначальныеСведенияОС_Следующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Изменения КАК ПараметрыАмортизацииОСБУ_Последнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Изменения КАК ПараметрыАмортизацииОСБУ_Следующее
	|			ПО (ПараметрыАмортизацииОСБУ_Следующее.Организация = ПараметрыАмортизацииОСБУ_Последнее.Организация)
	|				И (ПараметрыАмортизацииОСБУ_Следующее.ОсновноеСредство = ПараметрыАмортизацииОСБУ_Последнее.ОсновноеСредство)
	|				И (ПараметрыАмортизацииОСБУ_Следующее.НачалоМесяца = ПараметрыАмортизацииОСБУ_Последнее.НачалоМесяца)
	|				И (ПараметрыАмортизацииОСБУ_Следующее.Период = ПараметрыАмортизацииОСБУ_Последнее.Период)
	|				И (ПараметрыАмортизацииОСБУ_Следующее.МоментВремени > ПараметрыАмортизацииОСБУ_Последнее.МоментВремени)
	|		ПО (ПараметрыАмортизацииОСБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПараметрыАмортизацииОСБУ_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ_Последнее.Период = ТаблицаИзменений.ПараметрыАмортизацииОСБУ_ПоследнееПериод)
	|			И (ПараметрыАмортизацииОСБУ_Следующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС_ИзмененияБУ КАК ПорядокУчетаОС_Последнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС_ИзмененияБУ КАК ПорядокУчетаОС_Следующее
	|			ПО (ПорядокУчетаОС_Следующее.Организация = ПорядокУчетаОС_Последнее.Организация)
	|				И (ПорядокУчетаОС_Следующее.ОсновноеСредство = ПорядокУчетаОС_Последнее.ОсновноеСредство)
	|				И (ПорядокУчетаОС_Следующее.НачалоМесяца = ПорядокУчетаОС_Последнее.НачалоМесяца)
	|				И (ПорядокУчетаОС_Следующее.Период = ПорядокУчетаОС_Последнее.Период)
	|				И (ПорядокУчетаОС_Следующее.МоментВремени > ПорядокУчетаОС_Последнее.МоментВремени)
	|		ПО (ПорядокУчетаОС_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОС_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОС_Последнее.Период = ТаблицаИзменений.ПорядокУчетаОС_ПоследнееПериод)
	|			И (ПорядокУчетаОС_Следующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Изменения КАК ПорядокУчетаОСБУ_Последнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Изменения КАК ПорядокУчетаОСБУ_Следующее
	|			ПО (ПорядокУчетаОСБУ_Следующее.Организация = ПорядокУчетаОСБУ_Последнее.Организация)
	|				И (ПорядокУчетаОСБУ_Следующее.ОсновноеСредство = ПорядокУчетаОСБУ_Последнее.ОсновноеСредство)
	|				И (ПорядокУчетаОСБУ_Следующее.НачалоМесяца = ПорядокУчетаОСБУ_Последнее.НачалоМесяца)
	|				И (ПорядокУчетаОСБУ_Следующее.Период = ПорядокУчетаОСБУ_Последнее.Период)
	|				И (ПорядокУчетаОСБУ_Следующее.МоментВремени > ПорядокУчетаОСБУ_Последнее.МоментВремени)
	|		ПО (ПорядокУчетаОСБУ_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (ПорядокУчетаОСБУ_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ_Последнее.Период = ТаблицаИзменений.ПорядокУчетаОСБУ_ПоследнееПериод)
	|			И (ПорядокУчетаОСБУ_Следующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_ИзмененияБУ КАК МестонахождениеОС_Последнее
	|			ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_ИзмененияБУ КАК МестонахождениеОС_Следующее
	|			ПО (МестонахождениеОС_Следующее.Организация = МестонахождениеОС_Последнее.Организация)
	|				И (МестонахождениеОС_Следующее.ОсновноеСредство = МестонахождениеОС_Последнее.ОсновноеСредство)
	|				И (МестонахождениеОС_Следующее.НачалоМесяца = МестонахождениеОС_Последнее.НачалоМесяца)
	|				И (МестонахождениеОС_Следующее.Период = МестонахождениеОС_Последнее.Период)
	|				И (МестонахождениеОС_Следующее.МоментВремени > МестонахождениеОС_Последнее.МоментВремени)
	|		ПО (МестонахождениеОС_Последнее.Организация = ТаблицаИзменений.Организация)
	|			И (МестонахождениеОС_Последнее.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (МестонахождениеОС_Последнее.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (МестонахождениеОС_Последнее.Период = ТаблицаИзменений.МестонахождениеОС_ПоследнееПериод)
	|			И (МестонахождениеОС_Следующее.Регистратор ЕСТЬ NULL)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_ИзмененияБУ КАК СтоимостьОСИзменения
	|		ПО (СтоимостьОСИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (СтоимостьОСИзменения.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (СтоимостьОСИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (СтоимостьОСИзменения.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_ИзмененияБУ КАК АмортизацияОСИзменения
	|		ПО (АмортизацияОСИзменения.Организация = ТаблицаИзменений.Организация)
	|			И (АмортизацияОСИзменения.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|			И (АмортизацияОСИзменения.НачалоМесяца = ТаблицаИзменений.НачалоМесяца)
	|			И (АмортизацияОСИзменения.Регистратор = ТаблицаИзменений.Регистратор)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбъединениеОС КАК ОбъединениеОС
	|		ПО (ОбъединениеОС.Ссылка = ТаблицаИзменений.Регистратор)
	|			И (ОбъединениеОС.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК РазукомплектацияОС
	|		ПО (РазукомплектацияОС.Ссылка = ТаблицаИзменений.Регистратор)
	|			И (РазукомплектацияОС.ОсновноеСредство = ТаблицаИзменений.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГодовыеГрафикиАмортизацииОС КАК ГодовыеГрафикиАмортизацииОС
	|		ПО ГодовыеГрафикиАмортизацииОС.Ссылка = ПараметрыАмортизацииОСБУ_Последнее.ГрафикАмортизации
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО (РеестрДокументов.Ссылка = ТаблицаИзменений.Регистратор)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоэффициентПериода", ВнеоборотныеАктивыСлужебный.ТекстПоляКоэффициентПериода("ТаблицаИзменений.НачалоМесяца"));

	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
	
	#Область ПериодИзменения_БУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Изменения_БУ.НачалоМесяца           КАК НачалоМесяца,
	|	Изменения_БУ.ОсновноеСредство       КАК ОсновноеСредство,
	|	Изменения_БУ.Организация            КАК Организация,
	|	МИНИМУМ(Изменения_БУ.ДатаИзменений) КАК Период
	|ПОМЕСТИТЬ ПериодИзменения_БУ
	|ИЗ
	|	Изменения_БУ КАК Изменения_БУ
	|
	|СГРУППИРОВАТЬ ПО
	|	Изменения_БУ.НачалоМесяца,
	|	Изменения_БУ.ОсновноеСредство,
	|	Изменения_БУ.Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОССПараметрами_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ПериодИзмененияВТекущемМесяце.Период ЕСТЬ NULL
	|			ТОГДА СписокОС.ПериодНачисления
	|		КОГДА НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПериодИзмененияВТекущемМесяце.Период, МЕСЯЦ)
	|			ТОГДА ПериодИзмененияВТекущемМесяце.Период
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПериодИзмененияВТекущемМесяце.Период, ДЕНЬ, -1)
	|	КОНЕЦ КАК Период,
	|
	|	СписокОС.ЭтоДоначисление КАК ЭтоДоначисление,
	|	ЕСТЬNULL(ПредварительнаяСтоимостьОС.ПредварительнаяСтоимостьПревышаетФактическуюБУ, ЛОЖЬ) КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.Организация КАК Организация,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА МестонахождениеОСНаНачалоМесяца.Местонахождение
	|		ИНАЧЕ МестонахождениеОС.Местонахождение 
	|	КОНЕЦ КАК Подразделение,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаОСНаНачалоМесяца.ГруппаФинансовогоУчета
	|		ИНАЧЕ ПорядокУчетаОС.ГруппаФинансовогоУчета 
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаОСНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаОС.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|
	|	ПорядокУчетаОС.ПоказательНаработки,
	|	ПорядокУчетаОС.ОбъемНаработки,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюБУ, ЛОЖЬ) КАК НачислятьАмортизациюБУ,
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюНУ, ЛОЖЬ) КАК НачислятьАмортизациюНУ,
	|	СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|	КОНЕЦ КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ПорядокУчетаОСБУ.СтатьяРасходовБУ КАК СтатьяРасходов,
	|	ПорядокУчетаОСБУ.АналитикаРасходовБУ КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУ.ПодразделениеБУ <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУ.ПодразделениеБУ
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА МестонахождениеОСНаНачалоМесяца.Местонахождение
	|		ИНАЧЕ МестонахождениеОС.Местонахождение 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУ.ПодразделениеБУ <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУ.НаправлениеДеятельностиБУ 
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ПорядокУчетаОСНаНачалоМесяца.НаправлениеДеятельности
	|		ИНАЧЕ ПорядокУчетаОС.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).ТипОС = ЗНАЧЕНИЕ(Перечисление.ТипыОС.ГрупповоеОС)
	|				И ПорядокУчетаОСБУ.СпособОтраженияАмортизацииБУ В (&ПустыеСпособыОтраженияАмортизации)
	|				И ПорядокУчетаОСБУ.ПодразделениеБУ = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокОС.ОсновноеСредство
	|		ИНАЧЕ ПорядокУчетаОСБУ.СпособОтраженияАмортизацииБУ
	|	КОНЕЦ КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаОСБУ.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОСБУ.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(ГрафикиАмортизацииОС.ГрафикАмортизации, ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка)) КАК ГрафикАмортизации,
	|	ЕСТЬNULL(ГрафикиАмортизацииОС.КоэффициентПериода, 0) КАК КоэффициентПериода,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.Дата = НАЧАЛОПЕРИОДА(ПериодИзменения_БУ.Период, ДЕНЬ)
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,9))
	|
	|		КОГДА ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР 
	|					КОГДА НЕ ПериодИзменения_БУ.Период ЕСТЬ NULL
	|						ТОГДА ВЫБОР 
	|								КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|									ТОГДА (РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1)
	|									ИНАЧЕ (РАЗНОСТЬДАТ(СписокОС.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1)
	|							КОНЕЦ / ДЕНЬ(СписокОС.КонецМесяца)
	|					ИНАЧЕ 1
	|				КОНЕЦ * ВЫБОР
	|							КОГДА СписокОС.ЭтоДоначисление
	|								ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0)
	|							КОГДА НЕ СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|									И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|								ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаМесяц, 0) + ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаМесяц, 0)
	|						КОНЕЦ КАК ЧИСЛО(31,9))
	|	
			// Если расчет выполняется в месяце принятия к учету то ДеньПринятия / ВсегоДнейВМесяце
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1 КАК ЧИСЛО(15,9))
	|					/ ВЫРАЗИТЬ(ДЕНЬ(СписокОС.КонецМесяца) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
	|	
			// Если это доначисление то Дата документа / ВсегоДнейВМесяце
	|		КОГДА СписокОС.ЭтоДоначисление
	|
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(СписокОС.Период, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1 КАК ЧИСЛО(15,9))
	|					/ ВЫРАЗИТЬ(ДЕНЬ(СписокОС.КонецМесяца) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
	|
			// В остальных случаях КоличествоДнейДоПервогоИзмененияПараметров / ВсегоДнейВМесяце
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(СписокОС.НачалоМесяца, ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ПериодИзменения_БУ.Период, ДЕНЬ, -1), СписокОС.КонецМесяца), ДЕНЬ) + 1 КАК ЧИСЛО(15,9))
	|					/ ВЫРАЗИТЬ(ДЕНЬ(СписокОС.КонецМесяца) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
	|
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|				ИЛИ ДатыПоследнегоИзменения.Дата ЕСТЬ NULL
	|
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,9))
	|
	|		КОГДА ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА СписокОС.ЭтоДоначисление
	|						ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,9))
	|					КОГДА НЕ СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|							И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0)
	|									- ЕСТЬNULL(ВыработкаОС_НаДатуПоследнегоИзменения.ОбъемВыработки, 0) КАК ЧИСЛО(31,9))
	|				КОНЕЦ
	|
			// В следующем месяце после принятия к учету: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия]
	|		КОГДА КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(СписокОС.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
	|
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1 КАК ЧИСЛО(15,9)) 
	|					/ ВЫРАЗИТЬ(ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ)) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
	|
			// В более поздних месяцах: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца]
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ДатыПоследнегоИзменения.Дата, КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ), ДЕНЬ) + 1 КАК ЧИСЛО(15,9)) 
	|				/ ВЫРАЗИТЬ(ДЕНЬ(КОНЕЦПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ)) КАК ЧИСЛО(15,9)) 
	|				+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатыПоследнегоИзменения.Дата, МЕСЯЦ, 1), МЕСЯЦ), СписокОС.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(31,9))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	// ОтработанныхМесяцевПолныхЛет
	|	ВЫБОР
	|		КОГДА ГОД(ДатыПоследнегоИзменения.Дата) <> ГОД(СписокОС.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ДатыПоследнегоИзменения.Дата)
	|				+ 12 * (ГОД(СписокОС.НачалоМесяца) - Год(ДатыПоследнегоИзменения.Дата) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	// ЧислоЛетПользования
	|	ВЫБОР
	|		КОГДА ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 < 1
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 - 0.5 КАК ЧИСЛО(4,0))
	|	КОНЕЦ
	|		+ ВЫБОР 
	|			КОГДА (ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 
	|					- ВЫБОР
	|							КОГДА ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 < 1
	|								ТОГДА 0
	|							ИНАЧЕ ВЫРАЗИТЬ(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации / 12 - 0.5 КАК ЧИСЛО(4,0))
	|						КОНЕЦ) > 0 
	|				ТОГДА 1 
	|			ИНАЧЕ 0 
	|		КОНЕЦ КАК ЧислоЛетПользования,
	|
	// ЧислоПрошедшихЛет
	|	ВЫБОР
	|		КОГДА (&ЧислоПрошедшихЛет / 12) < 1
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(&ЧислоПрошедшихЛет / 12 - 0.5 КАК ЧИСЛО(4,0))
	|	КОНЕЦ КАК ЧислоПрошедшихЛет,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)   КАК СтоимостьНУ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0)   КАК СтоимостьПР,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьВР, 0)   КАК СтоимостьВР,
	|
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) КАК ЧИСЛО(31,2))
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) КАК СтоимостьНУЦФ,
	|
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) КАК ЧИСЛО(31,2))
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьПРЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьВРЦФ, 0) КАК СтоимостьВРЦФ,
	|	ЕСТЬNULL(СтоимостьОС.АмортизационнаяПремия, 0) КАК АмортизационнаяПремия,
	|	
	|	ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьРегл, 0) 
	|		+ ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьЦФ, 0)
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияРегл, 0) 
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияЦФ, 0) КАК СтоимостьНаНачалоГода,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	|		+ ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) КАК СтоимостьНУНачальныйОстаток,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0) КАК ОстаточнаяСтоимостьНУ,
	|
	// ОстаточнаяСтоимостьПР
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(КорректировкаАмортизации.АмортизацияПР, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0)
	|
	|	КОНЕЦ КАК ОстаточнаяСтоимостьПР,
	|
	// ОстаточнаяСтоимостьЦФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) КАК ЧИСЛО(31,2))
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)
	| 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0) КАК ОстаточнаяСтоимостьНУЦФ,
	|
	// ОстаточнаяСтоимостьПРЦФ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) 
	|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) КАК ЧИСЛО(31,2))
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0)
	| 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьПРЦФ,
	|	
	// СтоимостьРегл
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0)
	|
	|	КОНЕЦ КАК СтоимостьРегл,
	|
	// ОстаточнаяСтоимостьРегл
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) - ЕСТЬNULL(КорректировкаАмортизации.АмортизацияРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)
	|
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,
	|
	// СтоимостьДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|			ТОГДА ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации
	|
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) - ЕСТЬNULL(КорректировкаАмортизации.АмортизацияРегл, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)
	|
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	// СтоимостьДляВычисленияАмортизацииПР
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И (СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(КорректировкаАмортизации.АмортизацияПР, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0)
	|
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизацииПР,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0) КАК СтоимостьДляВычисленияПР,
	|
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0) КАК АмортизацияПР,
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0) КАК АмортизацияЦФ,
	|
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)
	|		+ ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0) КАК АмортизацияНУНачальныйОстаток,
	|
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|
	// ОбъемВыработки
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0)
	|		КОГДА НЕ СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|				И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|			ТОГДА ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаМесяц, 0) + ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаМесяц, 0)
	|	КОНЕЦ КАК ОбъемВыработки,
	|
	// ОбъемВыработкиЗаПрошлыйПериод
	|	ВЫБОР
	|		КОГДА СписокОС.ЭтоДоначисление
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0) КАК ЧИСЛО(20,8))
	|	КОНЕЦ КАК ОбъемВыработкиЗаПрошлыйПериод,
	|
	|	ПервоначальныеСведенияОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	ПервоначальныеСведенияОС.ПорядокУчетаНУ КАК ПорядокУчетаНУ,
	|	ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ, 0) КАК СрокПолезногоИспользованияБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентАмортизацииБУ, 0) КАК КоэффициентАмортизацииБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 0) КАК КоэффициентУскоренияБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0) КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации, 0) КАК СрокИспользованияДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(ДатыПоследнегоИзменения.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаПоследнегоИзменения,
	|
	// ПРДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) КАК ЧИСЛО(31,2))
	|
	|		ИНАЧЕ ПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации
	|
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации,
	|
	// КоэффициентЦФБУ
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) = 0
	|			ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|				И ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) <> 0
	|				И ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0) <> 0
	|
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизацииЦФ, 0) 
	|					/ ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0)
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФБУ,
	|
	// КоэффициентЦФНУ
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФНУ,
	|
	// КоэффициентЦФПР
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ПараметрыАмортизацииОСБУ.Регистратор) <> ТИП(Документ.МодернизацияОС2_4)
	|				И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						И СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.Дата, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ
	|						И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуБУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|					ИЛИ СписокОС.ЭтоДоначисление)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|			ТОГДА 1
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) = 0
	|			ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ СписокОССПараметрами_БУ
	|
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзменения_БУ
	|		ПО (ПериодИзменения_БУ.Организация = СписокОС.Организация)
	|			И (ПериодИзменения_БУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзменения_БУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокОС.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = СписокОС.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОС
	|		ПО (ПорядокУчетаОС.Организация = НЕОПРЕДЕЛЕНО)
	|			И (ПорядокУчетаОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОСНаНачалоМесяца
	|		ПО (ПорядокУчетаОСНаНачалоМесяца.Организация = НЕОПРЕДЕЛЕНО)
	|			И (ПорядокУчетаОСНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаОСНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоМесяца КАК СтоимостьОС
	|		ПО (СтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (СтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоГода КАК СтоимостьОСНаНачалоГода
	|		ПО (СтоимостьОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
	|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяСтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаАмортизацииБУ КАК КорректировкаАмортизации
	|		ПО (КорректировкаАмортизации.Организация = СписокОС.Организация)
	|			И (КорректировкаАмортизации.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (КорректировкаАмортизации.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыБУ)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
	|		ПО (АмортизацияОС.Организация = СписокОС.Организация)
	|			И (АмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (АмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоГода КАК АмортизацияОСНаНачалоГода
	|		ПО (АмортизацияОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.Организация = СписокОС.Организация)
	|			И (ОбесценениеНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.Организация = НЕОПРЕДЕЛЕНО)
	|			И (МестонахождениеОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (МестонахождениеОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (МестонахождениеОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОСНаНачалоМесяца
	|		ПО (МестонахождениеОСНаНачалоМесяца.Организация = НЕОПРЕДЕЛЕНО)
	|			И (МестонахождениеОСНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (МестонахождениеОСНаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (МестонахождениеОСНаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.Организация = СписокОС.Организация)
	|			И (ПервоначальныеСведенияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.Организация = СписокОС.Организация)
	|			И (ПараметрыАмортизацииОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО (ПорядокУчетаОСБУ.Организация = СписокОС.Организация)
	|			И (ПорядокУчетаОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ_НаНачалоМесяца
	|		ПО (ПорядокУчетаОСБУ_НаНачалоМесяца.Организация = СписокОС.Организация)
	|			И (ПорядокУчетаОСБУ_НаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ_НаНачалоМесяца.НачалоМесяца = &НачалоМесяца)
	|			И (ПорядокУчетаОСБУ_НаНачалоМесяца.ПериодПараметров = &КонецПредыдущегоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиАмортизацииОС КАК ГрафикиАмортизацииОС
	|		ПО (ГрафикиАмортизацииОС.Организация = СписокОС.Организация)
	|			И (ГрафикиАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС КАК ВыработкаОС
	|		ПО (ВыработкаОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство)
	|			И (ВыработкаОС.ПоказательНаработки = ПорядокУчетаОС.ПоказательНаработки)
	|			И (ВыработкаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС_НаДатуПоследнегоИзмененияБУ КАК ВыработкаОС_НаДатуПоследнегоИзменения
	|		ПО (ВыработкаОС_НаДатуПоследнегоИзменения.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство)
	|			И (ВыработкаОС_НаДатуПоследнегоИзменения.ПоказательНаработки = ПорядокУчетаОС.ПоказательНаработки)
	|
	|ГДЕ
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюБУ, ЛОЖЬ)
	|	И (НЕ СписокОС.ЭтоДоначисление
	|		ИЛИ ЕСТЬNULL(ПорядокУчетаОСБУ_НаНачалоМесяца.СостояниеБУ, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
	|	И НЕ СписокОС.ПолученПриРазукомплектацииОбъединении
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ЧислоПрошедшихЛет", 
		ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ДОБАВИТЬКДАТЕ(ДатыПоследнегоИзменения.Дата, МЕСЯЦ, 1)"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	#Область СписокОССИзмененнымиПараметрами_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Изменения_БУ.Период КАК Период,
	|	Изменения_БУ.Регистратор КАК Регистратор,
	|	Изменения_БУ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Изменения_БУ.ОсновноеСредство КАК ОсновноеСредство,
	|	Изменения_БУ.Организация КАК Организация,
	|	(Изменения_БУ.НачалоМесяца = &НачалоПредыдущегоМесяца) КАК ЭтоДоначисление,
	|	ЕСТЬNULL(ПредварительнаяСтоимостьОС.ПредварительнаяСтоимостьПревышаетФактическуюБУ, ЛОЖЬ) КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.МетодПереоценки КАК МетодПереоценки,
	|
	|	Изменения_БУ.ПолученПриРазукомплектацииОбъединении КАК ПолученПриРазукомплектацииОбъединении,
	| 
	|	ЕСТЬNULL(Изменения_БУ.ГруппаФинансовогоУчета, ПорядокУчетаОС.ГруппаФинансовогоУчета) КАК ГруппаФинансовогоУчета,
	|
	|	ЕСТЬNULL(Изменения_БУ.НаправлениеДеятельности, ПорядокУчетаОС.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|
	|	ЕСТЬNULL(Изменения_БУ.ПоказательНаработки, ПорядокУчетаОС.ПоказательНаработки) КАК ПоказательНаработки,
	|	ЕСТЬNULL(Изменения_БУ.ОбъемНаработки, ЕСТЬNULL(ПорядокУчетаОС.ОбъемНаработки, 0)) КАК ОбъемНаработки,
	|
	|	ЕСТЬNULL(Изменения_БУ.НачислятьАмортизациюБУ, ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюБУ, ЛОЖЬ)) КАК НачислятьАмортизациюБУ,
	|	ЕСТЬNULL(СписокОС.АмортизацияНачисляетсяПоСтандартамМУ, ЛОЖЬ) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ЕСТЬNULL(Изменения_БУ.СтатьяРасходовБУ, ПорядокУчетаОСБУ.СтатьяРасходовБУ) КАК СтатьяРасходов,
	|	ЕСТЬNULL(Изменения_БУ.АналитикаРасходовБУ, ПорядокУчетаОСБУ.АналитикаРасходовБУ) КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Изменения_БУ.ПодразделениеБУ, ПорядокУчетаОСБУ.ПодразделениеБУ) <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ.ПодразделениеБУ, ПорядокУчетаОСБУ.ПодразделениеБУ) 
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ.Местонахождение, МестонахождениеОС.Местонахождение) 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Изменения_БУ.ПодразделениеБУ, ПорядокУчетаОСБУ.ПодразделениеБУ) <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ.НаправлениеДеятельностиБУ, ПорядокУчетаОСБУ.НаправлениеДеятельностиБУ) 
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ.НаправлениеДеятельности, ПорядокУчетаОС.НаправлениеДеятельности) 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	ЕСТЬNULL(Изменения_БУ.СпособОтраженияАмортизацииБУ, ПорядокУчетаОСБУ.СпособОтраженияАмортизацииБУ) КАК СпособОтраженияАмортизации,
	|	ЕСТЬNULL(Изменения_БУ.ПередаватьРасходыВДругуюОрганизацию, ЕСТЬNULL(ПорядокУчетаОСБУ.ПередаватьРасходыВДругуюОрганизацию, ЛОЖЬ)) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(Изменения_БУ.ОрганизацияПолучательРасходов, ПорядокУчетаОСБУ.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(Изменения_БУ.ГрафикАмортизации, ЕСТЬNULL(ГрафикиАмортизацииОС.ГрафикАмортизации, ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка))) КАК ГрафикАмортизации,
	|	ЕСТЬNULL(Изменения_БУ.КоэффициентПериода, ЕСТЬNULL(ГрафикиАмортизацииОС.КоэффициентПериода, 0)) КАК КоэффициентПериода,
	|
	// РесурсНазначенный
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(Изменения_БУ.ОбъемНаработки, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0))
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ.СрокИспользования, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации, 0))
	|	КОНЕЦ КАК РесурсНазначенный,
	|
	// РесурсВыработанныйЗаТекущийПериод
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА Изменения_БУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0) КАК ЧИСЛО(15,9))
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаМесяц, 0) КАК ЧИСЛО(15,9))
	|				КОНЕЦ * ВЫРАЗИТЬ(Изменения_БУ.СрокДействия КАК ЧИСЛО(15,9)) / ВЫРАЗИТЬ(ДЕНЬ(Изменения_БУ.КонецМесяца) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Изменения_БУ.СрокДействия КАК ЧИСЛО(15,9)) / ВЫРАЗИТЬ(ДЕНЬ(Изменения_БУ.КонецМесяца) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
	|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
	|	  
	// РесурсВыработанныйЗаПрошлыйПериод
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				ИЛИ ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата) ЕСТЬ NULL
	|
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|
	|		КОГДА ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА Изменения_БУ.НачалоМесяца = &НачалоПредыдущегоМесяца
	|						ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(20,8))
	|					КОГДА НЕ СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету
	|							И НАЧАЛОПЕРИОДА(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, МЕСЯЦ) = &НачалоПредыдущегоМесяца
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0)
	|									- ЕСТЬNULL(ВыработкаОС_НаДатуПоследнегоИзменения.ОбъемВыработки, 0) КАК ЧИСЛО(20,8))
	|				КОНЕЦ
	|
			// В следующем месяце после принятия к учету: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия]
	|		КОГДА КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Изменения_БУ.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
	|
	|			ТОГДА ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ), ДЕНЬ) + 1) 
	|					/ ДЕНЬ(КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ)) КАК ЧИСЛО(20,8))
	|
			// В более поздних месяцах: [кол-во отработаннных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца]
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ), ДЕНЬ) + 1) 
	|				/ ДЕНЬ(КОНЕЦПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ))
	|				+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ДатыПоследнегоИзменения.Дата), МЕСЯЦ, 1), МЕСЯЦ), Изменения_БУ.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(20,8))
	|
	|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
	|
	// ОтработанныхМесяцевПолныхЛет
	|	ВЫБОР
	|		КОГДА ГОД(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ГОД(Изменения_БУ.НачалоМесяца) ТОГДА
	|			13 - МЕСЯЦ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения))
	|				+ 12 * (ГОД(Изменения_БУ.НачалоМесяца) - Год(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) - 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
	|
	|	ЕСТЬNULL(Изменения_БУ.АмортизационнаяГруппа, СписокОС.АмортизационнаяГруппа) КАК АмортизационнаяГруппа,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) КАК СтоимостьРегл,
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) КАК СтоимостьПР,
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0) КАК АмортизацияПР,
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) КАК СтоимостьЦФ,
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0) КАК АмортизацияЦФ,
	|
	|	Изменения_БУ.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	Изменения_БУ.СтоимостьПРИзменение КАК СтоимостьПРИзменение,
	|	Изменения_БУ.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	Изменения_БУ.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
	|
	|	ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьРегл, 0) 
	|		+ ЕСТЬNULL(СтоимостьОСНаНачалоГода.СтоимостьЦФ, 0)
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияРегл, 0) 
	|		- ЕСТЬNULL(АмортизацияОСНаНачалоГода.АмортизацияЦФ, 0) КАК СтоимостьНаНачалоГода,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	|		+ ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) КАК СтоимостьНУНачальныйОстаток,
	|
	// ОстаточнаяСтоимостьРегл
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) 
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0) КАК ОстаточнаяСтоимостьРегл,
	|
	// ОстаточнаяСтоимостьЦФ
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0) КАК ОстаточнаяСтоимостьЦФ,
	|
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0) КАК ОстаточнаяСтоимостьПР,
	|	ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0) КАК ОстаточнаяСтоимостьПРЦФ,
	|	
	|	ЕСТЬNULL(ОбесценениеНаНачалоМесяца.ОстатокОбесцененияРегл, 0) КАК ОстатокОбесцененияРегл,
	|
	|	ЕСТЬNULL(Изменения_БУ.Местонахождение, МестонахождениеОС.Местонахождение) КАК Подразделение,
	|
	|	ЕСТЬNULL(ВыработкаОС.ОбъемВыработкиЗаПрошлыйПериод, 0) КАК ОбъемВыработкиЗаПрошлыйПериод,
	|
	|	ЕСТЬNULL(Изменения_БУ.МетодНачисленияАмортизацииБУ, ПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ) КАК МетодНачисленияАмортизацииБУ,
	|	ЕСТЬNULL(Изменения_БУ.КоэффициентАмортизацииБУ, ПараметрыАмортизацииОСБУ.КоэффициентАмортизацииБУ) КАК КоэффициентАмортизацииБУ,
	|	ЕСТЬNULL(Изменения_БУ.КоэффициентУскоренияБУ, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 0)) КАК КоэффициентУскоренияБУ,
	|	ЕСТЬNULL(Изменения_БУ.ЛиквидационнаяСтоимость, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость, 0)) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(Изменения_БУ.ПорядокУчетаБУ, ПервоначальныеСведенияОС.ПорядокУчетаБУ) КАК ПорядокУчетаБУ,
	|	ЕСТЬNULL(Изменения_БУ.СтоимостьДляВычисленияАмортизации, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации, 0)) КАК СтоимостьДляВычисленияПР,
	|
	// ПРДляВычисленияАмортизации
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.МодернизацияОС2_4)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьБУ, 0) * ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) КАК ЧИСЛО(31,2))
	|
	|		ИНАЧЕ ЕСТЬNULL(Изменения_БУ.ПРДляВычисленияАмортизации, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации, 0))
	| 
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации,
	|
	// КоэффициентЦФБУ
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.МодернизацияОС2_4)
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0)
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияРегл, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФБУ,
	|
	// КоэффициентЦФНУ
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФНУ,
	|
	// КоэффициентЦФПР
	|	ВЫБОР 
	|		КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения), МЕСЯЦ) = Изменения_БУ.НачалоМесяца
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.ВводОстатковУзловКомпонентовАмортизации)
	|				И ТИПЗНАЧЕНИЯ(ЕСТЬNULL(Изменения_БУ.ДатаПоследнегоИзменения, ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения)) <> ТИП(Документ.МодернизацияОС2_4)
	|				И ЕСТЬNULL(ПредварительнаяСтоимостьОС.ДоляЦФ, 0) <> 0
	|
	|			ТОГДА 1
	|
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) = 0
	|				ИЛИ (ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПРЦФ, 0)) <= 0
	|
	|			ТОГДА 0
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияОС.АмортизацияПР, 0)) <= 0
	|
	|			ТОГДА 1
	|
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) <> 0
	|
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) 
	|							/ (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
	|
	|		ИНАЧЕ 0
	|
	|	КОНЕЦ КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ СписокОССИзмененнымиПараметрами_БУ
	|
	|ИЗ
	|	Изменения_БУ КАК Изменения_БУ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОбъектовУчета_БУ КАК СписокОС
	|		ПО (СписокОС.Организация = Изменения_БУ.Организация)
	|			И (СписокОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (СписокОС.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзменения_БУ
	|		ПО (ПериодИзменения_БУ.Организация = СписокОС.Организация)
	|			И (ПериодИзменения_БУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзменения_БУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодИзменения_БУ КАК ПериодИзмененияВТекущемМесяце
	|		ПО (ПериодИзмененияВТекущемМесяце.Организация = СписокОС.Организация)
	|			И (ПериодИзмененияВТекущемМесяце.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПериодИзмененияВТекущемМесяце.НачалоМесяца = &НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОС
	|		ПО (ПорядокУчетаОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПорядокУчетаОС.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПорядокУчетаОС.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоМесяца КАК СтоимостьОС
	|		ПО (СтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (СтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоГода КАК СтоимостьОСНаНачалоГода
	|		ПО (СтоимостьОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
	|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяСтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
	|		ПО (АмортизацияОС.Организация = СписокОС.Организация)
	|			И (АмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (АмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоГода КАК АмортизацияОСНаНачалоГода
	|		ПО (АмортизацияОСНаНачалоГода.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеНаНачалоМесяца
	|		ПО (ОбесценениеНаНачалоМесяца.Организация = СписокОС.Организация)
	|			И (ОбесценениеНаНачалоМесяца.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ОбесценениеНаНачалоМесяца.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (МестонахождениеОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (МестонахождениеОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.Организация = Изменения_БУ.Организация)
	|			И (ПервоначальныеСведенияОС.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.Организация = Изменения_БУ.Организация)
	|			И (ПараметрыАмортизацииОСБУ.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО (ПорядокУчетаОСБУ.Организация = Изменения_БУ.Организация)
	|			И (ПорядокУчетаОСБУ.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ.ПериодПараметров = Изменения_БУ.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиАмортизацииОС КАК ГрафикиАмортизацииОС
	|		ПО (ГрафикиАмортизацииОС.Организация = СписокОС.Организация)
	|			И (ГрафикиАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС КАК ВыработкаОС
	|		ПО (ВыработкаОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство)
	|			И (ВыработкаОС.ПоказательНаработки = ЕСТЬNULL(Изменения_БУ.ПоказательНаработки, ПорядокУчетаОС.ПоказательНаработки))
	|			И (ВыработкаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС_НаДатуПоследнегоИзмененияБУ КАК ВыработкаОС_НаДатуПоследнегоИзменения
	|		ПО (ВыработкаОС_НаДатуПоследнегоИзменения.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство)
	|			И (ВыработкаОС_НаДатуПоследнегоИзменения.ПоказательНаработки = ЕСТЬNULL(Изменения_БУ.ПоказательНаработки, ПорядокУчетаОС.ПоказательНаработки))
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = Изменения_БУ.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = Изменения_БУ.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = Изменения_БУ.НачалоМесяца)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоДоначисление, 
	|	ОсновноеСредство";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ЧислоПрошедшихЛет", 
		ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ДОБАВИТЬКДАТЕ(ПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения, МЕСЯЦ, 1)"));
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&НормаАмортизации", 
		РасчетАмортизацииОСЛокализация.ТекстПоляНормаАмортизации("СписокОС.АмортизационнаяГруппа"));
	
	СписокЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	#Область СписокОССПараметрами_НУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.Организация КАК Организация,
	|
	|	ПорядокУчетаОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ПорядокУчетаОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МестонахождениеОС.Местонахождение КАК Подразделение,
	|	МестонахождениеОС.Арендатор КАК Арендатор,
	|
	|	ПорядокУчетаОС.ПоказательНаработки КАК ПоказательНаработки,
	|	ПорядокУчетаОС.ОбъемНаработки КАК ОбъемНаработки,
	|
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюНУ, ЛОЖЬ) КАК НачислятьАмортизациюНУ,
	|
	|	ПорядокУчетаОСБУ.СтатьяРасходовНУ КАК СтатьяРасходов,
	|	ПорядокУчетаОСБУ.АналитикаРасходовНУ КАК АналитикаРасходов,
	|
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУ.ПодразделениеНУ <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУ.ПодразделениеНУ 
	|		ИНАЧЕ МестонахождениеОС.Местонахождение 
	|	КОНЕЦ КАК ПодразделениеРасходов,
	|
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУ.ПодразделениеНУ <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУ.НаправлениеДеятельностиНУ 
	|		ИНАЧЕ ПорядокУчетаОС.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельностиРасходов,
	|
	|	ПорядокУчетаОСБУ.СтатьяРасходовАмортизационнойПремии КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОСБУ.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУ.ПодразделениеАмортизационнойПремии <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУ.ПодразделениеАмортизационнойПремии 
	|		ИНАЧЕ МестонахождениеОС.Местонахождение 
	|	КОНЕЦ КАК ПодразделениеАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУ.ПодразделениеАмортизационнойПремии <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУ.НаправлениеДеятельностиАмортизационнойПремии 
	|		ИНАЧЕ ПорядокУчетаОС.НаправлениеДеятельности 
	|	КОНЕЦ КАК НаправлениеДеятельностиАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).ТипОС = ЗНАЧЕНИЕ(Перечисление.ТипыОС.ГрупповоеОС)
	|				И ПорядокУчетаОСБУ.СпособОтраженияАмортизацииНУ В (&ПустыеСпособыОтраженияАмортизации)
	|				И ПорядокУчетаОСБУ.ПодразделениеНУ = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокОС.ОсновноеСредство
	|		ИНАЧЕ ПорядокУчетаОСБУ.СпособОтраженияАмортизацииНУ
	|	КОНЕЦ КАК СпособОтраженияАмортизации,
	|
	|	ПорядокУчетаОСБУ.СпособОтраженияАмортизационнойПремии КАК СпособОтраженияАмортизационнойПремии,
	|	ПорядокУчетаОСБУ.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОСБУ.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|
	|	СписокОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СпециальныйКоэффициент, 1) <> 0
	|			ТОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СпециальныйКоэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СпециальныйКоэффициентНУ,
	|
	|	&НормаАмортизации КАК НормаАмортизации,
	|
	// ФактическийСрокПриПереходеКЛинейномуМетоду
	|	ВЫБОР
	|		КОГДА СписокОС.АмортизационнаяГруппа В (
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|					И СписокОС.ОсновноеСредство.ГруппаОС В (
	|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
	|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|				ИЛИ СписокОС.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|
	|			ТОГДА 0
	|
	|		КОГДА ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) = 2009
	|
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияОС.ФактическийСрокИспользованияДо2009, 0)
	|
	|		КОГДА ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1)) <= ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1,1,1))
	|
	|			ТОГДА 0
	|
	|		ИНАЧЕ (ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) 
	|					- ГОД(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ)) * 12 
	|				+ (МЕСЯЦ(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) - МЕСЯЦ(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ)) - 1
	|	КОНЕЦ КАК ФактическийСрокПриПереходеКЛинейномуМетоду,
	|
	// АмортизацияПриПереходеКЛинейномуМетоду
	|	ВЫБОР
	|		КОГДА СписокОС.АмортизационнаяГруппа В (
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|					И СписокОС.ОсновноеСредство.ГруппаОС В (
	|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
	|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|				ИЛИ СписокОС.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|
	|			ТОГДА 0
	|
	|		КОГДА ГОД(ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1))) = 2009
	|
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведенияОС.АмортизацияДо2009, 0)
	|
	|		КОГДА ЕСТЬNULL(ДатыПереходаКЛинейномуМетоду.Дата, ДАТАВРЕМЯ(2009,1,1)) <= ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1,1,1))
	|
	|			ТОГДА 0
	|
	|		ИНАЧЕ ЕСТЬNULL(АмортизацияОСПриПереходеКЛинейномуМетоду.АмортизацияНУ, 0)
	|
	|	КОНЕЦ КАК АмортизацияПриПереходеКЛинейномуМетоду,
	|
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыНУ
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуНУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(ПредварительнаяСтоимостьОС.АмортизационнаяПремия, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьНУ,
	|
	|	ЕСТЬNULL(СтоимостьОС.АмортизационнаяПремия, 0) КАК АмортизационнаяПремия,
	|
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыНУ
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуНУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(ПредварительнаяСтоимостьОС.АмортизационнаяПремия, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0)
	|				+ ЕСТЬNULL(СтоимостьОС.СтоимостьНУЦФ, 0)
	| 
	|	КОНЕЦ КАК СтоимостьНУНачальныйОстаток,
	|
	|	ВЫБОР
	|		КОГДА ДатыПоследнегоИзменения.РежимИсправленияСПрошлойДатыНУ
	|				И НАЧАЛОПЕРИОДА(ДатыПоследнегоИзменения.ДатаДокументаПринятияКУчетуНУ, МЕСЯЦ) = СписокОС.НачалоМесяца
	|
	|			ТОГДА ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьНУ, 0) - ЕСТЬNULL(КорректировкаАмортизации.АмортизацияНУ, 0)
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СтоимостьНУ, 0) 
	|				- ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)
	| 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьНУ,
	|	
	|	ЕСТЬNULL(АмортизацияОС.АмортизацияНУ, 0)
	|		+ ЕСТЬNULL(АмортизацияОС.АмортизацияНУЦФ, 0) КАК АмортизацияНУНачальныйОстаток,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.АмортизационнаяГруппа В (
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа), 
	|						ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа))
	|					И СписокОС.ОсновноеСредство.ГруппаОС В (
	|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
	|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения))
	|				ИЛИ СписокОС.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ОтдельнаяГруппа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ИНАЧЕ ЕСТЬNULL(РегУчетнаяПолитика.МетодНачисленияАмортизацииНУ, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный))
	|	КОНЕЦ КАК МетодНачисленияАмортизацииНУ,
	|
	|	ПервоначальныеСведенияОС.ПорядокУчетаБУ,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияНУ,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) <> 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0) / (ЕСТЬNULL(СтоимостьОС.СтоимостьПР, 0) + ЕСТЬNULL(СтоимостьОС.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ СписокОССПараметрами_НУ
	|
	|ИЗ
	|	СписокОбъектовУчета_НУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОС КАК ПорядокУчетаОС
	|		ПО (ПорядокУчетаОС.Организация = НЕОПРЕДЕЛЕНО)
	|			И (ПорядокУчетаОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_НаНачалоМесяца КАК СтоимостьОС
	|		ПО (СтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (СтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
	|		ПО (АмортизацияОС.Организация = СписокОС.Организация)
	|			И (АмортизацияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (АмортизацияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОСПриПереходеКЛинейномуМетоду КАК АмортизацияОСПриПереходеКЛинейномуМетоду
	|		ПО (АмортизацияОСПриПереходеКЛинейномуМетоду.Организация = СписокОС.Организация)
	|			И (АмортизацияОСПриПереходеКЛинейномуМетоду.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.Организация = НЕОПРЕДЕЛЕНО)
	|			И (МестонахождениеОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (МестонахождениеОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (МестонахождениеОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.Организация = СписокОС.Организация)
	|			И (ПервоначальныеСведенияОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПервоначальныеСведенияОС.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.Организация = СписокОС.Организация)
	|			И (ПараметрыАмортизацииОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПараметрыАмортизацииОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО (ПорядокУчетаОСБУ.Организация = СписокОС.Организация)
	|			И (ПорядокУчетаОСБУ.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУ.НачалоМесяца = СписокОС.НачалоМесяца)
	|			И (ПорядокУчетаОСБУ.ПериодПараметров = СписокОС.ПериодПараметров)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПереходаКЛинейномуМетоду КАК ДатыПереходаКЛинейномуМетоду
	|		ПО (ДатыПереходаКЛинейномуМетоду.Организация = СписокОС.Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
	|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ПредварительнаяСтоимостьОС.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаАмортизацииБУ КАК КорректировкаАмортизации
	|		ПО (КорректировкаАмортизации.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (КорректировкаАмортизации.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоследнегоИзмененияБУ КАК ДатыПоследнегоИзменения
	|		ПО (ДатыПоследнегоИзменения.Организация = СписокОС.Организация)
	|			И (ДатыПоследнегоИзменения.ОсновноеСредство = СписокОС.ОсновноеСредство)
	|			И (ДатыПоследнегоИзменения.НачалоМесяца = СписокОС.НачалоМесяца)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(&КонецМесяца) КАК РегУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.Организация = СписокОС.Организация
	|
	|ГДЕ
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюНУ, ЛОЖЬ)
	|	И НЕ СписокОС.ЭтоДоначисление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&НормаАмортизации", 
		РасчетАмортизацииОСЛокализация.ТекстПоляНормаАмортизации("СписокОС.АмортизационнаяГруппа"));
		
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СпособыОтраженияАмортизацииБУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияАмортизации КАК Ссылка
	|
	|ПОМЕСТИТЬ втСпособыОтраженияАмортизацииБУ
	|
	|ИЗ 
	|	СписокОССПараметрами_БУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияАмортизации
	|
	|ИЗ 
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияАмортизации
	|
	|ИЗ 
	|	СписокОССПараметрами_НУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СписокОС.СпособОтраженияАмортизационнойПремии
	|
	|ИЗ 
	|	СписокОССПараметрами_НУ КАК СписокОС
	|
	|ГДЕ 
	|	НЕ СписокОС.СпособОтраженияАмортизационнойПремии В (&ПустыеСпособыОтраженияАмортизации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАмортизация.Ссылка                               КАК СпособОтраженияАмортизации,
	|	ТаблицаАмортизация.СтатьяРасходов                       КАК СтатьяРасходов,
	|	ТаблицаАмортизация.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ТаблицаАмортизация.Подразделение                        КАК Подразделение,
	|	ТаблицаАмортизация.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ТаблицаАмортизация.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета КАК ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета,
	|	ТаблицаАмортизация.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТаблицаАмортизация.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|	ТаблицаАмортизация.Коэффициент                          КАК База,
	|	ТаблицаАмортизация.СуммаКоэффициентовПредыдущихСтрок    КАК БазаНакопленная,
	|	ТаблицаАмортизация.Ссылка.СуммаКоэффициентовАмортизации КАК СуммаБазы,
	|	ЛОЖЬ                                                    КАК ЭтоАмортизационнаяПремия
	|
	|ПОМЕСТИТЬ СпособыОтраженияАмортизацииБУ
	|
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4.Амортизация КАК ТаблицаАмортизация
	|
	|ГДЕ
	|	ТаблицаАмортизация.Ссылка В (ВЫБРАТЬ СпособыОтраженияАмортизации.Ссылка ИЗ втСпособыОтраженияАмортизацииБУ КАК СпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаАмортизация.Ссылка                               КАК СпособОтраженияАмортизации,
	|	ТаблицаАмортизация.СтатьяРасходов                       КАК СтатьяРасходов,
	|	ТаблицаАмортизация.АналитикаРасходов                    КАК АналитикаРасходов,
	|	ТаблицаАмортизация.Подразделение                        КАК Подразделение,
	|	ТаблицаАмортизация.НаправлениеДеятельности              КАК НаправлениеДеятельности,
	|	ЛОЖЬ                                                    КАК ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета,
	|	ТаблицаАмортизация.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТаблицаАмортизация.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|	ТаблицаАмортизация.Коэффициент                          КАК База,
	|	ТаблицаАмортизация.СуммаКоэффициентовПредыдущихСтрок    КАК БазаНакопленная,
	|	ТаблицаАмортизация.Ссылка.СуммаКоэффициентовАмортизационнойПремии КАК СуммаБазы,
	|	ИСТИНА                                                  КАК ЭтоАмортизационнаяПремия
	|
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4.АмортизационнаяПремия КАК ТаблицаАмортизация
	|
	|ГДЕ
	|	ТаблицаАмортизация.Ссылка В (ВЫБРАТЬ СпособыОтраженияАмортизации.Ссылка ИЗ втСпособыОтраженияАмортизацииБУ КАК СпособыОтраженияАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТМЦВЭксплуатации_Распределение.ОсновноеСредство         КАК СпособОтраженияАмортизации,
	|	НЕОПРЕДЕЛЕНО                                            КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО                                            КАК АналитикаРасходов,
	|	ТМЦВЭксплуатации_Распределение.Подразделение            КАК Подразделение,
	|	ТМЦВЭксплуатации_Распределение.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	ЛОЖЬ                                                    КАК ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета,
	|	ИСТИНА                                                  КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ТМЦВЭксплуатации_Распределение.Организация              КАК ОрганизацияПолучательРасходов,
	|	ТМЦВЭксплуатации_Распределение.База                     КАК База,
	|	ТМЦВЭксплуатации_Распределение.БазаНакопленная          КАК БазаНакопленная,
	|	ТМЦВЭксплуатации_Распределение.СуммаБазы                КАК СуммаБазы,
	|	ЛОЖЬ                                                    КАК ЭтоАмортизационнаяПремия
	|
	|ИЗ
	|	ТМЦВЭксплуатации_Распределение КАК ТМЦВЭксплуатации_Распределение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособОтраженияАмортизации,
	|	ЭтоАмортизационнаяПремия";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти		
		
	//-- Локализация
	
КонецПроцедуры

// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСписокОбъектовУчетаДоначислениеВсе() Экспорт
	
	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОбъектовУчета.Организация      КАК Организация,
	|	СписокОбъектовУчета.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОбъектовУчета.Период           КАК Период
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_Все
	|
	|ИЗ
	|	СписокОбъектовУчета_Доначисление_УУ КАК СписокОбъектовУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокОбъектовУчета.Организация      КАК Организация,
	|	СписокОбъектовУчета.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОбъектовУчета.Период           КАК Период
	|ИЗ
	|	СписокОбъектовУчета_Доначисление_БУ КАК СписокОбъектовУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;

КонецФункции

// 
// Параметры:
//  СписокЗапросов - Массив из Строка - 
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
Процедура ДополнитьТекстЗапросаПроверкаПараметровРасчета(СписокЗапросов, ПараметрыРасчета) Экспорт

	//++ Локализация
	
	#Область ПроверкаПараметровРасчета_БУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОбъектУчета КАК ОбъектУчета,
	|	СписокОС.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|	СписокОС.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|	СписокОС.ОбъемНаработкиВыработан КАК ОбъемНаработкиВыработан,
	|	СписокОС.НеУказанКоэффициентАмортизации КАК НеУказанКоэффициентАмортизации,
	|	СписокОС.НеУказанКоэффициентУскорения КАК НеУказанКоэффициентУскорения,
	|	СписокОС.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчета_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанСрокИспользованияБУ
	|		СписокОС.МетодНачисленияАмортизацииБУ В (
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования))
	|			И СписокОС.СтоимостьДляВычисленияАмортизации <> 0 
	|			И СписокОС.СрокИспользованияДляВычисленияАмортизации = 0
	|			И (НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|				ИЛИ СписокОС.РесурсВыработанныйЗаТекущийПериод > 0) КАК НеУказанСрокИспользованияБУ,
	|
			// НеУказанОбъемНаработки
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			И СписокОС.ОбъемНаработки = 0
	|			И (НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|				ИЛИ СписокОС.РесурсВыработанныйЗаТекущийПериод > 0) КАК НеУказанОбъемНаработки,
	|
			// ОбъемНаработкиВыработан
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			И (СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|					И СписокОС.РесурсНазначенный < (СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.РесурсВыработанныйЗаТекущийПериод)
	|					И СписокОС.РесурсНазначенный <> 0
	|					И СписокОС.РесурсВыработанныйЗаТекущийПериод > 0
	|				ИЛИ НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|					И СписокОС.ОбъемПродукцииРаботДляВычисленияАмортизации < СписокОС.ОбъемВыработки
	|					И СписокОС.ОбъемВыработки > 0) КАК ОбъемНаработкиВыработан,
	|
			// НеУказанКоэффициентАмортизации
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ)
	|			И СписокОС.КоэффициентАмортизацииБУ = 0 КАК НеУказанКоэффициентАмортизации,
	|
			// НеУказанКоэффициентУскорения
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|			И СписокОС.КоэффициентУскоренияБУ = 0 КАК НеУказанКоэффициентУскорения,
	|
			// МетодНачисленияНеПрименяется
	|		СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ В (
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега)) КАК МетодНачисленияНеПрименяется
	|
	|	ИЗ
	|		СписокОССПараметрами_БУ КАК СписокОС
	|
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюБУ
	|
	|	) СписокОС
	|
	|ГДЕ
	|	(СписокОС.НеУказанСрокИспользованияБУ
	|		ИЛИ СписокОС.НеУказанОбъемНаработки
	|		ИЛИ СписокОС.ОбъемНаработкиВыработан
	|		ИЛИ СписокОС.НеУказанКоэффициентАмортизации
	|		ИЛИ СписокОС.НеУказанКоэффициентУскорения
	|		ИЛИ СписокОС.МетодНачисленияНеПрименяется)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ПроверкаПараметровРасчетаИзменения_БУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОбъектУчета КАК ОбъектУчета,
	|	СписокОС.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|	СписокОС.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|	СписокОС.НеУказанРесурсВыработанный КАК НеУказанРесурсВыработанный,
	|	СписокОС.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчетаИзменения_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанСрокИспользованияБУ
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный)
	|			И ЕСТЬNULL(СписокОС.РесурсНазначенный, 0) = 0
	|			И СписокОС.РесурсВыработанныйЗаТекущийПериод > 0 КАК НеУказанСрокИспользованияБУ,
	|
			// НеУказанОбъемНаработки
	|		СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
	|			И ЕСТЬNULL(СписокОС.РесурсНазначенный, 0) = 0
	|			И СписокОС.РесурсВыработанныйЗаТекущийПериод > 0 КАК НеУказанОбъемНаработки,
	|
			// НеУказанРесурсВыработанный
	|		СписокОС.РесурсВыработанныйЗаТекущийПериод ЕСТЬ NULL
	|			ИЛИ СписокОС.РесурсВыработанныйЗаПрошлыйПериод ЕСТЬ NULL КАК НеУказанРесурсВыработанный,
	|
			// МетодНачисленияНеПрименяется
	|		СписокОС.НачислятьАмортизациюБУ
	|			И СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|			И СписокОС.МетодНачисленияАмортизацииБУ В (
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ),
	|				ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега)) КАК МетодНачисленияНеПрименяется
	|
	|	ИЗ
	|		СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюБУ
	|		И (СписокОС.ОстаточнаяСтоимостьРегл + СписокОС.СтоимостьРеглИзменение) > 0
	|
	|	) КАК СписокОС
	|
	|ГДЕ
	|	(СписокОС.НеУказанСрокИспользованияБУ
	|		ИЛИ СписокОС.НеУказанОбъемНаработки
	|		ИЛИ СписокОС.НеУказанРесурсВыработанный
	|		ИЛИ СписокОС.МетодНачисленияНеПрименяется)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ПроверкаПараметровРасчета_НУ
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОбъектУчета КАК ОбъектУчета,
	|	СписокОС.НеУказанСрокИспользованияНУ КАК НеУказанСрокИспользованияНУ,
	|	СписокОС.НеУказанаАмортизационнаяГруппа КАК НеУказанаАмортизационнаяГруппа,
	|	СписокОС.НеУказанаСтатьяРасходовАмортизационнойПремии КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|
	|ПОМЕСТИТЬ ПроверкаПараметровРасчета_НУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанСрокИспользованияНУ
	|		СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|			И СписокОС.СрокПолезногоИспользованияНУ = 0 КАК НеУказанСрокИспользованияНУ,
	|
			// НеУказанаАмортизационнаяГруппа
	|		СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
	|			И СписокОС.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка) КАК НеУказанаАмортизационнаяГруппа,
	|
			// НеУказанаСтатьяРасходовАмортизационнойПремии
	|		СписокОС.СтатьяРасходовАмортизационнойПремии = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И СписокОС.АмортизационнаяПремия <> 0
	|			И СписокОС.СпособОтраженияАмортизационнойПремии В (&ПустыеСпособыОтраженияАмортизации) КАК НеУказанаСтатьяРасходовАмортизационнойПремии
	|
	|	ИЗ
	|		СписокОССПараметрами_НУ КАК СписокОС
	|
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюНУ
	|
	|	) КАК СписокОС
	|
	|ГДЕ
	|	(СписокОС.НеУказанСрокИспользованияНУ
	|		ИЛИ СписокОС.НеУказанаАмортизационнаяГруппа
	|		ИЛИ СписокОС.НеУказанаСтатьяРасходовАмортизационнойПремии)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
Процедура ПроверитьРезультатыРасчета(ПараметрыРасчета) Экспорт
	
	//++ Локализация
	
	СписокЗапросов = Новый Массив;
	
	#Область ПроверкаРасчета_БУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.ОбъектУчета КАК ОбъектУчета,
	|	РасчетАмортизации.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходов
	|
	|ПОМЕСТИТЬ ПроверкаРасчета_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанаСтатьяРасходов
	|		РасчетАмортизации.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И НЕ РасчетАмортизации.НачислятьИзнос КАК НеУказанаСтатьяРасходов
	|
	|	ИЗ
	|		РасчетАмортизации_БУ КАК РасчетАмортизации
	|
	|	ГДЕ
	|		(РасчетАмортизации.СуммаБУ <> 0
	|			ИЛИ РасчетАмортизации.СуммаЦФ <> 0
	|			ИЛИ РасчетАмортизации.СуммаПР <> 0
	|			ИЛИ РасчетАмортизации.СуммаПРЦФ <> 0)
	|
	|	) КАК РасчетАмортизации
	|
	|ГДЕ
	|	РасчетАмортизации.НеУказанаСтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ПроверкаРасчета_НУ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.ОбъектУчета КАК ОбъектУчета,
	|	РасчетАмортизации.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходов
	|
	|ПОМЕСТИТЬ ПроверкаРасчета_НУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.ОсновноеСредство КАК ОбъектУчета,
	|
			// НеУказанаСтатьяРасходов
	|		РасчетАмортизации.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК НеУказанаСтатьяРасходов
	|
	|	ИЗ
	|		РасчетАмортизации_БУ КАК РасчетАмортизации
	|
	|	ГДЕ
	|		РасчетАмортизации.СуммаНУ <> 0
	|
	|	) КАК РасчетАмортизации
	|
	|ГДЕ
	|	РасчетАмортизации.НеУказанаСтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
//
Процедура ВыполнитьРасчетАмортизации(ПараметрыРасчета) Экспорт

	//++ Локализация
	
	ПараметрыРасчета.ИспользуемыеТаблицы = 
		ПараметрыРасчета.ИспользуемыеТаблицы 
		+ ",РасчетАмортизации_БУ,АмортизационнаяПремия";
	
	ИспользуемыеТаблицы = ОбщегоНазначенияУТ.СписокВременныхТаблиц(ПараметрыРасчета.МенеджерВременныхТаблиц);
	Для Каждого ИмяТаблицы Из СтрРазделить(ПараметрыРасчета.ИспользуемыеТаблицы, ",") Цикл
		ИспользуемыеТаблицы.Добавить(ИмяТаблицы);
	КонецЦикла;
	
	РассчитатьАмортизацию_ЗаПрошлыйМесяцБУ(ПараметрыРасчета);
	РассчитатьАмортизацию_ЗаТекущийМесяцБУ(ПараметрыРасчета);

	РассчитатьАмортизацию_ЗаТекущийМесяцНУ(ПараметрыРасчета);

	ОбъединитьРасчетАмортизации(ПараметрыРасчета);

	РассчитатьАмортизационнуюПремию(ПараметрыРасчета);
	
	ВернутьПараметрыРасчета(ПараметрыРасчета);
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ПараметрыРасчета.МенеджерВременныхТаблиц,, ИспользуемыеТаблицы);
	
	//-- Локализация
	
КонецПроцедуры
 
// 
// Параметры:
//  СписокЗапросов - Массив из Строка - 
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
Процедура ДополнитьТекстЗапросаСписокВсехОС(СписокЗапросов, ПараметрыРасчета) Экспорт

	//++ Локализация
	
	#Область УчетнаяПолитикаБухУчета
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&КонецПредыдущегоМесяца КАК Период,
	|	УчетнаяПолитика.Организация КАК Организация,
	|	УчетнаяПолитика.ПорядокНачисленияАмортизацииОС КАК ПорядокНачисленияАмортизацииОС,
	|	УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда КАК ПорядокНачисленияАмортизацииАренда,
	|	УчетнаяПолитика.ПрименяетсяФСБУ6 КАК ПрименяетсяФСБУ6,
	|	УчетнаяПолитика.МетодПереоценкиОС КАК МетодПереоценкиОС
	|
	|ПОМЕСТИТЬ ВтУчетнаяПолитикаБухУчета
	|
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецПредыдущегоМесяца) КАК УчетнаяПолитика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца КАК Период,
	|	УчетнаяПолитика.Организация КАК Организация,
	|	УчетнаяПолитика.ПорядокНачисленияАмортизацииОС КАК ПорядокНачисленияАмортизацииОС,
	|	УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда КАК ПорядокНачисленияАмортизацииАренда,
	|	УчетнаяПолитика.ПрименяетсяФСБУ6 КАК ПрименяетсяФСБУ6,
	|	УчетнаяПолитика.МетодПереоценкиОС КАК МетодПереоценкиОС
	|
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецМесяца) КАК УчетнаяПолитика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_Доначисление_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьОС.Организация      КАК Организация,
	|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МИНИМУМ(СтоимостьОС.Период)  КАК Период
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_Доначисление_БУ
	|
	|ИЗ
	|	РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = СтоимостьОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитика.Период = &КонецПредыдущегоМесяца
	|
	|ГДЕ
	|	СтоимостьОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И СтоимостьОС.ОтражатьВРеглУчете
	|	И СтоимостьОС.Активность
	|	И СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|
	|	И СтоимостьОС.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуУзловКомпонентовАмортизации),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеРасходовВСтоимостьОС),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтнесениеОтклоненийВСтоимостьОС))
	|
	|	И (СтоимостьОС.Организация, СтоимостьОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = СтоимостьОС.ОсновноеСредство
	|			И (ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВБУ
	|				ИЛИ ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВНУ))
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОС.Организация,
	|	СтоимостьОС.ОсновноеСредство
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтоимостьОС.СтоимостьРегл + СтоимостьОС.СтоимостьЦФ - СтоимостьОС.ПредварительнаяСтоимостьРегл) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_БУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоМесяца                   КАК НачалоМесяца,
	|	&КонецМесяца                    КАК КонецМесяца,
	|	&КонецПредыдущегоМесяца         КАК Период,
	|	&КонецПредыдущегоМесяца         КАК ПериодПараметров,
	|	ЛОЖЬ                            КАК ЭтоДоначисление,
	|	ЛОЖЬ                            КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизацииБУ,
	|	ПорядокУчетаОС.СпособОтраженияАмортизацииНУ КАК СпособОтраженияАмортизацииНУ,
	|	ПорядокУчетаОС.СпособОтраженияАмортизационнойПремии КАК СпособОтраженияАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|	ПорядокУчетаОС.СтатьяРасходовНУ    КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОС.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|
	|	ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии    КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиОС, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_БУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	|			&КонецПредыдущегоМесяца,
	|			ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|			И (Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)) КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитика.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитикаУУ.Период = &КонецМесяца
	|
	|ГДЕ
	|	НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаОС.ОсновноеСредство
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВБУ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоМесяца                   КАК НачалоМесяца,
	|	&КонецМесяца                    КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК Период,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			ТОГДА &КонецПредыдущегоМесяца
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	ЛОЖЬ                            КАК ЭтоДоначисление,
	|	ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) В (ТИП(Документ.РазукомплектацияОС), ТИП(Документ.ОбъединениеОС)) КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизацииБУ,
	|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияАмортизацииНУ,
	|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.СтатьяРасходовНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК СтатьяРасходовНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.АналитикаРасходовНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК АналитикаРасходовНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК СтатьяРасходовАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиОС, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитика.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитикаУУ.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуУзловКомпонентовАмортизации КАК ПринятиеКУчетуУзловКомпонентовАмортизации
	|		ПО ПринятиеКУчетуУзловКомпонентовАмортизации.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|ГДЕ
	|	ПорядокУчетаОС.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И (ПорядокУчетаОС.СостояниеБУ = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|		ИЛИ ПорядокУчетаОС.СостояниеНУ = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
	|
	|	И (ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			И (ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВБУ, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ))
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА)
	|				И ВЫБОР
	|					КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоМесяца)
	|						ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|					ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|
	|	И (ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуОС2_4)
	|			И (ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВБУ, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ))
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуУзловКомпонентовАмортизации)
	|			И ЕСТЬNULL(ПринятиеКУчетуУзловКомпонентовАмортизации.ОтражатьВРеглУчете, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) В (
	|				ТИП(Документ.РазукомплектацияОС),
	|				ТИП(Документ.ОбъединениеОС)))
	|
	|	И (ПорядокУчетаОС.Организация, ПорядокУчетаОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаОС.ОсновноеСредство
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВБУ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоПредыдущегоМесяца        КАК НачалоМесяца,
	|	&КонецПредыдущегоМесяца         КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК ПериодПараметров,
	|	ИСТИНА                          КАК ЭтоДоначисление,
	|	ЛОЖЬ                            КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.СпособОтраженияАмортизацииБУ КАК СпособОтраженияАмортизацииБУ,
	|	ПорядокУчетаОС.СпособОтраженияАмортизацииНУ КАК СпособОтраженияАмортизацииНУ,
	|	ПорядокУчетаОС.СпособОтраженияАмортизационнойПремии КАК СпособОтраженияАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовБУ    КАК СтатьяРасходовБУ,
	|	ПорядокУчетаОС.АналитикаРасходовБУ КАК АналитикаРасходовБУ,
	|	ПорядокУчетаОС.СтатьяРасходовНУ    КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОС.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|
	|	ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии    КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	ЕСТЬNULL(УчетнаяПолитика.МетодПереоценкиОС, ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВНА.МетодПропорциональногоПересчета)) КАК МетодПереоценки,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК АмортизацияНачисляетсяСДатыПринятияКУчету
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитика.Период = &КонецПредыдущегоМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = ПорядокУчетаОС.Организация.ГоловнаяОрганизация
	|			И УчетнаяПолитикаУУ.Период = &КонецПредыдущегоМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуУзловКомпонентовАмортизации КАК ПринятиеКУчетуУзловКомпонентовАмортизации
	|		ПО ПринятиеКУчетуУзловКомпонентовАмортизации.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МодернизацияОС2_4 КАК МодернизацияОС
	|		ПО МодернизацияОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтнесениеОтклоненийВСтоимостьОС КАК ОтнесениеОтклоненийВСтоимостьОС
	|		ПО ОтнесениеОтклоненийВСтоимостьОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|ГДЕ
	|	ПорядокУчетаОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
	|	И ПорядокУчетаОС.СостояниеБУ = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|	И ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ИСТИНА)
	|
	|	И ВЫБОР
	|		КОГДА ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ ВТ_АрендованныеОС КАК АрендованныеОС ГДЕ АрендованныеОС.ОсновноеСредство = ПорядокУчетаОС.ОсновноеСредство И АрендованныеОС.НачалоМесяца = &НачалоПредыдущегоМесяца)
	|			ТОГДА ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.ПорядокНачисленияАмортизацииОС, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
	|
	|	И (ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуОС2_4)
	|			И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВБУ, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ПринятиеКУчетуУзловКомпонентовАмортизации)
	|			И ЕСТЬNULL(ПринятиеКУчетуУзловКомпонентовАмортизации.ОтражатьВРеглУчете, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.МодернизацияОС2_4)
	|			И ЕСТЬNULL(МодернизацияОС.ОтражатьВБУ, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.ОтнесениеОтклоненийВСтоимостьОС)
	|			И ЕСТЬNULL(ОтнесениеОтклоненийВСтоимостьОС.ОтражатьВБУ, ЛОЖЬ)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) = ТИП(Документ.РазукомплектацияОС))
	|
	|	И (ПорядокУчетаОС.Организация, ПорядокУчетаОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					СписокОС.Организация,
	|					СписокОС.ОсновноеСредство
	|				ИЗ
	|					СписокОбъектовУчета_Доначисление_БУ КАК СписокОС)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаОС.ОсновноеСредство
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВБУ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	НачалоМесяца,
	|	ПериодПараметров
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область СписокОбъектовУчета_НУ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоМесяца                   КАК НачалоМесяца,
	|	&КонецМесяца                    КАК КонецМесяца,
	|	&КонецПредыдущегоМесяца         КАК Период,
	|	&КонецПредыдущегоМесяца         КАК ПериодПараметров,
	|	ЛОЖЬ                            КАК ЭтоДоначисление,
	|	ЛОЖЬ                            КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	ПорядокУчетаОС.СпособОтраженияАмортизацииНУ КАК СпособОтраженияАмортизацииНУ,
	|	ПорядокУчетаОС.СпособОтраженияАмортизационнойПремии КАК СпособОтраженияАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.СтатьяРасходовНУ    КАК СтатьяРасходовНУ,
	|	ПорядокУчетаОС.АналитикаРасходовНУ КАК АналитикаРасходовНУ,
	|
	|	ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии    КАК СтатьяРасходовАмортизационнойПремии,
	|	ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета_НУ
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	|			&КонецПредыдущегоМесяца,
	|			ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|			И (Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)) КАК ПорядокУчетаОС
	|
	|ГДЕ
	|	НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаОС.ОсновноеСредство
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВНУ)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&КонецМесяца                    КАК ПериодНачисления,
	|	&НачалоМесяца                   КАК НачалоМесяца,
	|	&КонецМесяца                    КАК КонецМесяца,
	|	НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ) КАК Период,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			ТОГДА &КонецПредыдущегоМесяца
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ПорядокУчетаОС.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодПараметров,
	|
	|	ЛОЖЬ                            КАК ЭтоДоначисление,
	|	ТИПЗНАЧЕНИЯ(ПорядокУчетаОС.Регистратор) В (ТИП(Документ.РазукомплектацияОС), ТИП(Документ.ОбъединениеОС)) КАК ПолученПриРазукомплектацииОбъединении,
	|	ПорядокУчетаОС.Организация      КАК Организация,
	|	ПорядокУчетаОС.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПорядокУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПорядокУчетаОС.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|
	|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияАмортизацииНУ,
	|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.СтатьяРасходовНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК СтатьяРасходовНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.АналитикаРасходовНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК АналитикаРасходовНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.СтатьяРасходовАмортизационнойПремии
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК СтатьяРасходовАмортизационнойПремии,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|				И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|			ТОГДА ПорядокУчетаОС.АналитикаРасходовАмортизационнойПремии
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|	КОНЕЦ КАК АналитикаРасходовАмортизационнойПремии,
	|
	|	ПорядокУчетаОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ПорядокУчетаОС.ОрганизацияПолучательРасходов       КАК ОрганизацияПолучательРасходов
	|
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОС.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуУзловКомпонентовАмортизации КАК ПринятиеКУчетуУзловКомпонентовАмортизации
	|		ПО ПринятиеКУчетуУзловКомпонентовАмортизации.Ссылка = ПорядокУчетаОС.Регистратор
	|
	|ГДЕ
	|	ПорядокУчетаОС.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ПорядокУчетаОС.СостояниеНУ = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|	И ЕСТЬNULL(ПринятиеКУчетуОС.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|	И ЕСТЬNULL(ПринятиеКУчетуОС.ОтражатьВНУ, ЛОЖЬ)
	|
	|	И (ПорядокУчетаОС.Организация, ПорядокУчетаОС.ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВтДанныеКРасчету.Организация,
	|					ВтДанныеКРасчету.ОбъектУчета
	|				ИЗ
	|					ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА 
	|		ИЗ 
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию КАК ОбъектыПоКоторымНеНужноНачислятьАмортизацию
	|		ГДЕ
	|			ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОбъектУчета = ПорядокУчетаОС.ОсновноеСредство
	|			И ОбъектыПоКоторымНеНужноНачислятьАмортизацию.ОтражатьВНУ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	НачалоМесяца,
	|	ПериодПараметров
	|";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаВтСписокОСУменьшаемогоОстатка(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство
	|ПОМЕСТИТЬ втСписокОСУменьшаемогоОстатка
	|ИЗ
	|	ПервоначальныеСведенияОС КАК СписокОС
	|ГДЕ
	|	СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство
	|ИЗ
	|	ПараметрыАмортизацииОСУУ КАК СписокОС
	|ГДЕ
	|	СписокОС.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса стоимость и амортизация на начало года.
// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСтоимостьИАмортизацияНаНачалоГода(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	Если ПараметрыРасчета.ДатаНачалаУчета <= НачалоГода(ПараметрыРасчета.Период) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&НачалоМесяца                            КАК НачалоМесяца,
		|	СтоимостьОС.ОсновноеСредство             КАК ОсновноеСредство,
		|	СтоимостьОС.СтоимостьОстаток             КАК Стоимость,
		|	СтоимостьОС.СтоимостьРеглОстаток         КАК СтоимостьРегл,
		|	СтоимостьОС.СтоимостьЦФОстаток           КАК СтоимостьЦФ
		|ПОМЕСТИТЬ СтоимостьОС_НаНачалоГода
		|ИЗ
		|	РегистрНакопления.СтоимостьОС.Остатки(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|				(ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК СтоимостьОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                          КАК НачалоМесяца,
		|	АмортизацияОС.ОсновноеСредство         КАК ОсновноеСредство,
		|	-АмортизацияОС.АмортизацияОстаток      КАК Амортизация,
		|	-АмортизацияОС.АмортизацияРеглОстаток  КАК АмортизацияРегл,
		|	-АмортизацияОС.АмортизацияЦФОстаток    КАК АмортизацияЦФ
		|ПОМЕСТИТЬ АмортизацияОС_НаНачалоГода
		|ИЗ
		|	РегистрНакопления.АмортизацияОС.Остатки(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|				(ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК АмортизацияОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетаУчета.СчетУчета КАК СчетУчета,
		|	СчетаУчета.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
		|ПОМЕСТИТЬ СчетаНачалоГода
		|ИЗ
		|	РегистрСведений.ПорядокУчетаОС.СрезПоследних(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						СписокОС.ОсновноеСредство
		|					ИЗ
		|						втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК СчетаУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПараметрыЦелевогоФинансированияОС.СчетУчета КАК СчетУчета,
		|	ПараметрыЦелевогоФинансированияОС.СчетАмортизации КАК СчетАмортизации
		|ИЗ
		|	РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
		|			&НачалоГода,
		|			ОсновноеСредство В
		|				(ВЫБРАТЬ
		|					СписокОС.ОсновноеСредство
		|				ИЗ
		|					втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК ПараметрыЦелевогоФинансированияОС
		|ГДЕ
		|	ПараметрыЦелевогоФинансированияОС.ПрименениеЦелевогоФинансирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                            КАК НачалоМесяца,
		|	СтоимостьОС.Субконто1                    КАК ОсновноеСредство,
		|	0                                        КАК Стоимость,
		|	СтоимостьОС.СуммаОстатокДт               КАК СтоимостьРегл,
		|	0                                        КАК СтоимостьЦФ
		|ПОМЕСТИТЬ СтоимостьОС_НаНачалоГода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&НачалоГода,
		|			Счет В
		|				(ВЫБРАТЬ
		|					СчетаНачалоГода.СчетУчета
		|				ИЗ
		|					СчетаНачалоГода КАК СчетаНачалоГода),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						СписокОС.ОсновноеСредство
		|					ИЗ
		|						втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК СтоимостьОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоМесяца                          КАК НачалоМесяца,
		|	АмортизацияОС.Субконто1                КАК ОсновноеСредство,
		|	0                                      КАК Амортизация,
		|	АмортизацияОС.СуммаОстатокКт           КАК АмортизацияРегл,
		|	0                                      КАК АмортизацияЦФ
		|ПОМЕСТИТЬ АмортизацияОС_НаНачалоГода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&НачалоГода,
		|			Счет В
		|				(ВЫБРАТЬ
		|					СчетаНачалоГода.СчетНачисленияАмортизации
		|				ИЗ
		|					СчетаНачалоГода КАК СчетаНачалоГода),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						СписокОС.ОсновноеСредство
		|					ИЗ
		|						втСписокОСУменьшаемогоОстатка КАК СписокОС)) КАК АмортизацияОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	КонецЕсли; 
	
	//-- Локализация
	
	Возврат ТекстЗапроса;

КонецФункции
 
// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
Процедура ЗарегистрироватьОшибкиРасчетаАмортизации(ПараметрыРасчета) Экспорт

	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|	ПроверкаПараметровРасчета.Организация КАК Организация,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ) КАК НеУказанСрокИспользованияБУ,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанСрокИспользованияНУ) КАК НеУказанСрокИспользованияНУ,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа) КАК НеУказанаАмортизационнаяГруппа,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанОбъемНаработки) КАК НеУказанОбъемНаработки,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.ОбъемНаработкиВыработан) КАК ОбъемНаработкиВыработан,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанКоэффициентАмортизации) КАК НеУказанКоэффициентАмортизации,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанКоэффициентУскорения) КАК НеУказанКоэффициентУскорения,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется) КАК МетодНачисленияНеПрименяется,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовАмортизационнойПремии) КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовБУ) КАК НеУказанаСтатьяРасходовБУ,
	|	МАКСИМУМ(ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовНУ) КАК НеУказанаСтатьяРасходовНУ
	|
	|ПОМЕСТИТЬ ПроверкаВсехПараметровРасчетаБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаПараметровРасчета.Организация КАК Организация,
	|		ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|		ПроверкаПараметровРасчета.ОбъемНаработкиВыработан КАК ОбъемНаработкиВыработан,
	|		ПроверкаПараметровРасчета.НеУказанКоэффициентАмортизации КАК НеУказанКоэффициентАмортизации,
	|		ПроверкаПараметровРасчета.НеУказанКоэффициентУскорения КАК НеУказанКоэффициентУскорения,
	|		ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияНУ,
	|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовНУ
	|	ИЗ
	|		ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|	ГДЕ
	|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаПараметровРасчета.Организация КАК Организация,
	|		ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|		ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|		ЛОЖЬ КАК ОбъемНаработкиВыработан,
	|		ЛОЖЬ КАК НеУказанКоэффициентАмортизации,
	|		ЛОЖЬ КАК НеУказанКоэффициентУскорения,
	|		ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияНУ,
	|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовНУ
	|	ИЗ
	|		ПроверкаПараметровРасчетаИзменения_БУ КАК ПроверкаПараметровРасчета
	|	ГДЕ
	|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаПараметровРасчета.Организация КАК Организация,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияБУ,
	|		ЛОЖЬ КАК НеУказанОбъемНаработки,
	|		ЛОЖЬ КАК ОбъемНаработкиВыработан,
	|		ЛОЖЬ КАК НеУказанКоэффициентАмортизации,
	|		ЛОЖЬ КАК НеУказанКоэффициентУскорения,
	|		ЛОЖЬ КАК МетодНачисленияНеПрименяется,
	|		ПроверкаПараметровРасчета.НеУказанСрокИспользованияНУ КАК НеУказанСрокИспользованияНУ,
	|		ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа КАК НеУказанаАмортизационнаяГруппа,
	|		ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовАмортизационнойПремии КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовНУ
	|	ИЗ
	|		ПроверкаПараметровРасчета_НУ КАК ПроверкаПараметровРасчета
	|	ГДЕ
	|		ПроверкаПараметровРасчета.Организация В(&СписокОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПроверкаРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаРасчета.Организация КАК Организация,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияБУ,
	|		ЛОЖЬ КАК НеУказанОбъемНаработки,
	|		ЛОЖЬ КАК ОбъемНаработкиВыработан,
	|		ЛОЖЬ КАК НеУказанКоэффициентАмортизации,
	|		ЛОЖЬ КАК НеУказанКоэффициентУскорения,
	|		ЛОЖЬ КАК МетодНачисленияНеПрименяется,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияНУ,
	|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|		ПроверкаРасчета.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходовБУ,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовНУ
	|	ИЗ
	|		ПроверкаРасчета_БУ КАК ПроверкаРасчета
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПроверкаРасчета.ОбъектУчета КАК ОбъектУчета,
	|		ПроверкаРасчета.Организация КАК Организация,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияБУ,
	|		ЛОЖЬ КАК НеУказанОбъемНаработки,
	|		ЛОЖЬ КАК ОбъемНаработкиВыработан,
	|		ЛОЖЬ КАК НеУказанКоэффициентАмортизации,
	|		ЛОЖЬ КАК НеУказанКоэффициентУскорения,
	|		ЛОЖЬ КАК МетодНачисленияНеПрименяется,
	|		ЛОЖЬ КАК НеУказанСрокИспользованияНУ,
	|		ЛОЖЬ КАК НеУказанаАмортизационнаяГруппа,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|		ЛОЖЬ КАК НеУказанаСтатьяРасходовБУ,
	|		ПроверкаРасчета.НеУказанаСтатьяРасходов КАК НеУказанаСтатьяРасходовНУ
	|	ИЗ
	|		ПроверкаРасчета_НУ КАК ПроверкаРасчета
	|
	|	) КАК ПроверкаПараметровРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроверкаПараметровРасчета.ОбъектУчета,
	|	ПроверкаПараметровРасчета.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроверкаПараметровРасчета.ОбъектУчета КАК ОбъектУчета,
	|	ПроверкаПараметровРасчета.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.ОбъектыЭксплуатации).Наименование КАК ОбъектУчетаПредставление,
	|	ВЫРАЗИТЬ(ПроверкаПараметровРасчета.ОбъектУчета КАК Справочник.ОбъектыЭксплуатации).ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПроверкаПараметровРасчета.НеУказанСрокИспользованияБУ КАК НеУказанСрокИспользованияБУ,
	|	ПроверкаПараметровРасчета.НеУказанСрокИспользованияНУ КАК НеУказанСрокИспользованияНУ,
	|	ПроверкаПараметровРасчета.НеУказанаАмортизационнаяГруппа КАК НеУказанаАмортизационнаяГруппа,
	|	ПроверкаПараметровРасчета.НеУказанОбъемНаработки КАК НеУказанОбъемНаработки,
	|	ПроверкаПараметровРасчета.ОбъемНаработкиВыработан КАК ОбъемНаработкиВыработан,
	|	ПроверкаПараметровРасчета.НеУказанКоэффициентАмортизации КАК НеУказанКоэффициентАмортизации,
	|	ПроверкаПараметровРасчета.НеУказанКоэффициентУскорения КАК НеУказанКоэффициентУскорения,
	|	ПроверкаПараметровРасчета.МетодНачисленияНеПрименяется КАК МетодНачисленияНеПрименяется,
	|	ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовАмортизационнойПремии КАК НеУказанаСтатьяРасходовАмортизационнойПремии,
	|	ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовБУ КАК НеУказанаСтатьяРасходовБУ,
	|	ПроверкаПараметровРасчета.НеУказанаСтатьяРасходовНУ КАК НеУказанаСтатьяРасходовНУ
	|ИЗ
	|	ПроверкаВсехПараметровРасчетаБУ КАК ПроверкаПараметровРасчета
	|";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокОрганизаций", ПараметрыРасчета.СписокОрганизаций);
	
	Результат = Запрос.Выполнить();
	
	ПараметрыРасчета.ЕстьОшибки = НЕ Результат.Пустой() ИЛИ ПараметрыРасчета.ЕстьОшибки;
	
	Если ПараметрыРасчета.ЗарегистрироватьОшибки Тогда
		
		Выборка = Результат.Выбрать();
		
		ШаблонАмортизационнаяГруппа = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указана амортизационная группа.';
											|en = 'Depreciation group is not specified for the ""%1"" fixed asset (inv. No. %2).'");
		
		ШаблонОбъемНаработки = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете не определен предполагаемый объем наработки (продукции, работ).';
									|en = 'Estimated asset activity value (of products, works) is not defined for the ""%1"" fixed asset (inv. No.%2) in local accounting.'");
		
		ШаблонКоэффициентАмортизации = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указан процент годовой амортизации.';
											|en = 'Annual depreciation percent is not specified for the ""%1"" fixed asset (inv. No. %2).'");
		ШаблонКоэффициентУскорения = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указан коэффициент ускорения.';
											|en = 'Acceleration factor is not specified for the ""%1"" fixed asset (inv. No. %2).'");
	
		ШаблонСрокИспользованияБУ = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете не определен срок использования, необходимый для вычисления амортизации.
											|Если была произведена модернизация после окончания срока использования, то следует оформить документ ""Изменение параметров ОС"" и указать новый срок (первоначальный + срок, на который произошло увеличение после модернизации) или приостановить начисление амортизации.';
											|en = 'For the fixed asset ""%1"" (inv. No.%2), the useful life necessary for calculating depreciation is not defined in the bookkeeping.
											|If upgrade after the end of useful life was made, then you need to generate ""FA parameters change"" document and indicate the new term (initial + term, which increased after upgrading) or suspend depreciation accrual.'");
											
		ШаблонСрокИспользованияНУ = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указан срок использования в налоговом учете.';
										|en = 'Useful life in tax accounting is not specified for the ""%1"" fixed asset (inv. No. %2).'");
		ШаблонСтатьяРасходовАмортизационнойПремии = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) не указана статья расходов по амортизационной премии.';
														|en = 'Expense item recording bonus depreciation is not specified for the ""%1"" fixed asset (inv. No. %2).'");
		
		ШаблонОбъемНаработкиВыработан = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете предполагаемый объем наработки полностью выработан.
													|Если была произведена модернизация после полной выработки ресурса, то необходимо оформить документ ""Изменение параметров ОС"" и увеличить предполагаемый объем наработки или приостановить начисление амортизации в бухгалтерском учете.';
													|en = 'Estimated asset activity is fully generated for the ""%1"" fixed asset (inv. No.%2) in local accounting.
													|If a modernization has been performed after the resource has been fully generated, register the ""Adjust fixed asset financial details"" document  and increase the estimated asset activity value or suspend depreciation charge in local accounting.'");
													
		ШаблонМетодНачисленияНеПрименяется = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете указан метод начисления, который не применяется при учете по стандарту ФСБУ 6/2020.
													|Необходимо изменить метод начисления с помощью документа ""Изменение параметров ОС"".';
													|en = 'For the fixed asset ""%1"" (inv. No. %2), an accrual method is specified in accounting, which is not applied in accounting according to the FSBU 6/2020 standard.
													|The accrual method must be changed using the ""Adjust fixed asset financial details"" document.'");
													
		ШаблонНеУказанаСтатьяРасходовБУ = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в бухгалтерском учете не определена статья расходов отражения амортизации.';
												|en = 'The expense item is not specified to record depreciation for the ""%1"" (inventory No. %2) fixed asset in local accounting.'");
		ШаблонНеУказанаСтатьяРасходовНУ = НСтр("ru = 'Для основного средства ""%1"" (инв. №%2) в налоговом учете не определена статья расходов отражения амортизации.';
												|en = 'The expense item is not specified for the ""%1"" ( inventory No. %2) fixed asset in management accounting.'");
	
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.НеУказанаАмортизационнаяГруппа Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонАмортизационнаяГруппа, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли;
			
			Если Выборка.НеУказанОбъемНаработки Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонОбъемНаработки, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
			Если Выборка.ОбъемНаработкиВыработан Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонОбъемНаработкиВыработан, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
			Если Выборка.НеУказанКоэффициентАмортизации Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонКоэффициентАмортизации, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
			Если Выборка.НеУказанКоэффициентУскорения Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонКоэффициентУскорения, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
			Если Выборка.НеУказанСрокИспользованияБУ Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонСрокИспользованияБУ, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
			Если Выборка.НеУказанСрокИспользованияНУ Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонСрокИспользованияНУ, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
			Если Выборка.НеУказанаСтатьяРасходовАмортизационнойПремии Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонСтатьяРасходовАмортизационнойПремии, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
		
			Если Выборка.МетодНачисленияНеПрименяется Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонМетодНачисленияНеПрименяется, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли;
			 
			Если Выборка.НеУказанаСтатьяРасходовБУ Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонНеУказанаСтатьяРасходовБУ, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
	
			Если Выборка.НеУказанаСтатьяРасходовНУ Тогда
				
				ТекстОшибки = СтрШаблон(ШаблонНеУказанаСтатьяРасходовНУ, Выборка.ОбъектУчетаПредставление, СокрЛП(Выборка.ИнвентарныйНомер));
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Справочники.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ПараметрыРасчета.Период,
					Выборка.Организация,
					ТекстОшибки,,
					Выборка.ОбъектУчета,
					ПараметрыРасчета.ЕстьОшибки);
					
			КонецЕсли; 
			
		КонецЦикла;
	
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаСписокОбъектовУчета(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокОС.НачалоМесяца                        КАК НачалоМесяца,
	|	СписокОС.КонецМесяца                         КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА     КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|
	|ПОМЕСТИТЬ СписокОбъектовУчета
	|
	|ИЗ
	|	СписокОбъектовУчета_УУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = СписокОС.ГоловнаяОрганизация
	|			И УчетнаяПолитикаБУ.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = СписокОС.ГоловнаяОрганизация
	|			И УчетнаяПолитикаУУ.Период = &КонецМесяца
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&НачалоМесяца                                КАК НачалоМесяца,
	|	&КонецМесяца                                 КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА     КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяСДатыПринятияКУчету КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|	(ЕСТЬNULL(УчетнаяПолитикаУУ.ПорядокУчетаВНА, ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) 
	|		= ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)) КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|ИЗ
	|	СписокОбъектовУчета_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = СписокОС.ГоловнаяОрганизация
	|			И УчетнаяПолитикаБУ.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = СписокОС.ГоловнаяОрганизация
	|			И УчетнаяПолитикаУУ.Период = &КонецМесяца
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&НачалоМесяца                                КАК НачалоМесяца,
	|	&КонецМесяца                                 КАК КонецМесяца,
	|	СписокОС.Организация                         КАК Организация,
	|	СписокОС.ОсновноеСредство                    КАК ОсновноеСредство,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|
	|	НЕОПРЕДЕЛЕНО                                 КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ                                         КАК АмортизацияНачисляетсяСДатыПринятияКУчету,
	|	ЛОЖЬ                                         КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	ЛОЖЬ                                         КАК АмортизацияНачисляетсяПоСтандартамМУ_УУ,
	|	ЛОЖЬ                                         КАК АмортизацияНачисляетсяПоСтандартамМУ_БУ
	|ИЗ
	|	СписокОбъектовУчета_НУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Параметры:
//  СписокПодзапросов - Массив из Строка - 
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
Процедура ДополнитьТекстПодзапросаНачисленнаяАмортизация(СписокПодзапросов, ПараметрыРасчета) Экспорт

	//++ Локализация
	
	ТекстПодзапроса =
	"	ВЫБРАТЬ
	|		НЕОПРЕДЕЛЕНО КАК Ссылка,
	|		РасчетАмортизации.ПериодРасчета КАК ПериодРасчета,
	|		РасчетАмортизации.ПериодРасчета КАК ПериодНачисления,
	|		РасчетАмортизации.Организация КАК Организация,
	|		РасчетАмортизации.Подразделение КАК Подразделение,
	|		РасчетАмортизации.КорПодразделение КАК КорПодразделение,
	|		РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|		РасчетАмортизации.ЕГДС КАК ЕГДС,
	|		РасчетАмортизации.ГруппаФинансовогоУчета,
	|		РасчетАмортизации.НаправлениеДеятельности,
	|		РасчетАмортизации.КорНаправлениеДеятельности,
	|		РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|		РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|		РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		РасчетАмортизации.НачислятьИзнос КАК НачислятьИзнос,
	|		NULL КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		NULL КАК РесурсВыработанныйЗаТекущийПериод,
	|		РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|		РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|		NULL КАК СтоимостьДляВычисленияАмортизации,
	|		РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииРегл,
	|		РасчетАмортизации.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		0 КАК ОстатокОбесцененияУпр,
	|		ЛОЖЬ КАК ЭтоДоначисление,
	|		РасчетАмортизации.ЭтоДоначисление КАК ЭтоДоначислениеБУ,
	|		ЛОЖЬ КАК КорректировкаАмортизацииЗаПериод,
	|		ЛОЖЬ КАК ЭтоКорректировкаАмортизацииЗаПрошлыйПериод,
	|		НЕОПРЕДЕЛЕНО КАК ПорядокУчетаУУ,
	|		РасчетАмортизации.ПорядокУчетаВНА КАК ПорядокУчетаБУ,
	|		НЕОПРЕДЕЛЕНО КАК ПорядокНачисленияАмортизацииУУ,
	|		РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		РасчетАмортизации.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|		0 КАК ВерсияМетодаНачисленияУУ,
	|		РасчетАмортизации.ВерсияМетодаНачисленияБУ КАК ВерсияМетодаНачисленияБУ,
	|
	|		0 КАК СуммаУУ,
	|
	|		РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|		РасчетАмортизации.СуммаНУ КАК СуммаНУ,
	|
	|		РасчетАмортизации.СуммаПР 
	|		+ ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПР <> 0
	|				ТОГДА РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПР,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаБУ
	|						- РасчетАмортизации.СуммаНУ 
	|						- РасчетАмортизации.СуммаПР) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПР <> 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетАмортизации.СуммаБУ
	|					- РасчетАмортизации.СуммаНУ 
	|					- РасчетАмортизации.СуммаПР
	|		КОНЕЦ КАК СуммаВР,
	|
	|		РасчетАмортизации.СуммаЦФ КАК СуммаЦФ,
	|		РасчетАмортизации.СуммаНУЦФ КАК СуммаНУЦФ,
	|
	|		РасчетАмортизации.СуммаПРЦФ
	|		+ ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПРЦФ <> 0
	|				ТОГДА РасчетАмортизации.СуммаЦФ
	|					- РасчетАмортизации.СуммаНУЦФ 
	|					- РасчетАмортизации.СуммаПРЦФ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПРЦФ,
	|
	|		ВЫБОР 
	|			КОГДА РасчетАмортизации.НачислятьИзнос
	|				ТОГДА 0
	|			КОГДА (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) < &МинимальнаяСуммаВР
	|					И (РасчетАмортизации.СуммаЦФ
	|						- РасчетАмортизации.СуммаНУЦФ 
	|						- РасчетАмортизации.СуммаПРЦФ) > -&МинимальнаяСуммаВР
	|					И РасчетАмортизации.СуммаПРЦФ <> 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетАмортизации.СуммаЦФ
	|					- РасчетАмортизации.СуммаНУЦФ 
	|					- РасчетАмортизации.СуммаПРЦФ
	|		КОНЕЦ КАК СуммаВРЦФ,
	|
	|		0 КАК ОбесценениеУУ,
	|		РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|		РасчетАмортизации.ОбесценениеЦФ КАК ОбесценениеЦФ
	|
	|	ИЗ
	|		РасчетАмортизации_БУ КАК РасчетАмортизации";
	
	СписокПодзапросов.Добавить(ТекстПодзапроса);
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаКоличествоОбработанныхДанных(ПараметрыРасчета) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РасчетАмортизации.ОсновноеСредство), 0) КАК КоличествоДанных
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство
	|	ИЗ
	|		РасчетАмортизации_БУ КАК РасчетАмортизации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетАмортизации.ОсновноеСредство
	|	ИЗ
	|		РасчетАмортизации_УУ КАК РасчетАмортизации) КАК РасчетАмортизации";
	
	//-- Локализация

	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаВтНачисленнаяАмортизация() Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыВнеоборотныхАктивов.ОсновноеСредство) КАК ВидВНА,
	|	НачисленнаяАмортизация.Ссылка,
	|	НачисленнаяАмортизация.ПериодРасчета,
	|	НачисленнаяАмортизация.ПериодНачисления КАК ПериодНачисления,
	|	НачисленнаяАмортизация.Организация,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|	НачисленнаяАмортизация.Подразделение,
	|	НачисленнаяАмортизация.КорПодразделение,
	|	НачисленнаяАмортизация.ОсновноеСредство,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.НаправлениеДеятельности,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.СтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов,
	|	НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов,
	|	НачисленнаяАмортизация.НачислятьИзнос,
	|	НачисленнаяАмортизация.ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ,
	|	НачисленнаяАмортизация.ЕГДС КАК ЕГДС,
	|
	|	&ИдентификаторСтрокиТаблицы КАК ИдентификаторСтроки,
	|
	|	МАКСИМУМ(НачисленнаяАмортизация.ЭтоОтражениеРазницы) КАК ЭтоОтражениеРазницы,
	|	МАКСИМУМ(НачисленнаяАмортизация.ЭтоКорректировкаАмортизацииЗаПрошлыйПериод) КАК ЭтоКорректировкаАмортизацииЗаПрошлыйПериод,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериод) КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериод) КАК РесурсВыработанныйЗаТекущийПериод,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаПрошлыйПериодБУ) КАК РесурсВыработанныйЗаПрошлыйПериодБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.РесурсВыработанныйЗаТекущийПериодБУ) КАК РесурсВыработанныйЗаТекущийПериодБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизации) КАК СтоимостьДляВычисленияАмортизации,
	|	МАКСИМУМ(НачисленнаяАмортизация.СтоимостьДляВычисленияАмортизацииРегл) КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	МАКСИМУМ(НачисленнаяАмортизация.ОстатокОбесцененияРегл) КАК ОстатокОбесцененияРегл,
	|	МАКСИМУМ(НачисленнаяАмортизация.ОстатокОбесцененияУпр) КАК ОстатокОбесцененияУпр,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокУчетаУУ) КАК ПорядокУчетаУУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокУчетаБУ) КАК ПорядокУчетаБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокНачисленияАмортизацииУУ) КАК ПорядокНачисленияАмортизацииУУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ПорядокНачисленияАмортизацииБУ) КАК ПорядокНачисленияАмортизацииБУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ВариантПроводокПоОбесценениюВНА) КАК ВариантПроводокПоОбесценениюВНА,
	|	МАКСИМУМ(НачисленнаяАмортизация.ВерсияМетодаНачисленияУУ) КАК ВерсияМетодаНачисленияУУ,
	|	МАКСИМУМ(НачисленнаяАмортизация.ВерсияМетодаНачисленияБУ) КАК ВерсияМетодаНачисленияБУ,
	|
	|	СУММА(НачисленнаяАмортизация.СуммаУУ) КАК СуммаУУ,
	|	СУММА(НачисленнаяАмортизация.СуммаБУ) КАК СуммаБУ,
	|	СУММА(НачисленнаяАмортизация.СуммаНУ) КАК СуммаНУ,
	|	СУММА(НачисленнаяАмортизация.СуммаПР) КАК СуммаПР,
	|	СУММА(НачисленнаяАмортизация.СуммаВР) КАК СуммаВР,
	|	СУММА(НачисленнаяАмортизация.СуммаЦФ) КАК СуммаЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаНУЦФ) КАК СуммаНУЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаПРЦФ) КАК СуммаПРЦФ,
	|	СУММА(НачисленнаяАмортизация.СуммаВРЦФ) КАК СуммаВРЦФ,
	|
	|	СУММА(НачисленнаяАмортизация.ОбесценениеУУ) КАК ОбесценениеУУ,
	|	СУММА(НачисленнаяАмортизация.ОбесценениеБУ) КАК ОбесценениеБУ,
	|	СУММА(НачисленнаяАмортизация.ОбесценениеЦФ) КАК ОбесценениеЦФ
	|
	|ПОМЕСТИТЬ НачисленнаяАмортизация
	|
	|ИЗ
	|	&ТекстПодзапроса КАК НачисленнаяАмортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = НачисленнаяАмортизация.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = НачисленнаяАмортизация.ОсновноеСредство
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленнаяАмортизация.Ссылка,
	|	НачисленнаяАмортизация.ПериодРасчета,
	|	НачисленнаяАмортизация.ПериодНачисления,
	|	НачисленнаяАмортизация.Организация,
	|	НачисленнаяАмортизация.ЕГДС,
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0),
	|	НачисленнаяАмортизация.Подразделение,
	|	НачисленнаяАмортизация.КорПодразделение,
	|	НачисленнаяАмортизация.ГруппаФинансовогоУчета,
	|	НачисленнаяАмортизация.НаправлениеДеятельности,
	|	НачисленнаяАмортизация.КорНаправлениеДеятельности,
	|	НачисленнаяАмортизация.ОсновноеСредство,
	|	НачисленнаяАмортизация.СтатьяРасходов,
	|	НачисленнаяАмортизация.АналитикаРасходов,
	|	НачисленнаяАмортизация.ПередаватьРасходыВДругуюОрганизацию,
	|	НачисленнаяАмортизация.ОрганизацияПолучательРасходов,
	|	НачисленнаяАмортизация.НачислятьИзнос,
	|	НачисленнаяАмортизация.ЭтоДоначисление,
	|	НачисленнаяАмортизация.ЭтоДоначислениеБУ,
	|	&ГруппировкаИдентификатора
	|";
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

//++ Локализация

Процедура РассчитатьАмортизацию_ЗаПрошлыйМесяцБУ(ПараметрыРасчета)
	
	ИспользуемыеВТ = ОбщегоНазначенияУТ.СписокВременныхТаблиц(ПараметрыРасчета.МенеджерВременныхТаблиц);
	ИспользуемыеВТ.Добавить("РасчетАмортизации_ЗаПрошлыйМесяцБУ");
	ИспользуемыеВТ.Добавить("РасчетАмортизации_ЗаПрошлыйМесяцБУ_Сгруппированная");

	РассчитатьАмортизацию_ЗаПрошлыйМесяц_БезИзмененийБУ(ПараметрыРасчета);
	РассчитатьАмортизацию_ЗаПрошлыйМесяц_СУчетомИзмененийБУ(ПараметрыРасчета);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетАмортизации.Период КАК ПериодРасчета,
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.Подразделение КАК Подразделение,
	|	РасчетАмортизации.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РасчетАмортизации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|				И НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, ГОД) 
	|			ТОГДА РасчетАмортизации.СтатьяРасходов
	|		ИНАЧЕ РасчетАмортизации.СтатьяРасходов 
	|	КОНЕЦ КАК СтатьяРасходов,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|				И НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, ГОД) 
	|			ТОГДА РасчетАмортизации.АналитикаРасходов
	|		ИНАЧЕ РасчетАмортизации.АналитикаРасходов 
	|	КОНЕЦ КАК АналитикаРасходов,
	|
	|	РасчетАмортизации.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|				И НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, ГОД) 
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РасчетАмортизации.СпособОтраженияАмортизации 
	|	КОНЕЦ КАК СпособОтраженияАмортизации,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|			ТОГДА -РасчетАмортизации.СуммаБУ
	|		ИНАЧЕ РасчетАмортизации.СуммаБУ 
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|			ТОГДА -РасчетАмортизации.СуммаПР
	|		ИНАЧЕ РасчетАмортизации.СуммаПР 
	|	КОНЕЦ КАК СуммаПР,
	|
	|	РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|			ТОГДА -РасчетАмортизации.СтоимостьДляВычисленияАмортизации
	|		ИНАЧЕ РасчетАмортизации.СтоимостьДляВычисленияАмортизации 
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	|	РасчетАмортизации.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	РасчетАмортизации.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	РасчетАмортизации.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	РасчетАмортизации.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	РасчетАмортизации.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ,
	|	РасчетАмортизации.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	РасчетАмортизации.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	РасчетАмортизации.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
	|	РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ РасчетАмортизации_ЗаПрошлыйМесяцБУ
	|
	|ИЗ
	|	РасчетАмортизацииЗаПрошлыйМесяц_БезИзменений_БУ КАК РасчетАмортизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетАмортизации.Период КАК Период,
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.Подразделение КАК Подразделение,
	|	РасчетАмортизации.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РасчетАмортизации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|				И НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, ГОД) 
	|			ТОГДА РасчетАмортизации.СтатьяРасходов
	|		ИНАЧЕ РасчетАмортизации.СтатьяРасходов 
	|	КОНЕЦ КАК СтатьяРасходов,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|				И НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, ГОД) 
	|			ТОГДА РасчетАмортизации.АналитикаРасходов
	|		ИНАЧЕ РасчетАмортизации.АналитикаРасходов 
	|	КОНЕЦ КАК АналитикаРасходов,
	|
	|	РасчетАмортизации.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|				И НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РасчетАмортизации.Период, ГОД) 
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РасчетАмортизации.СпособОтраженияАмортизации 
	|	КОНЕЦ КАК СпособОтраженияАмортизации,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|			ТОГДА -РасчетАмортизации.СуммаБУ
	|		ИНАЧЕ РасчетАмортизации.СуммаБУ 
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|			ТОГДА -РасчетАмортизации.СуммаПР
	|		ИНАЧЕ РасчетАмортизации.СуммаПР 
	|	КОНЕЦ КАК СуммаПР,
	|
	|	РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую
	|			ТОГДА -РасчетАмортизации.СтоимостьДляВычисленияАмортизации
	|		ИНАЧЕ РасчетАмортизации.СтоимостьДляВычисленияАмортизации 
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	|	РасчетАмортизации.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	РасчетАмортизации.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	РасчетАмортизации.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	РасчетАмортизации.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	РасчетАмортизации.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ,
	|	РасчетАмортизации.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	ИСТИНА КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	РасчетАмортизации.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
	|	РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР
	|
	|ИЗ
	|	РасчетАмортизации_ЗаПрошлыйМесяц_СУчетомИзмененийБУ КАК РасчетАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(РасчетАмортизации.СуммаБУ) КАК СуммаБУ,
	|	СУММА(РасчетАмортизации.СуммаПР) КАК СуммаПР
	|
	|ПОМЕСТИТЬ РасчетАмортизации_ЗаПрошлыйМесяцБУ_Сгруппированная
	|
	|ИЗ
	|	РасчетАмортизации_ЗаПрошлыйМесяцБУ КАК РасчетАмортизации
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетАмортизации.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	Запрос.Выполнить();
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ПараметрыРасчета.МенеджерВременныхТаблиц,, ИспользуемыеВТ);
	
КонецПроцедуры
	
Процедура РассчитатьАмортизацию_ЗаПрошлыйМесяц_БезИзмененийБУ(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.Период КАК Период,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.ПредварительнаяСтоимостьПревышаетФактическую КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	СписокОС.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ОстаточнаяСтоимостьПР = 0
	|				ИЛИ СписокОС.ОстаточнаяСтоимостьРегл = 0
	|				ИЛИ СписокОС.СуммаБУ = 0
	| 
	|			ТОГДА 0
	|
	|		КОГДА СписокОС.СуммаБУ = СписокОС.ОстаточнаяСтоимостьРегл
	| 
	|			ТОГДА СписокОС.ОстаточнаяСтоимостьПР
	|
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьПР КАК ЧИСЛО (25,9))
	|				* (ВЫРАЗИТЬ(СписокОС.СуммаБУ КАК ЧИСЛО (25,9)) / ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьРегл КАК ЧИСЛО (25,9))) КАК ЧИСЛО (31,2))
	|
	|	КОНЕЦ КАК СуммаПР
	|
	|ПОМЕСТИТЬ РасчетАмортизацииЗаПрошлыйМесяц_БезИзменений_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Период КАК Период,
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.Подразделение КАК Подразделение,
	|		СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|		СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|		СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|		СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|		СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|		СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|		СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|		СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|		СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|		СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|		СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|		СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|		СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|		СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|		СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		СписокОС.ПредварительнаяСтоимостьПревышаетФактическую КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|		СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|		СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|		СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|		СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|		СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|		ВЫБОР
	|			КОГДА СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВерсияМетодаНачисления,
	|
	|		&СуммаАмортизацииБУ КАК СуммаБУ
	|
	|	ИЗ
	|		СписокОССПараметрами_БУ КАК СписокОС
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|			ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|				И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|	ГДЕ
	|		СписокОС.ЭтоДоначисление
	|		И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|
	|	) КАК СписокОС
	|
	|";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииБУ();
	ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации = "СписокОС.СтоимостьДляВычисленияАмортизации";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "0";
	ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода = "СписокОС.СтоимостьРеглНаНачалоГода";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "0";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "0";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьАмортизацию_ЗаПрошлыйМесяц_СУчетомИзмененийБУ(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	ДАТАВРЕМЯ(1,1,1) КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).УчитыватьСтоимостьЛиквидационногоОбязательства КАК УчитыватьСтоимостьЛиквидационногоОбязательства,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	СписокОС.СуммаПР КАК СуммаПР,
	|	0 КАК СуммаУУ,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	0 КАК ОбесценениеРегл,
	|	0 КАК ОбесценениеУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЦФ,
	|	0 КАК СтоимостьПР,
	|
	|	0 КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|	0 КАК СтоимостьНУИзменение,
	|
	|	0 КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|	0 КАК АмортизацияНУИзменение,
	|
	|	0 КАК АмортизацияРегл,
	|	0 КАК АмортизацияЦФ,
	|	0 КАК АмортизацияПР,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	0 КАК СтоимостьДляВычисленияАмортизацииПР,
	|	0 КАК СтоимостьДляВычисленияПР,
	|
	|	0 КАК ПРДляВычисленияАмортизации, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.ПредварительнаяСтоимостьПревышаетФактическую КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	ЛОЖЬ КАК КорректировкаСтоимостиБУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииБУ,
	|	ЛОЖЬ КАК ВключаетАмортизациюТекущегоМесяца,
	|	НЕОПРЕДЕЛЕНО КАК МетодПереоценки,
	|	ЛОЖЬ КАК ПереоценкаПоСправедливойСтоимости,
	|	ЛОЖЬ КАК ЭтоИзменения
	|
	|ИЗ
	|	РасчетАмортизацииЗаПрошлыйМесяц_БезИзменений_БУ КАК СписокОС
	|
	|ГДЕ
	|	СписокОС.ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			СписокОССИзмененнымиПараметрами_БУ КАК СписокОС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	СписокОС.Период КАК Период,
	|	СписокОС.Регистратор КАК Регистратор,
	|	СписокОС.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).УчитыватьСтоимостьЛиквидационногоОбязательства КАК УчитыватьСтоимостьЛиквидационногоОбязательства,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|	0 КАК СуммаУУ,
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|
	|	0 КАК ОбесценениеРегл,
	|	0 КАК ОбесценениеУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|	СписокОС.СтоимостьПР КАК СтоимостьПР,
	|
	|	СписокОС.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	СписокОС.СтоимостьПРИзменение КАК СтоимостьПРИзменение,
	|	0 КАК СтоимостьНУИзменение,
	|
	|	СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	СписокОС.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
	|	0 КАК АмортизацияНУИзменение,
	|
	|	СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|	СписокОС.АмортизацияПР КАК АмортизацияПР,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизацииРегл,
	|	0 КАК СтоимостьДляВычисленияАмортизацииПР,
	|	0 КАК СтоимостьДляВычисленияПР,
	|
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации, 
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.ПредварительнаяСтоимостьПревышаетФактическую КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВБУ, ЛОЖЬ) КАК КорректировкаСтоимостиБУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВБУ, ЛОЖЬ) КАК КорректировкаАмортизацииБУ,
	|
	|	ЕСТЬNULL(Корректировка.ВключаетАмортизациюТекущегоМесяца, ЛОЖЬ) КАК ВключаетАмортизациюТекущегоМесяца,
	|
	|	СписокОС.МетодПереоценки КАК МетодПереоценки,
	|	ЕСТЬNULL(Переоценка.ПереоценкаПоСправедливойСтоимости, ЛОЖЬ) КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ИСТИНА КАК ЭтоИзменения
	|
	|ИЗ
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|		ПО Корректировка.Ссылка = СписокОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = СписокОС.Регистратор
	|
	|ГДЕ
	|	СписокОС.ЭтоДоначисление
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;

	РезультатЗапроса = Запрос.Выполнить();
	
	АмортизацияИзменений = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПриИзмененииПараметров(РезультатЗапроса.Выгрузить(), Неопределено);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетАмортизации.Период КАК Период,
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.Подразделение КАК Подразделение,
	|	РасчетАмортизации.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РасчетАмортизации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|	РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|	РасчетАмортизации.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	РасчетАмортизации.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|	РасчетАмортизации.СуммаПР КАК СуммаПР,
	|	РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	РасчетАмортизации.РесурсНазначенный КАК РесурсНазначенный,
	|	РасчетАмортизации.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизации,
	|	РасчетАмортизации.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	РасчетАмортизации.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	РасчетАмортизации.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	РасчетАмортизации.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	РасчетАмортизации.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ,
	|	РасчетАмортизации.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	РасчетАмортизации.ПредварительнаяСтоимостьПревышаетФактическую КАК ПредварительнаяСтоимостьПревышаетФактическую,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВерсияМетодаНачисления
	|
	|ПОМЕСТИТЬ РасчетАмортизации_ЗаПрошлыйМесяц_СУчетомИзмененийБУ
	|
	|ИЗ
	|	&АмортизацияИзменений КАК РасчетАмортизации
	|
	|ГДЕ
	|	РасчетАмортизации.ЭтоИзменения
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("АмортизацияИзменений", АмортизацияИзменений);

	Запрос.Выполнить();
		
КонецПроцедуры

Процедура РассчитатьАмортизацию_ЗаТекущийМесяцБУ(ПараметрыРасчета)
	
	ИспользуемыеВТ = ОбщегоНазначенияУТ.СписокВременныхТаблиц(ПараметрыРасчета.МенеджерВременныхТаблиц);
	ИспользуемыеВТ.Добавить("РасчетАмортизации_ЗаТекущийМесяц_БезИзмененийБУ");
	ИспользуемыеВТ.Добавить("РасчетАмортизации_ЗаТекущийМесяц_СУчетомИзмененийБУ");

	РассчитатьАмортизацию_ЗаТекущийМесяц_БезИзмененийБУ(ПараметрыРасчета);
	РассчитатьАмортизацию_ЗаТекущийМесяц_СУчетомИзмененийБУ(ПараметрыРасчета);

	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ПараметрыРасчета.МенеджерВременныхТаблиц,, ИспользуемыеВТ);
	
КонецПроцедуры

Процедура РассчитатьАмортизацию_ЗаТекущийМесяц_БезИзмененийБУ(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.ПериодРасчета КАК ПериодРасчета,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокОС.СтоимостьПР КАК СтоимостьПР,
	|	СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|	СписокОС.АмортизацияПР КАК АмортизацияПР,
	|	СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|	СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|	СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|	СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|	СписокОС.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|	СписокОС.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|
	|	ВЫБОР
	|		КОГДА СписокОС.ОстаточнаяСтоимостьПР = 0
	|				ИЛИ СписокОС.ОстаточнаяСтоимостьРегл = 0
	|				ИЛИ СписокОС.ВариантПроводокПоОбесценениюВНА = ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)
	|					И СписокОС.СуммаБУ + СписокОС.ОбесценениеБУ = 0
	|				ИЛИ СписокОС.ВариантПроводокПоОбесценениюВНА <> ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)
	|					И СписокОС.СуммаБУ = 0
	| 
	|			ТОГДА 0
	|
	|		КОГДА СписокОС.ВариантПроводокПоОбесценениюВНА = ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)
	|					И СписокОС.СуммаБУ + СписокОС.ОбесценениеБУ = СписокОС.ОстаточнаяСтоимостьРегл
	|				ИЛИ СписокОС.ВариантПроводокПоОбесценениюВНА <> ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)
	|					И СписокОС.СуммаБУ = СписокОС.ОстаточнаяСтоимостьРегл
	| 
	|			ТОГДА СписокОС.ОстаточнаяСтоимостьПР
	|
	|		КОГДА СписокОС.ВариантПроводокПоОбесценениюВНА = ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)
	|
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьПР КАК ЧИСЛО (25,9))
	|				* (ВЫРАЗИТЬ(СписокОС.СуммаБУ + СписокОС.ОбесценениеБУ КАК ЧИСЛО (25,9)) / ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьРегл КАК ЧИСЛО (25,9))) КАК ЧИСЛО (31,2))
	|
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьПР КАК ЧИСЛО (25,9))
	|				* (ВЫРАЗИТЬ(СписокОС.СуммаБУ КАК ЧИСЛО (25,9)) / ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьРегл КАК ЧИСЛО (25,9))) КАК ЧИСЛО (31,2))
	|
	|	КОНЕЦ КАК СуммаПР
	|
	|ПОМЕСТИТЬ РасчетАмортизации_ЗаТекущийМесяц_БезИзмененийБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.ПериодРасчета КАК ПериодРасчета,
	|		СписокОС.Организация КАК Организация,
	|		СписокОС.Подразделение КАК Подразделение,
	|		СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|		СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|		СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|		СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|		СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|		СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|		СписокОС.СтоимостьПР КАК СтоимостьПР,
	|		СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|		СписокОС.АмортизацияПР КАК АмортизацияПР,
	|		СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|		СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|		СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|		СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|		СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|		СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|		СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|		СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|		СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|		СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|		СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|		СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|		СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|		СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|		СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|		СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|		СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|		СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|		СписокОС.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
	|		СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|		СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|		СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|		СписокОС.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|		ВЫБОР 
	|			КОГДА СписокОС.ОстаточнаяСтоимостьРегл < 0
	|				ТОГДА 
	|					ВЫБОР
	|						КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.СуммаБУ) > 0
	|
	|							ТОГДА СписокОС.ОстаточнаяСтоимостьРегл
	|
	|						ИНАЧЕ СписокОС.СуммаБУ
	|					КОНЕЦ
	|
	|			КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость - СписокОС.ОбесценениеБУ - СписокОС.СуммаБУ) < &МинимальнаяОстаточнаяСтоимостьРегл
	|					И СписокОС.СуммаБУ > 0
	|					И СписокОС.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения
	|
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость - СписокОС.ОбесценениеБУ
	|
	|			КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость - СписокОС.СуммаБУ) < &МинимальнаяОстаточнаяСтоимостьРегл
	|					И СписокОС.СуммаБУ > 0
	|					И СписокОС.ВариантПроводокПоОбесценениюВНА <> &ДоначислятьКорректировкуОбесценения
	|
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость
	|
	|			ИНАЧЕ СписокОС.СуммаБУ
	|
	|		КОНЕЦ КАК СуммаБУ
	|
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СписокОС.ПериодРасчета КАК ПериодРасчета,
	|			СписокОС.Организация КАК Организация,
	|			СписокОС.Подразделение КАК Подразделение,
	|			СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|			СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|			СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|			СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|			СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|			СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|			СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|			СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|			СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|			СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|			СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|			СписокОС.СтоимостьПР КАК СтоимостьПР,
	|			СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|			СписокОС.АмортизацияПР КАК АмортизацияПР,
	|			СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|			СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|			СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|			СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|			СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|			СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|			СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|			СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|			СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|			СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|			СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|			СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|			СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|			СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|			СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|			СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|			СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|			СписокОС.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
	|			СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			ВЫБОР
	|				КОГДА (СписокОС.ОстатокОбесцененияРегл - СписокОС.ОбесценениеБУ) < &МинимальнаяОстаточнаяСтоимостьРегл
	|					ТОГДА СписокОС.ОстатокОбесцененияРегл
	|				ИНАЧЕ СписокОС.ОбесценениеБУ
	|			КОНЕЦ КАК ОбесценениеБУ,
	|
	|			ВЫБОР 
	|				КОГДА СписокОС.ОстаточнаяСтоимостьРегл < 0
	|
	|					ТОГДА 
	|						ВЫБОР
	|							КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.СуммаАмортизацииБУ) > -&МинимальнаяОстаточнаяСтоимостьРегл
	|
	|								ТОГДА СписокОС.ОстаточнаяСтоимостьРегл 
	|
	|							ИНАЧЕ  СписокОС.СуммаАмортизацииБУ
	|						КОНЕЦ
	|
	|				КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость - СписокОС.СуммаАмортизацииБУ) < &МинимальнаяОстаточнаяСтоимостьРегл
	|				
	|					ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - СписокОС.ЛиквидационнаяСтоимость
	|
	|				ИНАЧЕ СписокОС.СуммаАмортизацииБУ
	|
	|			КОНЕЦ КАК СуммаБУ
	|
	|		ИЗ
	|			(ВЫБРАТЬ
	|				СписокОС.Период КАК ПериодРасчета,
	|				СписокОС.Организация КАК Организация,
	|				СписокОС.Подразделение КАК Подразделение,
	|				СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|				СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|				СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|				СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|				СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|				СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|				СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|				СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|				СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|				СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|				СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|				СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|				СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|				СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|				СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|				СписокОС.СтоимостьПР КАК СтоимостьПР,
	|				СписокОС.АмортизацияРегл КАК АмортизацияРегл,
	|				СписокОС.АмортизацияПР КАК АмортизацияПР,
	|				СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|				СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|				СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0) КАК ОстаточнаяСтоимостьРегл,
	|				СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|				СписокОС.ОстаточнаяСтоимостьПР - ЕСТЬNULL(Доначисление.СуммаПР, 0) КАК ОстаточнаяСтоимостьПР,
	|				СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|				СписокОС.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|
	|				ВЫБОР
	|					КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|						ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|					ИНАЧЕ СписокОС.СтоимостьДляВычисленияАмортизации
	|				КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|
	|				СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|				СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|				СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|				СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|				СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|				СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|				СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|				СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|				СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|				СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
	|
	|				ВЫБОР
	|					КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|							И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК ВерсияМетодаНачисления,
	|
	|				СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|				СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|				СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|				&ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|				&СуммаАмортизацииБУ КАК СуммаАмортизацииБУ
	|
	|			ИЗ
	|				СписокОССПараметрами_БУ КАК СписокОС
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ РасчетАмортизации_ЗаПрошлыйМесяцБУ_Сгруппированная КАК Доначисление
	|					ПО Доначисление.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_БУ КАК ПроверкаПараметровРасчета
	|					ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|						И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|
	|			ГДЕ
	|				НЕ СписокОС.ЭтоДоначисление
	|				И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|
	|			) КАК СписокОС
	|
	|		) КАК СписокОС
	|
	|	) КАК СписокОС
	|";
	
	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииБУ();
	ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации = "СписокОС.СтоимостьДляВычисленияАмортизации";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "СписокОС.ЛиквидационнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода = "СписокОС.СтоимостьРеглНаНачалоГода";
	ПараметрыТекстаЗапроса.ТекстОбесценение = "СписокОС.ОстатокОбесцененияРегл";
	ПараметрыТекстаЗапроса.ТекстСуммаДоначисления = "ЕСТЬNULL(Доначисление.СуммаБУ, 0)";
	
	ТекстСуммаАмортизацииБУ = ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса, ПараметрыРасчета);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстСуммаАмортизацииБУ);
	
	ТекстОбесценениеБУ = ТекстЗапросаСуммаОбесценения();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеБУ", ТекстОбесценениеБУ);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьАмортизацию_ЗаТекущийМесяц_СУчетомИзмененийБУ(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОбъединениеОС.Ссылка КАК Ссылка,
	|	ОбъединениеОС.ОсновноеСредство КАК ОсновноеСредствоПолучатель,
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредствоИсточник
	|
	|ПОМЕСТИТЬ ОбъединениеОС
	|
	|ИЗ
	|	Документ.ОбъединениеОС КАК ОбъединениеОС
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОбъединениеОС.ОС КАК ТабличнаяЧасть
	|		ПО (ТабличнаяЧасть.Ссылка = ОбъединениеОС.Ссылка)
	|
	|ГДЕ
	|	ОбъединениеОС.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ОбъединениеОС.Проведен
	|	И ОбъединениеОС.ОтражатьВРеглУчете
	|
	|	И (ОбъединениеОС.Организация, ТабличнаяЧасть.ОсновноеСредство) В
	|		(ВЫБРАТЬ
	|			ВтДанныеКРасчету.Организация,
	|			ВтДанныеКРасчету.ОбъектУчета
	|		ИЗ
	|			ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство
	|
	|ПОМЕСТИТЬ ОтборОС
	|
	|ИЗ
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОС.ОсновноеСредствоИсточник
	|
	|ИЗ
	|	ОбъединениеОС КАК СписокОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредствоИсточник,
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредствоПолучатель,
	|
	|	ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазукомплектацияОСЧастичная),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации)) КАК ЭтоЧастичноеСписание,
	|
	|	0 КАК СтоимостьСписанияУпр,
	|	ТабличнаяЧасть.СтоимостьБУ КАК СтоимостьСписанияРегл,
	|	ТабличнаяЧасть.СтоимостьПР КАК СтоимостьСписанияПР
	|
	|ИЗ
	|	Документ.РазукомплектацияОС КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК ТабличнаяЧасть
	|		ПО ТабличнаяЧасть.Ссылка = ДанныеДокумента.Ссылка
	|
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ДанныеДокумента.Проведен
	|	И ДанныеДокумента.ОтражатьВРеглУчете
	|
	|	И (ДанныеДокумента.Организация, ТабличнаяЧасть.ОсновноеСредство) В
	|		(ВЫБРАТЬ
	|			ВтДанныеКРасчету.Организация,
	|			ВтДанныеКРасчету.ОбъектУчета
	|		ИЗ
	|			ВтДанныеКРасчету КАК ВтДанныеКРасчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.ОсновноеСредствоИсточник,
	|	ДанныеДокумента.ОсновноеСредствоПолучатель,
	|	ЛОЖЬ КАК ЭтоЧастичноеСписание,
	|	0 КАК СтоимостьСписанияУпр,
	|	0 КАК СтоимостьСписанияРегл,
	|	0 КАК СтоимостьСписанияПР
	|ИЗ
	|	ОбъединениеОС КАК ДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	&НачалоМесяца КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).УчитыватьСтоимостьЛиквидационногоОбязательства КАК УчитыватьСтоимостьЛиквидационногоОбязательства,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|	СписокОС.СуммаБУ КАК СуммаБУ,
	|	СписокОС.СуммаПР КАК СуммаПР,
	|
	|	0 КАК ОбесценениеУУ,
	|	СписокОС.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|
	|	СписокОС.ОстатокОбесцененияРегл КАК ОбесценениеРегл,
	|	0 КАК ОбесценениеУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|	СписокОС.СтоимостьПР КАК СтоимостьПР,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(СписокОС.ПериодРасчета, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокОС.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|		ИНАЧЕ СписокОС.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(СписокОС.ПериодРасчета, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокОС.АмортизацияПР + ЕСТЬNULL(Доначисление.СуммаПР, 0)
	|		ИНАЧЕ СписокОС.АмортизацияПР
	|	КОНЕЦ КАК АмортизацияПР,
	|
	|	0 КАК СтоимостьРеглИзменение,
	|	0 КАК СтоимостьПРИзменение,
	|	0 КАК СтоимостьНУИзменение,
	|
	|	0 КАК АмортизацияРеглИзменение,
	|	0 КАК АмортизацияПРИзменение,
	|	0 КАК АмортизацияНУИзменение,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|
	|	СписокОС.СтоимостьРегл 
	|		+ СписокОС.СтоимостьЦФ 
	|		- СписокОС.АмортизацияРегл
	|		- СписокОС.АмортизацияЦФ КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	СписокОС.СтоимостьПР - СписокОС.АмортизацияПР КАК СтоимостьДляВычисленияАмортизацииПР,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЛОЖЬ КАК КорректировкаСтоимостиУУ,
	|	ЛОЖЬ КАК КорректировкаСтоимостиБУ,
	|
	|	ЛОЖЬ КАК КорректировкаАмортизацииУУ,
	|	ЛОЖЬ КАК КорректировкаАмортизацииБУ,
	|
	|	ЛОЖЬ КАК ВключаетАмортизациюТекущегоМесяца,
	|	НЕОПРЕДЕЛЕНО КАК МетодПереоценки,
	|	ЛОЖЬ КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ЛОЖЬ КАК ЭтоИзменения
	|
	|ИЗ
	|	РасчетАмортизации_ЗаТекущийМесяц_БезИзмененийБУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетАмортизации_ЗаПрошлыйМесяцБУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|ГДЕ
	|	СписокОС.ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			СписокОС.ОсновноеСредство
	|		ИЗ
	|			ОтборОС КАК СписокОС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СписокОС.Регистратор) = ТИП(Документ.РазукомплектацияОС)
	|		И НЕ СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА 3
	|		КОГДА СписокОС.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|
	|	СписокОС.Период КАК Период,
	|	СписокОС.Регистратор КАК Регистратор,
	|	СписокОС.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(СписокОС.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).УчитыватьСтоимостьЛиквидационногоОбязательства КАК УчитыватьСтоимостьЛиквидационногоОбязательства,
	|	СписокОС.СтатьяРасходов КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|	0 КАК СуммаБУ,
	|	0 КАК СуммаПР,
	|
	|	0 КАК ОбесценениеУУ,
	|	0 КАК ОбесценениеБУ,
	|
	|	1 КАК Коэффициент,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	СписокОС.РесурсНазначенный КАК РесурсНазначенный,
	|	СписокОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизации,
	|
	|	0 КАК ЛиквидационнаяСтоимость,
	|	СписокОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьРегл,
	|
	|	СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
	|	СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
	|	СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ, 
	|
	|	СписокОС.ОстатокОбесцененияРегл КАК ОбесценениеРегл,
	|	0 КАК ОбесценениеУпр,
	|
	|	СписокОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
	|	СписокОС.ОтработанныхМесяцевПолныхЛет КАК ОтработанныхМесяцевПолныхЛет,
	|	СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	СписокОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	СписокОС.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	СписокОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
	|	СписокОС.ПолученПриРазукомплектацииОбъединении КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	СписокОС.СтоимостьРегл КАК СтоимостьРегл,
	|	СписокОС.СтоимостьЦФ КАК СтоимостьЦФ,
	|	СписокОС.СтоимостьПР КАК СтоимостьПР,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(СписокОС.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокОС.АмортизацияРегл + ЕСТЬNULL(Доначисление.СуммаБУ, 0)
	|		ИНАЧЕ СписокОС.АмортизацияРегл
	|	КОНЕЦ КАК АмортизацияРегл,
	|
	|	СписокОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(СписокОС.Период, МЕСЯЦ) = &НачалоМесяца
	|			ТОГДА СписокОС.АмортизацияПР + ЕСТЬNULL(Доначисление.СуммаПР, 0)
	|		ИНАЧЕ СписокОС.АмортизацияПР
	|	КОНЕЦ КАК АмортизацияПР,
	|
	|	СписокОС.СтоимостьРеглИзменение КАК СтоимостьРеглИзменение,
	|	СписокОС.СтоимостьПРИзменение КАК СтоимостьПРИзменение,
	|	0 КАК СтоимостьНУИзменение,
	|
	|	СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	СписокОС.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
	|	0 КАК АмортизацияНУИзменение,
	|
	|	0 КАК СтоимостьДляВычисленияАмортизации,
	|
	|	СписокОС.СтоимостьРегл 
	|		+ СписокОС.СтоимостьЦФ 
	|		- СписокОС.АмортизацияРегл
	|		- СписокОС.АмортизацияЦФ КАК СтоимостьДляВычисленияАмортизацииРегл,
	|
	|	СписокОС.СтоимостьПР - СписокОС.АмортизацияПР КАК СтоимостьДляВычисленияАмортизацииПР,
	|	СписокОС.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|
	|	СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|	СписокОС.ВариантПроводокПоОбесценениюВНА КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаСтоимостиУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВБУ, ЛОЖЬ) КАК КорректировкаСтоимостиБУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВУпрУчете, ЛОЖЬ) КАК КорректировкаАмортизацииУУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВБУ, ЛОЖЬ) КАК КорректировкаАмортизацииБУ,
	|
	|	ЕСТЬNULL(Корректировка.ВключаетАмортизациюТекущегоМесяца, ЛОЖЬ) КАК ВключаетАмортизациюТекущегоМесяца,
	|
	|	СписокОС.МетодПереоценки КАК МетодПереоценки,
	|	ЕСТЬNULL(Переоценка.ПереоценкаПоСправедливойСтоимости, ЛОЖЬ) КАК ПереоценкаПоСправедливойСтоимости,
	|
	|	ИСТИНА КАК ЭтоИзменения
	|
	|ИЗ
	|	СписокОССИзмененнымиПараметрами_БУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетАмортизации_ЗаПрошлыйМесяцБУ_Сгруппированная КАК Доначисление
	|		ПО Доначисление.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчетаИзменения_БУ КАК ПроверкаПараметровРасчета
	|		ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|			И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|		ПО Корректировка.Ссылка = СписокОС.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = СписокОС.Регистратор
	|
	|ГДЕ
	|	НЕ СписокОС.ЭтоДоначисление
	|	И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	АмортизацияИзменений = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПриИзмененииПараметров(
								РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить(), 
								РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетАмортизации.Период КАК ПериодРасчета,
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.Подразделение КАК Подразделение,
	|	РасчетАмортизации.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РасчетАмортизации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|	РасчетАмортизации.АналитикаРасходов КАК АналитикаРасходов,
	|	РасчетАмортизации.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	РасчетАмортизации.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|	РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|	РасчетАмортизации.СуммаПР КАК СуммаПР,
	|	РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|	РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	РасчетАмортизации.РесурсНазначенный КАК РесурсНазначенный,
	|	РасчетАмортизации.СтоимостьДляВычисленияАмортизацииРегл КАК СтоимостьДляВычисленияАмортизации,
	|	РасчетАмортизации.СтоимостьДляВычисленияПР КАК СтоимостьДляВычисленияПР,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА РасчетАмортизации.СтоимостьРегл
	|		ИНАЧЕ РасчетАмортизации.СтоимостьДляВычисленияАмортизацииРегл 
	|	КОНЕЦ КАК ОстаточнаяСтоимостьРегл,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА РасчетАмортизации.СтоимостьРегл * РасчетАмортизации.КоэффициентЦФБУ
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетАмортизации.СтоимостьДляВычисленияАмортизацииРегл * РасчетАмортизации.КоэффициентЦФБУ КАК ЧИСЛО (31, 2))
	|	КОНЕЦ КАК ОстаточнаяСтоимостьЦФ,                       
	|
	|	РасчетАмортизации.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
	|	ВЫРАЗИТЬ(РасчетАмортизации.ОстаточнаяСтоимостьПР * РасчетАмортизации.КоэффициентЦФБУ КАК ЧИСЛО (31, 2)) КАК ОстаточнаяСтоимостьПРЦФ, 
	|                      
	|	РасчетАмортизации.ОбесценениеРегл КАК ОстатокОбесцененияРегл,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.ПолученПриРазукомплектацииОбъединении
	|			ТОГДА РасчетАмортизации.СтоимостьДляВычисленияПР
	|		ИНАЧЕ РасчетАмортизации.ПРДляВычисленияАмортизации
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации,
	|
	|	РасчетАмортизации.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|
	|	ВЫБОР
	|		КОГДА РасчетАмортизации.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВерсияМетодаНачисления,
	|
	|	РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|	РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|	РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР
	|
	|ПОМЕСТИТЬ РасчетАмортизации_ЗаТекущийМесяц_СУчетомИзмененийБУ
	|
	|ИЗ
	|	&АмортизацияИзменений КАК РасчетАмортизации
	|
	|ГДЕ
	|	РасчетАмортизации.ЭтоИзменения
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("АмортизацияИзменений", АмортизацияИзменений);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьАмортизацию_ЗаТекущийМесяцНУ(ПараметрыРасчета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                          КАК ПериодРасчета,
	|	СписокОС.Организация                  КАК Организация,
	|	СписокОС.ОсновноеСредство             КАК ОсновноеСредство,
	|	СписокОС.Подразделение                КАК Подразделение,
	|	СписокОС.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|	СписокОС.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	СписокОС.СтатьяРасходов               КАК СтатьяРасходов,
	|	СписокОС.АналитикаРасходов            КАК АналитикаРасходов,
	|	СписокОС.ПодразделениеРасходов        КАК ПодразделениеРасходов,
	|	СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|	СписокОС.СпособОтраженияАмортизации   КАК СпособОтраженияАмортизации,
	|	СписокОС.ОстаточнаяСтоимостьНУ        КАК ОстаточнаяСтоимостьНУ,
	|	СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|	СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|	СписокОС.ПорядокУчетаБУ               КАК ПорядокУчетаБУ,
	|
	|	ВЫБОР 
	|		КОГДА СписокОС.ОстаточнаяСтоимостьНУ <= 0
	|			ТОГДА 0
	|		КОГДА (СписокОС.СуммаНУ > СписокОС.ОстаточнаяСтоимостьНУ
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьНУ - СписокОС.СуммаНУ < &МинимальнаяОстаточнаяСтоимостьРегл)
	|			ТОГДА СписокОС.ОстаточнаяСтоимостьНУ
	|		ИНАЧЕ СписокОС.СуммаНУ
	|	КОНЕЦ КАК СуммаНУ
	|
	|ПОМЕСТИТЬ РасчетАмортизации_ЗаТекущийМесяцНУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.Организация                  КАК Организация,
	|		СписокОС.ОсновноеСредство             КАК ОсновноеСредство,
	|		СписокОС.Подразделение                КАК Подразделение,
	|		СписокОС.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|		СписокОС.СтатьяРасходов               КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходов            КАК АналитикаРасходов,
	|		СписокОС.ПодразделениеРасходов        КАК ПодразделениеРасходов,
	|		СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокОС.СпособОтраженияАмортизации   КАК СпособОтраженияАмортизации,
	|		СписокОС.ОстаточнаяСтоимостьНУ        КАК ОстаточнаяСтоимостьНУ,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|		СписокОС.ПорядокУчетаБУ               КАК ПорядокУчетаБУ,
	|
	|		&СуммаАмортизацииНУ КАК СуммаНУ
	|	ИЗ
	|		СписокОССПараметрами_НУ КАК СписокОС
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПроверкаПараметровРасчета_НУ КАК ПроверкаПараметровРасчета
	|			ПО ПроверкаПараметровРасчета.ОбъектУчета = СписокОС.ОсновноеСредство
	|				И ПроверкаПараметровРасчета.Организация = СписокОС.Организация
	|	ГДЕ
	|		СписокОС.НачислятьАмортизациюНУ
	|		И ПроверкаПараметровРасчета.ОбъектУчета ЕСТЬ NULL
	|
	|	) КАК СписокОС
	|
	|ГДЕ
	|	СписокОС.СуммаНУ <> 0";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииНУ", ТекстЗапросаСуммаАмортизацииНУ());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить();
	
КонецПроцедуры
	
Процедура ОбъединитьРасчетАмортизации(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Амортизация.ПериодРасчета КАК ПериодРасчета,
	|	Амортизация.Организация КАК Организация,
	|	Амортизация.Подразделение КАК Подразделение,
	|	Амортизация.ОсновноеСредство КАК ОсновноеСредство,
	|	ОбесценениеВНА.ЕГДС КАК ЕГДС,
	|	Амортизация.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Амортизация.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияАмортизации.СтатьяРасходов
	|		ИНАЧЕ Амортизация.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходов,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.СтатьяРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				И СпособыОтраженияАмортизации.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|			ТОГДА СпособыОтраженияАмортизации.АналитикаРасходов
	|		ИНАЧЕ Амортизация.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Амортизация.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, Амортизация.ПодразделениеРасходов) 
	|	КОНЕЦ КАК КорПодразделение,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|			ТОГДА Амортизация.НаправлениеДеятельности
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.НаправлениеДеятельности, Амортизация.НаправлениеДеятельностиРасходов) 
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &ОбесценениеБУ
	|		ИНАЧЕ Амортизация.ОбесценениеБУ
	|	КОНЕЦ КАК ОбесценениеБУ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &ОбесценениеЦФ
	|		ИНАЧЕ Амортизация.ОбесценениеЦФ
	|	КОНЕЦ КАК ОбесценениеЦФ,
	|
	|	ВЫБОР
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &СуммаБУ
	|		КОГДА Амортизация.СуммаБУ > (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) > 0
	|			ТОГДА (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|		КОГДА Амортизация.СуммаБУ < (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Амортизация.СуммаБУ
	|	КОНЕЦ КАК СуммаБУ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &СуммаНУ_регл
	|		ИНАЧЕ Амортизация.СуммаНУ
	|	КОНЕЦ КАК СуммаНУ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &СуммаПР_регл
	|		ИНАЧЕ Амортизация.СуммаПР
	|	КОНЕЦ КАК СуммаПР,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &СуммаЦФ
	|		КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьЦФ
	|		КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Амортизация.СуммаЦФ
	|	КОНЕЦ КАК СуммаЦФ,
	|
	|	0 КАК СуммаНУЦФ,
	|
	|	ВЫБОР 
	|		КОГДА НЕ Амортизация.СпособОтраженияАмортизации В (&ПустыеСпособыОтраженияАмортизации) 
	|				И НЕ СпособыОтраженияАмортизации.СпособОтраженияАмортизации ЕСТЬ NULL
	|			ТОГДА &СуммаПРЦФ_регл
	|		ИНАЧЕ Амортизация.СуммаПРЦФ
	|	КОНЕЦ КАК СуммаПРЦФ,
	|
	|	ВЫБОР
	|		КОГДА НЕ СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов ЕСТЬ NULL
	|				И СпособыОтраженияАмортизации.ПередаватьРасходыВДругуюОрганизацию
	|				И СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов <> Амортизация.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Амортизация.ПередаватьРасходыВДругуюОрганизацию
	|	КОНЕЦ КАК ПередаватьРасходыВДругуюОрганизацию,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов, Амортизация.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл)
	|	КОНЕЦ КАК ПорядокУчетаВНА,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаУУ.ВариантПроводокПоОбесценениюВНА, ЗНАЧЕНИЕ(Перечисление.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения)) КАК ВариантПроводокПоОбесценениюВНА,
	|
	|	Амортизация.НачислятьИзнос КАК НачислятьИзнос,
	|	Амортизация.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	Амортизация.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|	Амортизация.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	Амортизация.ОстатокОбесцененияРегл КАК ОстатокОбесцененияРегл,
	|	Амортизация.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|	Амортизация.ВерсияМетодаНачисленияБУ КАК ВерсияМетодаНачисленияБУ,
	|	Амортизация.ЭтоДоначисление КАК ЭтоДоначисление
	|
	|ПОМЕСТИТЬ РасчетАмортизации_БУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокОС.ПериодРасчета              КАК ПериодРасчета,
	|		СписокОС.Организация                КАК Организация,
	|		ВЫРАЗИТЬ(СписокОС.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		СписокОС.Подразделение              КАК Подразделение,
	|		СписокОС.ОсновноеСредство           КАК ОсновноеСредство,
	|		СписокОС.ГруппаФинансовогоУчета     КАК ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|		СписокОС.СтатьяРасходов             КАК СтатьяРасходов,
	|		СписокОС.АналитикаРасходов          КАК АналитикаРасходов,
	|		СписокОС.ПодразделениеРасходов      КАК ПодразделениеРасходов,
	|		СписокОС.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|		СписокОС.СпособОтраженияАмортизации КАК СпособОтраженияАмортизации,
	|
	|		СУММА(СписокОС.СуммаБУ - ВЫРАЗИТЬ(СписокОС.СуммаБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаБУ,
	|
	|		СУММА(СписокОС.СуммаНУ - ВЫРАЗИТЬ(СписокОС.СуммаНУ * ЕСТЬNULL(СписокОС.КоэффициентЦФНУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаНУ,
	|
	|		СУММА(СписокОС.СуммаПР) КАК СуммаПР,
	|
	|		СУММА(ВЫРАЗИТЬ(СписокОС.СуммаБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаЦФ,
	|
	|		СУММА(ВЫРАЗИТЬ(СписокОС.СуммаБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК СуммаПРЦФ,
	|
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию  КАК ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов        КАК ОрганизацияПолучательРасходов,
	|
	|		СУММА(СписокОС.ОбесценениеБУ - ВЫРАЗИТЬ(СписокОС.ОбесценениеБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК ОбесценениеБУ,
	|		СУММА(ВЫРАЗИТЬ(СписокОС.ОбесценениеБУ * ЕСТЬNULL(СписокОС.КоэффициентЦФБУ, 0) КАК ЧИСЛО(31,2))) КАК ОбесценениеЦФ,
	|
	|		СписокОС.НачислятьИзнос КАК НачислятьИзнос,
	|		МАКСИМУМ(СписокОС.РесурсВыработанныйЗаПрошлыйПериод) КАК РесурсВыработанныйЗаПрошлыйПериод,
	|		МАКСИМУМ(СписокОС.РесурсВыработанныйЗаТекущийПериод) КАК РесурсВыработанныйЗаТекущийПериод,
	|		МАКСИМУМ(СписокОС.СтоимостьДляВычисленияАмортизации) КАК СтоимостьДляВычисленияАмортизации,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьРегл) КАК ОстаточнаяСтоимостьРегл,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьЦФ) КАК ОстаточнаяСтоимостьЦФ,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьПР) КАК ОстаточнаяСтоимостьПР,
	|		МАКСИМУМ(СписокОС.ОстаточнаяСтоимостьПРЦФ) КАК ОстаточнаяСтоимостьПРЦФ,
	|		МАКСИМУМ(СписокОС.ОстатокОбесцененияРегл) КАК ОстатокОбесцененияРегл,
	|		МАКСИМУМ(СписокОС.ПорядокНачисленияАмортизацииБУ) КАК ПорядокНачисленияАмортизацииБУ,
	|		МАКСИМУМ(СписокОС.ВерсияМетодаНачисленияБУ) КАК ВерсияМетодаНачисленияБУ,
	|		СписокОС.ЭтоДоначисление КАК ЭтоДоначисление
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.ПодразделениеРасходов        КАК ПодразделениеРасходов,
	|			РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|			РасчетАмортизации.СпособОтраженияАмортизации   КАК СпособОтраженияАмортизации,
	|
	|			РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|
	|			РасчетАмортизации.ОстаточнаяСтоимостьРегл           КАК ОстаточнаяСтоимостьРегл,
	|			РасчетАмортизации.ОстаточнаяСтоимостьЦФ             КАК ОстаточнаяСтоимостьЦФ,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПР             КАК ОстаточнаяСтоимостьПР,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ           КАК ОстаточнаяСтоимостьПРЦФ,
	|			РасчетАмортизации.ОстатокОбесцененияРегл            КАК ОстатокОбесцененияРегл,
	|
	|			РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|			РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|
	|			ВЫБОР
	|				КОГДА РасчетАмортизации.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|					ТОГДА РасчетАмортизации.СуммаПР
	|
	|				КОГДА РасчетАмортизации.СтоимостьДляВычисленияПР <> 0
	|
	|					ТОГДА ВЫБОР
	|							КОГДА &СуммаПР_1 > РасчетАмортизации.ОстаточнаяСтоимостьПР
	|										И РасчетАмортизации.ОстаточнаяСтоимостьПР >= 0
	|									ИЛИ &СуммаПР_1 < РасчетАмортизации.ОстаточнаяСтоимостьПР
	|										И РасчетАмортизации.ОстаточнаяСтоимостьПР <= 0
	|								ТОГДА РасчетАмортизации.ОстаточнаяСтоимостьПР
	|
	|							ИНАЧЕ &СуммаПР_1
	|						КОНЕЦ
	|
	|				ИНАЧЕ 0
	|
	|			КОНЕЦ КАК СуммаПР,
	|
	|			0 КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			РасчетАмортизации.ВерсияМетодаНачисления КАК ВерсияМетодаНачисленияБУ,
	|			ЛОЖЬ КАК ЭтоДоначисление
	|
	|		ИЗ
	|			РасчетАмортизации_ЗаТекущийМесяц_БезИзмененийБУ КАК РасчетАмортизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.ПодразделениеРасходов        КАК ПодразделениеРасходов,
	|			РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|			РасчетАмортизации.СпособОтраженияАмортизации   КАК СпособОтраженияАмортизации,
	|
	|			РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|
	|			РасчетАмортизации.ОстаточнаяСтоимостьРегл           КАК ОстаточнаяСтоимостьРегл,
	|			РасчетАмортизации.ОстаточнаяСтоимостьЦФ             КАК ОстаточнаяСтоимостьЦФ,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПР             КАК ОстаточнаяСтоимостьПР,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ           КАК ОстаточнаяСтоимостьПРЦФ,
	|			РасчетАмортизации.ОстатокОбесцененияРегл            КАК Обесценение,
	|
	|			РасчетАмортизации.ОбесценениеБУ КАК ОбесценениеБУ,
	|
	|			РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|			РасчетАмортизации.СуммаПР КАК СуммаПР,
	|
	|			0 КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			РасчетАмортизации.ВерсияМетодаНачисления КАК ВерсияМетодаНачисленияБУ,
	|			ЛОЖЬ КАК ЭтоДоначисление
	|
	|		ИЗ
	|			РасчетАмортизации_ЗаТекущийМесяц_СУчетомИзмененийБУ КАК РасчетАмортизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.ПодразделениеРасходов        КАК ПодразделениеРасходов,
	|			РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|			РасчетАмортизации.СпособОтраженияАмортизации   КАК СпособОтраженияАмортизации,
	|
	|			РасчетАмортизации.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			РасчетАмортизации.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
	|			РасчетАмортизации.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|
	|			РасчетАмортизации.ОстаточнаяСтоимостьРегл           КАК ОстаточнаяСтоимостьРегл,
	|			РасчетАмортизации.ОстаточнаяСтоимостьЦФ             КАК ОстаточнаяСтоимостьЦФ,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПР             КАК ОстаточнаяСтоимостьПР,
	|			РасчетАмортизации.ОстаточнаяСтоимостьПРЦФ           КАК ОстаточнаяСтоимостьПРЦФ,
	|			0                                                   КАК ОстатокОбесцененияРегл,
	|
	|			0 КАК ОбесценениеБУ,
	|
	|			РасчетАмортизации.СуммаБУ КАК СуммаБУ,
	|			РасчетАмортизации.СуммаПР КАК СуммаПР,
	|
	|			0 КАК СуммаНУ,
	|			
	|			РасчетАмортизации.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
	|			РасчетАмортизации.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
	|			РасчетАмортизации.КоэффициентЦФПР КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			РасчетАмортизации.ПорядокНачисленияАмортизацииБУ КАК ПорядокНачисленияАмортизацииБУ,
	|			РасчетАмортизации.ВерсияМетодаНачисления КАК ВерсияМетодаНачисленияБУ,
	|			ИСТИНА КАК ЭтоДоначисление
	|
	|		ИЗ
	|			РасчетАмортизации_ЗаПрошлыйМесяцБУ КАК РасчетАмортизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ПериодРасчета                КАК ПериодРасчета,
	|			РасчетАмортизации.Организация                  КАК Организация,
	|			РасчетАмортизации.Подразделение                КАК Подразделение,
	|			РасчетАмортизации.ОсновноеСредство             КАК ОсновноеСредство,
	|			РасчетАмортизации.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|			РасчетАмортизации.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|			РасчетАмортизации.СтатьяРасходов               КАК СтатьяРасходов,
	|			РасчетАмортизации.АналитикаРасходов            КАК АналитикаРасходов,
	|			РасчетАмортизации.ПодразделениеРасходов        КАК ПодразделениеРасходов,
	|			РасчетАмортизации.НаправлениеДеятельностиРасходов КАК НаправлениеДеятельностиРасходов,
	|			РасчетАмортизации.СпособОтраженияАмортизации   КАК СпособОтраженияАмортизации,
	|
	|			0 КАК РесурсВыработанныйЗаПрошлыйПериод,
	|			0 КАК РесурсВыработанныйЗаТекущийПериод,
	|			0 КАК СтоимостьДляВычисленияАмортизации,
	|
	|			0 КАК ОстаточнаяСтоимостьРегл,
	|			0 КАК ОстаточнаяСтоимостьЦФ,
	|			0 КАК ОстаточнаяСтоимостьПР,
	|			0 КАК ОстаточнаяСтоимостьПРЦФ,
	|			0 КАК ОстатокОбесцененияРегл,
	|
	|			0 КАК ОбесценениеБУ,
	|
	|			0 КАК СуммаБУ,
	|			0 КАК СуммаПР,
	|			РасчетАмортизации.СуммаНУ КАК СуммаНУ,
	|			
	|			0 КАК КоэффициентЦФБУ,
	|			0 КАК КоэффициентЦФНУ,
	|			0 КАК КоэффициентЦФПР,
	|
	|			РасчетАмортизации.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	|			РасчетАмортизации.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	|			РасчетАмортизации.ПорядокУчетаБУ = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ) КАК НачислятьИзнос,
	|			НЕОПРЕДЕЛЕНО КАК ПорядокНачисленияАмортизацииБУ,
	|			0 КАК ВерсияМетодаНачисленияБУ,
	|			ЛОЖЬ КАК ЭтоДоначисление
	|
	|		ИЗ
	|			РасчетАмортизации_ЗаТекущийМесяцНУ КАК РасчетАмортизации
	|
	|		) КАК СписокОС
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокОС.ПериодРасчета,
	|		СписокОС.Организация,
	|		ВЫРАЗИТЬ(СписокОС.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		СписокОС.Подразделение,
	|		СписокОС.ОсновноеСредство,
	|		СписокОС.ГруппаФинансовогоУчета,
	|		СписокОС.НаправлениеДеятельности,
	|		СписокОС.СтатьяРасходов,
	|		СписокОС.АналитикаРасходов,
	|		СписокОС.ПодразделениеРасходов,
	|		СписокОС.НаправлениеДеятельностиРасходов,
	|		СписокОС.СпособОтраженияАмортизации,
	|		СписокОС.ПередаватьРасходыВДругуюОрганизацию,
	|		СписокОС.ОрганизацияПолучательРасходов,
	|		СписокОС.НачислятьИзнос,
	|		СписокОС.ЭтоДоначисление
	|
	|	) КАК Амортизация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизацииБУ КАК СпособыОтраженияАмортизации
	|		ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = Амортизация.СпособОтраженияАмортизации)
	|			И (НЕ СпособыОтраженияАмортизации.ЭтоАмортизационнаяПремия)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Организация = Амортизация.ГоловнаяОрганизация
	|			И УчетнаяПолитикаБУ.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Организация = Амортизация.ГоловнаяОрганизация
	|			И УчетнаяПолитикаУУ.Период = &КонецМесяца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбесценениеВНА КАК ОбесценениеВНА
	|		ПО ОбесценениеВНА.Организация = Амортизация.Организация
	|			И ОбесценениеВНА.ОсновноеСредство = Амортизация.ОсновноеСредство
	|";
	
	ПолеСумма = 
	"ВЫБОР
	|	КОГДА Амортизация.СуммаБУ > (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) > 0
	|			ТОГДА (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|	КОГДА Амортизация.СуммаБУ < (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ)
	|				И (Амортизация.ОстаточнаяСтоимостьРегл - Амортизация.ОстаточнаяСтоимостьЦФ) <= 0
	|			ТОГДА 0
	|	ИНАЧЕ Амортизация.СуммаБУ
	|КОНЕЦ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаБУ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации(ПолеСумма));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаНУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПР_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаПР"));
	
	ПолеСумма = 
	"ВЫБОР
	|	КОГДА Амортизация.СуммаЦФ > Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ > 0
	|			ТОГДА Амортизация.ОстаточнаяСтоимостьЦФ
	|	КОГДА Амортизация.СуммаЦФ < Амортизация.ОстаточнаяСтоимостьЦФ
	|				И Амортизация.ОстаточнаяСтоимостьЦФ <= 0
	|			ТОГДА 0
	|	ИНАЧЕ Амортизация.СуммаЦФ
	|КОНЕЦ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаЦФ", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации(ПолеСумма));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПРЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаПРЦФ"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеБУ",  ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.ОбесценениеБУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбесценениеЦФ",  ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.ОбесценениеЦФ"));

	ПолеСумма = 
	"ВЫРАЗИТЬ(РасчетАмортизации.ПРДляВычисленияАмортизации 
	|			* РасчетАмортизации.СуммаБУ 
	|			/ РасчетАмортизации.СтоимостьДляВычисленияПР КАК ЧИСЛО(31,2))";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПР_1",  ПолеСумма);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьАмортизационнуюПремию(ПараметрыРасчета)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
	|	СписокОС.Организация КАК Организация,
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СписокОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СписокОС.Подразделение КАК Подразделение,
	|	СписокОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СписокОС.Арендатор КАК Арендатор,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.СтатьяРасходов, СписокОС.СтатьяРасходовАмортизационнойПремии) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.АналитикаРасходов, СписокОС.АналитикаРасходовАмортизационнойПремии) КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, СписокОС.ПодразделениеАмортизационнойПремии) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СписокОС.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.Подразделение, СписокОС.ПодразделениеАмортизационнойПремии) 
	|	КОНЕЦ КАК КорПодразделение,
	|
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(СпособыОтраженияАмортизации.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета, ЛОЖЬ)
	|			ТОГДА СписокОС.НаправлениеДеятельности
	|		ИНАЧЕ ЕСТЬNULL(СпособыОтраженияАмортизации.НаправлениеДеятельности, СписокОС.НаправлениеДеятельностиАмортизационнойПремии) 
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ПередаватьРасходыВДругуюОрганизацию, СписокОС.ПередаватьРасходыВДругуюОрганизацию) КАК ПередаватьРасходыВДругуюОрганизацию,
	|	ЕСТЬNULL(СпособыОтраженияАмортизации.ОрганизацияПолучательРасходов, СписокОС.ОрганизацияПолучательРасходов) КАК ОрганизацияПолучательРасходов,
	|
	|	ВЫБОР 
	|		КОГДА НЕ СписокОС.СпособОтраженияАмортизационнойПремии В (&ПустыеСпособыОтраженияАмортизации) ТОГДА
	|			&АмортизационнаяПремия
	|		ИНАЧЕ СписокОС.АмортизационнаяПремия
	|	КОНЕЦ КАК Сумма
	|
	|ПОМЕСТИТЬ АмортизационнаяПремия
	|
	|ИЗ
	|	СписокОССПараметрами_НУ КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияАмортизацииБУ КАК СпособыОтраженияАмортизации
	|		ПО (СпособыОтраженияАмортизации.СпособОтраженияАмортизации = СписокОС.СпособОтраженияАмортизационнойПремии)
	|			И (СпособыОтраженияАмортизации.ЭтоАмортизационнаяПремия)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
	|		ПО ПакетыАмортизацииОС.Организация = СписокОС.Организация
	|			И ПакетыАмортизацииОС.ОсновноеСредство = СписокОС.ОсновноеСредство
	|
	|ГДЕ
	|	СписокОС.АмортизационнаяПремия <> 0
	|	И СписокОС.ОсновноеСредство В (
	|		ВЫБРАТЬ
	|			РасчетАмортизации.ОсновноеСредство
	|		ИЗ
	|			РасчетАмортизации_ЗаТекущийМесяцНУ КАК РасчетАмортизации
	|		ГДЕ
	|			РасчетАмортизации.СуммаНУ > 0)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&АмортизационнаяПремия", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("СписокОС.АмортизационнаяПремия"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	Запрос.Выполнить();
	
	ОбщегоНазначенияУТ.ДобавитьИдентификаторыВоВременнуюТаблицу("АмортизационнаяПремия", ПараметрыРасчета.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ВернутьПараметрыРасчета(ПараметрыРасчета)

	Если НЕ ПараметрыРасчета.ВернутьПараметрыРасчета Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство                             КАК ВнеоборотныйАктив,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииБУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МетодНачисленияБУ,
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.СрокИспользованияДляВычисленияАмортизации
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СрокИспользованияБУ,
	|	ПараметрыАмортизации.КоэффициентПериода                           КАК КоэффициентПериода,
	|	ПараметрыАмортизации.СтоимостьДляВычисленияАмортизации            КАК СтоимостьБУ,
	|	ПараметрыАмортизации.ОбъемВыработки                               КАК ВыработкаЗаМесяцБУ,
	|	ПараметрыАмортизации.ОбъемПродукцииРаботДляВычисленияАмортизации  КАК ОбъемПродукцииБУ,
	|	ПараметрыАмортизации.КоэффициентАмортизацииБУ                     КАК КоэффициентАмортизацииБУ,
	|	ПараметрыАмортизации.КоэффициентУскоренияБУ                       КАК КоэффициентУскоренияБУ,
	|	ПараметрыАмортизации.СтоимостьНаНачалоГода                        КАК СтоимостьНаНачалоГодаБУ,
	|	(ПараметрыАмортизации.ЧислоЛетПользования
	|		- ПараметрыАмортизации.ЧислоПрошедшихЛет) * 12                КАК ОставшийсяСрокИспользования,
	|	ПараметрыАмортизации.ЧислоПрошедшихЛет * 12                       КАК ФактическийСрокИспользования,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюБУ 
	|			ТОГДА ПараметрыАмортизации.ПРДляВычисленияАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПРДляВычисленияАмортизации
	|
	|ИЗ
	|	СписокОССПараметрами_БУ КАК ПараметрыАмортизации
	|
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизациюБУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство                             КАК ВнеоборотныйАктив,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииНУ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК МетодНачисленияНУ,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.СрокПолезногоИспользованияНУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияНУ,
	|
	|	ВЫБОР
	|		КОГДА НЕ ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА 0
	|		КОГДА ПараметрыАмортизации.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный) 
	|			ТОГДА ПараметрыАмортизации.СтоимостьНУНачальныйОстаток 
	|					- ПараметрыАмортизации.АмортизационнаяПремия 
	|					- ПараметрыАмортизации.АмортизацияПриПереходеКЛинейномуМетоду
	|		ИНАЧЕ ПараметрыАмортизации.СтоимостьНУНачальныйОстаток 
	|				- ПараметрыАмортизации.АмортизационнаяПремия 
	|				- ПараметрыАмортизации.АмортизацияНУНачальныйОстаток                    
	|	КОНЕЦ КАК СтоимостьНУ,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.СпециальныйКоэффициентНУ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентНУ,
	|
	|	ВЫБОР 
	|		КОГДА ПараметрыАмортизации.НачислятьАмортизациюНУ 
	|			ТОГДА ПараметрыАмортизации.НормаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НормаАмортизацииНУ
	|
	|ИЗ
	|	СписокОССПараметрами_НУ КАК ПараметрыАмортизации
	|
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизациюНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&КонецМесяца                                                      КАК Дата,
	|	ПараметрыАмортизации.Организация                                  КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство                             КАК ВнеоборотныйАктив,
	
	// УУ
	|	ПараметрыАмортизации.МетодНачисленияАмортизации                   КАК МетодНачисленияУУ,
	|	ПараметрыАмортизации.ОстаточнаяСтоимость                          КАК СтоимостьУУ,
	|	ПараметрыАмортизации.ЛиквидационнаяСтоимость                      КАК ЛиквидационнаяСтоимость,
	|	ПараметрыАмортизации.РесурсНазначенный                            КАК СрокИспользованияУУ,
	|	ПараметрыАмортизации.РесурсВыработанныйЗаТекущийПериод            КАК РесурсВыработанныйЗаТекущийПериод,
	|	ПараметрыАмортизации.РесурсВыработанныйЗаПрошлыйПериод            КАК РесурсВыработанныйЗаПрошлыйПериод,
	|	ПараметрыАмортизации.ОтработанныхМесяцевПолныхЛет                 КАК ОтработанныхМесяцевПолныхЛет,
	|	ПараметрыАмортизации.КоэффициентУскорения                         КАК КоэффициентУскоренияУУ
	|ИЗ
	|	СписокОССПараметрами_УУ КАК ПараметрыАмортизации
	|ГДЕ
	|	ПараметрыАмортизации.НачислятьАмортизацию";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПараметрыРасчета.Период));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыАмортизации_БУ = Результат[0].Выгрузить();
	ПараметрыАмортизации_НУ = Результат[1].Выгрузить();
	ПараметрыАмортизации_УУ = Результат[2].Выгрузить();

	СписокПараметровАмортизации = ПолучитьИзВременногоХранилища(ПараметрыРасчета.АдресПараметровРасчета);
	
	Если СписокПараметровАмортизации = Неопределено Тогда
		СписокПараметровАмортизации = Новый Структура;
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_БУ", ПараметрыАмортизации_БУ);
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_НУ", ПараметрыАмортизации_НУ);
		СписокПараметровАмортизации.Вставить("ПараметрыАмортизации_УУ", ПараметрыАмортизации_УУ);
	Иначе
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_БУ, ПараметрыАмортизации_БУ);
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_НУ, ПараметрыАмортизации_НУ);
		ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(СписокПараметровАмортизации.ПараметрыАмортизации_УУ, ПараметрыАмортизации_УУ);
	КонецЕсли; 
	
	ПоместитьВоВременноеХранилище(СписокПараметровАмортизации, ПараметрыРасчета.АдресПараметровРасчета);
	
КонецПроцедуры

// 
// Параметры:
//  ПараметрыТекстаЗапроса - см. ПараметрыТекстаЗапросаСуммаАмортизацииБУ
//  ПараметрыРасчета - см. РасчетАмортизацииОС.ПараметрыВыполнения
// 
// Возвращаемое значение:
//  Строка - Текст запроса сумма амортизации БУ
Функция ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса, ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокОС.НачислятьАмортизациюБУ
	|
	|		ТОГДА 0
	|";
	
	Если ПараметрыРасчета = Неопределено
		ИЛИ ПараметрыРасчета.ПрименяетсяФСБУ6 Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И ((СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - СписокОС.ЛиквидационнаяСтоимость - &ОстатокОбесценения) = 0 
		|				ИЛИ (СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения) <= 0
		|						И (СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - &ОстатокОбесценения) >= 0
		|				ИЛИ (СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - &ОстатокОбесценения) < 0
		|						И (НЕ СписокОС.ОсновноеСредство.УчитыватьСтоимостьЛиквидационногоОбязательства
		|							ИЛИ НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|							ИЛИ НЕ СписокОС.МетодНачисленияАмортизацииБУ В (
		|								ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
		|								ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)))
		|				ИЛИ СписокОС.РесурсВыработанныйЗаТекущийПериод <= 0)
		|
		|		ТОГДА 0
		|
		|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|				И (СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.РесурсВыработанныйЗаТекущийПериод) >= СписокОС.РесурсНазначенный
		|
		|		ТОГДА СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения
		|
			// Линейный, ПропорциональноОбъемуПродукции
		|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ В (
		|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
		|					ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)) 
		|
		|		ТОГДА ВЫБОР 
		|			КОГДА СписокОС.ЭтоДоначисление
		|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&СтоимостьДляВычисленияАмортизации - &СуммаДоначисления КАК ЧИСЛО(20,8))
		|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8)) 
		|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|
		|			КОГДА (СписокОС.ОстаточнаяСтоимостьРегл - &СуммаДоначисления - &ОстатокОбесценения) < 0
		|					И СписокОС.ОсновноеСредство.УчитыватьСтоимостьЛиквидационногоОбязательства
		|
		|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&СтоимостьДляВычисленияАмортизации - &СуммаДоначисления - &ОстатокОбесценения КАК ЧИСЛО(20,8)) 
		|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
		|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|
		|			ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(&СтоимостьДляВычисленияАмортизации - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения КАК ЧИСЛО(20,8)) 
		|								* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
		|								/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|		КОНЕЦ
		|
			// УменьшаемогоОстатка
		|	КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка) 
		|   
		|		ТОГДА ВЫБОР
		|				КОГДА (СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.КоэффициентУскоренияБУ - 1) <> 0
		|					ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&СтоимостьДляВычисленияАмортизации - &СуммаДоначисления - &ЛиквидационнаяСтоимость - &ОстатокОбесценения КАК ЧИСЛО(20,8))
		|									* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
		|									* ВЫРАЗИТЬ(СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(20,8))
		|									/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.КоэффициентУскоренияБУ - 1 КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|
		|";
	
	КонецЕсли;
	
	Если ПараметрыРасчета = Неопределено
		ИЛИ ПараметрыРасчета.НеПрименяетсяФСБУ6 Тогда
			
		ТекстЗапроса = ТекстЗапроса + 
			// Линейный
		"	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.ОстаточнаяСтоимостьРегл <= 0 
		|
		|		ТОГДА 0
		|
		|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный)
		|		ТОГДА ВЫБОР 
		|			КОГДА СписокОС.СрокИспользованияДляВычисленияАмортизации = 0
		|				ТОГДА 0
		|			КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) 
		|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации КАК ЧИСЛО(20,8))
		|								/ ВЫРАЗИТЬ(СписокОС.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|			ИНАЧЕ
		|				ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * 12 КАК ЧИСЛО(20,8))
		|						/ ВЫРАЗИТЬ(СписокОС.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(20,8)) 
		|						* ВЫРАЗИТЬ(СписокОС.КоэффициентПериода КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|		КОНЕЦ
		|   
			// ПропорциональноОбъемуПродукции
		|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
		|		ТОГДА ВЫБОР 
		|			КОГДА СписокОС.ОбъемВыработки <> 0 
		|					И СписокОС.ОбъемПродукцииРаботДляВычисленияАмортизации <> 0 
		|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации КАК ЧИСЛО(20,8))
		|								* ВЫРАЗИТЬ(СписокОС.ОбъемВыработки КАК ЧИСЛО(20,8))
		|								/ ВЫРАЗИТЬ(СписокОС.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|
			// ПоЕНАОФ
		|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ)
		|		ТОГДА ВЫБОР 
		|			КОГДА СписокОС.КоэффициентАмортизацииБУ <> 0 ТОГДА
		|				ВЫБОР 
		|					КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) 
		|						ТОГДА ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * СписокОС.КоэффициентАмортизацииБУ / 100 / 12 КАК ЧИСЛО(31,2))
		|					ИНАЧЕ
		|						ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * СписокОС.КоэффициентАмортизацииБУ / 100 * СписокОС.КоэффициентПериода КАК ЧИСЛО(31,2))
		|				КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|
			// ПоЕНАОФНа1000кмПробега
		|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега) ТОГДА
		|		ВЫБОР 
		|			КОГДА СписокОС.ОбъемВыработки <> 0 И СписокОС.КоэффициентАмортизацииБУ <> 0 
		|				ТОГДА ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * СписокОС.ОбъемВыработки / 1000 * СписокОС.КоэффициентАмортизацииБУ / 100 КАК ЧИСЛО(31,2))
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|
			// УменьшаемогоОстатка
		|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка) ТОГДА
		|		ВЫБОР 
		|			КОГДА СписокОС.СрокИспользованияДляВычисленияАмортизации = 0
		|				ТОГДА 0
		|			КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) ТОГДА
		|				ВЫБОР
		|					КОГДА ГОД(СписокОС.ДатаПоследнегоИзменения) = ГОД(&КонецМесяца) 
		|						ТОГДА ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации 
		|										/ СписокОС.СрокИспользованияДляВычисленияАмортизации 
		|										* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
		|					ИНАЧЕ
		|						ВЫРАЗИТЬ(СписокОС.СтоимостьНаНачалоГода 
		|									/ СписокОС.СрокИспользованияДляВычисленияАмортизации 
		|									* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
		|				КОНЕЦ 
		|			ИНАЧЕ
		|				ВЫБОР
		|					КОГДА ГОД(СписокОС.ДатаПоследнегоИзменения) = ГОД(&КонецМесяца) ТОГДА
		|						ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации 
		|							/ СписокОС.СрокИспользованияДляВычисленияАмортизации * 12 
		|							* СписокОС.КоэффициентПериода 
		|							* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
		|					ИНАЧЕ
		|						ВЫРАЗИТЬ(СписокОС.СтоимостьНаНачалоГода 
		|							/ СписокОС.СрокИспользованияДляВычисленияАмортизации * 12 
		|							* СписокОС.КоэффициентПериода 
		|							* СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(31,2))
		|				КОНЕЦ
		|		КОНЕЦ 
		|
			// ПоСуммеЧиселЛетИспользования
		|	КОГДА НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|			И СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования) ТОГДА
		|		ВЫБОР 
		|			КОГДА СписокОС.ГрафикАмортизации = ЗНАЧЕНИЕ(Справочник.ГодовыеГрафикиАмортизацииОС.ПустаяСсылка) ТОГДА
		|				ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * &ЧислоЛетОставшихся / &СуммаЧиселЛет / 12 КАК ЧИСЛО(31,2))
		|			ИНАЧЕ
		|				ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации * &ЧислоЛетОставшихся / &СуммаЧиселЛет * СписокОС.КоэффициентПериода КАК ЧИСЛО(31,2))
		|		КОНЕЦ
		|
		|";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "КОНЕЦ";
	 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЧислоЛетОставшихся", "(СписокОС.ЧислоЛетПользования - СписокОС.ЧислоПрошедшихЛет)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаЧиселЛет", "((СписокОС.ЧислоЛетПользования + 1) * СписокОС.ЧислоЛетПользования / 2)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтоимостьДляВычисленияАмортизации", ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЛиквидационнаяСтоимость", ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтоимостьНаНачалоГода", ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаДоначисления", ПараметрыТекстаЗапроса.ТекстСуммаДоначисления);
	
	ТекстОбесценение = 
		СтрЗаменить(
			"(ВЫБОР КОГДА СписокОС.ВариантПроводокПоОбесценениюВНА = &ДоначислятьКорректировкуОбесценения ТОГДА &ОстатокОбесценения ИНАЧЕ 0 КОНЕЦ)", 
			"&ОстатокОбесценения",
			ПараметрыТекстаЗапроса.ТекстОбесценение);			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстатокОбесценения", ТекстОбесценение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаСуммаАмортизацииНУ() Экспорт

	ТекстЗапроса =
	"ВЫБОР 
	|	КОГДА НЕ СписокОС.НачислятьАмортизациюНУ
	|		ТОГДА 0
	|
	|	КОГДА СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Линейный)
	|		ТОГДА ВЫБОР 
	|			КОГДА (СписокОС.СрокПолезногоИспользованияНУ - СписокОС.ФактическийСрокПриПереходеКЛинейномуМетоду) > 0 
	|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьНУНачальныйОстаток - СписокОС.АмортизационнаяПремия - СписокОС.АмортизацияПриПереходеКЛинейномуМетоду КАК ЧИСЛО(20,8))
	|								* ВЫРАЗИТЬ(СписокОС.СпециальныйКоэффициентНУ КАК ЧИСЛО(20,8)) 
	|								/ ВЫРАЗИТЬ(СписокОС.СрокПолезногоИспользованияНУ - СписокОС.ФактическийСрокПриПереходеКЛинейномуМетоду КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|
	|	КОГДА СписокОС.МетодНачисленияАмортизацииНУ = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.Нелинейный)
	|		ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.СтоимостьНУНачальныйОстаток - СписокОС.АмортизационнаяПремия - СписокОС.АмортизацияНУНачальныйОстаток КАК ЧИСЛО(20,8))
	|							* ВЫРАЗИТЬ(СписокОС.НормаАмортизации / 100 КАК ЧИСЛО(20,8))
	|							* ВЫРАЗИТЬ(СписокОС.СпециальныйКоэффициентНУ КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|	ИНАЧЕ 0
	|КОНЕЦ";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСуммаОбесценения()
	
	ТекстЗапроса = 
	"ВЫБОР 
	|	КОГДА НЕ СписокОС.НачислятьАмортизациюБУ 
	|		ИЛИ &ОстатокОбесценения <= 0
	|		ИЛИ НЕ СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
	|
	|		ТОГДА 0
	|
	|	КОГДА (СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.РесурсВыработанныйЗаТекущийПериод) >= СписокОС.РесурсНазначенный
	|
	|		ТОГДА &ОстатокОбесценения
	|
		// Линейный, ПропорциональноОбъемуПродукции
	|	КОГДА СписокОС.МетодНачисленияАмортизацииБУ В (
	|						ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.Линейный),
	|						ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)) 
	|
	|		ТОГДА ВЫРАЗИТЬ(&ОстатокОбесценения 
	|							* (ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|							/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК ЧИСЛО(20,8))) КАК ЧИСЛО(31,2))
	|
		// Уменьшаемого остатка
	|	КОГДА СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка) 
	|
	|		ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(&ОстатокОбесценения КАК ЧИСЛО(20,8))
	|					* ВЫРАЗИТЬ(СписокОС.РесурсВыработанныйЗаТекущийПериод КАК ЧИСЛО(20,8))
	|					* ВЫРАЗИТЬ(СписокОС.КоэффициентУскоренияБУ КАК ЧИСЛО(20,8))
	|					/ ВЫРАЗИТЬ(СписокОС.РесурсНазначенный - СписокОС.РесурсВыработанныйЗаПрошлыйПериод + СписокОС.КоэффициентУскоренияБУ - 1 КАК ЧИСЛО(20,8)) КАК ЧИСЛО(31,2))
	|	ИНАЧЕ 0
	|
	|КОНЕЦ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстатокОбесценения", "СписокОС.ОстатокОбесцененияРегл");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Параметры текста запроса сумма амортизации БУ.
// 
// Возвращаемое значение:
//  Структура - свойства:
// 		* ТекстСтоимостьДляВычисленияАмортизации - Строка - 
//		* ТекстОстаточнаяСтоимость - Строка -
// 		* ТекстЛиквидационнаяСтоимость - Строка -
// 		* ТекстСтоимостьНаНачалоГода - Строка -
// 		* ТекстСуммаДоначисления - Строка -
// 		* ТекстОбесценение - Строка -
Функция ПараметрыТекстаЗапросаСуммаАмортизацииБУ() Экспорт

	ПараметрыТекстаЗапроса = Новый Структура;
	ПараметрыТекстаЗапроса.Вставить("ТекстСтоимостьДляВычисленияАмортизации", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстЛиквидационнаяСтоимость", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстСтоимостьНаНачалоГода", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстСуммаДоначисления", "0");
	ПараметрыТекстаЗапроса.Вставить("ТекстОбесценение", "0");
	
	Возврат ПараметрыТекстаЗапроса;
	
КонецФункции

//-- Локализация

#КонецОбласти

#Область РасчетАмортизацииПоТаблице

Процедура РассчитатьАмортизациюПоТаблице(РезультатРасчета, ТаблицыРасчета, ПараметрыРасчета, НомерСтроки) Экспорт
	
	//++ Локализация
	НачатьРасчетАмортизацииПоЗаданнымПараметрамНУ(РезультатРасчета, ТаблицыРасчета, ПараметрыРасчета, НомерСтроки);
	//-- Локализация
	
КонецПроцедуры

Функция НачатьРасчетАмортизацииПоЗаданнымПараметрамБУ(РезультатРасчета, ТаблицыРасчета, ПараметрыРасчета, НомерСтроки = Неопределено) Экспорт
	
	АмортизацияРассчитана = Ложь;
	
	//++ Локализация
	
	ПараметрыЗаПериод = Неопределено;
	
	Если НЕ ТаблицыРасчета.Свойство("ПараметрыЗаПериодБУ", ПараметрыЗаПериод) Тогда
		Возврат Истина;
	КонецЕсли;
	
	АмортизацияРассчитана = Истина;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПараметрыЗаПериод.Дата КАК Период,
	|	ПараметрыЗаПериод.НомерСтроки КАК НомерСтроки,
	|	ПараметрыЗаПериод.НеРассчитыватьАмортизациюБУ КАК НеРассчитыватьАмортизациюБУ,
	|
	|	ПараметрыЗаПериод.АмортизацияБУ КАК АмортизацияБУ,
	|	ПараметрыЗаПериод.АмортизацияПР КАК АмортизацияПР,
	|	ПараметрыЗаПериод.АмортизацияЦФ КАК АмортизацияЦФ,
	|
	|	ПараметрыЗаПериод.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	ПараметрыЗаПериод.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
	|	ПараметрыЗаПериод.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
	|	ПараметрыЗаПериод.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение,
	|
	|	ПараметрыЗаПериод.СтоимостьБУ КАК СтоимостьБУ,
	|	ПараметрыЗаПериод.СтоимостьПР КАК СтоимостьПР,
	|	ПараметрыЗаПериод.СтоимостьЦФ КАК СтоимостьЦФ,
	|	ПараметрыЗаПериод.СтоимостьПРЦФ КАК СтоимостьПРЦФ,
	|
	|	ПараметрыЗаПериод.ГрафикАмортизации КАК ГрафикАмортизации,
	|	ПараметрыЗаПериод.ГодоваяНормаАмортизацииБУ КАК КоэффициентАмортизацииБУ,
	|	ПараметрыЗаПериод.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
	|	ПараметрыЗаПериод.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	ПараметрыЗаПериод.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	ПараметрыЗаПериод.ОбъемВыработки КАК ОбъемВыработки,
	|	ПараметрыЗаПериод.ОбъемВыработкиНаНачалоМесяца КАК ОбъемВыработкиНаНачалоМесяца,
	|	ПараметрыЗаПериод.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыЗаПериод.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	ПараметрыЗаПериод.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыЗаПериод.СтоимостьДляВычисленияАмортизацииБУ КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыЗаПериод.СтоимостьДляВычисленияАмортизацииЦФ КАК СтоимостьДляВычисленияАмортизацииЦФ,
	|	ПараметрыЗаПериод.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	ПараметрыЗаПериод.ДатаИзмененияПараметровБУ КАК ДатаПоследнегоИзменения,
	|
	|	&ЭтоАрендованныеОС КАК ЭтоАрендованныеОС,
	|	&Организация КАК Организация,
	|	&ОсновноеСредство КАК ОсновноеСредство,
	|	&ДатаВводаВЭксплуатациюБУ КАК ДатаВводаВЭксплуатациюБУ,
	|	&СтоимостьРеглНаНачалоГода КАК СтоимостьНаНачалоГода,
	|	&АмортизацияРеглНаНачалоГода КАК АмортизацияНаНачалоГода,
	|	&АмортизацияРеглНаНачалоПериода КАК АмортизацияРеглНаНачалоПериода,
	|	&АмортизацияПРНаНачалоПериода КАК АмортизацияПРНаНачалоПериода,
	|	&АмортизацияЦФНаНачалоПериода КАК АмортизацияЦФНаНачалоПериода,
	|	&АмортизацияПРЦФНаНачалоПериода КАК АмортизацияПРЦФНаНачалоПериода
	|
	|ПОМЕСТИТЬ ЗначенияПараметров
	|
	|ИЗ
	|	&ПараметрыЗаПериодБУ КАК ПараметрыЗаПериод";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПараметрыЗаПериодБУ", ПараметрыЗаПериод);
	Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", ПараметрыРасчета.ОсновноеСредство);
	Запрос.УстановитьПараметр("ДатаВводаВЭксплуатациюБУ", ПараметрыРасчета.ДатаВводаВЭксплуатациюБУ);
	Запрос.УстановитьПараметр("СтоимостьРеглНаНачалоГода", ПараметрыРасчета.СтоимостьРеглНаНачалоГода);
	Запрос.УстановитьПараметр("АмортизацияРеглНаНачалоГода", ПараметрыРасчета.АмортизацияРеглНаНачалоГода);
	Запрос.УстановитьПараметр("АмортизацияРеглНаНачалоПериода", ПараметрыРасчета.АмортизацияРеглНаНачалоПериода);
	Запрос.УстановитьПараметр("АмортизацияПРНаНачалоПериода", ПараметрыРасчета.АмортизацияПРНаНачалоПериода);
	Запрос.УстановитьПараметр("АмортизацияЦФНаНачалоПериода", ПараметрыРасчета.АмортизацияЦФНаНачалоПериода);
	Запрос.УстановитьПараметр("АмортизацияПРЦФНаНачалоПериода", ПараметрыРасчета.АмортизацияПРЦФНаНачалоПериода);
	Запрос.УстановитьПараметр("ЭтоАрендованныеОС", ПараметрыРасчета.ЭтоАрендованныеОС);

	Запрос.Выполнить();
		
	РезультатРасчетаБУ = РассчитатьАмортизациюПоЗаданнымПараметрамБУ(МенеджерВременныхТаблиц, НомерСтроки);
	
	РезультатРасчета.Вставить("РезультатРасчетаБУ", РезультатРасчетаБУ);
	
	//-- Локализация
	
	Возврат АмортизацияРассчитана;
	
КонецФункции

Процедура ПараметрыДляРасчетаАмортизацииПоТаблице(ПараметрыДляРасчета, Параметры) Экспорт
	
	//++ Локализация
	ЗаполнитьПараметрыЗаПериодНУ(ПараметрыДляРасчета, Параметры);
	//-- Локализация
	
КонецПроцедуры

//++ Локализация

Процедура НачатьРасчетАмортизацииПоЗаданнымПараметрамНУ(РезультатРасчета, ТаблицыРасчета, ПараметрыРасчета, НомерСтроки)
	
	ПараметрыЗаПериод = Неопределено;
	
	Если НЕ ТаблицыРасчета.Свойство("ПараметрыЗаПериодНУ", ПараметрыЗаПериод) Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПараметрыЗаПериод.Дата КАК Период,
	|	ПараметрыЗаПериод.НомерСтроки КАК НомерСтроки,
	|	ПараметрыЗаПериод.НеРассчитыватьАмортизациюНУ КАК НеРассчитыватьАмортизациюНУ,
	|
	|	ПараметрыЗаПериод.АмортизацияНУ КАК АмортизацияНУ,
	|
	|	ПараметрыЗаПериод.АмортизацияНУИзменение КАК АмортизацияНУИзменение,
	|
	|	ПараметрыЗаПериод.СтоимостьНУ КАК СтоимостьНУ,
	|
	|	ПараметрыЗаПериод.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|	ПараметрыЗаПериод.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
	|	ПараметрыЗаПериод.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
	|	ПараметрыЗаПериод.СпециальныйКоэффициентНУ КАК СпециальныйКоэффициентНУ,
	|	ПараметрыЗаПериод.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользованияНУ,
	|
	|	&ДатаВводаВЭксплуатациюНУ КАК ДатаВводаВЭксплуатациюНУ,
	|	&АмортизацияНУНаНачалоПериода КАК АмортизацияНУНаНачалоПериода,
	|	&АмортизацияДо2009 КАК АмортизацияДо2009,
	|	&ФактическийСрокИспользованияДо2009 КАК ФактическийСрокИспользованияДо2009
	|
	|ПОМЕСТИТЬ ЗначенияПараметровНУ
	|
	|ИЗ
	|	&ПараметрыЗаПериодНУ КАК ПараметрыЗаПериод";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПараметрыЗаПериодНУ", ПараметрыЗаПериод);
	
	Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("ДатаВводаВЭксплуатациюНУ", ПараметрыРасчета.ДатаВводаВЭксплуатациюНУ);
	Запрос.УстановитьПараметр("АмортизацияНУНаНачалоПериода", ПараметрыРасчета.АмортизацияНУНаНачалоПериода);
	Запрос.УстановитьПараметр("АмортизацияДо2009", ПараметрыРасчета.АмортизацияДо2009);
	Запрос.УстановитьПараметр("ФактическийСрокИспользованияДо2009", ПараметрыРасчета.ФактическийСрокИспользованияДо2009);

	Запрос.Выполнить();
		
	РезультатРасчетаНУ = РассчитатьАмортизациюПоЗаданнымПараметрамНУ(МенеджерВременныхТаблиц, НомерСтроки);
	
	РезультатРасчета.Вставить("РезультатРасчетаНУ", РезультатРасчетаНУ);
		
КонецПроцедуры

Функция РассчитатьАмортизациюПоЗаданнымПараметрамБУ(МенеджерВременныхТаблиц, НомерСтроки)
	
	ИспользуемыеТаблицы = ОбщегоНазначенияУТ.СписокВременныхТаблиц(МенеджерВременныхТаблиц);

	МетаданныеРегистра = Метаданные.РегистрыНакопления.АмортизацияОС;

	РезультатРасчета = Новый ТаблицаЗначений();
	РезультатРасчета.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	РезультатРасчета.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	РезультатРасчета.Колонки.Добавить("АмортизацияБУ", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	РезультатРасчета.Колонки.Добавить("АмортизацияПР", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	РезультатРасчета.Колонки.Добавить("АмортизацияЦФ", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	РезультатРасчета.Колонки.Добавить("РесурсВыработанныйЗаПрошлыйПериод", МетаданныеРегистра.Реквизиты.РесурсВыработанныйЗаПрошлыйПериод.Тип);
	РезультатРасчета.Колонки.Добавить("РесурсВыработанныйЗаТекущийПериод", МетаданныеРегистра.Реквизиты.РесурсВыработанныйЗаТекущийПериод.Тип);
	РезультатРасчета.Колонки.Добавить("СтоимостьДляВычисленияАмортизацииРегл", МетаданныеРегистра.Реквизиты.СтоимостьДляВычисленияАмортизацииРегл.Тип);
	РезультатРасчета.Колонки.Добавить("ПорядокНачисленияАмортизации", МетаданныеРегистра.Реквизиты.ПорядокНачисленияАмортизацииБУ.Тип);
	РезультатРасчета.Колонки.Добавить("ПорядокУчета", МетаданныеРегистра.Реквизиты.ПорядокУчетаБУ.Тип);
	РезультатРасчета.Колонки.Добавить("ВерсияМетодаНачисления", МетаданныеРегистра.Реквизиты.ВерсияМетодаНачисленияБУ.Тип);

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УчетнаяПолитика_Период.Период КАК Период,
	|	УчетнаяПолитика_Период.Организация КАК Организация,
	|
	|	УчетнаяПолитика.ПрименяетсяФСБУ6 КАК ПрименяетсяФСБУ6,
	|
	|	ВЫБОР
	|		КОГДА УчетнаяПолитика_Период.ЭтоАрендованныеОС
	|			ТОГДА УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда 
	|		ИНАЧЕ УчетнаяПолитика.ПорядокНачисленияАмортизацииОС
	|	КОНЕЦ КАК ПорядокНачисленияАмортизации
	|
	|ПОМЕСТИТЬ УчетнаяПолитикаБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначенияПараметров.Период КАК Период,
	|		ЗначенияПараметров.Организация КАК Организация,
	|		ЗначенияПараметров.ЭтоАрендованныеОС КАК ЭтоАрендованныеОС,
	|		Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		МАКСИМУМ(УчетнаяПолитика.Период) КАК ПериодУчетнаяПолитика
	|	ИЗ
	|		ЗначенияПараметров КАК ЗначенияПараметров
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО Организации.Ссылка = ЗначенияПараметров.Организация
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета КАК УчетнаяПолитика
	|			ПО УчетнаяПолитика.Организация = Организации.ГоловнаяОрганизация
	|				И УчетнаяПолитика.Период <= ЗначенияПараметров.Период
	|
	|	СГРУППИРОВАТЬ ПО
	|		ЗначенияПараметров.Период,
	|		ЗначенияПараметров.Организация,
	|		ЗначенияПараметров.ЭтоАрендованныеОС,
	|		Организации.ГоловнаяОрганизация
	|
	|	) КАК УчетнаяПолитика_Период
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = УчетнаяПолитика_Период.ГоловнаяОрганизация
	|			И УчетнаяПолитика.Период = УчетнаяПолитика_Период.ПериодУчетнаяПолитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитика_Период.Период КАК Период,
	|	УчетнаяПолитика_Период.Организация КАК Организация,
	|
	|	УчетнаяПолитика.МесяцНачалаФинансовогоГода КАК МесяцНачалаФинансовогоГода
	|
	|ПОМЕСТИТЬ УчетнаяПолитикаУУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначенияПараметров.Период КАК Период,
	|		ЗначенияПараметров.Организация КАК Организация,
	|		Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		МАКСИМУМ(УчетнаяПолитика.Период) КАК ПериодУчетнаяПолитика
	|	ИЗ
	|		ЗначенияПараметров КАК ЗначенияПараметров
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО Организации.Ссылка = ЗначенияПараметров.Организация
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитика
	|			ПО УчетнаяПолитика.Организация = Организации.ГоловнаяОрганизация
	|				И УчетнаяПолитика.Период <= ЗначенияПараметров.Период
	|
	|	СГРУППИРОВАТЬ ПО
	|		ЗначенияПараметров.Период,
	|		ЗначенияПараметров.Организация,
	|		Организации.ГоловнаяОрганизация
	|
	|	) КАК УчетнаяПолитика_Период
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитика
	|		ПО УчетнаяПолитика.Организация = УчетнаяПолитика_Период.ГоловнаяОрганизация
	|			И УчетнаяПолитика.Период = УчетнаяПолитика_Период.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
	|	ЗначенияПараметров.Период КАК Период,
	|
	|	ЗначенияПараметров.АмортизацияБУ КАК АмортизацияБУ,
	|	ЗначенияПараметров.АмортизацияПР КАК АмортизацияПР,
	|	ЗначенияПараметров.АмортизацияЦФ КАК АмортизацияЦФ,
	|
	|	ЗначенияПараметров.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
	|	ЗначенияПараметров.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
	|	ЗначенияПараметров.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
	|	ЗначенияПараметров.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение,
	|
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПрименяетсяФСБУ6, ИСТИНА) КАК ПрименяетсяФСБУ6,
	|	ЕСТЬNULL(УчетнаяПолитикаБУ.ПорядокНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)) КАК ПорядокНачисленияАмортизации,
	|
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ЗначенияПараметров.Период) < ЕСТЬNULL(УчетнаяПолитикаУУ.МесяцНачалаФинансовогоГода, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, ГОД), МЕСЯЦ, ЕСТЬNULL(УчетнаяПолитикаУУ.МесяцНачалаФинансовогоГода, 1) - 13)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, ГОД), МЕСЯЦ, ЕСТЬNULL(УчетнаяПолитикаУУ.МесяцНачалаФинансовогоГода, 1) - 1) 
	|	КОНЕЦ КАК НачалоФинансовогоГода,
	|	
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ЗначенияПараметров.Период) < ЕСТЬNULL(УчетнаяПолитикаУУ.МесяцНачалаФинансовогоГода, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, ГОД), МЕСЯЦ, ЕСТЬNULL(УчетнаяПолитикаУУ.МесяцНачалаФинансовогоГода, 1) - 1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, ГОД), МЕСЯЦ, ЕСТЬNULL(УчетнаяПолитикаУУ.МесяцНачалаФинансовогоГода, 1) + 11) 
	|	КОНЕЦ КАК КонецФинансовогоГода
	|
	|ИЗ	
	|	ЗначенияПараметров КАК ЗначенияПараметров
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаБУ КАК УчетнаяПолитикаБУ
	|		ПО УчетнаяПолитикаБУ.Период = ЗначенияПараметров.Период
	|			И УчетнаяПолитикаБУ.Организация = ЗначенияПараметров.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаУУ КАК УчетнаяПолитикаУУ
	|		ПО УчетнаяПолитикаУУ.Период = ЗначенияПараметров.Период
	|			И УчетнаяПолитикаУУ.Организация = ЗначенияПараметров.Организация
	|
	|ГДЕ 
	|	&НомерСтроки = НЕОПРЕДЕЛЕНО 
	|		ИЛИ ЗначенияПараметров.НомерСтроки <= &НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос);
	
	АмортизацияЗаПериодРегл = 0;
	АмортизацияЗаПериодПР = 0;
	АмортизацияЗаПериодЦФ = 0;
	АмортизацияЗаПериодПРЦФ = 0;
	АмортизацияЗаМесяцРегл = 0;
	АмортизацияЗаМесяцПР = 0;
	АмортизацияЗаМесяцЦФ = 0;
	ТекущийМесяц = 0;

	Результат = Запрос.Выполнить();
	ВыборкаСтрок = Результат.Выбрать();
	
	//@skip-check query-in-loop
	Пока ВыборкаСтрок.Следующий() Цикл
		
		Если Месяц(ВыборкаСтрок.Период) <> ТекущийМесяц Тогда
			
			АмортизацияЗаПериодРегл = АмортизацияЗаПериодРегл + АмортизацияЗаМесяцРегл;
			АмортизацияЗаПериодПР = АмортизацияЗаПериодПР + АмортизацияЗаМесяцПР;
			АмортизацияЗаПериодЦФ = АмортизацияЗаПериодЦФ + АмортизацияЗаМесяцЦФ;
			
			АмортизацияЗаМесяцРегл = 0;
			АмортизацияЗаМесяцПР = 0;
			АмортизацияЗаМесяцЦФ = 0;
			
			ТекущийМесяц = Месяц(ВыборкаСтрок.Период);
			
		КонецЕсли;

		Если НомерСтроки <> Неопределено
			И ВыборкаСтрок.НомерСтроки < НомерСтроки Тогда
			
			// Расчет уже был выполнен, можно использовать исходные данные
			АмортизацияЗаМесяцРегл = АмортизацияЗаМесяцРегл + ВыборкаСтрок.АмортизацияБУ + ВыборкаСтрок.АмортизацияРеглИзменение;
			АмортизацияЗаМесяцПР = АмортизацияЗаМесяцПР + ВыборкаСтрок.АмортизацияПР + ВыборкаСтрок.АмортизацияПРИзменение;
			АмортизацияЗаМесяцЦФ = АмортизацияЗаМесяцЦФ + ВыборкаСтрок.АмортизацияЦФ + ВыборкаСтрок.АмортизацияЦФИзменение;
			
			Продолжить;
		КонецЕсли;

		Запрос.УстановитьПараметр("НомерСтроки", ВыборкаСтрок.НомерСтроки);
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ВыборкаСтрок.Период));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ВыборкаСтрок.Период));
		Запрос.УстановитьПараметр("АмортизацияЗаПериодРегл", АмортизацияЗаПериодРегл);
		Запрос.УстановитьПараметр("АмортизацияЗаПериодПР", АмортизацияЗаПериодПР);
		Запрос.УстановитьПараметр("АмортизацияЗаПериодЦФ", АмортизацияЗаПериодЦФ);
		Запрос.УстановитьПараметр("АмортизацияЗаПериодПРЦФ", АмортизацияЗаПериодПРЦФ);
		Запрос.УстановитьПараметр("АмортизацияЗаМесяцРегл", АмортизацияЗаМесяцРегл);
		Запрос.УстановитьПараметр("АмортизацияЗаМесяцПР", АмортизацияЗаМесяцПР);
		Запрос.УстановитьПараметр("АмортизацияЗаМесяцЦФ", АмортизацияЗаМесяцЦФ);
		Запрос.УстановитьПараметр("ПрименяетсяФСБУ6", ВыборкаСтрок.ПрименяетсяФСБУ6);
		Запрос.УстановитьПараметр("ПорядокНачисленияАмортизации", ВыборкаСтрок.ПорядокНачисленияАмортизации);
		Запрос.УстановитьПараметр("НачалоФинансовогоГода", ВыборкаСтрок.НачалоФинансовогоГода);
		Запрос.УстановитьПараметр("КонецФинансовогоГода", ВыборкаСтрок.КонецФинансовогоГода);
		
		ДатаПереходаКЛинейномуМетоду = УправлениеВнеоборотнымиАктивамиПереопределяемый.ПолучитьДатуПереходаКЛинейномуМетоду(КонецМесяца(ВыборкаСтрок.Период), Неопределено);
		Запрос.УстановитьПараметр("ДатаПереходаКЛинейномуМетоду", ДатаПереходаКЛинейномуМетоду);

		#Область ПодготовкаПараметров
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, МЕСЯЦ) КАК НачалоМесяца,
		|	КОНЕЦПЕРИОДА(ЗначенияПараметров.Период, МЕСЯЦ) КАК КонецМесяца,
		|	НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, ДЕНЬ) КАК НачалоДня,
		|
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|	ЗначенияПараметров.Организация КАК Организация,
		|	ЗначенияПараметров.ОсновноеСредство КАК ОсновноеСредство,
		|
		|	ЗначенияПараметров.НеРассчитыватьАмортизациюБУ КАК НеРассчитыватьАмортизациюБУ,
		|
		|	ЗначенияПараметров.АмортизацияБУ КАК АмортизацияБУ,
		|	ЗначенияПараметров.АмортизацияПР КАК АмортизацияПР,
		|	ЗначенияПараметров.АмортизацияЦФ КАК АмортизацияЦФ,
		|
		|	ЗначенияПараметров.ГрафикАмортизации КАК ГрафикАмортизации,
		|
		|	ВЫБОР
		|		КОГДА &ПрименяетсяФСБУ6 И &ПорядокНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
		|			ТОГДА ЗначенияПараметров.ДатаПоследнегоИзменения
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ)
		|	КОНЕЦ КАК ДатаПоследнегоИзменения,
		|
		|	ЗначенияПараметров.КоэффициентАмортизацииБУ КАК КоэффициентАмортизацииБУ,
		|	ЗначенияПараметров.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
		|	ЗначенияПараметров.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
		|	ЗначенияПараметров.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
		|
		|	ЗначенияПараметров.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
		|
		|	ЗначенияПараметров.ОбъемВыработки КАК ОбъемВыработки,
		|	ЗначенияПараметров.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	ЗначенияПараметров.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
		|	ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
		|	ЗначенияПараметров.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
		|	ЗначенияПараметров.СтоимостьДляВычисленияАмортизацииЦФ КАК СтоимостьДляВычисленияАмортизацииЦФ,
		|	ЗначенияПараметров.СтоимостьБУ КАК СтоимостьБУ,
		|	ЗначенияПараметров.СтоимостьПР КАК СтоимостьПР,
		|	ЗначенияПараметров.СтоимостьЦФ КАК СтоимостьЦФ,
		|	ЗначенияПараметров.СтоимостьПРЦФ КАК СтоимостьПРЦФ,
		|
		|	ЗначенияПараметров.СтоимостьНаНачалоГода КАК СтоимостьНаНачалоГода,
		|
		|	ЗначенияПараметров.АмортизацияРеглНаНачалоПериода КАК АмортизацияРеглНаНачалоПериода,
		|	ЗначенияПараметров.АмортизацияПРНаНачалоПериода КАК АмортизацияПРНаНачалоПериода,
		|	ЗначенияПараметров.АмортизацияЦФНаНачалоПериода КАК АмортизацияЦФНаНачалоПериода,
		|	ЗначенияПараметров.АмортизацияПРЦФНаНачалоПериода КАК АмортизацияПРЦФНаНачалоПериода,
		|
		|	ЗначенияПараметров.ОбъемВыработкиНаНачалоМесяца КАК ОбъемВыработкиНаНачалоМесяца,
		|
		|	ЗначенияПараметров.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
		|	ЗначенияПараметров.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
		|	ЗначенияПараметров.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
		|	ЗначенияПараметров.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение
		|
		|ПОМЕСТИТЬ ЗначенияПараметровЗаМесяц
		|
		|ИЗ
		|	ЗначенияПараметров КАК ЗначенияПараметров
		|
		|ГДЕ
		|	ЗначенияПараметров.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.НачалоМесяца КАК НачалоМесяца,
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(МАКСИМУМ(ЗначенияПараметровПредыдущее.Период), ДАТАВРЕМЯ(1,1,1)) КАК ПериодПредыдущее
		|
		|ПОМЕСТИТЬ ЗначенияПараметровПредыдущее
		|
		|ИЗ
		|	ЗначенияПараметровЗаМесяц КАК ЗначенияПараметров
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровЗаМесяц КАК ЗначенияПараметровПредыдущее
		|		ПО ЗначенияПараметровПредыдущее.НачалоМесяца = ЗначенияПараметров.НачалоМесяца
		|			И ЗначенияПараметровПредыдущее.НачалоДня < ЗначенияПараметров.НачалоДня
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияПараметров.НачалоМесяца,
		|	ЗначенияПараметров.Период,
		|	ЗначенияПараметров.НомерСтроки
		|;
		|	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.НачалоМесяца КАК НачалоМесяца,
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(МИНИМУМ(ЗначенияПараметровЭтогоДня.Период), ДАТАВРЕМЯ(1,1,1)) КАК ПериодСледующее
		|
		|ПОМЕСТИТЬ ЗначенияПараметровЭтогоДня
		|
		|ИЗ
		|	ЗначенияПараметровЗаМесяц КАК ЗначенияПараметров
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровЗаМесяц КАК ЗначенияПараметровЭтогоДня
		|		ПО ЗначенияПараметровЭтогоДня.НачалоМесяца = ЗначенияПараметров.НачалоМесяца
		|			И ЗначенияПараметровЭтогоДня.НачалоДня = ЗначенияПараметров.НачалоДня
		|			И ЗначенияПараметровЭтогоДня.НомерСтроки > ЗначенияПараметров.НомерСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияПараметров.НачалоМесяца,
		|	ЗначенияПараметров.Период,
		|	ЗначенияПараметров.НомерСтроки
		|;
		|	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.НачалоМесяца КАК НачалоМесяца,
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗначенияПараметровЭтогоДня.ПериодСледующее, ДАТАВРЕМЯ(1,1,1)) <> ДАТАВРЕМЯ(1,1,1)
		|
		|			ТОГДА 0
		|
		|		КОГДА НЕ &ПрименяетсяФСБУ6
		|				ИЛИ &ПорядокНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
		|
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ЗначенияПараметровПредыдущее.ПериодПредыдущее, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
		|						ТОГДА РАЗНОСТЬДАТ(ЗначенияПараметров.НачалоМесяца, ЗначенияПараметров.КонецМесяца, ДЕНЬ) + 1
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|
		|		КОГДА ЕСТЬNULL(ЗначенияПараметровПредыдущее.ПериодПредыдущее, ДАТАВРЕМЯ(1,1,1)) <> ДАТАВРЕМЯ(1,1,1)
		|
		|			ТОГДА РАЗНОСТЬДАТ(ЗначенияПараметровПредыдущее.ПериодПредыдущее, ЗначенияПараметров.Период, ДЕНЬ)
		|
		|		КОГДА НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ)
		|
		|			ТОГДА РАЗНОСТЬДАТ(ЗначенияПараметров.ДатаПоследнегоИзменения, ЗначенияПараметров.Период, ДЕНЬ) + 1
		|
		|		ИНАЧЕ РАЗНОСТЬДАТ(ЗначенияПараметров.НачалоМесяца, ЗначенияПараметров.Период, ДЕНЬ) + 1
		|
		|	КОНЕЦ КАК Количество
		|
		|ПОМЕСТИТЬ КоличествоДнейИспользования
		|
		|ИЗ
		|	ЗначенияПараметровЗаМесяц КАК ЗначенияПараметров
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровПредыдущее КАК ЗначенияПараметровПредыдущее
		|		ПО (ЗначенияПараметровПредыдущее.Период = ЗначенияПараметров.Период)
		|			И (ЗначенияПараметровПредыдущее.НомерСтроки = ЗначенияПараметров.НомерСтроки)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровЭтогоДня КАК ЗначенияПараметровЭтогоДня
		|		ПО ЗначенияПараметровЭтогоДня.НачалоМесяца = ЗначенияПараметров.НачалоМесяца
		|			И ЗначенияПараметровЭтогоДня.НомерСтроки = ЗначенияПараметров.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|	ЗначенияПараметров.ОсновноеСредство КАК ОсновноеСредство,
		|	ВЫРАЗИТЬ(ЗначенияПараметров.ОсновноеСредство КАК Справочник.ОбъектыЭксплуатации).УчитыватьСтоимостьЛиквидационногоОбязательства КАК УчитыватьСтоимостьЛиквидационногоОбязательства,
		|
		|	ЗначенияПараметров.НеРассчитыватьАмортизациюБУ КАК НеРассчитыватьАмортизациюБУ,
		|
		|	&ПрименяетсяФСБУ6 КАК АмортизацияНачисляетсяПоСтандартамМУ,
		|	НЕОПРЕДЕЛЕНО КАК ВариантПроводокПоОбесценениюВНА,
		|
		|	ЗначенияПараметров.АмортизацияБУ КАК АмортизацияБУ,
		|	ЗначенияПараметров.АмортизацияПР КАК АмортизацияПР,
		|	ЗначенияПараметров.АмортизацияЦФ КАК АмортизацияЦФ,
		|
		|	ЗначенияПараметров.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
		|	ЗначенияПараметров.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
		|	ЗначенияПараметров.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
		|	ЗначенияПараметров.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение,
		|
		// Для бухгалтерского учета
		|	ЗначенияПараметров.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
		|	ЗначенияПараметров.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
		|	ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
		|
		|	ЗначенияПараметров.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
		|	ЗначенияПараметров.СтоимостьНаНачалоГода КАК СтоимостьНаНачалоГода,
		|	ЗначенияПараметров.ГрафикАмортизации КАК ГрафикАмортизации,
		|	ЗначенияПараметров.ОбъемВыработки КАК ОбъемВыработки,
		|	ЗначенияПараметров.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	ЗначенияПараметров.КоэффициентАмортизацииБУ КАК КоэффициентАмортизацииБУ,
		|	ЗначенияПараметров.КоэффициентУскоренияБУ КАК КоэффициентУскоренияБУ,
		|	ЗначенияПараметров.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
		|	ЗначенияПараметров.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
		|
		// РесурсНазначенный
		|	ВЫБОР 
		|		КОГДА ЗначенияПараметров.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
		|			ТОГДА ЗначенияПараметров.ОбъемПродукцииРаботДляВычисленияАмортизации
		|		ИНАЧЕ ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации
		|	КОНЕЦ КАК РесурсНазначенный,
		|
		// РесурсВыработанныйЗаТекущийПериод
		|	ВЫБОР 
		|		КОГДА ЗначенияПараметров.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
		|
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(КоличествоДнейИспользования.Количество КАК ЧИСЛО(15,9)) / ВЫРАЗИТЬ(ДЕНЬ(ЗначенияПараметров.КонецМесяца) КАК ЧИСЛО(15,9)) * ЗначенияПараметров.ОбъемВыработки КАК ЧИСЛО(31,9)) 
		|	
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(КоличествоДнейИспользования.Количество КАК ЧИСЛО(15,9)) / ВЫРАЗИТЬ(ДЕНЬ(ЗначенияПараметров.КонецМесяца) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9)) 
		|
		|	КОНЕЦ КАК РесурсВыработанныйЗаТекущийПериод,
		|
		// РесурсВыработанныйЗаПрошлыйПериод
		|	ВЫБОР 
		|		КОГДА ЗначенияПараметров.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции)
		|
		|			ТОГДА ЗначенияПараметров.ОбъемВыработкиНаНачалоМесяца
		|
				// В месяце принятия к учету
		|		КОГДА НАЧАЛОПЕРИОДА(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ) = ЗначенияПараметров.НачалоМесяца
		|
		|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(31,9))
		|
				// В следующем месяце после принятия к учету
		|		КОГДА КОНЕЦПЕРИОДА(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗначенияПараметров.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ)
		|
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ЗначенияПараметров.ДатаПоследнегоИзменения, КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗначенияПараметров.НачалоМесяца, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ) + 1 КАК ЧИСЛО(15,9))
		|					/ ВЫРАЗИТЬ(ДЕНЬ(КОНЕЦПЕРИОДА(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ)) КАК ЧИСЛО(15,9)) КАК ЧИСЛО(31,9))
		|	
				// Расшифровка формулы: [кол-во отработанных дней в мес принятия] / [всего дней в мес принятия] + [кол-во месяцев после принятия до начала месяца]
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ЗначенияПараметров.ДатаПоследнегоИзменения, КОНЕЦПЕРИОДА(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ), ДЕНЬ) + 1 КАК ЧИСЛО(15,9))
		|					/ ВЫРАЗИТЬ(ДЕНЬ(КОНЕЦПЕРИОДА(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ)) КАК ЧИСЛО(15,9))
		|				+ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ, 1), МЕСЯЦ), ЗначенияПараметров.КонецМесяца, МЕСЯЦ) КАК ЧИСЛО(31,9))
		|
		|	КОНЕЦ КАК РесурсВыработанныйЗаПрошлыйПериод,
		|
		// СтоимостьДляВычисленияАмортизации
		|	ВЫБОР 
		|		КОГДА НЕ &ПрименяетсяФСБУ6
		|			ТОГДА ЗначенияПараметров.СтоимостьДляВычисленияАмортизации
		|
		|		КОГДА &ПрименяетсяФСБУ6
		|				И &ПорядокНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
		|			ТОГДА ЗначенияПараметров.СтоимостьБУ 
		|					+ ЗначенияПараметров.СтоимостьЦФ 
		|					- ЗначенияПараметров.АмортизацияРеглНаНачалоПериода 
		|					- ЗначенияПараметров.АмортизацияЦФНаНачалоПериода
		|					- ЗначенияПараметров.АмортизацияРеглИзменение
		|					- &АмортизацияЗаПериодРегл
		|					- &АмортизацияЗаМесяцРегл
		|
		|		ИНАЧЕ ЗначенияПараметров.СтоимостьБУ 
		|				+ ЗначенияПараметров.СтоимостьЦФ 
		|				- ЗначенияПараметров.АмортизацияРеглНаНачалоПериода 
		|				- ЗначенияПараметров.АмортизацияЦФНаНачалоПериода
		|				- &АмортизацияЗаПериодРегл
		|
		|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
		|
		// СтоимостьДляВычисленияАмортизацииПР
		|	ЗначенияПараметров.СтоимостьПР 
		|		+ ЗначенияПараметров.СтоимостьЦФ 
		|		- ЗначенияПараметров.АмортизацияПРНаНачалоПериода 
		|		- ЗначенияПараметров.АмортизацияЦФНаНачалоПериода
		|		- ЗначенияПараметров.АмортизацияПРИзменение
		|		- &АмортизацияЗаПериодПР КАК СтоимостьДляВычисленияАмортизацииПР,
		|
		// ОтработанныхМесяцевПолныхЛет
		|	ВЫБОР
		|		КОГДА ГОД(ЗначенияПараметров.ДатаПоследнегоИзменения) <> ГОД(ЗначенияПараметров.НачалоМесяца) ТОГДА
		|			13 - МЕСЯЦ(ЗначенияПараметров.ДатаПоследнегоИзменения)
		|				+ 12 * (ГОД(ЗначенияПараметров.НачалоМесяца) - Год(ЗначенияПараметров.ДатаПоследнегоИзменения) - 1)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтработанныхМесяцевПолныхЛет,
		|
		|	ЛОЖЬ КАК ЭтоДоначисление,
		|	
		// ОстаточнаяСтоимостьРегл
		|	ЗначенияПараметров.СтоимостьБУ
		|		+ ЗначенияПараметров.СтоимостьЦФ
		|		- ЗначенияПараметров.АмортизацияРеглНаНачалоПериода
		|		- ЗначенияПараметров.АмортизацияЦФНаНачалоПериода
		|		- &АмортизацияЗаПериодРегл
		|		- &АмортизацияЗаПериодЦФ КАК ОстаточнаяСтоимостьРегл,
		|
		// ОстаточнаяСтоимостьПР
		|	ЗначенияПараметров.СтоимостьПР
		|		+ ЗначенияПараметров.СтоимостьПРЦФ
		|		- ЗначенияПараметров.АмортизацияПРНаНачалоПериода
		|		- ЗначенияПараметров.АмортизацияПРЦФНаНачалоПериода
		|		- &АмортизацияЗаПериодПР КАК ОстаточнаяСтоимостьПР,
		|
		// ОстаточнаяСтоимостьЦФ
		|	ЗначенияПараметров.СтоимостьЦФ
		|		- ЗначенияПараметров.АмортизацияЦФНаНачалоПериода
		|		- &АмортизацияЗаПериодЦФ КАК ОстаточнаяСтоимостьЦФ,
		|
		// ОстаточнаяСтоимостьПРЦФ
		|	ЗначенияПараметров.СтоимостьПРЦФ
		|		- ЗначенияПараметров.АмортизацияПРЦФНаНачалоПериода
		|		- &АмортизацияЗаПериодПРЦФ КАК ОстаточнаяСтоимостьПРЦФ,
		|
		// КоэффициентПериода
		|	ВЫБОР 
		|		КОГДА ГодовыеГрафикиАмортизацииОС.Коэффициент1 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент2 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент3 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент4 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент5 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент6 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент7 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент8 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент9 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент10 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент11 
		|			+ ГодовыеГрафикиАмортизацииОС.Коэффициент12 <> 0
		|		ТОГДА 
		|			ВЫБОР МЕСЯЦ(&НачалоМесяца)
		|				КОГДА 1 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент1, 0)
		|				КОГДА 2 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент2, 0) 
		|				КОГДА 3 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент3, 0)
		|				КОГДА 4 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент4, 0) 
		|				КОГДА 5 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент5, 0)
		|				КОГДА 6 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент6, 0)
		|				КОГДА 7 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент7, 0)
		|				КОГДА 8 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент8, 0)
		|				КОГДА 9 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент9, 0)
		|				КОГДА 10 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент10, 0)
		|				КОГДА 11 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент11, 0)
		|				КОГДА 12 ТОГДА ЕСТЬNULL(ГодовыеГрафикиАмортизацииОС.Коэффициент12, 0)
		|			КОНЕЦ / (ГодовыеГрафикиАмортизацииОС.Коэффициент1 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент2 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент3 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент4 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент5 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент6 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент7 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент8 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент9 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент10 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент11 
		|						+ ГодовыеГрафикиАмортизацииОС.Коэффициент12)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентПериода,
		|
		// ЧислоПрошедшихЛет
		|	ВЫБОР
		|		КОГДА (&ЧислоПрошедшихЛет / 12) < 1
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(&ЧислоПрошедшихЛет / 12 - 0.5 КАК ЧИСЛО(4,0))
		|	КОНЕЦ КАК ЧислоПрошедшихЛет,
		|
		// ЧислоЛетПользования
		|	ВЫБОР
		|		КОГДА ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации / 12 < 1
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации / 12 - 0.5 КАК ЧИСЛО(4,0))
		|	КОНЕЦ
		|		+ ВЫБОР 
		|			КОГДА (ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации / 12 
		|					- ВЫБОР
		|							КОГДА ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации / 12 < 1
		|								ТОГДА 0
		|							ИНАЧЕ ВЫРАЗИТЬ(ЗначенияПараметров.СрокИспользованияДляВычисленияАмортизации / 12 - 0.5 КАК ЧИСЛО(4,0))
		|						КОНЕЦ) > 0 
		|				ТОГДА 1 
		|			ИНАЧЕ 0 
		|		КОНЕЦ КАК ЧислоЛетПользования,
		|
		// КоэффициентЦФБУ
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(ЗначенияПараметров.СтоимостьЦФ, 0) = 0
		|			ТОГДА 0
		|		КОГДА НЕ &ПрименяетсяФСБУ6
		|				И ЕСТЬNULL(ЗначенияПараметров.СтоимостьДляВычисленияАмортизацииЦФ, 0) <> 0
		|				И ЕСТЬNULL(ЗначенияПараметров.СтоимостьДляВычисленияАмортизации, 0) <> 0
		|			ТОГДА ЕСТЬNULL(ЗначенияПараметров.СтоимостьДляВычисленияАмортизацииЦФ, 0) / ЕСТЬNULL(ЗначенияПараметров.СтоимостьДляВычисленияАмортизации, 0)
		|		КОГДА (ЕСТЬNULL(ЗначенияПараметров.СтоимостьБУ, 0) + ЕСТЬNULL(ЗначенияПараметров.СтоимостьЦФ, 0)) <> 0
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ЗначенияПараметров.СтоимостьЦФ, 0) / (ЕСТЬNULL(ЗначенияПараметров.СтоимостьБУ, 0) + ЕСТЬNULL(ЗначенияПараметров.СтоимостьЦФ, 0)) КАК ЧИСЛО (23, 10))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентЦФБУ,
		|
		// КоэффициентЦФПР
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(ЗначенияПараметров.СтоимостьПРЦФ, 0) = 0
		|			ТОГДА 0
		|		КОГДА (ЕСТЬNULL(ЗначенияПараметров.СтоимостьПР, 0) + ЕСТЬNULL(ЗначенияПараметров.СтоимостьПРЦФ, 0)) <> 0
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ЗначенияПараметров.СтоимостьПРЦФ, 0) / (ЕСТЬNULL(ЗначенияПараметров.СтоимостьПР, 0) + ЕСТЬNULL(ЗначенияПараметров.СтоимостьПРЦФ, 0)) КАК ЧИСЛО (23, 10))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентЦФПР,
		|
		|	ЛОЖЬ КАК ЭтоАмортизационнаяПремия,
		|	ЛОЖЬ КАК НачислятьИзнос
		|
		|ПОМЕСТИТЬ ВТ_СписокОССПараметрами_БУ
		|
		|ИЗ
		|	ЗначенияПараметровЗаМесяц КАК ЗначенияПараметров
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоДнейИспользования КАК КоличествоДнейИспользования
		|		ПО (КоличествоДнейИспользования.Период = ЗначенияПараметров.Период)
		|			И (КоличествоДнейИспользования.НомерСтроки = ЗначенияПараметров.НомерСтроки)
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГодовыеГрафикиАмортизацииОС КАК ГодовыеГрафикиАмортизацииОС
		|		ПО ГодовыеГрафикиАмортизацииОС.Ссылка = ЗначенияПараметров.ГрафикАмортизации
		|
		|ГДЕ
		|	ЗначенияПараметров.НомерСтроки = &НомерСтроки
		|";
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, 
			"&ЧислоПрошедшихЛет", 
			ВнеоборотныеАктивыСлужебный.ТекстПоляФактическийСрокИспользования("ДОБАВИТЬКДАТЕ(ЗначенияПараметров.ДатаПоследнегоИзменения, МЕСЯЦ, 1)"));
			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		#КонецОбласти
		
		#Область РасчетАмортизации
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СписокОС.Период КАК Период,
		|	СписокОС.НомерСтроки КАК НомерСтроки,
		|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
		|	СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
		|	СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
		|	СписокОС.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
		|	&ПорядокНачисленияАмортизации КАК ПорядокНачисленияАмортизации,
		|
		|	ВЫБОР
		|		КОГДА &ПрименяетсяФСБУ6
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл)
		|	КОНЕЦ КАК ПорядокУчета,
		|
		|	СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
		|	СписокОС.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
		|	СписокОС.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
		|	СписокОС.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение,
		|
		|	&РасчетСуммыБУ_БезЦФ КАК СуммаБУ,
		|	&РасчетСуммыПР_БезЦФ КАК СуммаПР,
		|	&РасчетСуммыЦФ КАК СуммаЦФ,
		|	&РасчетСуммыПРЦФ КАК СуммаПРЦФ
		|
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокОС.Период КАК Период,
		|		СписокОС.НомерСтроки КАК НомерСтроки,
		|		СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
		|		СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
		|		СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
		|
		|		СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
		|		0 КАК АмортизацияНУИзменение,
		|		СписокОС.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
		|		СписокОС.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
		|		СписокОС.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение,
		|
		|		СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
		|		СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
		|		СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
		|		СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ,
		|
		|		СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
		|		СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
		|
		|		СписокОС.НачислятьИзнос КАК НачислятьИзнос,
		|		СписокОС.ВерсияМетодаНачисления КАК ВерсияМетодаНачисления,
		|		ЛОЖЬ КАК ЭтоАмортизационнаяПремия,
		|
		|		СписокОС.СуммаБУ КАК СуммаБУ,
		|
		|		ВЫБОР
		|			КОГДА СписокОС.НеРассчитыватьАмортизациюБУ
		|
		|				ТОГДА СписокОС.АмортизацияПР
		|
		|			КОГДА (СписокОС.ОстаточнаяСтоимостьПР + СписокОС.ОстаточнаяСтоимостьПРЦФ) = 0
		|					ИЛИ СписокОС.СтоимостьДляВычисленияАмортизации = 0
		| 
		|				ТОГДА 0
		|
		|			КОГДА СписокОС.АмортизацияНачисляетсяПоСтандартамМУ
		|					И СписокОС.СтоимостьДляВычисленияАмортизации <> 0
		|
		|				ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СписокОС.ОстаточнаяСтоимостьПР + СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ЧИСЛО (25,9))
		|						* (ВЫРАЗИТЬ(СписокОС.СуммаБУ КАК ЧИСЛО (25,9)) / ВЫРАЗИТЬ(СписокОС.СтоимостьДляВычисленияАмортизации КАК ЧИСЛО (25,9))) КАК ЧИСЛО (31,2))
		|
		|			КОГДА СписокОС.СтоимостьДляВычисленияАмортизации <> 0
		|
		|				ТОГДА ВЫРАЗИТЬ(СписокОС.ПРДляВычисленияАмортизации 
		|								* СписокОС.СуммаБУ 
		|								/ СписокОС.СтоимостьДляВычисленияАмортизации КАК ЧИСЛО(31,2))
		|			ИНАЧЕ 0
		|
		|		КОНЕЦ КАК СуммаПР
		|
		|	ИЗ 
		|		(ВЫБРАТЬ
		|			СписокОС.Период КАК Период,
		|			СписокОС.НомерСтроки КАК НомерСтроки,
		|			СписокОС.РесурсВыработанныйЗаПрошлыйПериод КАК РесурсВыработанныйЗаПрошлыйПериод,
		|			СписокОС.РесурсВыработанныйЗаТекущийПериод КАК РесурсВыработанныйЗаТекущийПериод,
		|			СписокОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
		|			СписокОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
		|			СписокОС.НеРассчитыватьАмортизациюБУ КАК НеРассчитыватьАмортизациюБУ,
		|			СписокОС.АмортизацияНачисляетсяПоСтандартамМУ КАК АмортизацияНачисляетсяПоСтандартамМУ,
		|
		|			СписокОС.АмортизацияПР КАК АмортизацияПР,
		|
		|			СписокОС.АмортизацияРеглИзменение КАК АмортизацияРеглИзменение,
		|			СписокОС.АмортизацияПРИзменение КАК АмортизацияПРИзменение,
		|			СписокОС.АмортизацияЦФИзменение КАК АмортизацияЦФИзменение,
		|			СписокОС.АмортизацияПРЦФИзменение КАК АмортизацияПРЦФИзменение,
		|
		|			СписокОС.ОстаточнаяСтоимостьРегл КАК ОстаточнаяСтоимостьРегл,
		|			СписокОС.ОстаточнаяСтоимостьПР КАК ОстаточнаяСтоимостьПР,
		|			СписокОС.ОстаточнаяСтоимостьЦФ КАК ОстаточнаяСтоимостьЦФ,
		|			СписокОС.ОстаточнаяСтоимостьПРЦФ КАК ОстаточнаяСтоимостьПРЦФ,
		|
		|			СписокОС.КоэффициентЦФБУ КАК КоэффициентЦФБУ,
		|			СписокОС.КоэффициентЦФПР КАК КоэффициентЦФПР,
		|
		|			СписокОС.НачислятьИзнос КАК НачислятьИзнос,
		|
		|			ВЫБОР
		|				КОГДА СписокОС.МетодНачисленияАмортизацииБУ = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка)
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ВерсияМетодаНачисления,
		|
		|			ВЫБОР
		|				КОГДА СписокОС.НеРассчитыватьАмортизациюБУ
		|						ТОГДА СписокОС.АмортизацияБУ + СписокОС.АмортизацияЦФ
		|					ИНАЧЕ &СуммаАмортизацииБУ 
		|			КОНЕЦ КАК СуммаБУ
		|
		|		ИЗ
		|			ВТ_СписокОССПараметрами_БУ КАК СписокОС
		|
		|		) КАК СписокОС
		|
		|	) КАК СписокОС
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокОС.Период,
		|	СписокОС.НомерСтроки,
		|	СписокОС.РесурсВыработанныйЗаПрошлыйПериод,
		|	СписокОС.РесурсВыработанныйЗаТекущийПериод,
		|	СписокОС.СтоимостьДляВычисленияАмортизации,
		|	СписокОС.ВерсияМетодаНачисления,
		|	ВЫБОР
		|		КОГДА &ПрименяетсяФСБУ6
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл)
		|	КОНЕЦ,
		|	СписокОС.АмортизацияРеглИзменение,
		|	СписокОС.АмортизацияПРИзменение,
		|	СписокОС.АмортизацияЦФИзменение,
		|	СписокОС.АмортизацияПРЦФИзменение,
		|	СписокОС.НачислятьИзнос,
		|	СписокОС.ЭтоАмортизационнаяПремия,
		|	СписокОС.ОстаточнаяСтоимостьРегл,
		|	СписокОС.ОстаточнаяСтоимостьПР,
		|	СписокОС.ОстаточнаяСтоимостьЦФ,
		|	СписокОС.ОстаточнаяСтоимостьПРЦФ";
		
		ЗаменитьПараметрыТекстаЗапросаДляРасчетаАмортизацииБУ(ТекстЗапроса);
		
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаАмортизация = РезультатРасчета.Добавить();
			СтрокаАмортизация.Период = Выборка.Период;
			СтрокаАмортизация.НомерСтроки = Выборка.НомерСтроки;
			
			СтрокаАмортизация.АмортизацияБУ = Выборка.СуммаБУ;
			СтрокаАмортизация.АмортизацияПР = Выборка.СуммаПР;
			СтрокаАмортизация.АмортизацияЦФ = Выборка.СуммаЦФ;
			
			СтрокаАмортизация.РесурсВыработанныйЗаПрошлыйПериод = Выборка.РесурсВыработанныйЗаПрошлыйПериод;
			СтрокаАмортизация.РесурсВыработанныйЗаТекущийПериод = Выборка.РесурсВыработанныйЗаТекущийПериод;
			СтрокаАмортизация.СтоимостьДляВычисленияАмортизацииРегл = Выборка.СтоимостьДляВычисленияАмортизации;
			СтрокаАмортизация.ПорядокНачисленияАмортизации = Выборка.ПорядокНачисленияАмортизации;
			СтрокаАмортизация.ПорядокУчета = Выборка.ПорядокУчета;
			СтрокаАмортизация.ВерсияМетодаНачисления = Выборка.ВерсияМетодаНачисления;
	
			АмортизацияЗаМесяцРегл = АмортизацияЗаМесяцРегл + Выборка.СуммаБУ + Выборка.АмортизацияРеглИзменение;
			АмортизацияЗаМесяцПР = АмортизацияЗаМесяцПР + Выборка.СуммаПР + Выборка.АмортизацияПРИзменение;
			АмортизацияЗаМесяцЦФ = АмортизацияЗаМесяцЦФ + Выборка.СуммаЦФ + Выборка.АмортизацияЦФИзменение;

		КонецЦикла;
		#КонецОбласти

		ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,, ИспользуемыеТаблицы);
		
	КонецЦикла;
	
	Возврат РезультатРасчета;
	
КонецФункции

Функция РассчитатьАмортизациюПоЗаданнымПараметрамНУ(МенеджерВременныхТаблиц, НомерСтроки)
	
	ИспользуемыеТаблицы = ОбщегоНазначенияУТ.СписокВременныхТаблиц(МенеджерВременныхТаблиц);

	РезультатРасчета = Новый ТаблицаЗначений();
	РезультатРасчета.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	РезультатРасчета.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	РезультатРасчета.Колонки.Добавить("АмортизацияНУ", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
	|	ЗначенияПараметров.Период КАК Период,
	|
	|	ЗначенияПараметров.АмортизацияНУ КАК АмортизацияНУ,
	|	ЗначенияПараметров.АмортизацияНУИзменение КАК АмортизацияНУИзменение
	|
	|ИЗ	
	|	ЗначенияПараметровНУ КАК ЗначенияПараметров
	|
	|ГДЕ 
	|	&НомерСтроки = НЕОПРЕДЕЛЕНО 
	|		ИЛИ ЗначенияПараметров.НомерСтроки <= &НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	РасчетАмортизацииОС.УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос);
	
	АмортизацияНУЗаПериод = 0;

	Результат = Запрос.Выполнить();
	ВыборкаСтрок = Результат.Выбрать();

	//@skip-check query-in-loop
	Пока ВыборкаСтрок.Следующий() Цикл
		
		Если НомерСтроки <> Неопределено
			И ВыборкаСтрок.НомерСтроки < НомерСтроки Тогда
			
			// Расчет уже был выполнен, можно использовать исходные данные
			АмортизацияНУЗаПериод = АмортизацияНУЗаПериод + ВыборкаСтрок.АмортизацияНУ + ВыборкаСтрок.АмортизацияНУИзменение;
			
			Продолжить;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("НомерСтроки", ВыборкаСтрок.НомерСтроки);
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ВыборкаСтрок.Период));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ВыборкаСтрок.Период));
		Запрос.УстановитьПараметр("АмортизацияНУЗаПериод", АмортизацияНУЗаПериод);
		
		ДатаПереходаКЛинейномуМетоду = УправлениеВнеоборотнымиАктивамиПереопределяемый.ПолучитьДатуПереходаКЛинейномуМетоду(КонецМесяца(ВыборкаСтрок.Период), Неопределено);
		Запрос.УстановитьПараметр("ДатаПереходаКЛинейномуМетоду", ДатаПереходаКЛинейномуМетоду);

		#Область ПодготовкаПараметров
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, МЕСЯЦ) КАК НачалоМесяца,
		|	КОНЕЦПЕРИОДА(ЗначенияПараметров.Период, МЕСЯЦ) КАК КонецМесяца,
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|
		|	ЗначенияПараметров.НеРассчитыватьАмортизациюНУ КАК НеРассчитыватьАмортизациюНУ,
		|
		|	ЗначенияПараметров.АмортизацияНУ КАК АмортизацияНУ,
		|
		|	ЗначенияПараметров.ДатаВводаВЭксплуатациюНУ КАК ДатаВводаВЭксплуатациюНУ,
		|	ЗначенияПараметров.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
		|	ЗначенияПараметров.АмортизацияДо2009 КАК АмортизацияДо2009,
		|	ЗначенияПараметров.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
		|
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ЗначенияПараметров.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ЗначенияПараметров.ДатаВводаВЭксплуатациюНУ, МЕСЯЦ)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЗначенияПараметров.НачислятьАмортизациюНУ
		|	КОНЕЦ КАК НачислятьАмортизациюНУ,
		|
		|	ЗначенияПараметров.СпециальныйКоэффициентНУ КАК СпециальныйКоэффициентНУ,
		|	ЗначенияПараметров.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользованияНУ,
		|	ЗначенияПараметров.СтоимостьНУ КАК СтоимостьНУ,
		|	ЗначенияПараметров.СтоимостьНУ КАК СтоимостьНУНачальныйОстаток,
		|	ЗначенияПараметров.ФактическийСрокИспользованияДо2009 КАК ФактическийСрокИспользованияДо2009,
		|
		|	ЗначенияПараметров.АмортизацияНУНаНачалоПериода КАК АмортизацияНУНаНачалоПериода,
		|
		|	ЗначенияПараметров.АмортизацияНУИзменение КАК АмортизацияНУИзменение
		|
		|ПОМЕСТИТЬ ЗначенияПараметровЗаМесяц
		|
		|ИЗ
		|	ЗначенияПараметровНУ КАК ЗначенияПараметров
		|
		|ГДЕ
		|	ЗначенияПараметров.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.Период КАК Период,
		|	ЗначенияПараметров.НомерСтроки КАК НомерСтроки,
		|
		|	ЗначенияПараметров.НеРассчитыватьАмортизациюНУ КАК НеРассчитыватьАмортизациюНУ,
		|
		|	ЗначенияПараметров.АмортизацияНУ КАК АмортизацияНУ,
		|	ЗначенияПараметров.АмортизацияНУИзменение КАК АмортизацияНУИзменение,
		|	0 КАК АмортизационнаяПремия,
		|
		|	ЗначенияПараметров.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ,
		|	ЗначенияПараметров.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
		|	ЗначенияПараметров.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользованияНУ,
		|	ЗначенияПараметров.СтоимостьНУНачальныйОстаток КАК СтоимостьНУНачальныйОстаток,
		|	ЗначенияПараметров.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
		|	ЗначенияПараметров.СпециальныйКоэффициентНУ КАК СпециальныйКоэффициентНУ,
		|
		|	&НормаАмортизации КАК НормаАмортизации,
		|
		// ФактическийСрокПриПереходеКЛинейномуМетоду
		|	ВЫБОР
		|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
		|			ТОГДА ЕСТЬNULL(ЗначенияПараметров.ФактическийСрокИспользованияДо2009, 0)
		|		ИНАЧЕ (ГОД(&ДатаПереходаКЛинейномуМетоду) 
		|					- ГОД(ЗначенияПараметров.ДатаВводаВЭксплуатациюНУ)) * 12 
		|				+ (МЕСЯЦ(&ДатаПереходаКЛинейномуМетоду) - МЕСЯЦ(ЗначенияПараметров.ДатаВводаВЭксплуатациюНУ)) - 1
		|	КОНЕЦ КАК ФактическийСрокПриПереходеКЛинейномуМетоду,
		|
		// АмортизацияПриПереходеКЛинейномуМетоду
		|	ВЫБОР
		|		КОГДА ГОД(&ДатаПереходаКЛинейномуМетоду) = 2009
		|			ТОГДА ЕСТЬNULL(ЗначенияПараметров.АмортизацияДо2009, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АмортизацияПриПереходеКЛинейномуМетоду,
		|
		// ОстаточнаяСтоимостьНУ
		|	ЗначенияПараметров.СтоимостьНУ
		|		- ЗначенияПараметров.АмортизацияНУНаНачалоПериода
		|		- &АмортизацияНУЗаПериод КАК ОстаточнаяСтоимостьНУ,
		|
		// АмортизацияНУНачальныйОстаток
		|	ЗначенияПараметров.АмортизацияНУНаНачалоПериода 
		|		+ &АмортизацияНУЗаПериод КАК АмортизацияНУНачальныйОстаток,
		|
		// КоэффициентЦФНУ
		|	0 КАК КоэффициентЦФНУ,
		|
		|	ЛОЖЬ КАК НачислятьИзнос
		|
		|ПОМЕСТИТЬ ВТ_СписокОССПараметрами_НУ
		|
		|ИЗ
		|	ЗначенияПараметровЗаМесяц КАК ЗначенияПараметров
		|
		|ГДЕ
		|	ЗначенияПараметров.НомерСтроки = &НомерСтроки
		|";

		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, 
			"&НормаАмортизации", 
			РасчетАмортизацииОСЛокализация.ТекстПоляНормаАмортизации("ЗначенияПараметров.АмортизационнаяГруппа"));
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		#КонецОбласти
		
		#Область РасчетАмортизации
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СписокОС.Период КАК Период,
		|	СписокОС.НомерСтроки КАК НомерСтроки,
		|
		|	СписокОС.АмортизацияНУИзменение КАК АмортизацияНУИзменение,
		|
		|	&РасчетСуммыНУ_БезЦФ КАК СуммаНУ
		|
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокОС.Период КАК Период,
		|		СписокОС.НомерСтроки КАК НомерСтроки,
		|
		|		СписокОС.АмортизацияНУИзменение КАК АмортизацияНУИзменение,
		|		СписокОС.ОстаточнаяСтоимостьНУ КАК ОстаточнаяСтоимостьНУ,
		|
		|		СписокОС.КоэффициентЦФНУ КАК КоэффициентЦФНУ,
		|		СписокОС.НачислятьИзнос КАК НачислятьИзнос,
		|		ЛОЖЬ КАК ЭтоАмортизационнаяПремия,
		|
		|		ВЫБОР
		|			КОГДА СписокОС.НеРассчитыватьАмортизациюНУ
		|					ТОГДА СписокОС.АмортизацияНУ
		|				ИНАЧЕ &СуммаАмортизацииНУ 
		|		КОНЕЦ КАК СуммаНУ
		|	ИЗ
		|		ВТ_СписокОССПараметрами_НУ КАК СписокОС
		|
		|	) КАК СписокОС
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокОС.Период,
		|	СписокОС.НомерСтроки,
		|	СписокОС.АмортизацияНУИзменение,
		|	СписокОС.НачислятьИзнос,
		|	СписокОС.ЭтоАмортизационнаяПремия,
		|	СписокОС.ОстаточнаяСтоимостьНУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|";
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, 
			"&НормаАмортизации", 
			РасчетАмортизацииОСЛокализация.ТекстПоляНормаАмортизации("ЗначенияПараметров.АмортизационнаяГруппа"));
			
		ЗаменитьПараметрыТекстаЗапросаДляРасчетаАмортизацииНУ(ТекстЗапроса);
		
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаАмортизация = РезультатРасчета.Добавить();
			СтрокаАмортизация.Период = Выборка.Период;
			СтрокаАмортизация.НомерСтроки = Выборка.НомерСтроки;
			
			СтрокаАмортизация.АмортизацияНУ = Выборка.СуммаНУ;
			
			АмортизацияНУЗаПериод = АмортизацияНУЗаПериод + Выборка.СуммаНУ + Выборка.АмортизацияНУИзменение;

		КонецЦикла;
		
		#КонецОбласти

		ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,, ИспользуемыеТаблицы);
		
	КонецЦикла;
	
	Возврат РезультатРасчета;
	
КонецФункции

Процедура ЗаменитьПараметрыТекстаЗапросаДляРасчетаАмортизацииБУ(ТекстЗапроса)

	ПараметрыТекстаЗапроса = ПараметрыТекстаЗапросаСуммаАмортизацииБУ();
	ПараметрыТекстаЗапроса.ТекстСтоимостьДляВычисленияАмортизации = "СписокОС.СтоимостьДляВычисленияАмортизации";
	ПараметрыТекстаЗапроса.ТекстЛиквидационнаяСтоимость = "СписокОС.ЛиквидационнаяСтоимость";
	ПараметрыТекстаЗапроса.ТекстСтоимостьНаНачалоГода = "СписокОС.СтоимостьНаНачалоГода";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииБУ", ТекстЗапросаСуммаАмортизацииБУ(ПараметрыТекстаЗапроса));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаБУ",        ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаБУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПР_регл",   ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаПР"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаЦФ",        ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаЦФ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаПРЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаПРЦФ"));
	
	ТекстПоля =
	"		ВЫБОР 
	|			КОГДА СписокОС.ОстаточнаяСтоимостьРегл <= 0
	|				ТОГДА 0
	|			КОГДА &СуммаБУ > СписокОС.ОстаточнаяСтоимостьРегл
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьРегл - &СуммаБУ < &МинимальнаяОстаточнаяСтоимостьРегл
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьРегл
	|			ИНАЧЕ &СуммаБУ
	|		КОНЕЦ";
	ТекстПоля = СтрЗаменить(ТекстПоля, "&СуммаБУ", "СУММА(СписокОС.СуммаБУ - ВЫРАЗИТЬ(СписокОС.СуммаБУ * СписокОС.КоэффициентЦФБУ КАК ЧИСЛО(31,2)))");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасчетСуммыБУ_БезЦФ", ТекстПоля);
	
	ТекстПоля =
	"		ВЫБОР 
	|			КОГДА СписокОС.НачислятьИзнос ИЛИ СписокОС.ОстаточнаяСтоимостьПР = 0
	|				ТОГДА 0
	|			КОГДА (СписокОС.ОстаточнаяСтоимостьПР > 0
	|						И (&СуммаПР > СписокОС.ОстаточнаяСтоимостьПР
	|							ИЛИ СписокОС.ОстаточнаяСтоимостьПР - &СуммаПР < &МинимальнаяОстаточнаяСтоимостьРегл)
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьПР < 0
	|						И (&СуммаПР > -СписокОС.ОстаточнаяСтоимостьПР
	|							ИЛИ -СписокОС.ОстаточнаяСтоимостьПР - &СуммаПР < &МинимальнаяОстаточнаяСтоимостьРегл))
	|					И НЕ СписокОС.ЭтоАмортизационнаяПремия
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьПР
	|			ИНАЧЕ &СуммаПР
	|		КОНЕЦ";
	ТекстПоля = СтрЗаменить(ТекстПоля, "&СуммаПР", "СУММА(СписокОС.СуммаПР - ВЫРАЗИТЬ(СписокОС.СуммаПР * СписокОС.КоэффициентЦФПР КАК ЧИСЛО(31,2)))");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасчетСуммыПР_БезЦФ", ТекстПоля);
	
	ТекстПоля =
	"		ВЫБОР
	|			КОГДА СписокОС.ОстаточнаяСтоимостьЦФ = 0
	|				ТОГДА 0
	|			КОГДА &СуммаЦФ > СписокОС.ОстаточнаяСтоимостьЦФ
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьЦФ - &СуммаЦФ < &МинимальнаяОстаточнаяСтоимостьРегл
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьЦФ
	|			ИНАЧЕ &СуммаЦФ
	|		КОНЕЦ";
	ТекстПоля = СтрЗаменить(ТекстПоля, "&СуммаЦФ", "СУММА(ВЫРАЗИТЬ(СписокОС.СуммаБУ * СписокОС.КоэффициентЦФБУ КАК ЧИСЛО(31,2)))");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасчетСуммыЦФ", ТекстПоля);
	
	ТекстПоля =
	"		ВЫБОР 
	|			КОГДА СписокОС.НачислятьИзнос ИЛИ СписокОС.ОстаточнаяСтоимостьПРЦФ = 0
	|				ТОГДА 0
	|			КОГДА СписокОС.ОстаточнаяСтоимостьПРЦФ > 0
	|						И (&СуммаПРЦФ > СписокОС.ОстаточнаяСтоимостьПРЦФ
	|							ИЛИ СписокОС.ОстаточнаяСтоимостьПРЦФ - &СуммаПРЦФ < &МинимальнаяОстаточнаяСтоимостьРегл)
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьПРЦФ < 0
	|						И (&СуммаПРЦФ > -СписокОС.ОстаточнаяСтоимостьПРЦФ
	|							ИЛИ -СписокОС.ОстаточнаяСтоимостьПРЦФ - &СуммаПРЦФ < &МинимальнаяОстаточнаяСтоимостьРегл)
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьПРЦФ
	|			ИНАЧЕ &СуммаПРЦФ
	|		КОНЕЦ";
	ТекстПоля = СтрЗаменить(ТекстПоля, "&СуммаПРЦФ", "СУММА(ВЫРАЗИТЬ(СписокОС.СуммаПР * СписокОС.КоэффициентЦФПР КАК ЧИСЛО(31,2)))");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасчетСуммыПРЦФ", ТекстПоля);
	
КонецПроцедуры

Процедура ЗаменитьПараметрыТекстаЗапросаДляРасчетаАмортизацииНУ(ТекстЗапроса)

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаАмортизацииНУ", ТекстЗапросаСуммаАмортизацииНУ());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУ_регл",   ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаНУ"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаНУЦФ_регл", ВнеоборотныеАктивыСлужебный.ТекстРаспределенияСуммыАмортизации("Амортизация.СуммаНУЦФ"));
	
	ТекстПоля =
	"		ВЫБОР 
	|			КОГДА СписокОС.ОстаточнаяСтоимостьНУ <= 0
	|				ТОГДА 0
	|			КОГДА (&СуммаНУ > СписокОС.ОстаточнаяСтоимостьНУ
	|						ИЛИ СписокОС.ОстаточнаяСтоимостьНУ - &СуммаНУ < &МинимальнаяОстаточнаяСтоимостьРегл)
	|					И НЕ СписокОС.ЭтоАмортизационнаяПремия
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьНУ
	|			ИНАЧЕ &СуммаНУ
	|		КОНЕЦ";
	ТекстПоля = СтрЗаменить(ТекстПоля, "&СуммаНУ", "СУММА(СписокОС.СуммаНУ - ВЫРАЗИТЬ(СписокОС.СуммаНУ * СписокОС.КоэффициентЦФНУ КАК ЧИСЛО(31,2)))");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасчетСуммыНУ_БезЦФ", ТекстПоля);
	
	ТекстПоля =
	"		ВЫБОР 
	|			КОГДА СписокОС.ОстаточнаяСтоимостьНУЦФ = 0
	|				ТОГДА 0
	|			КОГДА &СуммаНУЦФ > СписокОС.ОстаточнаяСтоимостьНУЦФ
	|					ИЛИ СписокОС.ОстаточнаяСтоимостьНУЦФ - &СуммаНУЦФ < &МинимальнаяОстаточнаяСтоимостьРегл
	|				ТОГДА СписокОС.ОстаточнаяСтоимостьНУЦФ
	|			ИНАЧЕ &СуммаНУЦФ
	|		КОНЕЦ";
	ТекстПоля = СтрЗаменить(ТекстПоля, "&СуммаНУЦФ", "СУММА(ВЫРАЗИТЬ(СписокОС.СуммаНУ * СписокОС.КоэффициентЦФНУ КАК ЧИСЛО(31,2)))");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасчетСуммыНУЦФ", ТекстПоля);
		
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗаПериодНУ(ПараметрыДляРасчета, Параметры)
	
	Если НЕ Параметры.ЗаполнитьНУ Тогда
		Возврат;
	КонецЕсли;

	ИспользуемыеВТ = ОбщегоНазначенияУТ.СписокВременныхТаблиц(Параметры.МенеджерВременныхТаблиц);

	ПараметрыДляРасчета.Вставить("ДатаВводаВЭксплуатациюНУ", '00010101');
	ПараметрыДляРасчета.Вставить("АмортизацияНУНаНачалоПериода", 0);
	ПараметрыДляРасчета.Вставить("АмортизацияДо2009", 0);
	ПараметрыДляРасчета.Вставить("ФактическийСрокИспользованияДо2009", 0);

	СписокЗапросов = Новый Массив;

	#Область ТаблицаДат
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВсеЗаписиРегистров.Дата КАК Дата,
	|	ВсеЗаписиРегистров.Регистратор КАК Регистратор,
	|	ВсеЗаписиРегистров.ЭтоИзменения КАК ЭтоИзменения,
	|
	|	МИНИМУМ(СледующиеЗаписиРегистров.Дата) КАК СледующаяДата
	|
	|ПОМЕСТИТЬ СледующиеЗаписиРегистров
	|
	|ИЗ
	|	ВсеЗаписиРегистров КАК ВсеЗаписиРегистров
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЗаписиРегистров КАК СледующиеЗаписиРегистров
	|		ПО СледующиеЗаписиРегистров.Дата <= &КонецПериодаНУ
	|			И СледующиеЗаписиРегистров.ЭтоИзменения
	|			И СледующиеЗаписиРегистров.ОтражатьВНУ
	|			И СледующиеЗаписиРегистров.Дата >= НАЧАЛОПЕРИОДА(ВсеЗаписиРегистров.Дата, МЕСЯЦ)
	|			И СледующиеЗаписиРегистров.Дата <= КОНЕЦПЕРИОДА(ВсеЗаписиРегистров.Дата, МЕСЯЦ)
	|			И (НЕ ВсеЗаписиРегистров.ЭтоИзменения
	|				ИЛИ СледующиеЗаписиРегистров.Дата > ВсеЗаписиРегистров.Дата
	|				ИЛИ СледующиеЗаписиРегистров.Дата = ВсеЗаписиРегистров.Дата
	|					И СледующиеЗаписиРегистров.Порядок >= ВсеЗаписиРегистров.Порядок
	|					И СледующиеЗаписиРегистров.Регистратор > ВсеЗаписиРегистров.Регистратор)
	|
	|ГДЕ
	|	ВсеЗаписиРегистров.Дата <= &КонецПериодаНУ
	|	И ВсеЗаписиРегистров.ОтражатьВНУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЗаписиРегистров.Дата,
	|	ВсеЗаписиРегистров.Регистратор,
	|	ВсеЗаписиРегистров.ЭтоИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗаписиРегистров.Дата КАК Период,
	|	ВсеЗаписиРегистров.Регистратор КАК Регистратор,
	|	ВсеЗаписиРегистров.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВсеЗаписиРегистров.ЭтоИзменения КАК ЭтоИзменения,
	|	ВсеЗаписиРегистров.Порядок КАК Порядок,
	|	НАЧАЛОПЕРИОДА(ВсеЗаписиРегистров.Дата, МЕСЯЦ) КАК НачалоМесяца,
	|
	|	ВЫБОР 
	|		КОГДА НЕ ВсеЗаписиРегистров.ЭтоИзменения
	|
	|			ТОГДА НАЧАЛОПЕРИОДА(ВсеЗаписиРегистров.Дата, МЕСЯЦ)
	|
	|		КОГДА СледующиеЗаписиРегистров.СледующаяДата ЕСТЬ NULL
	|
	|			ТОГДА КОНЕЦПЕРИОДА(ВсеЗаписиРегистров.Дата, МЕСЯЦ)
	|
	|		КОГДА НАЧАЛОПЕРИОДА(СледующиеЗаписиРегистров.СледующаяДата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СледующиеЗаписиРегистров.СледующаяДата, МЕСЯЦ)
	|
	|			ТОГДА СледующиеЗаписиРегистров.СледующаяДата
	|
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(СледующиеЗаписиРегистров.СледующаяДата, ДЕНЬ, -1)
	|
	|	КОНЕЦ КАК Дата,
	|
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВсеЗаписиРегистров.Дата, МЕСЯЦ), СЕКУНДА, -1) КАК ДатаПараметров
	|
	|ПОМЕСТИТЬ ТаблицаИзменений
	|
	|ИЗ
	|	ВсеЗаписиРегистров КАК ВсеЗаписиРегистров
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СледующиеЗаписиРегистров КАК СледующиеЗаписиРегистров
	|		ПО СледующиеЗаписиРегистров.Дата = ВсеЗаписиРегистров.Дата
	|			И СледующиеЗаписиРегистров.Регистратор = ВсеЗаписиРегистров.Регистратор
	|
	|ГДЕ
	|	ВсеЗаписиРегистров.Дата <= &КонецПериодаНУ
	|	И ВсеЗаписиРегистров.ОтражатьВНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРегистраРегистраторЗаписи.Дата КАК Дата,
	|	ДанныеРегистраРегистраторЗаписи.Период КАК Период,
	|	ДанныеРегистраРегистраторЗаписи.Регистратор КАК Регистратор,
	|	ДанныеРегистраРегистраторЗаписи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистраРегистраторЗаписи.ДатаПараметров КАК ДатаПараметров,
	|	ДанныеРегистраРегистраторЗаписи.ЭтоИзменения КАК ЭтоИзменения,
	|	ДанныеРегистраРегистраторЗаписи.Порядок КАК Порядок,
	|	МестонахождениеОС_Записи.Организация КАК Организация
	|
	|ПОМЕСТИТЬ ТаблицаДат
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистраПериодЗаписи.Дата КАК Дата,
	|		ДанныеРегистраПериодЗаписи.Период КАК Период,
	|		ДанныеРегистраПериодЗаписи.Регистратор КАК Регистратор,
	|		ДанныеРегистраПериодЗаписи.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ДанныеРегистраПериодЗаписи.ДатаПараметров КАК ДатаПараметров,
	|		ДанныеРегистраПериодЗаписи.ЭтоИзменения КАК ЭтоИзменения,
	|		ДанныеРегистраПериодЗаписи.Порядок КАК Порядок,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи КАК ПериодЗаписи,
	|		МАКСИМУМ(ДанныеРегистраРегистраторЗаписи.Регистратор) КАК РегистраторЗаписи
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаИзменений.Дата КАК Дата,
	|			ТаблицаИзменений.Период КАК Период,
	|			ТаблицаИзменений.Регистратор КАК Регистратор,
	|			ТаблицаИзменений.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|			ТаблицаИзменений.ДатаПараметров КАК ДатаПараметров,
	|			ТаблицаИзменений.ЭтоИзменения КАК ЭтоИзменения,
	|			ТаблицаИзменений.Порядок КАК Порядок,
	|			МАКСИМУМ(ДанныеРегистраПериодЗаписи.Период) КАК ПериодЗаписи
	|		ИЗ
	|			ТаблицаИзменений КАК ТаблицаИзменений
	|
	|				ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_Записи КАК ДанныеРегистраПериодЗаписи
	|				ПО ДанныеРегистраПериодЗаписи.Период <= ТаблицаИзменений.ДатаПараметров
	|				
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаИзменений.Дата,
	|			ТаблицаИзменений.Период,
	|			ТаблицаИзменений.Регистратор,
	|			ТаблицаИзменений.ХозяйственнаяОперация,
	|			ТаблицаИзменений.ДатаПараметров,
	|			ТаблицаИзменений.ЭтоИзменения,
	|			ТаблицаИзменений.Порядок
	|
	|		) КАК ДанныеРегистраПериодЗаписи
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_Записи КАК ДанныеРегистраРегистраторЗаписи
	|		ПО ДанныеРегистраРегистраторЗаписи.Период = ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|				
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеРегистраПериодЗаписи.Дата,
	|		ДанныеРегистраПериодЗаписи.Период,
	|		ДанныеРегистраПериодЗаписи.Регистратор,
	|		ДанныеРегистраПериодЗаписи.ХозяйственнаяОперация,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи,
	|		ДанныеРегистраПериодЗаписи.ДатаПараметров,
	|		ДанныеРегистраПериодЗаписи.ЭтоИзменения,
	|		ДанныеРегистраПериодЗаписи.Порядок
	|
	|	) КАК ДанныеРегистраРегистраторЗаписи
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС_Записи КАК МестонахождениеОС_Записи
	|	ПО МестонахождениеОС_Записи.Регистратор = ДанныеРегистраРегистраторЗаписи.РегистраторЗаписи
	|		И МестонахождениеОС_Записи.Период = ДанныеРегистраРегистраторЗаписи.ПериодЗаписи";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область ПервоначальныеСведенияОС
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистраРегистраторЗаписи.Дата КАК Дата,
	|	ПервоначальныеСведенияОС_Записи.ДатаВводаВЭксплуатациюНУ КАК ДатаВводаВЭксплуатациюНУ,
	|	ПервоначальныеСведенияОС_Записи.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияОС_Записи.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияОС_Записи.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
	|	ЕСТЬNULL(ПринятиеКУчетуНУ.Ссылка.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаПринятияКУчету,
	|	ЕСТЬNULL(ПринятиеКУчетуНУ.Ссылка.РежимИсправленияСПрошлойДаты, ЛОЖЬ) КАК РежимИсправленияСПрошлойДаты,
	|	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуНУ.Ссылка.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ПринятиеКУчетуНУ.СтоимостьНУ, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПринятиеКУчетуНУ.СтоимостьБУ, 0) 
	|	КОНЕЦ КАК ПредварительнаяСтоимостьНУ,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПринятиеКУчетуНУ.Ссылка.РежимИсправленияСПрошлойДаты, ЛОЖЬ)
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПринятиеКУчетуНУ.СтоимостьНУ, 0) * ПринятиеКУчетуНУ.Ссылка.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ КАК ЧИСЛО (31, 2)) / 100 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК АмортизационнаяПремия
	|
	|ПОМЕСТИТЬ ПервоначальныеСведенияОС
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистраПериодЗаписи.Дата КАК Дата,
	|		ДанныеРегистраПериодЗаписи.Организация КАК Организация,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи КАК ПериодЗаписи,
	|		МАКСИМУМ(ДанныеРегистраРегистраторЗаписи.Регистратор) КАК РегистраторЗаписи
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДат.Дата КАК Дата,
	|			ТаблицаДат.Организация КАК Организация,
	|			МАКСИМУМ(ДанныеРегистраПериодЗаписи.Период) КАК ПериодЗаписи
	|		ИЗ
	|			ТаблицаДат КАК ТаблицаДат
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_Записи КАК ДанныеРегистраПериодЗаписи
	|				ПО ДанныеРегистраПериодЗаписи.Период <= ТаблицаДат.ДатаПараметров
	|					И ДанныеРегистраПериодЗаписи.Организация = ТаблицаДат.Организация
	|				
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаДат.Дата,
	|			ТаблицаДат.Организация
	|
	|		) КАК ДанныеРегистраПериодЗаписи
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_Записи КАК ДанныеРегистраРегистраторЗаписи
	|		ПО ДанныеРегистраРегистраторЗаписи.Период = ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|			И ДанныеРегистраРегистраторЗаписи.Организация = ДанныеРегистраПериодЗаписи.Организация
	|
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеРегистраПериодЗаписи.Дата,
	|		ДанныеРегистраПериодЗаписи.Организация,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|
	|	) КАК ДанныеРегистраРегистраторЗаписи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС_Записи КАК ПервоначальныеСведенияОС_Записи
	|	ПО ПервоначальныеСведенияОС_Записи.Регистратор = ДанныеРегистраРегистраторЗаписи.РегистраторЗаписи
	|		И ПервоначальныеСведенияОС_Записи.Период = ДанныеРегистраРегистраторЗаписи.ПериодЗаписи
	|		И ПервоначальныеСведенияОС_Записи.Организация = ДанныеРегистраРегистраторЗаписи.Организация
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4.ОС КАК ПринятиеКУчетуНУ
	|	ПО ПринятиеКУчетуНУ.Ссылка = ПервоначальныеСведенияОС_Записи.ДокументВводаВЭксплуатациюНУ
	|		И ПринятиеКУчетуНУ.ОсновноеСредство = &ОсновноеСредство
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПорядокУчетаОСБУ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистраРегистраторЗаписи.Дата КАК Дата,
	|	ПорядокУчетаОСБУ_Записи.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	|	ПорядокУчетаОСБУ_Записи.НачислятьАмортизациюБУ КАК НачислятьАмортизациюБУ,
	|	ПорядокУчетаОСБУ_Записи.НачислятьАмортизациюНУ КАК НачислятьАмортизациюНУ
	|
	|ПОМЕСТИТЬ ПорядокУчетаОСБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистраПериодЗаписи.Дата КАК Дата,
	|		ДанныеРегистраПериодЗаписи.Организация КАК Организация,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи КАК ПериодЗаписи,
	|		МАКСИМУМ(ДанныеРегистраРегистраторЗаписи.Регистратор) КАК РегистраторЗаписи
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДат.Дата КАК Дата,
	|			ТаблицаДат.Организация КАК Организация,
	|			МАКСИМУМ(ДанныеРегистраПериодЗаписи.Период) КАК ПериодЗаписи
	|		ИЗ
	|			ТаблицаДат КАК ТаблицаДат
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Записи КАК ДанныеРегистраПериодЗаписи
	|				ПО ДанныеРегистраПериодЗаписи.Период <= ТаблицаДат.ДатаПараметров
	|					И ДанныеРегистраПериодЗаписи.Организация = ТаблицаДат.Организация
	|				
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаДат.Дата,
	|			ТаблицаДат.Организация
	|
	|		) КАК ДанныеРегистраПериодЗаписи
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Записи КАК ДанныеРегистраРегистраторЗаписи
	|		ПО ДанныеРегистраРегистраторЗаписи.Период = ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|			И ДанныеРегистраРегистраторЗаписи.Организация = ДанныеРегистраПериодЗаписи.Организация
	|
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеРегистраПериодЗаписи.Дата,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи,
	|		ДанныеРегистраПериодЗаписи.Организация
	|
	|	) КАК ДанныеРегистраРегистраторЗаписи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ_Записи КАК ПорядокУчетаОСБУ_Записи
	|	ПО ПорядокУчетаОСБУ_Записи.Регистратор = ДанныеРегистраРегистраторЗаписи.РегистраторЗаписи
	|		И ПорядокУчетаОСБУ_Записи.Период = ДанныеРегистраРегистраторЗаписи.ПериодЗаписи
	|		И ПорядокУчетаОСБУ_Записи.Организация = ДанныеРегистраРегистраторЗаписи.Организация";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПараметрыАмортизацииОСБУ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистраРегистраторЗаписи.Дата КАК Дата,
	|	ПараметрыАмортизацииОСБУ_Записи.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользованияНУ,
	|	ПараметрыАмортизацииОСБУ_Записи.КоэффициентАмортизацииБУ КАК КоэффициентАмортизацииБУ,
	|	ПараметрыАмортизацииОСБУ_Записи.КоэффициентУскорения КАК КоэффициентУскорения,
	|	ПараметрыАмортизацииОСБУ_Записи.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ_Записи.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ_Записи.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ_Записи.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ_Записи.ГрафикАмортизации КАК ГрафикАмортизации,
	|	ПараметрыАмортизацииОСБУ_Записи.СпециальныйКоэффициент КАК СпециальныйКоэффициент,
	|	ПараметрыАмортизацииОСБУ_Записи.СтоимостьДляВычисленияАмортизацииЦФ КАК СтоимостьДляВычисленияАмортизацииЦФ
	|
	|ПОМЕСТИТЬ ПараметрыАмортизацииОСБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистраПериодЗаписи.Дата КАК Дата,
	|		ДанныеРегистраПериодЗаписи.Организация КАК Организация,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи КАК ПериодЗаписи,
	|		МАКСИМУМ(ДанныеРегистраРегистраторЗаписи.Регистратор) КАК РегистраторЗаписи
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДат.Дата КАК Дата,
	|			ТаблицаДат.Организация КАК Организация,
	|			МАКСИМУМ(ДанныеРегистраПериодЗаписи.Период) КАК ПериодЗаписи
	|		ИЗ
	|			ТаблицаДат КАК ТаблицаДат
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Записи КАК ДанныеРегистраПериодЗаписи
	|				ПО ДанныеРегистраПериодЗаписи.Период <= ТаблицаДат.ДатаПараметров
	|					И ДанныеРегистраПериодЗаписи.Организация = ТаблицаДат.Организация
	|				
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаДат.Дата,
	|			ТаблицаДат.Организация
	|
	|		) КАК ДанныеРегистраПериодЗаписи
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Записи КАК ДанныеРегистраРегистраторЗаписи
	|		ПО ДанныеРегистраРегистраторЗаписи.Период = ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|			И ДанныеРегистраРегистраторЗаписи.Организация = ДанныеРегистраПериодЗаписи.Организация
	|
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеРегистраПериодЗаписи.Дата,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи,
	|		ДанныеРегистраПериодЗаписи.Организация
	|
	|	) КАК ДанныеРегистраРегистраторЗаписи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ_Записи КАК ПараметрыАмортизацииОСБУ_Записи
	|	ПО ПараметрыАмортизацииОСБУ_Записи.Регистратор = ДанныеРегистраРегистраторЗаписи.РегистраторЗаписи
	|		И ПараметрыАмортизацииОСБУ_Записи.Период = ДанныеРегистраРегистраторЗаписи.ПериодЗаписи
	|		И ПараметрыАмортизацииОСБУ_Записи.Организация = ДанныеРегистраРегистраторЗаписи.Организация";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПорядокУчетаОС
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистраРегистраторЗаписи.Дата КАК Дата,
	|	ПорядокУчетаОС_Записи.ПоказательНаработки КАК ПоказательНаработки,
	|	ПорядокУчетаОС_Записи.ОбъемНаработки КАК ОбъемНаработки
	|
	|ПОМЕСТИТЬ ПорядокУчетаОС
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистраПериодЗаписи.Дата КАК Дата,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи КАК ПериодЗаписи,
	|		МАКСИМУМ(ДанныеРегистраРегистраторЗаписи.Регистратор) КАК РегистраторЗаписи
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДат.Дата КАК Дата,
	|			МАКСИМУМ(ДанныеРегистраПериодЗаписи.Период) КАК ПериодЗаписи
	|		ИЗ
	|			ТаблицаДат КАК ТаблицаДат
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОС_Записи КАК ДанныеРегистраПериодЗаписи
	|				ПО ДанныеРегистраПериодЗаписи.Период <= ТаблицаДат.ДатаПараметров
	|				
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаДат.Дата
	|
	|		) КАК ДанныеРегистраПериодЗаписи
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОС_Записи КАК ДанныеРегистраРегистраторЗаписи
	|		ПО ДанныеРегистраРегистраторЗаписи.Период = ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеРегистраПериодЗаписи.Дата,
	|		ДанныеРегистраПериодЗаписи.ПериодЗаписи
	|
	|	) КАК ДанныеРегистраРегистраторЗаписи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОС_Записи КАК ПорядокУчетаОС_Записи
	|	ПО ПорядокУчетаОС_Записи.Регистратор = ДанныеРегистраРегистраторЗаписи.РегистраторЗаписи
	|		И ПорядокУчетаОС_Записи.Период = ДанныеРегистраРегистраторЗаписи.ПериодЗаписи";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СтоимостьАмортизацияИсходныхОС
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИсточникИПолучатель.Ссылка КАК Ссылка,
	|	ТаблицаИсточникИПолучатель.ОсновноеСредствоИсточник КАК ОсновноеСредство,
	|	ЕСТЬNULL(СтоимостьНаДату.Стоимость, 0) КАК Стоимость,
	|	ЕСТЬNULL(СтоимостьНаДату.СтоимостьРегл, 0) КАК СтоимостьРегл,
	|	ЕСТЬNULL(СтоимостьНаДату.СтоимостьНУ, 0) КАК СтоимостьНУ,
	|	ЕСТЬNULL(СтоимостьНаДату.СтоимостьПР, 0) КАК СтоимостьПР,
	|	ЕСТЬNULL(СтоимостьНаДату.СтоимостьЦФ, 0) КАК СтоимостьЦФ,
	|	ЕСТЬNULL(СтоимостьНаДату.СтоимостьПРЦФ, 0) КАК СтоимостьПРЦФ,
	|	ЕСТЬNULL(АмортизацияНаДату.Амортизация, 0) КАК Амортизация,
	|	ЕСТЬNULL(АмортизацияНаДату.АмортизацияРегл, 0) КАК АмортизацияРегл,
	|	ЕСТЬNULL(АмортизацияНаДату.АмортизацияЦФ, 0) КАК АмортизацияЦФ,
	|	ЕСТЬNULL(АмортизацияНаДату.АмортизацияПР, 0) КАК АмортизацияПР
	|
	|ИЗ
	|	ТаблицаИсточникИПолучатель КАК ТаблицаИсточникИПолучатель
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНаДату КАК СтоимостьНаДату
	|		ПО СтоимостьНаДату.Регистратор = ТаблицаИсточникИПолучатель.Ссылка
	|			И СтоимостьНаДату.ОсновноеСредство = ТаблицаИсточникИПолучатель.ОсновноеСредствоИсточник
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНаДату КАК АмортизацияНаДату
	|		ПО АмортизацияНаДату.Регистратор = ТаблицаИсточникИПолучатель.Ссылка
	|			И СтоимостьНаДату.ОсновноеСредство = ТаблицаИсточникИПолучатель.ОсновноеСредствоИсточник
	|
	|ГДЕ
	|	ТаблицаИсточникИПолучатель.ОсновноеСредствоИсточник <> &ОсновноеСредство
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ТаблицаИсточникИПолучатель
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ОсновноеСредствоИсточник КАК ОсновноеСредствоИсточник,
	|	Таблица.ОсновноеСредствоПолучатель КАК ОсновноеСредствоПолучатель,
	|	Таблица.ЭтоЧастичноеСписание КАК ЭтоЧастичноеСписание,
	|	Таблица.СтоимостьСписанияНУ КАК СтоимостьСписанияНУ,
	|	Таблица.СтоимостьСписанияПР КАК СтоимостьСписанияПР
	|
	|ИЗ
	|	ТаблицаИсточникИПолучатель КАК Таблица
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
					
	#Область АмортизацияНаНачалоПериода
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АмортизацияОС.АмортизацияРегл КАК АмортизацияРегл,
	|	АмортизацияОС.АмортизацияНУ КАК АмортизацияНУ,
	|	АмортизацияОС.АмортизацияПР КАК АмортизацияПР,
	|	АмортизацияОС.АмортизацияЦФ КАК АмортизацияЦФ,
	|	АмортизацияОС.АмортизацияПРЦФ КАК АмортизацияПРЦФ
	|ИЗ
	|	АмортизацияНаНачалоПериода КАК АмортизацияОС
	|ГДЕ
	|	АмортизацияОС.ОсновноеСредство = &ОсновноеСредство";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ДатаВводаВЭксплуатациюНУ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюНУ КАК ДатаВводаВЭксплуатациюНУ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(
	|			&Дата,
	|			ДатаИсправления = ДАТАВРЕМЯ(1,1,1)
	|				И Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОС";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВыборкаПараметровНУ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	0 КАК НомерСтроки,
	|	ТаблицаДат.Регистратор КАК Регистратор,
	|	ТаблицаДат.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаДат.ЭтоИзменения КАК ЭтоИзменения,
	|	&ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаДат.Дата КАК Дата,
	|	ТаблицаДат.Порядок КАК Порядок,
	|
	|	(НЕ ОбъединениеОС.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ РазукомплектацияОС.Ссылка ЕСТЬ NULL) КАК ПолученПриРазукомплектацииОбъединении,
	|
	|	ВЫБОР 
	|		КОГДА НЕ ОбъединениеОС.Ссылка ЕСТЬ NULL
	|				ИЛИ НЕ РазукомплектацияОС.Ссылка ЕСТЬ NULL
	|
	|			ТОГДА 0
	|
	|		КОГДА НАЧАЛОПЕРИОДА(ТаблицаДат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаВводаВЭксплуатациюНУ, МЕСЯЦ)
	|
	|			ТОГДА ВЫБОР
	|					КОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(ДокументВводаВЭксплуатацию.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)), МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|						ТОГДА ЕСТЬNULL(ПервоначальнаяСтоимость.ПредварительнаяСтоимостьНУ, 0)
	|					ИНАЧЕ ЕСТЬNULL(ПервоначальнаяСтоимость.СтоимостьНУ, 0)
	|				КОНЕЦ
	|
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьНаНачалоПериода.СтоимостьНУ, 0)
	|
	|	КОНЕЦ КАК СтоимостьНУ,
	|
	|	ЕСТЬNULL(СтоимостьОС_Записи.АмортизационнаяПремия, 0) АмортизационнаяПремия,
	|
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.АмортизационнаяГруппа, ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)) КАК АмортизационнаяГруппа,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентАмортизацииБУ, 0) КАК ГодоваяНормаАмортизацииБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 0) КАК КоэффициентУскоренияБУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.МетодНачисленияАмортизацииНУ, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.ПустаяСсылка)) КАК МетодНачисленияАмортизацииНУ,
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюНУ, ЛОЖЬ) КАК НачислятьАмортизацию,
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.НачислятьАмортизациюНУ, ЛОЖЬ) КАК НачислятьАмортизациюНУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации, 0) КАК ПРДляВычисленияАмортизации,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СпециальныйКоэффициент, 0) КАК СпециальныйКоэффициентНУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияНУ, 0) КАК СрокПолезногоИспользованияНУ,
	|
	|	0 КАК АмортизацияПР,
	|	0 КАК АмортизацияНУ,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаДат.ЭтоИзменения
	|			ТОГДА ЕСТЬNULL(СтоимостьОС_Записи.СтоимостьНУ, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьНУИзменение,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаДат.ЭтоИзменения
	|			ТОГДА ЕСТЬNULL(СтоимостьОС_Записи.СтоимостьПР, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПРИзменение,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаДат.ЭтоИзменения
	|			ТОГДА ЕСТЬNULL(АмортизацияОС_Записи.АмортизацияНУ, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АмортизацияНУИзменение,
	|
	|	0 КАК АмортизацияПРИзменение,
	|
	|	0 КАК ОстаточнаяСтоимостьПР,
	|	0 КАК СтоимостьДляВычисленияПР,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаСтоимости, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВНУ, ЛОЖЬ) КАК КорректировкаСтоимостиНУ,
	|
	|	ЕСТЬNULL(Корректировка.КорректировкаАмортизации, ЛОЖЬ)
	|		И ЕСТЬNULL(Корректировка.ОтражатьВНУ, ЛОЖЬ) 
	|		И Корректировка.ДокументОснование = НЕОПРЕДЕЛЕНО
	|		И НЕ Корректировка.ДокументОснование ССЫЛКА Документ.ОбъединениеОС
	|		И НЕ Корректировка.ДокументОснование ССЫЛКА Документ.РазукомплектацияОС
	|		И НЕ Корректировка.ДокументОснование ССЫЛКА Документ.МодернизацияОС2_4
	|		И НЕ Корректировка.ДокументОснование ССЫЛКА Документ.ОтнесениеОтклоненийВСтоимостьОС
	|		И НЕ Корректировка.ДокументОснование ССЫЛКА Документ.ПереоценкаОС2_4
	|		И НЕ Корректировка.ДокументОснование ССЫЛКА Документ.ПринятиеКУчетуОС2_4 КАК КорректировкаАмортизацииНУ,
	|
	|	ЕСТЬNULL(Корректировка.ВключаетАмортизациюТекущегоМесяца, ЛОЖЬ) КАК ВключаетАмортизациюТекущегоМесяца,
	|
	|	ЛОЖЬ КАК НеРассчитыватьАмортизациюНУ
	|
	|ИЗ
	|	ТаблицаДат КАК ТаблицаДат
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО ПервоначальныеСведенияОС.Дата = ТаблицаДат.Дата
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО ПорядокУчетаОСБУ.Дата = ТаблицаДат.Дата
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО ПараметрыАмортизацииОСБУ.Дата = ТаблицаДат.Дата
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНаНачалоПериода КАК СтоимостьНаНачалоПериода
	|		ПО СтоимостьНаНачалоПериода.ОсновноеСредство = &ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость
	|		ПО ПервоначальнаяСтоимость.ОсновноеСредство = &ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОС_Записи КАК СтоимостьОС_Записи
	|		ПО СтоимостьОС_Записи.Регистратор = ТаблицаДат.Регистратор
	|			И СтоимостьОС_Записи.Период = ТаблицаДат.Период
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияОС_Записи КАК АмортизацияОС_Записи
	|		ПО АмортизацияОС_Записи.Регистратор = ТаблицаДат.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК Корректировка
	|		ПО Корректировка.Ссылка = ТаблицаДат.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4 КАК Переоценка
	|		ПО Переоценка.Ссылка = ТаблицаДат.Регистратор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбъединениеОС КАК ОбъединениеОС
	|		ПО ОбъединениеОС.Ссылка = ТаблицаДат.Регистратор
	|			И ОбъединениеОС.ОсновноеСредство = &ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК РазукомплектацияОС
	|		ПО РазукомплектацияОС.Ссылка = ТаблицаДат.Регистратор
	|			И РазукомплектацияОС.ОсновноеСредство = &ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК ДокументВводаВЭксплуатацию
	|		ПО ДокументВводаВЭксплуатацию.Ссылка = &ДокументВводаВЭксплуатациюНУ
	|			И НЕ ДокументВводаВЭксплуатацию.ДополнительнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ЭтоИзменения,
	|	Порядок,
	|	Регистратор
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Параметры.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
	Запрос.УстановитьПараметр("Дата", Параметры.Дата);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Параметры.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ОсновноеСредство", Параметры.ОсновноеСредство);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаНУ", КонецДня(Параметры.КонецПериодаНУ));
	Запрос.УстановитьПараметр("АмортизационнаяПремия", Параметры.АмортизационнаяПремия);
	Запрос.УстановитьПараметр("ДатаВводаВЭксплуатациюНУ", Параметры.ДатаВводаВЭксплуатациюНУ);
	Запрос.УстановитьПараметр("ДокументВводаВЭксплуатациюНУ", Параметры.ДокументВводаВЭксплуатациюНУ);

	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаИсточникИПолучатель = Результат[Результат.ВГраница()-3].Выгрузить();
	
	Выборка = Результат[Результат.ВГраница()-2].Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыДляРасчета.АмортизацияНУНаНачалоПериода = Выборка.АмортизацияНУ;
	Иначе
		ПараметрыДляРасчета.АмортизацияНУНаНачалоПериода = 0;
	КонецЕсли;
	
	Выборка = Результат[Результат.ВГраница()-1].Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыДляРасчета.ДатаВводаВЭксплуатациюНУ = Выборка.ДатаВводаВЭксплуатациюНУ;
	КонецЕсли;
	
	ПараметрыЗаПериодНУ = Результат[Результат.ВГраница()].Выгрузить();

	НомерСтроки = 1;
	Для Каждого ДанныеСтроки Из ПараметрыЗаПериодНУ Цикл
		ДанныеСтроки.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Параметры.Организация);
	ПараметрыРасчета.Вставить("ОсновноеСредство", Параметры.ОсновноеСредство);
	ПараметрыРасчета.Вставить("ДатаВводаВЭксплуатациюНУ", ПараметрыДляРасчета.ДатаВводаВЭксплуатациюНУ);
	ПараметрыРасчета.Вставить("АмортизацияНУНаНачалоПериода", ПараметрыДляРасчета.АмортизацияНУНаНачалоПериода);
	ПараметрыРасчета.Вставить("АмортизацияДо2009", ПараметрыДляРасчета.АмортизацияДо2009);
	ПараметрыРасчета.Вставить("ФактическийСрокИспользованияДо2009", ПараметрыДляРасчета.ФактическийСрокИспользованияДо2009);
	ПараметрыРасчета.Вставить("ЭтоАрендованныеОС", УчетАрендованныхОС.ОсновноеСредствоПолученоВАренду(Параметры.ОсновноеСредство, Параметры.Дата));

	ТаблицыРасчета = Новый Структура;
	ТаблицыРасчета.Вставить("ПараметрыЗаПериодНУ", ПараметрыЗаПериодНУ);

	ЗначенияПараметровРасчетаИзменений = Новый Соответствие;

	Выборка = Результат[Результат.ВГраница()-4].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Стоимость исходных ОС при разукомплектации и объединении
		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("Стоимость", 0);
		ЗначенияПараметров.Вставить("СтоимостьРегл", 0);
		ЗначенияПараметров.Вставить("СтоимостьНУ", 0);
		ЗначенияПараметров.Вставить("СтоимостьЦФ", 0);
		ЗначенияПараметров.Вставить("СтоимостьПР", 0);
		ЗначенияПараметров.Вставить("Амортизация", 0);
		ЗначенияПараметров.Вставить("АмортизацияРегл", 0);
		ЗначенияПараметров.Вставить("АмортизацияНУ", 0);
		ЗначенияПараметров.Вставить("АмортизацияЦФ", 0);
		ЗначенияПараметров.Вставить("АмортизацияПР", 0);
		ЗначенияПараметров.Вставить("ОбесценениеУпр", 0);
		ЗначенияПараметров.Вставить("ОбесценениеРегл", 0);
		ЗначенияПараметров.Вставить("АмортизацияЗаПериодУпр", 0);  
		ЗначенияПараметров.Вставить("АмортизацияЗаПериодРегл", 0);
		ЗначенияПараметров.Вставить("АмортизацияЗаПериодПР", 0);
		ЗначенияПараметров.Вставить("АмортизацияЗаПериодНУ", 0);
		
		ЗаполнитьЗначенияСвойств(ЗначенияПараметров, Выборка);
		
		ЗначенияПараметровРасчетаИзменений.Вставить(Выборка.ОсновноеСредство, ЗначенияПараметров);
		
	КонецЦикла;
	
	АмортизацияЗаПериодНУ = 0;
	
	Для Каждого ДанныеСтроки Из ПараметрыЗаПериодНУ Цикл
		
		Если НЕ ДанныеСтроки.НеРассчитыватьАмортизациюНУ Тогда
			
			ДанныеСтроки.АмортизацияНУ = ПараметрыРасчета.АмортизацияНУНаНачалоПериода + АмортизацияЗаПериодНУ;
			
			ЗначенияПараметров = Документы.АмортизацияОС2_4.РассчитатьСтоимостьАмортизациюПоДаннымДокумента(
				ДанныеСтроки, ЗначенияПараметровРасчетаИзменений, ТаблицаИсточникИПолучатель);
			
			ДанныеСтроки.СтоимостьНУ = ЗначенияПараметров.СтоимостьНУ;
		
			ДанныеСтроки.АмортизацияНУИзменение = ЗначенияПараметров.АмортизацияНУИзменение;
			
			Если НЕ ДанныеСтроки.ЭтоИзменения Тогда
			
				Результат = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПоТаблице(ТаблицыРасчета, ПараметрыРасчета, ДанныеСтроки.НомерСтроки);
				
				СтрокаАмортизация = Результат.РезультатРасчетаНУ[0];
				
				ДанныеСтроки.АмортизацияНУ = СтрокаАмортизация.АмортизацияНУ;
				
			Иначе
	
				ДанныеСтроки.АмортизацияНУ = 0;
				
			КонецЕсли;
			
			ЗначенияПараметров.АмортизацияЗаПериодНУ = ЗначенияПараметров.АмортизацияЗаПериодНУ + ДанныеСтроки.АмортизацияНУ;
				
		КонецЕсли;
			
		АмортизацияЗаПериодНУ = АмортизацияЗаПериодНУ + ДанныеСтроки.АмортизацияНУ;
		
	КонецЦикла;
	
	КолонкиСуммирования = Новый Массив;
	КолонкиСуммирования.Добавить("АмортизацияНУ");
	КолонкиСуммирования.Добавить("АмортизацияНУИзменение");
	КолонкиСуммирования.Добавить("АмортизацияПРИзменение");
	КолонкиСуммирования.Добавить("АмортизационнаяПремия");

	Документы.АмортизацияОС2_4.СгруппироватьПараметрыЗаПериод(
		ПараметрыЗаПериодНУ, 
		КолонкиСуммирования, 
		Ложь);	
	
	ПараметрыДляРасчета.Вставить("ПараметрыЗаПериодНУ", ПараметрыЗаПериодНУ);

	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(Параметры.МенеджерВременныхТаблиц,, ИспользуемыеВТ);
	
КонецПроцедуры

//-- Локализация

#Область ФормаДокумента

Процедура ПриСозданииНаСервере(Форма) Экспорт

	//++ Локализация
	
	Если НЕ ПолучитьФункциональнуюОпцию("УправлениеПредприятием") 
		//++ НЕ УТКА
		ИЛИ НЕ ПравоДоступа("Просмотр", Метаданные.РегистрыБухгалтерии.Международный) 
		//-- НЕ УТКА
		Тогда
		Форма.Элементы.ФормаПроводкиМеждУчета.Видимость = Ложь;
	КонецЕсли; 
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ФормаРасчетАмортизации

Процедура ДополнитьСлужебныеПараметрыФормыРасчетАмортизации(Знач СлужебныеПараметры) Экспорт

	//++ Локализация
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АмортизацияОС2_4.Ссылка КАК Ссылка,
	|	АмортизацияОС2_4.Организация КАК Организация,
	|	АмортизацияОС2_4.НомерПакета,
	|	АмортизацияОС2_4.Дата КАК Дата
	|ИЗ
	|	Документ.АмортизацияОС2_4 КАК АмортизацияОС2_4
	|ГДЕ
	|	АмортизацияОС2_4.Ссылка В(&СписокДокументов)
	|	И НЕ АмортизацияОС2_4.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОС.Ссылка,
	|	АмортизацияОС.Организация,
	|	0,
	|	АмортизацияОС.Дата КАК Дата
	|ИЗ
	|	Документ.АмортизацияОС КАК АмортизацияОС
	|ГДЕ
	|	АмортизацияОС.Ссылка В(&СписокДокументов)
	|	И НЕ АмортизацияОС.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Организация";
	
	СлужебныеПараметры.Вставить("ТекстЗапроса", ТекстЗапроса);
	
	СлужебныеПараметры.СобытияЗаписи.Добавить("Запись_АмортизацияОС");
	СлужебныеПараметры.ТипыДокументов.Добавить("ДокументСсылка.АмортизацияОС");
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти