
#Область ПрограммныйИнтерфейс

//Инициализирует настройки отчета для формирования отчета.
// Возвращаемое значение:
//	Структура - настройки отчета.
Функция ИнициализироватьНастройкиОтчета(Отчет, КлючТекущегоВарианта, ОтчетОбъект) Экспорт
	
	НастройкиОтчета = ВариантыОтчетов.НастройкиФормыОтчета(Отчет, КлючТекущегоВарианта, ОтчетОбъект); // Структура
	
	НастройкиОтчета.Вставить("ПрочитатьФлажокФормироватьСразуИзПользовательскихНастроек", Ложь);
	НастройкиОтчета.Вставить("РазрешеноВыбиратьВарианты", Ложь);
	НастройкиОтчета.Вставить("СхемаМодифицирована", Ложь);
	НастройкиОтчета.Вставить("ПредопределенныеВарианты", Неопределено);
	НастройкиОтчета.Вставить("АдресСхемы",   "");
	НастройкиОтчета.Вставить("КлючСхемы",    "");
	НастройкиОтчета.Вставить("Контекстный",  Ложь);
	НастройкиОтчета.Вставить("ПолноеИмя",    "");
	НастройкиОтчета.Вставить("Наименование", "");
	НастройкиОтчета.Вставить("ОтчетСсылка",  Неопределено);
	НастройкиОтчета.Вставить("Внешний",      Ложь);
	НастройкиОтчета.Вставить("Безопасный",   Ложь);
	
	Возврат НастройкиОтчета;
	
КонецФункции

// Строит дерево себестоимости для изделия.
//
// Параметры:
//  ПараметрыДерева - см. СтруктураСебестоимости.ПараметрыДереваСебестоимости
//
Процедура ПостроитьДеревоСебестоимости(ПараметрыДерева) Экспорт
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ОбщийМодуль.СтруктураСебестоимости.ПостроитьДеревоСебестоимости");
	ПараметрыДерева.Вставить("КоличествоСтрок", 0);
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	Если ПараметрыДерева.Результат = Неопределено Тогда
		ПустоеДеревоСебестоимости(ПараметрыДерева);
	КонецЕсли;
	
	ЗаполнитьДеревоСебестоимости(ПараметрыДерева);
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ПараметрыДерева.КоличествоСтрок / 1000);
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
КонецПроцедуры

// Строит дерево себестоимости для изделия в фоне.
//
// Параметры:
// 	Параметры - Структура - описание параметров формирования отчетов:
//		* ПараметрыДерева - см. СтруктураСебестоимости.ПараметрыДереваСебестоимости
//	АдресХранилища - Строка - адрес временного хранилища.
Процедура ПостроитьДеревоСебестоимостиВФоне(Параметры, АдресХранилища) Экспорт
	
	ПараметрыДерева = Параметры.ПараметрыДерева; // см. СтруктураСебестоимости.ПараметрыДереваСебестоимости
	ПостроитьДеревоСебестоимости(ПараметрыДерева);
	
	Результат = Новый Структура("ДеревоСебестоимости, Успех");
	Результат.ДеревоСебестоимости	= ПараметрыДерева.Результат;
	Результат.Успех					= Истина;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

// Процедура дозаполняет параметры дерева себестоимости, необходимые для запуска разузлования по уровням.
//
// Параметры:
//  ПараметрыДерева - см. СтруктураСебестоимости.ПараметрыДереваСебестоимости
//
Процедура ДозаполнитьПараметрыДереваСебестоимости(ПараметрыДерева) Экспорт
	
	Если ПараметрыДерева.ТипРезультатаДеревоЗначений
		+ ПараметрыДерева.ТипРезультатаМенеджерВременныхТаблиц + ПараметрыДерева.ТипРезультатаТаблицаЗначений <> 1 Тогда
			
		ВызватьИсключение НСтр("ru = 'Должен быть определен один тип результата дерева себестоимости.';
								|en = 'Define one type of cost tree result.'");
	КонецЕсли;
	
	ПараметрыДерева.Вставить("ГлобальныеВременныеТаблицы", Новый Массив());
	ПараметрыДерева.Вставить("ТаблицаОтборовУзлов", ПустаяТаблицаОтборовУзлов(ПараметрыДерева.СтруктураПолей));
	ПараметрыДерева.Вставить("ТаблицаОтборовУзлов_ИменаКолонок",
		РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(ПараметрыДерева.ТаблицаОтборовУзлов, "",
			Истина));
	ПараметрыДерева.Вставить("ТаблицаОтборовУзлов_ИменаКолонокССинонимами",
		РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьКолонкамСинонимы(
			ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонок, "Т"));
			
	ПараметрыДерева.Вставить("СоответствиеУзлов", Новый Соответствие());
	Если ПараметрыДерева.МенеджерВременныхТаблиц = Неопределено Тогда
		ПараметрыДерева.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Если ПараметрыДерева.ТипРезультатаМенеджерВременныхТаблиц Тогда
		ПараметрыДерева.Вставить("ДобавленаВременнаяТаблицаРезультатовРазузлования", Ложь);
	КонецЕсли;
	
	ТекстЗапросаЗатратыНаПродукцию(ПараметрыДерева);
	ПараметрыДерева.Вставить("ТекстЗапросаУзлыТребующиеРазузлования",
		ТекстЗапросаШаблонРезультатыРазузлования(Истина, ПараметрыДерева));
	
	ПараметрыДерева.ПараметрыОтчета.Вставить("НоменклатураВключениеИсключениеНДСВСтоимости",
		НСтр("ru = 'Включение / Исключение НДС в стоимости';
			|en = 'Include / Exclude VAT in / from cost'"));
	ПараметрыДерева.ПараметрыОтчета.Вставить("НоменклатураЗацикливание",
		НСтр("ru = 'Зацикливание разузлования';
			|en = 'Explosion looping'"));
	
	Диагностика = Новый Структура();
	Диагностика.Вставить("ГруппаСобытийЖурналаРегистрации", НСтр("ru = 'Формирование дерева себестоимости.';
																|en = 'Generate a cost tree.'"));
	Диагностика.Вставить("ЕстьОшибки", Ложь);
	Диагностика.Вставить("Ошибки", Неопределено);
	Диагностика.Вставить("ЗамерыВыполненияЗапросовПоУровнямУзлов", Новый Массив());
	ПараметрыДерева.Вставить("Диагностика", Диагностика);
	
	ПараметрыДерева.Вставить("ВышестоящиеУзлы", Новый Соответствие());
	ПараметрыДерева.Вставить("ВышестоящиеУзлыДобавлены", Ложь);
	
	ЗаполнитьИндексДляПроверкиЗацикливания(ПараметрыДерева, Ложь);
	
	ПараметрыДерева.ГлобальныеВременныеТаблицы.Добавить("ТаблицаУзлов");
	ПараметрыДерева.ГлобальныеВременныеТаблицы.Добавить("Результат");
	ПараметрыДерева.ГлобальныеВременныеТаблицы.Добавить("ВТВзаимосвязанныеОрганизации");
	
КонецПроцедуры

// Процедура загружает таблицу отборов узлов во временную таблицу менеджера временных таблиц параметров дерева.
//
// Параметры:
//  ПараметрыДерева - см. СтруктураСебестоимости.ПараметрыДереваСебестоимости
//
Процедура ЗагрузитьТаблицуОтбораУзловВоВременнуюТаблицу(ПараметрыДерева) Экспорт
	
	МассивНаборовИндексов = Новый Массив();
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1 Тогда
		МассивНаборовИндексов.Добавить("ПартияПродукции");
	КонецЕсли;
	МассивНаборовИндексов.Добавить("ИдентификаторУзла");

	ПараметрыДерева.ГлобальныеВременныеТаблицы.Добавить("ТаблицаОтборовУзлов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		ПараметрыДерева.МенеджерВременныхТаблиц,
		"ТаблицаОтборовУзлов", ПараметрыДерева.ТаблицаОтборовУзлов,
		ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонок,
		МассивНаборовИндексов);

КонецПроцедуры

// Вызывается перед раскрытием узла дерева себестоимости.
//
// Параметры:
//  ПараметрыДерева - см. СтруктураСебестоимости.ПараметрыДереваСебестоимости.
//
Процедура ДеревоСебестоимостиПередРазворачиванием(ПараметрыДерева) Экспорт
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"ОбщийМодуль.СтруктураСебестоимости.ДеревоСебестоимостиПередРазворачиванием");
	ПараметрыДерева.Вставить("КоличествоСтрок", 0);
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	Справочники.Организации.ПолучитьВзаимосвязанныеОрганизации(ПараметрыДерева.МенеджерВременныхТаблиц);
	ПоместитьТаблицаОтборовУзловВВТТаблицаУзлов(ПараметрыДерева);
	РазузловатьУровеньУзловДереваСебестоимости(ПараметрыДерева, ПараметрыДерева.Результат);
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ПараметрыДерева.КоличествоСтрок / 100);
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
КонецПроцедуры

#Область ПараметрыДереваСебестоимости

// Параметры построения дерева себестоимости
// 
// Возвращаемое значение:
// Структура:
//  * ДинамическоеСчитывание - Булево - Истина, если уровни дерева себестоимости получается последовательно.
//  * ТипРезультатаДеревоЗначений - Булево - Истина если ТипРезультата - ДеревоЗначений.
//  * ТипРезультатаМенеджерВременныхТаблиц - Булево - Истина если ТипРезультата - МенеджерВременныхТаблиц.
//  * ТипРезультатаТаблицаЗначений - Булево - Истина если ТипРезультата - ТаблицаЗначений.
//  * Результат - Произвольный - При инициализации, определяется позже, для возможности передачи параметров в фон.
//              - ДеревоЗначений - дерево значений, в которое будет помещен результат разузлования,
//                                 в случае когда ТипРезультатаДеревоЗначений.
//              - ТаблицаЗначений - таблица значений, в которую будет помещен результат разузлования,
//                                 в случае когда ТипРезультатаТаблицаЗначений.
//  * МенеджерВременныхТаблиц - Неопределено - При инициализации параметров, определяется позже, для возможности передачи параметров в фон.
//                             - МенеджерВременныхТаблиц - в случае когда ТипРезультатаМенеджерВременныхТаблиц,
//                              результат разузлования возвращается как временная таблица в данном менеджере.
//  * ДобавлятьПолуфабрикатыВРезультат - Булево - Будут ли добавлены промежуточные полуфабрикаты в результат.
//                                       Если результат ДеревоЗначений, то полуфабрикаты добавляются всегда.
//  * ВариантыУсловийСоединенияПоПараметрамУзлов - Структура - структура вариантов соединения.
//  * ИнтерактивнаяНастройка - Булево - Истина если настройки могут быть изменены интерактивно.
//  * СхемаКД - СхемаКомпоновкиДанных - Используемая схема компоновки данных.
//  * НастройкиКД - НастройкиКомпоновкиДанных - Используемые настройки компоновки данных.
//  * СчетчикТаблиц - Число - Счетчик сформированных таблиц.
//  * УровеньУзла - Число - Уровень текущего узла.
//  * ВключитьНДСВСтоимость - Булево - Определяет необходимость включения НДС в стоимость.
//  * ИсключитьНДСИзСтоимости - Булево - Определяет необходимость исключения НДС из стоимости.
//  * СтруктураПолей - Структура - Определяет структуру полей и их типов дерева себестоимости.
//  * МаксимальнаяГлубинаРазузлования - Число - Ограничение максимальной глубины разузлования, дополнительная защита от зацикливания.
//  * ВыводитьОшибки - Булево - Определяет нужно ли выводить пользователю ошибки разузлования.
//  * ПараметрыОтчета - Структура - Структура параметров отчета.
//  * ИндексДляПроверкиЗацикливания - Неопределено - При инициализации параметров, определяется позже.
//                                  - Строка - Список колонок по которым требуется индексирование.
//  * ТаблицаОтборовУзлов - Неопределено - При инициализации параметров, определяется позже.
//                        - ТаблицаЗначений - Таблица, по которой будет происходить отбор данных из регистров.
//
Функция ПараметрыДереваСебестоимости() Экспорт
	
	ТипыРезультата = Новый ОписаниеТипов("ДеревоЗначений,ТаблицаЗначений");
	ПараметрыДерева = Новый Структура;
	
	#Область ОбщиеПараметрыДерева
	
	ПараметрыДерева.Вставить("ДинамическоеСчитывание",	Истина);
	ПараметрыДерева.Вставить("Результат",				ТипыРезультата.ПривестиЗначение(Неопределено));
	ПараметрыДерева.Вставить("ДобавлятьПолуфабрикатыВРезультат", Истина);
	
	ПараметрыДерева.Вставить("СхемаКД", Отчеты.ДеревоСебестоимостиПродукции.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));
	ПараметрыДерева.Вставить("НастройкиКД", ПараметрыДерева.СхемаКД.НастройкиПоУмолчанию);
	ПараметрыДерева.Вставить("СчетчикТаблиц", 0);
	
	ПараметрыДерева.Вставить("УровеньУзла", 1);
	ПараметрыДерева.Вставить("ИнтерактивнаяНастройка", Ложь);
	ПараметрыДерева.Вставить("ВключитьНДСВСтоимость", Ложь);
	ПараметрыДерева.Вставить("ИсключитьНДСИзСтоимости", Ложь);
	ПараметрыДерева.Вставить("МенеджерВременныхТаблиц", Неопределено);
	ПараметрыДерева.Вставить("ТипРезультатаДеревоЗначений", Ложь);
	ПараметрыДерева.Вставить("ТипРезультатаМенеджерВременныхТаблиц", Ложь);
	ПараметрыДерева.Вставить("ТипРезультатаТаблицаЗначений", Ложь);
	ПараметрыДерева.Вставить("СтруктураПолей", СтруктураПолейДереваСебестоимости());
	ПараметрыДерева.Вставить("МаксимальнаяГлубинаРазузлования", 1000);
	ПараметрыДерева.Вставить("ВыводитьОшибки", Истина);
	ПараметрыДерева.Вставить("ИндексДляПроверкиЗацикливания", Неопределено);
	ПараметрыДерева.Вставить("ТаблицаОтборовУзлов", Неопределено);

	#КонецОбласти
	
	#Область ОбщиеПараметрыОтчета
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("ДатаНачала", Дата('00010101'));
	ПараметрыОтчета.Вставить("ДатаОкончания", Дата('00010101'));
	ПараметрыОтчета.Вставить("Организации", Новый Массив());
	ПараметрыОтчета.Вставить("Подразделения", Новый Массив());
	ПараметрыОтчета.Вставить("Регистраторы", Новый Массив());
	ПараметрыОтчета.Вставить("РазворачиватьДопРасходы", Истина);
	ПараметрыОтчета.Вставить("ВалютаУправленческогоУчета", Справочники.Валюты.ПустаяСсылка());
	ПараметрыОтчета.Вставить("ДанныеПоСебестоимости", 1);
	ПараметрыОтчета.Вставить("ЗаВесьПериод", Истина);
	ПараметрыОтчета.Вставить("ПоВсемОрганизациям", Истина);
	ПараметрыОтчета.Вставить("ПоВсемПодразделениям", Истина);
	ПараметрыОтчета.Вставить("РасшифровкаДвиженийДокумента", Ложь);
	ПараметрыОтчета.Вставить("КоличествоУзловОтбора", 0);
	
	ПараметрыДерева.Вставить("ПараметрыОтчета", ПараметрыОтчета);
	
	#КонецОбласти
	
	#Область ВариантыУсловийСоединенияПоПараметрамУзлов
	// Комментарий 204.
	// 3 варианта по каждому соединению:
	//    0. По колонке во всех строках значение пустое и не требует соединения, условие соединения не нужно.
	//    1. По колонке во всех строках отбора заполнено значение, условие соединения на равенство.
	//    2. По колонке в каких то строках таблицы отбора требуется соединение, в каких то нет,
	//      условие соединения через ИЛИ, в зависимости от заполненности.
	ВариантыУсловийСоединенияПоПараметрамУзлов = Новый Структура();
	ВариантыУсловийСоединенияПоПараметрамУзлов.Вставить("Продукция", 1);
	ВариантыУсловийСоединенияПоПараметрамУзлов.Вставить("ПартияПродукции", 1);
	ВариантыУсловийСоединенияПоПараметрамУзлов.Вставить("ХарактеристикаПродукции", 1);
	ВариантыУсловийСоединенияПоПараметрамУзлов.Вставить("СерияПродукции", 0);
	ВариантыУсловийСоединенияПоПараметрамУзлов.Вставить("НазначениеПродукции", 0);
	ВариантыУсловийСоединенияПоПараметрамУзлов.Вставить("АналитикаУчетаПартийПродукции", 0);
	
	ПараметрыДерева.Вставить("ВариантыУсловийСоединенияПоПараметрамУзлов", ВариантыУсловийСоединенияПоПараметрамУзлов);
	#КонецОбласти
	
	Возврат ПараметрыДерева;
	
КонецФункции

// Определяет варианты условий соединения для параметров узлов на основе таблицы отборов.
//
// Параметры:
//   ПараметрыДерева - Структура - Структура, содержащая таблицу отборов узлов и варианты условий соединения.
//
Процедура УстановитьВариантыУсловийСоединенияПоПараметрамУзлов(ПараметрыДерева) Экспорт
	ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора = ПараметрыДерева.ТаблицаОтборовУзлов.Количество();
	КоличествоСтрокОтбора = ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора;
	ПоВсейПродукции = 0;
	ПоВсемПартиям = 0;
	ПоВсемХарактеристикам = 0;
	ПоВсемСериям = 0;
	ПоВсемНазначениям = 0;
	ПоВсемАналитикамПартий = 0;
	Для Каждого СтрокаОтбора Из ПараметрыДерева.ТаблицаОтборовУзлов Цикл
		ПоВсейПродукции = ПоВсейПродукции + ?(СтрокаОтбора.ПоВсейПродукции, 1, 0);
		ПоВсемПартиям = ПоВсемПартиям + ?(СтрокаОтбора.ПоВсемПартиям, 1, 0);
		ПоВсемХарактеристикам = ПоВсемХарактеристикам + ?(СтрокаОтбора.ПоВсемХарактеристикам, 1, 0);
		ПоВсемСериям = ПоВсемСериям + ?(СтрокаОтбора.ПоВсемСериям, 1, 0);
		ПоВсемНазначениям = ПоВсемНазначениям + ?(СтрокаОтбора.ПоВсемНазначениям, 1, 0);
		ПоВсемАналитикамПартий = ПоВсемАналитикамПартий + ?(СтрокаОтбора.ПоВсемАналитикамПартий, 1, 0);
	КонецЦикла;
	
	#Область ВариантыУсловийСоединенияПоПараметрамУзлов
	ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 
		?(ПоВсейПродукции = КоличествоСтрокОтбора, 0,
			?(ПоВсейПродукции = 0, 1, 2));
	ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 
		?(ПоВсемПартиям = КоличествоСтрокОтбора, 0,
			?(ПоВсемПартиям = 0, 1, 2));
	ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 
		?(ПоВсемХарактеристикам = КоличествоСтрокОтбора, 0,
			?(ПоВсемХарактеристикам = 0, 1, 2));
	ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 
		?(ПоВсемСериям = КоличествоСтрокОтбора, 0,
			?(ПоВсемСериям = 0, 1, 2));
	ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 
		?(ПоВсемНазначениям = КоличествоСтрокОтбора, 0,
			?(ПоВсемНазначениям = 0, 1, 2));
	ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 
		?(ПоВсемАналитикамПартий = КоличествоСтрокОтбора, 0,
			?(ПоВсемАналитикамПартий = 0, 1, 2));
	#КонецОбласти
КонецПроцедуры

// Возвращает структуру типов затрат, которые могут быть использованы в сформированном дереве себестоимости.
// 
// Возвращаемое значение:
// Структура:
//  * ТипЗатратПродукция - Строка - Тип затрат продукции.
//  * ТипЗатратМатериальные - Строка - Тип затрат материальные.
//  * ТипЗатратТрудозатраты - Строка - Тип затрат трудозатраты.
//  * ТипЗатратПостатейные - Строка - Тип затрат постатейные.
//  * ТипЗатратДопРасходы - Строка - Тип затрат доп. расходы.
//
Функция ТипыЗатратДереваСебестоимости() Экспорт
	ТипыЗатрат = Новый Структура();
	ТипыЗатрат.Вставить("ТипЗатратПродукция",		НСтр("ru = 'Продукция';
															|en = 'Manufactured product'"));
	ТипыЗатрат.Вставить("ТипЗатратМатериальные",	НСтр("ru = 'Материальные';
														|en = 'Material costs'"));
	ТипыЗатрат.Вставить("ТипЗатратТрудозатраты",	НСтр("ru = 'Трудозатраты';
														|en = 'Labor costs'"));
	ТипыЗатрат.Вставить("ТипЗатратПостатейные",		НСтр("ru = 'Постатейные';
															|en = 'Itemized costs'"));
	ТипыЗатрат.Вставить("ТипЗатратДопРасходы",		НСтр("ru = 'Доп. расходы';
															|en = 'Additional expenses'"));
	Возврат ТипыЗатрат;
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет дерево себестоимости
//
// Параметры:
//  ПараметрыДерева - см. СтруктураСебестоимости.ПараметрыДереваСебестоимости.
//
Процедура ЗаполнитьДеревоСебестоимости(ПараметрыДерева)
	
	Если ПараметрыДерева.ТаблицаОтборовУзлов = Неопределено Тогда
		ДозаполнитьПараметрыДереваСебестоимости(ПараметрыДерева);
	КонецЕсли;
	
	Справочники.Организации.ПолучитьВзаимосвязанныеОрганизации(ПараметрыДерева.МенеджерВременныхТаблиц);
	
	// Набор полей для индексирования должен учитывать варианты условий соединения.
	МассивНаборовИндексов = Новый Массив();
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1 Тогда
		МассивНаборовИндексов.Добавить("ПартияПродукции");
	КонецЕсли;
	МассивНаборовИндексов.Добавить("ИдентификаторУзла");
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		ПараметрыДерева.МенеджерВременныхТаблиц,
		"ТаблицаОтборовУзлов", ПараметрыДерева.ТаблицаОтборовУзлов,
		ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонок,
		МассивНаборовИндексов);
	
	ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора = ПараметрыДерева.ТаблицаОтборовУзлов.Количество();
	Запрос = ЗапросВыпущеннаяПродукция(Ложь, ПараметрыДерева);
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("РезультатВыполненияЗапроса", "");
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ВыпущеннаяПродукция = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(
		ПараметрыРасчета, Запрос,,, Истина, НСтр("ru = 'Заполнить дерево себестоимости';
												|en = 'Fill cost tree'"));
		
	Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала) / 1000;
	Шаблон = НСтр("ru = 'Уровень узлов: %1
			|Общее время: %2
			|Количество узлов отбора: %3
			|%4';
			|en = 'Node level: %1
			|Total time: %2
			|Number of filter nodes: %3
			|%4'");
	ТекстДляПротокола = СтрШаблон(Шаблон,
		ПараметрыДерева.УровеньУзла,
		РасчетСебестоимостиПротоколРасчета.ПредставлениеВремени(Длительность),
		ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора,
		ПараметрыРасчета.РезультатВыполненияЗапроса);
	ПараметрыДерева.Диагностика.ЗамерыВыполненияЗапросовПоУровнямУзлов.Добавить(ТекстДляПротокола);
	ИмяСобытия = НСтр("ru = 'Выполнение запроса по уровню узлов';
						|en = 'Query execution by node level'");
	ЗаписьЖурналаРегистрации(ПараметрыДерева.Диагностика.ГруппаСобытийЖурналаРегистрации + ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,,,
		ТекстДляПротокола);
		
	УничтожитьВременныеТаблицы(ПараметрыДерева);
		
	ПараметрыДерева.ИнтерактивнаяНастройка = Ложь;
	ПараметрыДерева.Вставить("УровеньУзла", 1);
	
	Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		Результат = ПараметрыДерева.Результат.Строки;
	ИначеЕсли ПараметрыДерева.ТипРезультатаТаблицаЗначений Тогда
		Результат = ПараметрыДерева.Результат;
	Иначе
		Результат = Новый ТаблицаЗначений;
		ИнициализироватьПоляДереваСебестоимости(Результат, ПараметрыДерева.СтруктураПолей);
		ПараметрыДерева.Вставить("ПоляТаблицы",
			РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(Результат, "Идентификатор", Истина));
		ПараметрыДерева.Вставить("ИменаТаблиц", Новый Массив());
	КонецЕсли;
	
	ПараметрыДерева.ТаблицаОтборовУзлов.Очистить();
	ВыпущеннаяПродукция = ВыпущеннаяПродукция.Выбрать();
	Пока ВыпущеннаяПродукция.Следующий() Цикл
		
		НовыйИдентификаторУзла = Строка(Новый УникальныйИдентификатор());
		
		Если ПараметрыДерева.ТипРезультатаДеревоЗначений
			ИЛИ ПараметрыДерева.ДобавлятьПолуфабрикатыВРезультат
			ИЛИ Не ВыпущеннаяПродукция.ТребуетсяРазузлование Тогда
			СтрокаПартия = Результат.Добавить(); // СтрокаДереваЗначений
			ЗаполнитьЗначенияСвойств(СтрокаПартия, ВыпущеннаяПродукция);
			
			СтрокаПартия.Идентификатор	= Новый УникальныйИдентификатор();
			СтрокаПартия.ИдентификаторУзла = НовыйИдентификаторУзла;
			СтрокаПартия.ВидСтроки		= Перечисления.ВидыСтрокДереваСебестоимости.ПартияПродукции;
			
			СтрокаПартия.АналитикаУчетаВыходноеИзделие			= ВыпущеннаяПродукция.АналитикаУчетаПродукции;
			СтрокаПартия.АналитикаУчетаПартийВыходноеИзделие	= ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции;
			СтрокаПартия.ПартияВыходноеИзделие					= ВыпущеннаяПродукция.ПартияПродукции;
			
			СтрокаПартия.Номенклатура			= ВыпущеннаяПродукция.Продукция;
			СтрокаПартия.Характеристика			= ВыпущеннаяПродукция.ХарактеристикаПродукции;
			СтрокаПартия.Серия					= ВыпущеннаяПродукция.СерияПродукции;
			СтрокаПартия.Назначение				= ВыпущеннаяПродукция.НазначениеПродукции;
			СтрокаПартия.Валюта					= ВыпущеннаяПродукция.Валюта;
			СтрокаПартия.Партия					= ВыпущеннаяПродукция.ПартияПродукции;
			СтрокаПартия.АналитикаУчетаПартий	= ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции;
			СтрокаПартия.ЕдиницаИзмерения		= ВыпущеннаяПродукция.ЕдиницаИзмеренияПродукция;
			
			СтрокаПартия.Количество	= ВыпущеннаяПродукция.КоличествоПродукция;
			СтрокаПартия.Сумма		= ВыпущеннаяПродукция.СуммаПродукция;
			СтрокаПартия.СуммаЗабалансовая = ВыпущеннаяПродукция.СуммаПродукцияЗабалансовая;
			
			Если ПараметрыДерева.ТипРезультатаДеревоЗначений И ВыпущеннаяПродукция.ТребуетсяРазузлование 
				И ВыпущеннаяПродукция.КоличествоПродукция <> 0 Тогда
						
				ПараметрыДерева.СоответствиеУзлов.Вставить(СтрокаПартия.ИдентификаторУзла, 
					СтрокаПартия);
			КонецЕсли;
		КонецЕсли;
		
		Если (ВыпущеннаяПродукция.ТребуетсяРазузлование Или ВыпущеннаяПродукция.ТребуетсяРазузлованиеДопРасходов)
			И ПараметрыДерева.ТипРезультатаДеревоЗначений
			И ПараметрыДерева.ДинамическоеСчитывание
			И ВыпущеннаяПродукция.КоличествоПродукция <> 0 Тогда
			
			СтрокаПартия.Строки.Добавить();
			
		ИначеЕсли ВыпущеннаяПродукция.ТребуетсяРазузлование
			И ВыпущеннаяПродукция.КоличествоПродукция <> 0 Тогда //проверка на отсторнированный выпуск в выбранном периоде
			
			НоваяСтрокаОтбора = ПараметрыДерева.ТаблицаОтборовУзлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОтбора, ВыпущеннаяПродукция);
			НоваяСтрокаОтбора.Уровень = ПараметрыДерева.УровеньУзла;
			НоваяСтрокаОтбора.ДанныеПоСебестоимости = ПараметрыДерева.ПараметрыОтчета.ДанныеПоСебестоимости;

			НоваяСтрокаОтбора.ИдентификаторУзла = НовыйИдентификаторУзла;
			ВышестоящиеУзлы = Новый Массив();
			ПараметрыДерева.ВышестоящиеУзлы.Вставить(НовыйИдентификаторУзла, ВышестоящиеУзлы);
			Если Не ЗначениеЗаполнено(НоваяСтрокаОтбора.ИдентификаторУзлаПервогоУровня) Тогда
				НоваяСтрокаОтбора.ИдентификаторУзлаПервогоУровня = НовыйИдентификаторУзла;
			КонецЕсли;
			НоваяСтрокаОтбора.УзелПервогоУровня_АналитикаУчетаПродукции = ВыпущеннаяПродукция.АналитикаУчетаПродукции;
			НоваяСтрокаОтбора.АналитикаУчетаЗатрат = ВыпущеннаяПродукция.АналитикаУчетаПродукции;
			НоваяСтрокаОтбора.УзелПервогоУровня_ПартияПродукции = ВыпущеннаяПродукция.ПартияПродукции;
			НоваяСтрокаОтбора.УзелПервогоУровня_АналитикаУчетаПартийПродукции = ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции;
			// Комментарий 406.
			// При разузловании полуфабрикатов отбор по назначению не нужен,
			// т.к. полуфабрикат может быть выпущен без назначения или с указанием другого назначения.
			// Поэтому в таблицу отбора значение заполняем, но выключаем отбор по назначениям.
			НоваяСтрокаОтбора.ПоВсемНазначениям = Истина;
			
			НоваяСтрокаОтбора.Знаменатель = Макс(-ВыпущеннаяПродукция.Знаменатель, ВыпущеннаяПродукция.Знаменатель);
			НоваяСтрокаОтбора.КоличествоПродукции = Макс(-ВыпущеннаяПродукция.КоличествоПродукция, ВыпущеннаяПродукция.КоличествоПродукция);
			НоваяСтрокаОтбора.РазворачиватьДопРасходы = ПараметрыДерева.ПараметрыОтчета.РазворачиватьДопРасходы;
			НоваяСтрокаОтбора.ДатаИсходнойПартии_НачалоМесяца = НачалоМесяца(НоваяСтрокаОтбора.ДатаИсходнойПартии);
			НоваяСтрокаОтбора.ДатаИсходнойПартии_КонецМесяца = КонецМесяца(НоваяСтрокаОтбора.ДатаИсходнойПартии);
			
			НоваяСтрокаОтбора.Сумма = ВыпущеннаяПродукция.СуммаПродукция;
			НоваяСтрокаОтбора.СуммаЗабалансовая = ВыпущеннаяПродукция.СуммаПродукцияЗабалансовая;
			
			Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
				ТаблицаРезультата = СтрокаПартия;
			Иначе
				ТаблицаРезультата = Результат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПараметрыДерева.ТипРезультатаМенеджерВременныхТаблиц Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
			ПараметрыДерева.МенеджерВременныхТаблиц,
			"ПредварительныйРезультат",
			Результат,
			ПараметрыДерева.ПоляТаблицы);
		ПараметрыДерева.ГлобальныеВременныеТаблицы.Добавить("ПредварительныйРезультат");
		Результат.Очистить();
	КонецЕсли;
	
	ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора = ПараметрыДерева.ТаблицаОтборовУзлов.Количество();
	Если ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора > 0 Тогда
		#Область ВариантыУсловийСоединенияПоПараметрамУзлов
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 0;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 1;
		
		МассивНаборовИндексов = Новый Массив();
		МассивНаборовИндексов.Добавить("ПартияПродукции");
		МассивНаборовИндексов.Добавить("ИдентификаторУзла");
		
		МассивНаборовИндексов.Добавить(ПараметрыДерева.ИндексДляПроверкиЗацикливания);
		#КонецОбласти
		
		// Комментарий 520.
		// Массив регистраторов должен быть заполнен только на первом шаге разузлования.
		ПараметрыДерева.ПараметрыОтчета.Регистраторы = Новый Массив();
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
			ПараметрыДерева.МенеджерВременныхТаблиц,
			"ТаблицаОтборовУзлов", ПараметрыДерева.ТаблицаОтборовУзлов,
			ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонок,
			МассивНаборовИндексов);
			
		МассивНаборовИндексов = Новый Массив();
		ПоместитьТаблицаОтборовУзловВВТТаблицаУзлов(ПараметрыДерева);

		РазузловатьУровеньУзловДереваСебестоимости(ПараметрыДерева, ТаблицаРезультата);
	КонецЕсли;
	
	Если ПараметрыДерева.ТипРезультатаМенеджерВременныхТаблиц Тогда
		
		ОбъединяемыеВременныеТаблицы = "ПредварительныйРезультат";
		Если РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыДерева.МенеджерВременныхТаблиц,
			"ПредварительныйРезультат2") Тогда
				
			ОбъединяемыеВременныеТаблицы = "ПредварительныйРезультат,ПредварительныйРезультат2";
		КонецЕсли;
		
		// В таблицах у колонок разные типы, поэтому для использования метода запроса - добавить,
		// заполняем таблицы отдельно, в конце объединяем.
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбъединитьВременныеТаблицы(ПараметрыДерева.МенеджерВременныхТаблиц,
			ОбъединяемыеВременныеТаблицы, "Результат",
			ПараметрыДерева.ПоляТаблицы, "", "", Истина); //@Query-part
			
	КонецЕсли;
	
	ВывестиОшибкиРазузлования(ПараметрыДерева);
	
КонецПроцедуры

Процедура ЗаполнитьИндексДляПроверкиЗацикливания(ПараметрыДерева, ПроверитьИндексациюВТТаблицаУзлов)
	
	МассивИндексируемыхКолонок = Новый Массив();
	МассивИндексируемыхКолонок.Добавить("ИдентификаторУзлаПервогоУровня"); //@Query-part
	МассивИндексируемыхКолонок.Добавить("АналитикаУчетаЗатрат"); //@Query-part
	МассивИндексируемыхКолонок.Добавить("ПартияЗатрата"); //@Query-part
	
	// Смотри комментарий 204.
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1 Тогда
		МассивИндексируемыхКолонок.Добавить("ПартияПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 1 Тогда
		МассивИндексируемыхКолонок.Добавить("АналитикаУчетаПартийПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1 Тогда
		МассивИндексируемыхКолонок.Добавить("Продукция"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 1 Тогда
		МассивИндексируемыхКолонок.Добавить("ХарактеристикаПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 1 Тогда
		МассивИндексируемыхКолонок.Добавить("СерияПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 1 Тогда
		МассивИндексируемыхКолонок.Добавить("НазначениеПродукции"); //@Query-part
	КонецЕсли;
	
	МассивИндексируемыхКолонок.Добавить("ИдентификаторУзла"); //@Query-part
	НоваяСтрокаИндексируемыхКолонок = СтрСоединить(МассивИндексируемыхКолонок, ",");
	ПереиндексироватьВТТаблицаУзлов = ПроверитьИндексациюВТТаблицаУзлов
		И ПараметрыДерева.ИндексДляПроверкиЗацикливания <> Неопределено
		И НоваяСтрокаИндексируемыхКолонок <> ПараметрыДерева.ИндексДляПроверкиЗацикливания;
	
	ПараметрыДерева.Вставить("ИндексДляПроверкиЗацикливания", НоваяСтрокаИндексируемыхКолонок);
	
	Если ПереиндексироватьВТТаблицаУзлов Тогда
		ИмяИсточника = "ТаблицаУзлов";
		ИмяПриемника = "ТаблицаУзловКопия";
		РасчетСебестоимостиПрикладныеАлгоритмы.СкопироватьВременнуюТаблицу(ПараметрыДерева.МенеджерВременныхТаблиц,
			ИмяИсточника, ИмяПриемника);
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыДерева.МенеджерВременныхТаблиц,
			ИмяИсточника);
		РасчетСебестоимостиПрикладныеАлгоритмы.СкопироватьВременнуюТаблицу(ПараметрыДерева.МенеджерВременныхТаблиц,
			ИмяПриемника, ИмяИсточника, НоваяСтрокаИндексируемыхКолонок) 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоместитьТаблицаОтборовУзловВВТТаблицаУзлов(ПараметрыДерева)

	ЗаполнитьИндексДляПроверкиЗацикливания(ПараметрыДерева, Ложь);
	
	// Комментарий 510.
	// ТаблицаУзлов необходима для отслеживания зацикливания.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		ПараметрыДерева.МенеджерВременныхТаблиц,
		"ТаблицаУзлов", ПараметрыДерева.ТаблицаОтборовУзлов,
		ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонок,
		ПараметрыДерева.ИндексДляПроверкиЗацикливания);
	
КонецПроцедуры

Процедура ВывестиОшибкиРазузлования(ПараметрыДерева)
	Если ПараметрыДерева.ВыводитьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ПараметрыДерева.Диагностика.Ошибки);
	КонецЕсли;
КонецПроцедуры

Процедура УничтожитьВременныеТаблицы(ПараметрыДерева)
	
	ТекстыУничтоженияВременныхТаблиц = Новый Массив();
	Для Каждого ВременнаяТаблица Из ПараметрыДерева.МенеджерВременныхТаблиц.Таблицы Цикл
		Если ПараметрыДерева.ГлобальныеВременныеТаблицы.Найти(ВременнаяТаблица.ПолноеИмя) = Неопределено Тогда
			ТекстыУничтоженияВременныхТаблиц.Добавить("УНИЧТОЖИТЬ " + ВременнаяТаблица.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	
	Если ТекстыУничтоженияВременныхТаблиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПараметрыДерева.МенеджерВременныхТаблиц;
	Запрос.Текст = СтрСоединить(ТекстыУничтоженияВременныхТаблиц, ";");
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьДанныеКВременнойТаблице(МенеджерВТ, ИмяВременнойТаблицы, Данные, ИменаКолонок)
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Шаблон = "
		|ВЫБРАТЬ
		|	%1
		|ДОБАВИТЬ %2
		|ИЗ &ПараметрЗапросаТаблицаЗначений КАК Т
		|"; //@Query-part

	ИменаКолонокССинонимами = РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьКолонкамСинонимы(ИменаКолонок, "Т");
	Запрос.Текст = СтрШаблон(Шаблон, ИменаКолонокССинонимами, ИмяВременнойТаблицы);
	Запрос.УстановитьПараметр("ПараметрЗапросаТаблицаЗначений", Данные);
	Запрос.Выполнить();
КонецПроцедуры

Процедура РассчитатьРасходПартий(Запрос, ПараметрыДерева)
	МассивТекстовЗапросов = Новый Массив();
	МассивТекстовЗапросов.Добавить(Запрос.Текст);
	МассивТекстовЗапросов.Добавить(ТекстЗапросаРасходПартий());
	Запрос.Текст = СтрСоединить(МассивТекстовЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Пояснение = НСтр("ru = 'Материальные затраты узлов';
					|en = 'Материальные затраты узлов'");
	ИмяСобытия = НСтр("ru = 'Расчет расхода партий в НЗП по уровню узлов';
						|en = 'Расчет расхода партий в НЗП по уровню узлов'");
	РезультатЗапроса = ВыполнитьЗапросСЗамеромДляПротокола(Запрос, ПараметрыДерева, Пояснение, ИмяСобытия);
	
	ИндексПоследнегоЗапроса = РезультатЗапроса.ВГраница();
	ВыбытиеИзНЗПДляОстатка = РезультатЗапроса[ИндексПоследнегоЗапроса - 2].Выгрузить();
	ПервичныеПартииВНЗП = РезультатЗапроса[ИндексПоследнегоЗапроса - 1].Выгрузить();
	ПервичныеПартииВНЗП.Индексы.Добавить("ИдентификаторАналитик");
	РасходПартий = РезультатЗапроса[ИндексПоследнегоЗапроса].Выгрузить();
	
	Для Каждого СтрокаВыбытия Из ВыбытиеИзНЗПДляОстатка Цикл
		СтруктураОтбора = Новый Структура("ИдентификаторАналитик", СтрокаВыбытия.ИдентификаторАналитик);
		СтрокиПрихода = ПервичныеПартииВНЗП.НайтиСтроки(СтруктураОтбора);
		
		// Общий остаток по партиям необходимо считать по месяцу расхода, с учетом возможного расхода в предыдущих месяцах.
		КоличествоОстатокПоПартиям = 0;
		ОтобранныеСтрокиПартий = Новый Массив;
		Для Каждого СтрокаПрихода Из СтрокиПрихода Цикл
			Если СтрокаПрихода.Период > СтрокаВыбытия.Период Или СтрокаПрихода.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОтобранныеСтрокиПартий.Добавить(СтрокаПрихода);
			КоличествоОстатокПоПартиям = КоличествоОстатокПоПартиям + СтрокаПрихода.Количество;
		КонецЦикла;
		
		КоличествоВыбытия = СтрокаВыбытия.Количество;
		Для Каждого СтрокаПрихода Из ОтобранныеСтрокиПартий Цикл
			
			// В разделе незавершенного производства учет по средней.
			// Забираем из каждой партии количество выбытия, относительно коэффициента остатка по партии, в общем остатке.
			КоличествоРасход = КоличествоВыбытия * СтрокаПрихода.Количество / КоличествоОстатокПоПартиям;
			
			СтрокаРасходаПартии = РасходПартий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРасходаПартии, СтрокаПрихода);
			СтрокаРасходаПартии.Период = СтрокаВыбытия.Период;
			СтрокаРасходаПартии.Количество = КоличествоРасход;
			
			СтрокаПрихода.Количество = СтрокаПрихода.Количество - КоличествоРасход;
			СтрокаВыбытия.Количество = СтрокаВыбытия.Количество - КоличествоРасход;
		КонецЦикла;
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		Запрос.МенеджерВременныхТаблиц,
		"РасходПартий",
		РасходПартий,
		"ИдентификаторУзла,Период,Организация,АналитикаУчетаНоменклатуры,АналитикаУчетаПартий,Партия,
			|КорАналитикаУчетаНоменклатуры,КорПартия,Количество",
		"ИдентификаторУзла,Организация,АналитикаУчетаНоменклатуры,Партия,Период");
КонецПроцедуры

Функция ВыполнитьЗапросСЗамеромДляПротокола(Запрос, ПараметрыДерева, Пояснение, ИмяСобытия)
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("РезультатВыполненияЗапроса", "");
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(
		ПараметрыРасчета, Запрос,,, Истина, Пояснение);
		
	Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала) / 1000;
	Шаблон = НСтр("ru = 'Уровень узлов: %1
			|Общее время: %2
			|Количество узлов отбора: %3
			|%4';
			|en = 'Node level: %1
			|Total time: %2
			|Number of filter nodes: %3
			|%4'");
	ТекстДляПротокола = СтрШаблон(Шаблон,
		ПараметрыДерева.УровеньУзла,
		РасчетСебестоимостиПротоколРасчета.ПредставлениеВремени(Длительность),
		ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора,
		ПараметрыРасчета.РезультатВыполненияЗапроса);
	ПараметрыДерева.Диагностика.ЗамерыВыполненияЗапросовПоУровнямУзлов.Добавить(ТекстДляПротокола);
	
	ЗаписьЖурналаРегистрации(ПараметрыДерева.Диагностика.ГруппаСобытийЖурналаРегистрации + ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,,,
		ТекстДляПротокола);
	
	Возврат РезультатЗапроса;
КонецФункции

Функция СебестоимостьУзлов(ПараметрыДерева, ВыводитьДопРасходы, ДобавитьГруппировкуПоИдентификаторамУзлов)
	
	СтрокаИтогиПоИдентификаторУзла = "";
	Если ДобавитьГруппировкуПоИдентификаторамУзлов Тогда
		СтрокаИтогиПоИдентификаторУзла = "
			|ИТОГИ ПО
			|	ИдентификаторУзла
			|"; //@Query-part
	КонецЕсли;
	
	Запрос = ЗапросВыпущеннаяПродукция(Истина, ПараметрыДерева);
	Запрос.УстановитьПараметр("ДобавлятьПолуфабрикатыВРезультат", ПараметрыДерева.ДобавлятьПолуфабрикатыВРезультат);
	Запрос.УстановитьПараметр("УровеньУзла", ПараметрыДерева.УровеньУзла);
	
	РассчитатьРасходПартий(Запрос, ПараметрыДерева);
	
	МассивТекстовЗапросов = Новый Массив();
	МассивТекстовЗапросов.Добавить(ТекстЗапросаРезультатыРазузлованияПредварительная(ВыводитьДопРасходы, ПараметрыДерева));
	МассивТекстовЗапросов.Добавить(ТекстЗапросаРезультатыРазузлования(ПараметрыДерева));
	МассивТекстовЗапросов.Добавить("УНИЧТОЖИТЬ РезультатыРазузлованияПредварительная"); //@Query-part
	МассивТекстовЗапросов.Добавить(ПараметрыДерева.ТекстЗапросаЗатратыНаПродукцию + СтрокаИтогиПоИдентификаторУзла);
	Если ПараметрыДерева.ТипРезультатаМенеджерВременныхТаблиц Тогда
		МассивТекстовЗапросов.Добавить(
			ПараметрыДерева.ТекстЗапросаУзлыТребующиеРазузлования + СтрокаИтогиПоИдентификаторУзла);
	КонецЕсли;
	Запрос.Текст = СтрСоединить(МассивТекстовЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДОБАВИТЬ ПредварительныйРезультат2", ""); //@Query-part
		
	ИначеЕсли ПараметрыДерева.ТипРезультатаМенеджерВременныхТаблиц Тогда
		Если Не ПараметрыДерева.ДобавленаВременнаяТаблицаРезультатовРазузлования Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДОБАВИТЬ ПредварительныйРезультат2",
				"ПОМЕСТИТЬ ПредварительныйРезультат2"); //@Query-part
			ПараметрыДерева.ГлобальныеВременныеТаблицы.Добавить("ПредварительныйРезультат2");
			ПараметрыДерева.ДобавленаВременнаяТаблицаРезультатовРазузлования = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Пояснение = НСтр("ru = 'Себестоимость узлов';
					|en = 'Node cost'");
	ИмяСобытия = НСтр("ru = 'Выполнение запроса по уровню узлов';
						|en = 'Query execution by node level'");
	РезультатЗапроса = ВыполнитьЗапросСЗамеромДляПротокола(Запрос, ПараметрыДерева, Пояснение, ИмяСобытия);
	
	Если ТипЗнч(РезультатЗапроса) = Тип("Массив") Тогда
		РезультатЗапроса = РезультатЗапроса[РезультатЗапроса.ВГраница()];
	КонецЕсли;
	
	ПринципОбхода = ?(ДобавитьГруппировкуПоИдентификаторамУзлов,
		ОбходРезультатаЗапроса.ПоГруппировкам, ОбходРезультатаЗапроса.Прямой);
	Возврат РезультатЗапроса.Выбрать(ПринципОбхода);
	
КонецФункции

Процедура РазузловатьУровеньУзловДереваСебестоимости(ПараметрыДерева, ТаблицаРезультата)
	
	ПараметрыДерева.УровеньУзла = ПараметрыДерева.УровеньУзла + 1;
	
	ВыводитьДопРасходы = ПараметрыДерева.ПараметрыОтчета.РазворачиватьДопРасходы И НЕ (ПараметрыДерева.УровеньУзла = 1);
	// Смотри комментарий 3970.
	ДобавитьГруппировкуПоИдентификаторамУзлов = ПараметрыДерева.ТипРезультатаДеревоЗначений 
		И Не ПараметрыДерева.ИнтерактивнаяНастройка
		И Не ПараметрыДерева.ДинамическоеСчитывание;
		
	ЗатратыНаПродукцию = СебестоимостьУзлов(ПараметрыДерева, ВыводитьДопРасходы,
		ДобавитьГруппировкуПоИдентификаторамУзлов);
	УничтожитьВременныеТаблицы(ПараметрыДерева);
	
	// Смотри комментарий 759.
	СоответствиеУзлов = Неопределено;
	Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		СоответствиеУзлов = Новый Соответствие();
	КонецЕсли;
	
	ПараметрыДерева.ТаблицаОтборовУзлов.Очистить();
	Результат = Неопределено;
	Если Не ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		Результат = ТаблицаРезультата
	КонецЕсли;
	
	ВышестоящиеУзлыКУдалению = Новый Соответствие();
	Пока ЗатратыНаПродукцию.Следующий() Цикл
		Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
			Результат = ПараметрыДерева.СоответствиеУзлов[ЗатратыНаПродукцию.ИдентификаторУзла].Строки;
		КонецЕсли;
		
		Если ДобавитьГруппировкуПоИдентификаторамУзлов Тогда
			ТекущаяПартия = ЗатратыНаПродукцию.Выбрать();
			Пока ТекущаяПартия.Следующий() Цикл
				ТаблицаРезультатаПартии = ОбработатьЗатратыНаПродукцию(Результат, ТекущаяПартия,
					СоответствиеУзлов, ПараметрыДерева, ВышестоящиеУзлыКУдалению);
			КонецЦикла;
		Иначе
			ТаблицаРезультатаПартии = ОбработатьЗатратыНаПродукцию(Результат, ЗатратыНаПродукцию,
				СоответствиеУзлов, ПараметрыДерева, ВышестоящиеУзлыКУдалению);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора = ПараметрыДерева.ТаблицаОтборовУзлов.Количество();
	Если ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора > 0 И Не ПараметрыДерева.ДинамическоеСчитывание Тогда
		
		#Область ВариантыУсловийСоединенияПоПараметрамУзлов
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 1;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 0;
		ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 1;
		
		// Набор полей для индексирования должен учитывать варианты условий соединения.
		НаборовИндексовТаблицыОтбораУзлов = Новый Массив();
		НаборовИндексовТаблицыОтбораУзлов.Добавить("ПартияПродукции");
		НаборовИндексовТаблицыОтбораУзлов.Добавить("ИдентификаторУзла");
		
		#КонецОбласти
		
		Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
			// Комментарий 759.
			// Необходимости хранения соответствия узлов для всего дерева нет,
			// для оптимизации обновляем соответствие при разузловке каждого уровня дерева.
			ПараметрыДерева.СоответствиеУзлов = СоответствиеУзлов;
		КонецЕсли;
		
		// Хранить вышестоящие узлы прошлых уровней не нужно, так как они находятся во временной таблице ВышестоящиеУзлы.
		Для Каждого ВышестоящийУзел Из ВышестоящиеУзлыКУдалению Цикл
			ПараметрыДерева.ВышестоящиеУзлы.Удалить(ВышестоящийУзел.Ключ);
		КонецЦикла;
			
		ПроверитьПараметрыРасчета(ПараметрыДерева);
		ПоместитьВышестоящиеУзлыВоВременнуюТаблицу(ПараметрыДерева);
		ЕстьСтрокиДляРазузлования = ДобавитьТаблицуОтбораУзловВоВременную(
			ПараметрыДерева, НаборовИндексовТаблицыОтбораУзлов);
		Если ПараметрыДерева.Диагностика.ЕстьОшибки Или Не ЕстьСтрокиДляРазузлования Тогда
			Возврат;
		КонецЕсли;
		
		// Смотри комментарий 520.
		ПараметрыДерева.ПараметрыОтчета.Регистраторы = Новый Массив();
		
		РазузловатьУровеньУзловДереваСебестоимости(ПараметрыДерева, ТаблицаРезультатаПартии);
	КонецЕсли;
	
КонецПроцедуры

Функция ОбработатьЗатратыНаПродукцию(Результат, ТекПартия, СоответствиеУзлов, ПараметрыДерева, ВышестоящиеУзлыКУдалению)
	
	ТаблицаРезультатаПартии = Неопределено;

	НовыйИдентификаторУзла = Строка(Новый УникальныйИдентификатор);
	Если ПараметрыДерева.ТипРезультатаДеревоЗначений
		И (ПараметрыДерева.ДобавлятьПолуфабрикатыВРезультат Или Не ТекПартия.ТребуетсяРазузлование) Тогда

		СтрокаПартия = Результат.Добавить(); // СтрокаДереваЗначений
		ЗаполнитьЗначенияСвойств(СтрокаПартия, ТекПартия);

		СтрокаПартия.Идентификатор	= Новый УникальныйИдентификатор;

		Если ПараметрыДерева.ТипРезультатаДеревоЗначений
			И (ТекПартия.ТребуетсяРазузлование Или ТекПартия.ТребуетсяРазузлованиеДопРасходов) Тогда
				
			СоответствиеУзлов.Вставить(НовыйИдентификаторУзла, СтрокаПартия);
		КонецЕсли;

	КонецЕсли;

	Если (ТекПартия.ТребуетсяРазузлование Или ТекПартия.ТребуетсяРазузлованиеДопРасходов)
		И ПараметрыДерева.ТипРезультатаДеревоЗначений
		И ПараметрыДерева.ДинамическоеСчитывание Тогда
		
		// Комментарий 649.
		// Добавление пустой строки в дереве значений,
		// необходимо для того, чтобы при динамическом считывании, 
		// была возможность нажать на + и получить разузлование по выбранной позиции.
		// При разузловании, подчиненные строки должны быть сначала очищены.
		СтрокаПартия.Строки.Добавить();

	ИначеЕсли (ТекПартия.ТребуетсяРазузлование Или ТекПартия.ТребуетсяРазузлованиеДопРасходов) Тогда
			
		НоваяСтрокаОтбора = ПараметрыДерева.ТаблицаОтборовУзлов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОтбора, ТекПартия);
		
		НоваяСтрокаОтбора.УзелПервогоУровня_АналитикаУчетаПродукции = ТекПартия.АналитикаУчетаПродукции;
		НоваяСтрокаОтбора.УзелПервогоУровня_АналитикаУчетаПартийПродукции = ТекПартия.АналитикаУчетаПартийПродукции;
		НоваяСтрокаОтбора.УзелПервогоУровня_ПартияПродукции = ТекПартия.ПартияПродукции;
		
		НоваяСтрокаОтбора.Продукция = ТекПартия.Номенклатура;
		НоваяСтрокаОтбора.ХарактеристикаПродукции = ТекПартия.Характеристика;
		НоваяСтрокаОтбора.СерияПродукции = ТекПартия.Серия;
		// Смотри комментарий 406, 204.
		НоваяСтрокаОтбора.ПоВсемНазначениям = Истина;
		НоваяСтрокаОтбора.НазначениеПродукции = ТекПартия.Назначение;
		НоваяСтрокаОтбора.ПартияПродукции = ТекПартия.Партия;
		
		НоваяСтрокаОтбора.АналитикаУчетаПартийПродукции = ТекПартия.АналитикаУчетаПартийЗатрата;
		НоваяСтрокаОтбора.АналитикаУчетаЗатрат = ТекПартия.АналитикаУчетаЗатрата;

		// Для знаменателя и количества продукции берем модуль значения,
		// чтобы знак количества и сумм затрат определялся по числителю,
		// который при выпуске будет > 0, а при сторно < 0
		НоваяСтрокаОтбора.Числитель = ТекПартия.Количество;
		НоваяСтрокаОтбора.КоличествоПродукции = Макс(-ТекПартия.Количество, ТекПартия.Количество);
		НоваяСтрокаОтбора.ДатаИсходнойПартии_НачалоМесяца = НачалоМесяца(НоваяСтрокаОтбора.ДатаИсходнойПартии);
		НоваяСтрокаОтбора.ДатаИсходнойПартии_КонецМесяца = КонецМесяца(НоваяСтрокаОтбора.ДатаИсходнойПартии);
		НоваяСтрокаОтбора.АналитикаУчетаВыходноеИзделие = ТекПартия.АналитикаУчетаЗатрата;
		
		НоваяСтрокаОтбора.ДанныеПоСебестоимости = ПараметрыДерева.ПараметрыОтчета.ДанныеПоСебестоимости;
		
		// Перед изменением УИД строки разузлования, добавим в соответствие массив всех вышестоящих узлов.
		НоваяСтрокаОтбора.Уровень = ПараметрыДерева.УровеньУзла;
		ВышестоящиеУзлы = ОбщегоНазначения.СкопироватьРекурсивно(
			ПараметрыДерева.ВышестоящиеУзлы.Получить(НоваяСтрокаОтбора.ИдентификаторУзла));
		ВышестоящиеУзлы.Добавить(НоваяСтрокаОтбора.ИдентификаторУзла);
		ВышестоящиеУзлыКУдалению.Вставить(НоваяСтрокаОтбора.ИдентификаторУзла);
		ПараметрыДерева.ВышестоящиеУзлы.Вставить(НовыйИдентификаторУзла, ВышестоящиеУзлы);
		НоваяСтрокаОтбора.ИдентификаторУзла = НовыйИдентификаторУзла;
		
		НоваяСтрокаОтбора.ДатаОкончания = ПараметрыДерева.ПараметрыОтчета.ДатаОкончания;
		НоваяСтрокаОтбора.РазворачиватьДопРасходы = ПараметрыДерева.ПараметрыОтчета.РазворачиватьДопРасходы;

		Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
			ТаблицаРезультатаПартии = СтрокаПартия;
		Иначе
			ТаблицаРезультатаПартии = Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаРезультатаПартии;
	
КонецФункции

Процедура ПоместитьВышестоящиеУзлыВоВременнуюТаблицу(ПараметрыДерева)
	
	ТаблицаВышестоящиеУзлы = Новый ТаблицаЗначений();
	ТаблицаВышестоящиеУзлы.Колонки.Добавить("ВышестоящийУзел", ПараметрыДерева.СтруктураПолей.ИдентификаторУзла);
	ТаблицаВышестоящиеУзлы.Колонки.Добавить("УзелИсточник", ПараметрыДерева.СтруктураПолей.ИдентификаторУзла);
	
	Для Каждого Узел Из ПараметрыДерева.ВышестоящиеУзлы Цикл
		Для Каждого ВышестоящийУзел Из Узел.Значение Цикл
			НоваяСтрока = ТаблицаВышестоящиеУзлы.Добавить();
			НоваяСтрока.ВышестоящийУзел = ВышестоящийУзел;
			НоваяСтрока.УзелИсточник = Узел.Ключ;
		КонецЦикла;
	КонецЦикла;
	
	ИменаКолонок = "
		|Т.ВышестоящийУзел КАК ВышестоящийУзел,
		|Т.УзелИсточник КАК УзелИсточник
		|";
	
	Если ПараметрыДерева.ВышестоящиеУзлыДобавлены Тогда
		ДобавитьДанныеКВременнойТаблице(ПараметрыДерева.МенеджерВременныхТаблиц, "ВышестоящиеУзлы",
			ТаблицаВышестоящиеУзлы,
			ИменаКолонок);
	Иначе
		РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
			ПараметрыДерева.МенеджерВременныхТаблиц,
			"ВышестоящиеУзлы",
			ТаблицаВышестоящиеУзлы,
			ИменаКолонок,
			"УзелИсточник, ВышестоящийУзел");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПараметрыРасчета(ПараметрыДерева)
	
	Если ПараметрыДерева.МаксимальнаяГлубинаРазузлования > 0
		И ПараметрыДерева.УровеньУзла > ПараметрыДерева.МаксимальнаяГлубинаРазузлования Тогда
		
		ТекстДляПротокола = СтрШаблон(
			НСтр("ru = 'Превышена максимальная глубина разузлования дерева себестоимости (%1)';
				|en = 'The maximum explosion depth of the cost tree is exceeded (%1)'"),
			ПараметрыДерева.МаксимальнаяГлубинаРазузлования);
		
		ГруппаОшибок = НСтр("ru = 'Проверка глубины разузлования';
							|en = 'Check explosion depth'");
		ЗаписьЖурналаРегистрации(ПараметрыДерева.Диагностика.ГруппаСобытийЖурналаРегистрации + ГруппаОшибок,
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстДляПротокола);
			
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ПараметрыДерева.Диагностика.Ошибки,
			"", ТекстДляПротокола, ГруппаОшибок);
		ПараметрыДерева.Диагностика.ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет и исключает возможное зацикливание разузлования.
Функция ДобавитьТаблицуОтбораУзловВоВременную(ПараметрыДерева, НаборовИндексовТаблицыОтбораУзлов)
	
	ЗаполнитьИндексДляПроверкиЗацикливания(ПараметрыДерева, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		ПараметрыДерева.МенеджерВременныхТаблиц,
		"ТаблицаОтборовУзловПредварительная", ПараметрыДерева.ТаблицаОтборовУзлов,
		ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонок,
		ПараметрыДерева.ИндексДляПроверкиЗацикливания);
	
	// 1. Уничтожаем ВТ ТаблицаОтборовУзлов, если существует.
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыДерева.МенеджерВременныхТаблиц,
		"ТаблицаОтборовУзлов");
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПараметрыДерева.МенеджерВременныхТаблиц;
	ТекстыЗапросов = Новый Массив();
	
	// 2. Ищем возможное зацикливание.
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИменаКолонокССинонимами КАК ИменаКолонокССинонимами,
		|	ИСТИНА В (
		|		ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
		|	
		|		ИЗ ТаблицаУзлов КАК ТаблицаУзлов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВышестоящиеУзлы КАК ВышестоящиеУзлы
		|		ПО ТаблицаУзлов.ИдентификаторУзлаПервогоУровня = Т.ИдентификаторУзлаПервогоУровня
		|			И ТаблицаУзлов.АналитикаУчетаЗатрат =  Т.АналитикаУчетаЗатрат
		|			И ТаблицаУзлов.ПартияЗатрата = Т.ПартияЗатрата
		|			И &ДополнительныеУсловияСоединения
		|		
		|			И Т.ИдентификаторУзла = ВышестоящиеУзлы.УзелИсточник
		|			И ВышестоящиеУзлы.ВышестоящийУзел = ТаблицаУзлов.ИдентификаторУзла
		|	) КАК Зацикливание
		|
		|ПОМЕСТИТЬ ТаблицаОтборовУзловПредварительная2
		|
		|ИЗ ТаблицаОтборовУзловПредварительная КАК Т
		|";
	
	#Область ВариантыУсловийСоединенияПоПараметрамУзлов
	// Смотри комментарий 204.
	УсловияСоединения = Новый Массив();
		
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1 Тогда
		УсловияСоединения.Добавить("И ТаблицаУзлов.ПартияПродукции = Т.ПартияПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 1 Тогда
		УсловияСоединения.Добавить(
			"И ТаблицаУзлов.АналитикаУчетаПартийПродукции = Т.АналитикаУчетаПартийПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1 Тогда
		УсловияСоединения.Добавить("И ТаблицаУзлов.Продукция = Т.Продукция"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 1 Тогда
		УсловияСоединения.Добавить("И ТаблицаУзлов.ХарактеристикаПродукции = Т.ХарактеристикаПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 1 Тогда
		УсловияСоединения.Добавить("И ТаблицаУзлов.СерияПродукции = Т.СерияПродукции"); //@Query-part
	КонецЕсли;
	Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 1 Тогда
		УсловияСоединения.Добавить("И ТаблицаУзлов.НазначениеПродукции = Т.НазначениеПродукции"); //@Query-part
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ДополнительныеУсловияСоединения",
		?(УсловияСоединения.Количество() = 0,
			"",
			СтрСоединить(УсловияСоединения, Символы.ПС))); //@Query-part
	#КонецОбласти
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	// 3. Добавляем в ВТ ТаблицаОтборовУзлов только строки, по которым нет зацикливания.
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИменаКолонокССинонимами КАК ИменаКолонокССинонимами
		|ПОМЕСТИТЬ ТаблицаОтборовУзлов
		|ИЗ ТаблицаОтборовУзловПредварительная2 КАК Т
		|ГДЕ
		|	НЕ Т.Зацикливание
		|";
	
	МассивНаборовИндексов = Новый Массив;
	Для Каждого Набор Из НаборовИндексовТаблицыОтбораУзлов Цикл
		МассивНаборовИндексов.Добавить("(" + Набор + ")");
	КонецЦикла;
	ТекстПоляИндексирования = "
		|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
		|(
		|" + СтрСоединить(МассивНаборовИндексов, "," + Символы.ПС) + "
		|)"; //@Query-part
		
	ТекстыЗапросов.Добавить(ТекстЗапроса + ТекстПоляИндексирования);
	
	// 4. Добавляем в ВТ ТаблицаУзлов только строки, по которым нет зацикливания.
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИменаКолонокССинонимами КАК ИменаКолонокССинонимами
		|ДОБАВИТЬ ТаблицаУзлов
		|ИЗ ТаблицаОтборовУзловПредварительная2 КАК Т
		|ГДЕ
		|	НЕ Т.Зацикливание
		|";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	// Комментарий 975.
	// 5. Собираем временную таблицу по зацикливанию, в результате представим как НоменклатураЗацикливание.
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ИменаКолонокССинонимами КАК ИменаКолонокССинонимами
		|ПОМЕСТИТЬ УзлыСЗацикливанием
		|ИЗ ТаблицаОтборовУзловПредварительная2 КАК Т
		|ГДЕ
		|	Т.Зацикливание
		|";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИменаКолонокССинонимами КАК ИменаКолонокССинонимами",
		ПараметрыДерева.ТаблицаОтборовУзлов_ИменаКолонокССинонимами);
	Запрос.Текст = ТекстЗапроса;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("РезультатВыполненияЗапроса", "");
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(
		ПараметрыРасчета, Запрос,,, Ложь, НСтр("ru = 'Добавить таблицу отбора узлов во временную';
												|en = 'Add a node filter table to the temporary one'"));
	Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала) / 1000;
	ГруппаОшибок = НСтр("ru = 'Проверка зацикливания';
						|en = 'Looping check'");
	Шаблон = НСтр("ru = 'Уровень узлов: %1
		|Общее время: %2
		|Количество узлов отбора: %3
		|%4';
		|en = 'Node level: %1
		|Total time: %2
		|Number of filter nodes: %3
		|%4'");
	ТекстДляПротокола = ГруппаОшибок + Символы.ПС + СтрШаблон(Шаблон,
		ПараметрыДерева.УровеньУзла,
		РасчетСебестоимостиПротоколРасчета.ПредставлениеВремени(Длительность),
		ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора,
		ПараметрыРасчета.РезультатВыполненияЗапроса);
	ПараметрыДерева.Диагностика.ЗамерыВыполненияЗапросовПоУровнямУзлов.Добавить(ТекстДляПротокола);
	
	ЗаписьЖурналаРегистрации(ПараметрыДерева.Диагностика.ГруппаСобытийЖурналаРегистрации + ГруппаОшибок,
		УровеньЖурналаРегистрации.Информация,,,
		ТекстДляПротокола);
	
	// 6. Проверяем есть ли строки в ВТ ТаблицаОтборовУзлов:
	//	Истина - Строки есть, продолжаем разузлование.
	//	Ложь - нет строк для разузлования.
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(Запрос.МенеджерВременныхТаблиц,
		"ТаблицаОтборовУзлов") > 0;
	
КонецФункции

Функция ТекстЗапросаРасходПартий()
	
	ТекстыЗапроса = Новый Массив;
	
	#Область ВыбытиеИзНЗППоПродукции
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыпущеннаяПродукция.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ВыпущеннаяПродукция.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	МАКСИМУМ(ВыпущеннаяПродукция.ДатаИсходнойПартии) КАК ДатаИсходнойПартии,
		|	МАКСИМУМ(ВыпущеннаяПродукция.ТребуетсяРазузлованиеУзлаИсточника) КАК ТребуетсяРазузлованиеУзлаИсточника,
		|	ВыпущеннаяПродукция.АналитикаУчетаЗатрат КАК АналитикаУчетаЗатрат,
		|
		|	МАКСИМУМ(ВыпущеннаяПродукция.РазворачиватьДопРасходы) КАК РазворачиватьДопРасходы,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ) КАК Период,
		|	ВыпущеннаяПродукция.Организация КАК Организация,
		|	ВыпущеннаяПродукция.ПартияПродукции КАК ПартияПродукции,
		|	ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
		|	ВыпущеннаяПродукция.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
		|	МАКСИМУМ(ВыпущеннаяПродукция.Числитель) КАК Числитель,
		|	МАКСИМУМ(ВыпущеннаяПродукция.Знаменатель) КАК Знаменатель,
		|	СебестоимостьТоваров.Партия КАК Партия,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
		|	СУММА(СебестоимостьТоваров.Количество) КАК Количество,
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаЗатратаЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|				+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|				+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|				+ СебестоимостьТоваров.ТрудозатратыУпр
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|				+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|				+ СебестоимостьТоваров.ТрудозатратыРегл
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|				+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаЗатрата,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ВыбытиеИзНЗППоПродукции
		|ИЗ
		|	ВыпущеннаяПродукция КАК ВыпущеннаяПродукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ПО СебестоимостьТоваров.Организация = ВыпущеннаяПродукция.Организация
		|			И ВыпущеннаяПродукция.ПартияПродукции = СебестоимостьТоваров.Регистратор
		|			И ВыпущеннаяПродукция.АналитикаУчетаПродукции = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры
		|			И ВыпущеннаяПродукция.ПартияПродукции = СебестоимостьТоваров.КорПартия
		|			И ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции = СебестоимостьТоваров.КорАналитикаУчетаПартий
		|			И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|ГДЕ
		|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.Партия) = ТИП(Справочник.ПартииПроизводства)
		|	И НЕ СебестоимостьТоваров.Партия = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ),
		|	ВыпущеннаяПродукция.Организация,
		|	ВыпущеннаяПродукция.ПартияПродукции,
		|	ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции,
		|	ВыпущеннаяПродукция.АналитикаУчетаПродукции,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|
		|	ВыпущеннаяПродукция.ИдентификаторУзла,
		|	ВыпущеннаяПродукция.ИдентификаторУзлаПервогоУровня,
		|	ВыпущеннаяПродукция.АналитикаУчетаЗатрат,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_ПартияПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПартийПродукции
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Партия,
		|	АналитикаУчетаНоменклатуры,
		|	Период
		|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ВыбывшиеЗатратыСводно
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|	Т.Организация КАК Организация,
		|	МАКСИМУМ(Т.Период) КАК Период,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартий
		|ПОМЕСТИТЬ ВыбывшиеЗатратыСводно
		|ИЗ
		|	ВыбытиеИзНЗППоПродукции КАК Т
		|ГДЕ
		|	Т.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ИдентификаторУзла,
		|	Т.Организация,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартийПродукции
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	АналитикаУчетаНоменклатуры,
		|	АналитикаУчетаПартий,
		|	Организация,
		|	ИдентификаторУзла
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область ПартииПроизводства
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|	Т.Партия КАК Партия
		|ПОМЕСТИТЬ ПартииПроизводства
		|ИЗ
		|	ВыбывшиеЗатратыСводно КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	ИдентификаторУзла
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область ВыбытиеИзНЗП
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Выбытие.ИдентификаторУзла КАК ИдентификаторУзла,
		|	Т.Организация КАК Организация,
		|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.Партия КАК Партия,
		|	СУММА(Т.КоличествоРасход) КАК Количество
		|ПОМЕСТИТЬ ВыбытиеИзНЗП
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Обороты(,, МЕСЯЦ,
		|		Партия В (
		|			ВЫБРАТЬ
		|				Т.Партия
		|			ИЗ
		|				ПартииПроизводства КАК Т)
		|		И (АналитикаУчетаНоменклатуры, Организация) В (
		|			ВЫБРАТЬ
		|				Выбытие.АналитикаУчетаНоменклатуры,
		|				Выбытие.Организация КАК Организация
		|			ИЗ
		|				ВыбывшиеЗатратыСводно КАК Выбытие)
		|	) КАК Т
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбывшиеЗатратыСводно КАК Выбытие
		|	ПО Т.АналитикаУчетаНоменклатуры = Выбытие.АналитикаУчетаНоменклатуры
		|		И Т.Партия = Выбытие.Партия
		|		И Т.Организация = Выбытие.Организация
		|
		|ГДЕ
		|	Т.Период <= КОНЕЦПЕРИОДА(Выбытие.Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Выбытие.ИдентификаторУзла,
		|	Т.Организация,
		|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ),
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.Партия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Партия
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВыбытиеИзНЗПДляОстатка
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Выбытие.ИдентификаторУзла КАК ИдентификаторУзла,
		|	Т.Организация КАК Организация,
		|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.Партия КАК Партия,
		|	СУММА(Т.КоличествоРасход) КАК Количество
		|ПОМЕСТИТЬ ВыбытиеИзНЗПДляОстатка
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Обороты(,, МЕСЯЦ,
		|		Партия В (
		|			ВЫБРАТЬ
		|				Т.Партия
		|			ИЗ
		|				ПартииПроизводства КАК Т)
		|		И (АналитикаУчетаНоменклатуры, Организация) В (
		|			ВЫБРАТЬ
		|				Выбытие.АналитикаУчетаНоменклатуры,
		|				Выбытие.Организация КАК Организация
		|			ИЗ
		|				ВыбывшиеЗатратыСводно КАК Выбытие)
		|	) КАК Т
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбывшиеЗатратыСводно КАК Выбытие
		|	ПО Т.АналитикаУчетаНоменклатуры = Выбытие.АналитикаУчетаНоменклатуры
		|		И Т.Партия = Выбытие.Партия
		|		И Т.Организация = Выбытие.Организация
		|
		|ГДЕ
		|	Т.Период <= КОНЕЦПЕРИОДА(Выбытие.Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Выбытие.ИдентификаторУзла,
		|	Т.Организация,
		|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ),
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.Партия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Партия
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область ПервичныеПартииВНЗП
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ) КАК Период,
		|	СебестоимостьТоваров.Организация					КАК Организация,
		|	СебестоимостьТоваров.ВидЗапасов						КАК ВидЗапасов,
		// Аналитика первичной партии.
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий 			КАК АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Партия 						КАК Партия,
		// Аналитка в НЗП.
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры 	КАК КорАналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.КорПартия						КАК КорПартия,
		|
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА СебестоимостьТоваров.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И СебестоимостьТоваров.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ВключитьНДСВСтоимость,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА СебестоимостьТоваров.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И СебестоимостьТоваров.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ИсключитьНДСИзСтоимости,
		
		|	СУММА(СебестоимостьТоваров.Количество) 				КАК Количество,
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаЗатратаЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|				+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|				+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|				+ СебестоимостьТоваров.ТрудозатратыУпр
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|				+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|				+ СебестоимостьТоваров.ТрудозатратыРегл
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|				+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаЗатрата,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ПервичныеПартииВНЗП
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводства КАК ПП
		|		ПО СебестоимостьТоваров.КорПартия = ПП.Партия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбывшиеЗатратыСводно КАК Выбытие
		|		ПО СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры = Выбытие.АналитикаУчетаНоменклатуры
		|			И СебестоимостьТоваров.КорПартия = Выбытие.Партия
		|			И СебестоимостьТоваров.Период <= КОНЕЦПЕРИОДА(Выбытие.Период, МЕСЯЦ)
		|			И СебестоимостьТоваров.Организация = Выбытие.Организация
		|			И ПП.ИдентификаторУзла = Выбытие.ИдентификаторУзла
		|ГДЕ
		|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП.ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ),
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.КорПартия
		|
		|ИМЕЮЩИЕ СУММА(СебестоимостьТоваров.Количество) > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Фикс. стоимость
		|ВЫБРАТЬ
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ)	КАК Период,
		|	СебестоимостьТоваров.Организация					КАК Организация,
		|	СебестоимостьТоваров.ВидЗапасов						КАК ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий 			КАК АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Регистратор					КАК Партия,
		
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры		КАК КорАналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.Партия							КАК КорПартия,
		|	ЛОЖЬ												КАК ВключитьНДСВСтоимость,
		|	ЛОЖЬ												КАК ИсключитьНДСИзСтоимости,
		
		|	СУММА(СебестоимостьТоваров.Количество),
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаЗатратаЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|				+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|				+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|				+ СебестоимостьТоваров.ТрудозатратыУпр
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|				+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|				+ СебестоимостьТоваров.ТрудозатратыРегл
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|				+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаЗатрата,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводства КАК ПП
		|		ПО СебестоимостьТоваров.Партия = ПП.Партия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбывшиеЗатратыСводно КАК Выбытие
		|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = Выбытие.АналитикаУчетаНоменклатуры
		|			И СебестоимостьТоваров.Партия = Выбытие.Партия
		|			И СебестоимостьТоваров.Период <= КОНЕЦПЕРИОДА(Выбытие.Период, МЕСЯЦ)
		|			И СебестоимостьТоваров.Организация = Выбытие.Организация
		|			И ПП.ИдентификаторУзла = Выбытие.ИдентификаторУзла
		|ГДЕ
		|	СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
		|	И СебестоимостьТоваров.Количество < 0
		|	И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП.ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ),
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Регистратор,
		|	СебестоимостьТоваров.Партия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Услуги переработчика
		|ВЫБРАТЬ
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ)	КАК Период,
		|	СебестоимостьТоваров.Организация					КАК Организация,
		|	СебестоимостьТоваров.ВидЗапасов						КАК ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Регистратор					КАК Партия,
		
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры		КАК КорАналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.Партия							КАК КорПартия,
		|	ЛОЖЬ												КАК ВключитьНДСВСтоимость,
		|	ЛОЖЬ												КАК ИсключитьНДСИзСтоимости,
		
		|	СУММА(СебестоимостьТоваров.Количество),
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаЗатратаЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|				+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|				+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|				+ СебестоимостьТоваров.ТрудозатратыУпр
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|				+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|				+ СебестоимостьТоваров.ТрудозатратыРегл
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|				+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаЗатрата,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводства КАК ПП
		|		ПО СебестоимостьТоваров.Партия = ПП.Партия
		|	
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.Регистратор) В(
		//++ Устарело_Переработка24
		|		ТИП(Документ.ОтчетПереработчика),
		//-- Устарело_Переработка24
		|		ТИП(Документ.ОтчетПереработчика2_5))
		|	И СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
		|	И СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|	И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП.ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ),
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Регистратор,
		|	СебестоимостьТоваров.Партия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Начальные остатки
		|ВЫБРАТЬ
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ)	КАК Период,
		|	СебестоимостьТоваров.Организация					КАК Организация,
		|	СебестоимостьТоваров.ВидЗапасов						КАК ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Регистратор					КАК Партия,
		
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры		КАК КорАналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.Партия							КАК КорПартия,
		|	ЛОЖЬ												КАК ВключитьНДСВСтоимость,
		|	ЛОЖЬ												КАК ИсключитьНДСИзСтоимости,
		
		|	СУММА(СебестоимостьТоваров.Количество),
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаЗатратаЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|				+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|				+ СебестоимостьТоваров.Трудозатраты
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|				+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|				+ СебестоимостьТоваров.ТрудозатратыУпр
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|				+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|				+ СебестоимостьТоваров.ТрудозатратыРегл
		|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|				+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|				+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаЗатрата,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводства КАК ПП
		|		ПО СебестоимостьТоваров.Партия = ПП.Партия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбывшиеЗатратыСводно КАК Выбытие
		|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = Выбытие.АналитикаУчетаНоменклатуры
		|			И СебестоимостьТоваров.Партия = Выбытие.Партия
		|			И СебестоимостьТоваров.Период <= КОНЕЦПЕРИОДА(Выбытие.Период, МЕСЯЦ)
		|			И СебестоимостьТоваров.Организация = Выбытие.Организация
		|			И ПП.ИдентификаторУзла = Выбытие.ИдентификаторУзла
		|ГДЕ
		|	СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковЗатратПартийПроизводства)
		|	И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП.ИдентификаторУзла,
		|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ),
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	СебестоимостьТоваров.Регистратор,
		|	СебестоимостьТоваров.Партия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Партия
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ИтогиПоПартиямВНЗП
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПП.Период) КАК МесяцПервичнойПартииВНЗП,
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ПП.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ПП.Партия КАК Партия,
		|	ПП.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ПП.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ПП.КорПартия КАК КорПартия,
		|	ПП.Организация КАК Организация,
		|	МАКСИМУМ(ПП.ВключитьНДСВСтоимость) КАК ВключитьНДСВСтоимость,
		|	МАКСИМУМ(ПП.ИсключитьНДСИзСтоимости) КАК ИсключитьНДСИзСтоимости,
		|
		|	СУММА(ПП.Количество) КАК Количество,
		|	СУММА(ПП.Материальные) КАК Материальные,
		|	СУММА(ПП.Трудозатраты) КАК Трудозатраты,
		|	СУММА(ПП.ПостатейныеПостоянные) КАК ПостатейныеПостоянные,
		|	СУММА(ПП.ПостатейныеПеременные) КАК ПостатейныеПеременные,
		|	СУММА(ПП.ДопРасходы) КАК ДопРасходы,
		|	СУММА(ПП.СуммаЗатратаЗабалансовая) КАК СуммаЗатратаЗабалансовая,
		|	СУММА(ПП.СуммаЗатрата) КАК СуммаЗатрата,
		|	СУММА(ПП.НДД) КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(ПП.МатериальныеСНДС) КАК МатериальныеСНДС,
		|	СУММА(ПП.ТрудозатратыСНДС) КАК ТрудозатратыСНДС,
		|	СУММА(ПП.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(ПП.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
		|	СУММА(ПП.ДопРасходыСНДС) КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(ПП.МатериальныеБезНДС) КАК МатериальныеБезНДС,
		|	СУММА(ПП.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(ПП.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(ПП.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(ПП.МатериальныеУпр) КАК МатериальныеУпр,
		|	СУММА(ПП.ТрудозатратыУпр) КАК ТрудозатратыУпр,
		|	СУММА(ПП.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
		|	СУММА(ПП.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
		|	СУММА(ПП.ДопРасходыУпр) КАК ДопРасходыУпр,
		|	СУММА(ПП.СтоимостьЗабалансоваяУпр) КАК СтоимостьЗабалансоваяУпр,

		// Стоимости Регл
		|	СУММА(ПП.МатериальныеРегл) КАК МатериальныеРегл,
		|	СУММА(ПП.ТрудозатратыРегл) КАК ТрудозатратыРегл,
		|	СУММА(ПП.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
		|	СУММА(ПП.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
		|	СУММА(ПП.ДопРасходыРегл) КАК ДопРасходыРегл,
		|	СУММА(ПП.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,

		// Налоговый учет
		|	СУММА(ПП.НалоговыйУчет) КАК НалоговыйУчет,
		|	СУММА(ПП.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ПП.ВременнаяРазница) КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ИтогиПоПартиямВНЗП
		|ИЗ
		|	ПервичныеПартииВНЗП КАК ПП
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП.ИдентификаторУзла,
		|	ПП.АналитикаУчетаНоменклатуры,
		|	ПП.Партия,
		|	ПП.АналитикаУчетаПартий,
		|	ПП.КорАналитикаУчетаНоменклатуры,
		|	ПП.КорПартия,
		|	ПП.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Организация,
		|	АналитикаУчетаНоменклатуры,
		|	Партия,
		|	АналитикаУчетаПартий,
		|	КорАналитикаУчетаНоменклатуры,
		|	КорПартия
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ИдентификаторыАналитик
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АВТОНОМЕРЗАПИСИ() КАК ИдентификаторАналитик,
		|	ВыбытиеИзНЗПДляОстатка.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ВыбытиеИзНЗПДляОстатка.Организация КАК Организация,
		|	ВыбытиеИзНЗПДляОстатка.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВыбытиеИзНЗПДляОстатка.Партия КАК Партия
		|ПОМЕСТИТЬ ИдентификаторыАналитик
		|ИЗ
		|	ВыбытиеИзНЗПДляОстатка КАК ВыбытиеИзНЗПДляОстатка
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВыборкаВыбытиеИзНЗПДляОстатка
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ИдентификаторыАналитик.ИдентификаторАналитик КАК ИдентификаторАналитик,
		|	ВыбытиеИзНЗПДляОстатка.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ВыбытиеИзНЗПДляОстатка.Организация КАК Организация,
		|	ВыбытиеИзНЗПДляОстатка.Период КАК Период,
		|	ВыбытиеИзНЗПДляОстатка.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВыбытиеИзНЗПДляОстатка.Партия КАК Партия,
		|	ВыбытиеИзНЗПДляОстатка.Количество КАК Количество
		|ИЗ
		|	ВыбытиеИзНЗПДляОстатка КАК ВыбытиеИзНЗПДляОстатка  
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыАналитик КАК ИдентификаторыАналитик
		|		ПО ВыбытиеИзНЗПДляОстатка.ИдентификаторУзла = ИдентификаторыАналитик.ИдентификаторУзла
		|			И ВыбытиеИзНЗПДляОстатка.Организация = ИдентификаторыАналитик.Организация
		|			И ВыбытиеИзНЗПДляОстатка.АналитикаУчетаНоменклатуры = ИдентификаторыАналитик.АналитикаУчетаНоменклатуры
		|			И ВыбытиеИзНЗПДляОстатка.Партия = ИдентификаторыАналитик.Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВыборкаПервичныеПартииВНЗП
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ИдентификаторыАналитик.ИдентификаторАналитик КАК ИдентификаторАналитик,
		|	ПервичныеПартииВНЗП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ПервичныеПартииВНЗП.Период КАК Период,
		|	ПервичныеПартииВНЗП.Организация КАК Организация,
		|	ПервичныеПартииВНЗП.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ПервичныеПартииВНЗП.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ПервичныеПартииВНЗП.Партия КАК Партия,
		|	ПервичныеПартииВНЗП.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ПервичныеПартииВНЗП.КорПартия КАК КорПартия,
		|	ПервичныеПартииВНЗП.Количество КАК Количество
		|ИЗ
		|	ПервичныеПартииВНЗП КАК ПервичныеПартииВНЗП 
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыАналитик КАК ИдентификаторыАналитик
		|		ПО ПервичныеПартииВНЗП.ИдентификаторУзла = ИдентификаторыАналитик.ИдентификаторУзла
		|			И ПервичныеПартииВНЗП.Организация = ИдентификаторыАналитик.Организация
		|			И ПервичныеПартииВНЗП.КорАналитикаУчетаНоменклатуры = ИдентификаторыАналитик.АналитикаУчетаНоменклатуры
		|			И ПервичныеПартииВНЗП.КорПартия = ИдентификаторыАналитик.Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВыборкаРасходПартий
	ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	0 КАК ИдентификаторАналитик,
		|	ПервичныеПартииВНЗП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ПервичныеПартииВНЗП.Период КАК Период,
		|	ПервичныеПартииВНЗП.Организация КАК Организация,
		|	ПервичныеПартииВНЗП.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ПервичныеПартииВНЗП.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ПервичныеПартииВНЗП.Партия КАК Партия,
		|	ПервичныеПартииВНЗП.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ПервичныеПартииВНЗП.КорПартия КАК КорПартия,
		|	ПервичныеПартииВНЗП.Количество КАК Количество
		|ИЗ
		|	ПервичныеПартииВНЗП КАК ПервичныеПартииВНЗП
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРезультатыРазузлованияПредварительная(ВыводитьДопРасходы, ПараметрыДерева)
	
	ТекстыЗапроса = Новый Массив;
	
	#Область ТекстМатериальныеЗатраты
	
	#Область ПредварительныйРасходПартий
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Выбытие.ИдентификаторУзла			КАК ИдентификаторУзла,
		|	Выбытие.Организация					КАК Организация,
		|	Выбытие.Период						КАК Период,
		|	МАКСИМУМ(ПП.МесяцПервичнойПартииВНЗП)	КАК МесяцПервичнойПартииВНЗП,
		|	ПП.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|	ПП.АналитикаУчетаПартий				КАК АналитикаУчетаПартий,
		|	ПП.Партия							КАК Партия,
		|	Выбытие.КорАналитикаУчетаНоменклатуры	КАК КорАналитикаУчетаНоменклатуры,
		|	Выбытие.КорПартия						КАК КорПартия,
		|
		|	МАКСИМУМ(ПП.ВключитьНДСВСтоимость) КАК ВключитьНДСВСтоимость,
		|	МАКСИМУМ(ПП.ИсключитьНДСИзСтоимости) КАК ИсключитьНДСИзСтоимости,
		|
		|	СУММА(Выбытие.Количество) КАК Количество,
		|
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.Материальные КАК ЧИСЛО(23, 10))) КАК Материальные,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.Трудозатраты КАК ЧИСЛО(23, 10))) КАК Трудозатраты,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПостоянные КАК ЧИСЛО(23, 10))) КАК ПостатейныеПостоянные,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПеременные КАК ЧИСЛО(23, 10))) КАК ПостатейныеПеременные,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ДопРасходы КАК ЧИСЛО(23, 10))) КАК ДопРасходы,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.СуммаЗатратаЗабалансовая КАК ЧИСЛО(23, 10))) КАК СуммаЗатратаЗабалансовая,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.СуммаЗатрата КАК ЧИСЛО(23, 10))) КАК СуммаЗатрата,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.НДД КАК ЧИСЛО(23, 10))) КАК НДД,
		
		// Стоимости с НДС
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.МатериальныеСНДС КАК ЧИСЛО(23, 10))) КАК МатериальныеСНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ТрудозатратыСНДС КАК ЧИСЛО(23, 10))) КАК ТрудозатратыСНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(23, 10))) КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПеременныеСНДС КАК ЧИСЛО(23, 10))) КАК ПостатейныеПеременныеСНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ДопРасходыСНДС КАК ЧИСЛО(23, 10))) КАК ДопРасходыСНДС,
		
		// Стоимости без НДС
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.МатериальныеБезНДС КАК ЧИСЛО(23, 10))) КАК МатериальныеБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(23, 10))) КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(23, 10))) КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ДопРасходыБезНДС КАК ЧИСЛО(23, 10))) КАК ДопРасходыБезНДС,
		
		// Стоимости Упр
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.МатериальныеУпр КАК ЧИСЛО(23, 10))) КАК МатериальныеУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ТрудозатратыУпр КАК ЧИСЛО(23, 10))) КАК ТрудозатратыУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПостоянныеУпр КАК ЧИСЛО(23, 10))) КАК ПостатейныеПостоянныеУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПеременныеУпр КАК ЧИСЛО(23, 10))) КАК ПостатейныеПеременныеУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ДопРасходыУпр КАК ЧИСЛО(23, 10))) КАК ДопРасходыУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.СтоимостьЗабалансоваяУпр КАК ЧИСЛО(23, 10))) КАК СтоимостьЗабалансоваяУпр,
		
		// Стоимости Регл
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.МатериальныеРегл КАК ЧИСЛО(23, 10))) КАК МатериальныеРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ТрудозатратыРегл КАК ЧИСЛО(23, 10))) КАК ТрудозатратыРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПостоянныеРегл КАК ЧИСЛО(23, 10))) КАК ПостатейныеПостоянныеРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостатейныеПеременныеРегл КАК ЧИСЛО(23, 10))) КАК ПостатейныеПеременныеРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ДопРасходыРегл КАК ЧИСЛО(23, 10))) КАК ДопРасходыРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.СтоимостьЗабалансоваяРегл КАК ЧИСЛО(23, 10))) КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.НалоговыйУчет КАК ЧИСЛО(23, 10))) КАК НалоговыйУчет,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ПостояннаяРазница КАК ЧИСЛО(23, 10))) КАК ПостояннаяРазница,
		|	СУММА(
		|		ВЫРАЗИТЬ(Выбытие.Количество / ПП.Количество * ПП.ВременнаяРазница КАК ЧИСЛО(23, 10))) КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ПредварительныйРасходПартий
		|ИЗ
		|	ВыбытиеИзНЗП КАК ВыбытиеИзНЗП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходПартий КАК Выбытие
		|		ПО ВыбытиеИзНЗП.ИдентификаторУзла = Выбытие.ИдентификаторУзла
		|			И ВыбытиеИзНЗП.Организация = Выбытие.Организация
		|			И ВыбытиеИзНЗП.АналитикаУчетаНоменклатуры = Выбытие.КорАналитикаУчетаНоменклатуры
		|			И ВыбытиеИзНЗП.Партия = Выбытие.КорПартия
		|			И ВыбытиеИзНЗП.Период = Выбытие.Период
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиПоПартиямВНЗП КАК ПП
		|		ПО Выбытие.ИдентификаторУзла = ПП.ИдентификаторУзла
		|			И Выбытие.Организация = ПП.Организация
		|			И Выбытие.АналитикаУчетаНоменклатуры = ПП.АналитикаУчетаНоменклатуры
		|			И Выбытие.Партия = ПП.Партия
		|			И Выбытие.АналитикаУчетаПартий = ПП.АналитикаУчетаПартий
		|			И Выбытие.КорАналитикаУчетаНоменклатуры = ПП.КорАналитикаУчетаНоменклатуры
		|			И Выбытие.КорПартия = ПП.КорПартия
		|
		|СГРУППИРОВАТЬ ПО
		|	Выбытие.ИдентификаторУзла,
		|	Выбытие.Организация,
		|	Выбытие.Период,
		|	Выбытие.КорАналитикаУчетаНоменклатуры,
		|	Выбытие.КорПартия,
		|	ПП.АналитикаУчетаПартий,
		|	ПП.АналитикаУчетаНоменклатуры,
		|	ПП.Партия
		|
		|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
		|(
		|	(ИдентификаторУзла, КорАналитикаУчетаНоменклатуры, КорПартия, АналитикаУчетаНоменклатуры,
		|		АналитикаУчетаПартий, Партия, Организация, Период),
		|	(ИдентификаторУзла, КорПартия, Организация, АналитикаУчетаНоменклатуры, АналитикаУчетаПартий, Партия),
		|	(ИдентификаторУзла, Партия)
		|)
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПервичныеПартииСводно
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|	Т.Организация КАК Организация,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.Партия КАК Партия
		|ПОМЕСТИТЬ ПервичныеПартииСводно
		|ИЗ
		|	ПредварительныйРасходПартий КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Партия
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область ПартииПолуфабрикатов
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ВЫБОР КОГДА &ДанныеПоСебестоимости < 3
		|		ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ СебестоимостьТоваров.Организация
		|	КОНЕЦ КАК Организация,
		|	ПП.Партия КАК Партия,
		|	ПП.АналитикаУчетаПартий,
		|	ПП.АналитикаУчетаНоменклатуры
		|ПОМЕСТИТЬ ПартииПолуфабрикатов
		|ИЗ
		|	ПервичныеПартииСводно КАК ПП
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ПО СебестоимостьТоваров.Регистратор = ПП.Партия
		|		И СебестоимостьТоваров.АналитикаУчетаПартий = ПП.АналитикаУчетаПартий
		|		И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		// Добавляем филиалы головной организации, филиалы с одной и той же головной организацией, и головную организацию филиала.
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВзаимосвязанныеОрганизации КАК ВТВзаимосвязанныеОрганизации
		|		ПО СебестоимостьТоваров.Организация = ВТВзаимосвязанныеОрганизации.Организация1
		|			И ПП.Организация = ВТВзаимосвязанныеОрганизации.Организация2
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
		|		ПО СебестоимостьТоваров.АналитикаУчетаПартий = АналитикиУчетаПартий.КлючАналитики
		|
		|ГДЕ
		|	СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И СебестоимостьТоваров.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|													ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
		|													ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
		|													ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами),
		|													ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуМеждуОрганизациями))
		|	И НЕ АналитикиУчетаПартий.КодСтроки = 0
		|	И (СебестоимостьТоваров.Организация = ПП.Организация
		|		ИЛИ ВТВзаимосвязанныеОрганизации.Организация1 ЕСТЬ НЕ NULL)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	Партия
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВключениеИсключениеНДСВСтоимости
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ПП.ИдентификаторУзла КАК ИдентификаторУзла,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.Партия КАК Партия,
		|	ВЫБОР КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ
		|	*
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|		КОГДА &ДанныеПоСебестоимости = 4
		|			ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|	КОНЕЦ КАК Стоимость
		|ПОМЕСТИТЬ ВТВключениеИсключениеНДСВСтоимости
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбытиеИзНЗП КАК ПП
		|		ПО &ДанныеПоСебестоимости > 2
		|			И СебестоимостьТоваров.АналитикаУчетаНоменклатуры = ПП.АналитикаУчетаНоменклатуры
		|			И СебестоимостьТоваров.Партия = ПП.Партия
		|			И (СебестоимостьТоваров.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИСключениеНДСВСтоимости))
		|			И (СебестоимостьТоваров.Период <= &ДатаОкончания
		|				ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторУзла,
		|	АналитикаУчетаНоменклатуры,
		|	Партия
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ВТВыпущеннаяПродукцияАналитикиДляОтборов
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыпущеннаяПродукция.Организация КАК Организация,
		|	ВыпущеннаяПродукция.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
		|	ВыпущеннаяПродукция.ПартияПродукции КАК ПартияПродукции,
		|	ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции
		|ПОМЕСТИТЬ ВТВыпущеннаяПродукцияАналитикиДляОтборов
		|ИЗ
		|	ВыпущеннаяПродукция КАК ВыпущеннаяПродукция
		|		
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПродукции,
		|	ПартияПродукции,
		|	АналитикаУчетаПартийПродукции,
		|	Организация	
		|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#КонецОбласти
	
	#Область ВТПрочиеРасходыНезавершенногоПроизводства
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеРасходыНЗП.Организация КАК Организация,
		|	ПрочиеРасходыНЗП.Регистратор КАК Регистратор,
		|	ПрочиеРасходыНЗП.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	ПрочиеРасходыНЗП.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
		|	ПрочиеРасходыНЗП.СтатьяРасходов КАК СтатьяРасходов,
		|	ПрочиеРасходыНЗП.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	ПрочиеРасходыНЗП.Подразделение КАК Подразделение,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
		|				ТОГДА 0
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПрочиеРасходыНЗП.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьРегл
		|		КОНЕЦ) КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|				ТОГДА 0
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПрочиеРасходыНЗП.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьРегл
		|		КОНЕЦ) КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПрочиеРасходыНЗП.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьРегл
		|		КОНЕЦ) КАК СуммаЗатрата,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА ПрочиеРасходыНЗП.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДД,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.Стоимость
		|		КОНЕЦ) КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.Стоимость
		|		КОНЕЦ) КАК ПостатейныеПеременныеСНДС,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.СтоимостьБезНДС
		|		КОНЕЦ) КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.СтоимостьБезНДС
		|		КОНЕЦ) КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.СтоимостьУпр
		|		КОНЕЦ) КАК ПостатейныеПостоянныеУпр,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.СтоимостьУпр
		|		КОНЕЦ) КАК ПостатейныеПеременныеУпр,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.СтоимостьРегл
		|		КОНЕЦ) КАК ПостатейныеПостоянныеРегл,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|				ТОГДА 0
		|			ИНАЧЕ ПрочиеРасходыНЗП.СтоимостьРегл
		|		КОНЕЦ) КАК ПостатейныеПеременныеРегл,
		|	СУММА(ПрочиеРасходыНЗП.СтоимостьРегл - ПрочиеРасходыНЗП.ПостояннаяРазница - ПрочиеРасходыНЗП.ВременнаяРазница) КАК НалоговыйУчет,
		|	СУММА(ПрочиеРасходыНЗП.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ПрочиеРасходыНЗП.ВременнаяРазница) КАК ВременнаяРазница
		|ПОМЕСТИТЬ ВТПрочиеРасходыНезавершенногоПроизводства
		|ИЗ
		|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|		ПО (ПрочиеРасходыНЗП.СтатьяРасходов = СтатьиРасходов.Ссылка)
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				ВТВыпущеннаяПродукцияАналитикиДляОтборов КАК Т
		|			ГДЕ
		|				Т.АналитикаУчетаПродукции = ПрочиеРасходыНЗП.АналитикаУчетаПродукции
		|				И Т.ПартияПродукции = ПрочиеРасходыНЗП.Регистратор
		|				И Т.АналитикаУчетаПартийПродукции = ПрочиеРасходыНЗП.КорАналитикаУчетаПартий
		|				И Т.Организация = ПрочиеРасходыНЗП.Организация)
		|	И НЕ ПрочиеРасходыНЗП.Сторно
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеРасходыНЗП.Организация,
		|	ПрочиеРасходыНЗП.СтатьяРасходов,
		|	ПрочиеРасходыНЗП.СтатьяКалькуляции,
		|	ПрочиеРасходыНЗП.АналитикаУчетаПродукции,
		|	ПрочиеРасходыНЗП.Регистратор,
		|	ПрочиеРасходыНЗП.КорАналитикаУчетаПартий,
		|	ПрочиеРасходыНЗП.Подразделение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПродукции,
		|	Регистратор,
		|	КорАналитикаУчетаПартий,
		|	Организация
		|";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ВТТрудозатратыНезавершенногоПроизводства
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТрудозатратыНЗП.Организация						КАК Организация,
		|	ТрудозатратыНЗП.Регистратор						КАК Регистратор,
		|	ТрудозатратыНЗП.КорАналитикаУчетаПартий			КАК КорАналитикаУчетаПартий,
		|	ТрудозатратыНЗП.КорАналитикаУчетаПродукции		КАК КорАналитикаУчетаПродукции,
		|	ТрудозатратыНЗП.ВидРабот						КАК ВидРабот,
		|	ТрудозатратыНЗП.СтатьяКалькуляции				КАК СтатьяКалькуляции,
		|	ТрудозатратыНЗП.Подразделение					КАК Подразделение,
		|	СУММА(ТрудозатратыНЗП.Количество) КАК Количество,
		|
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	СУММА(ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 1
		|			ТОГДА ТрудозатратыНЗП.Стоимость
		|		КОГДА &ДанныеПоСебестоимости = 2
		|			ТОГДА ТрудозатратыНЗП.Стоимость
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ТрудозатратыНЗП.Стоимость
		|		КОГДА &ДанныеПоСебестоимости = 4
		|			ТОГДА ТрудозатратыНЗП.СтоимостьРегл
		|	КОНЕЦ) КАК Стоимость,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА ТрудозатратыНЗП.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьНДД,
		|
		// Стоимости Регл
		|	СУММА(ТрудозатратыНЗП.СтоимостьРегл) КАК СтоимостьРегл,
		|
		// Налоговый учет
		|	СУММА(ТрудозатратыНЗП.СтоимостьРегл
		|		- ТрудозатратыНЗП.ПостояннаяРазница
		|		- ТрудозатратыНЗП.ВременнаяРазница) КАК НалоговыйУчет,
		|	СУММА(ТрудозатратыНЗП.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ТрудозатратыНЗП.ВременнаяРазница) КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ВТТрудозатратыНезавершенногоПроизводства
		|
		|ИЗ
		|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНЗП
		|ГДЕ
		|	ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
		|		ИЗ ВТВыпущеннаяПродукцияАналитикиДляОтборов КАК Т
		|		ГДЕ Т.Организация = ТрудозатратыНЗП.Организация
		|			И Т.ПартияПродукции = ТрудозатратыНЗП.Регистратор
		|			И Т.АналитикаУчетаПартийПродукции = ТрудозатратыНЗП.КорАналитикаУчетаПартий
		|			И Т.АналитикаУчетаПродукции = ТрудозатратыНЗП.КорАналитикаУчетаПродукции
		|	)
		|	И НЕ ТрудозатратыНЗП.Сторно
		|
		|СГРУППИРОВАТЬ ПО
		|	ТрудозатратыНЗП.Организация,
		|	ТрудозатратыНЗП.ВидРабот,
		|	ТрудозатратыНЗП.СтатьяКалькуляции,
		|	ТрудозатратыНЗП.КорАналитикаУчетаПродукции,
		|	ТрудозатратыНЗП.Регистратор,
		|	ТрудозатратыНЗП.КорАналитикаУчетаПартий,
		|	ТрудозатратыНЗП.Подразделение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	КорАналитикаУчетаПродукции,
		|	КорАналитикаУчетаПартий,
		|	Организация
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	ТекстыЗапросаОбъединение = Новый Массив;
	
	#Область ТекстМатериальныеЗатратыОбъединение

	ТекстМатериальныеЗатратыОбъединение = "
		|ВЫБРАТЬ
		|	НЗППоПродукции.ИдентификаторУзла КАК ИдентификаторУзла,
		|	НЗППоПродукции.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	НЗППоПродукции.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	НЗППоПродукции.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	НЗППоПродукции.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	НЗППоПродукции.ДатаИсходнойПартии КАК ДатаИсходнойПартии,
		|	НЗППоПродукции.РазворачиватьДопРасходы КАК РазворачиватьДопРасходы,
		|	НЗППоПродукции.ТребуетсяРазузлованиеУзлаИсточника КАК ТребуетсяРазузлованиеУзлаИсточника,
		|
		|	ПартииМатериалов.МесяцПервичнойПартииВНЗП			КАК МесяцПервичнойПартииВНЗП,
		|
		|	НЗППоПродукции.Организация							КАК Организация,
		|	НЗППоПродукции.ПартияПродукции						КАК ПартияВыходноеИзделие,
		|	НЗППоПродукции.АналитикаУчетаПартийПродукции		КАК АналитикаУчетаПартийВыходноеИзделие,
		|	НЗППоПродукции.АналитикаУчетаЗатрат					КАК АналитикаУчетаВыходноеИзделие,
		|	ПартииМатериалов.Партия								КАК ПартияЗатрата,
		|	ПартииМатериалов.АналитикаУчетаПартий				КАК АналитикаУчетаПартийЗатрата,
		|	ПартииМатериалов.ВключитьНДСВСтоимость				КАК ВключитьНДСВСтоимость,
		|	ПартииМатериалов.ИсключитьНДСИзСтоимости			КАК ИсключитьНДСИзСтоимости,
		|	ПартииМатериалов.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаЗатрата,
		|	АналитикаЗатрат.Номенклатура						КАК Затрата,
		|	АналитикаЗатрат.Номенклатура.ЕдиницаИзмерения 		КАК ЕдиницаИзмеренияЗатрата,
		|	АналитикаЗатрат.Характеристика						КАК ХарактеристикаЗатрата,
		|	АналитикаЗатрат.Серия								КАК СерияЗатрата,
		|	АналитикаЗатрат.Назначение							КАК НазначениеЗатрата,
		|	АналитикаЗатрат.СтатьяКалькуляции					КАК СтатьяКалькуляции,
		|	АналитикаЗатрат.МестоХранения                       КАК Подразделение,
		|	(ВЫБОР
		|		КОГДА НЗППоПродукции.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
		|			ТОГДА ЛОЖЬ
		// Для возвратных отходов разузлования не требуется. 
		|		КОГДА АналитикаЗатрат.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
		|			ТОГДА ЛОЖЬ
		//++ НЕ УТКА
		
		// Разузловывать затраты переработчика, если отчет формируется в валюте регл./упр. учета, по давальцу, не нужно
		|		КОГДА &ДанныеПоСебестоимости > 3
		|			И НЗППоПродукции.Организация = ВЫРАЗИТЬ(ПартииМатериалов.Партия КАК Документ.ОтчетДавальцуМеждуОрганизациями).Давалец
		|				ТОГДА ЛОЖЬ
		//-- НЕ УТКА
		|		КОГДА ПартииПолуфабрикатов.Партия ЕСТЬ НЕ NULL
		|				И (ПартииПолуфабрикатов.Организация = НЗППоПродукции.Организация
		//						Добавляем филиалы головной организации, филиалы с одной и той же головной организацией, и головную организацию филиала.
		|						ИЛИ ВТВзаимосвязанныеОрганизации.Организация1 ЕСТЬ НЕ NULL
		|						ИЛИ &ДанныеПоСебестоимости < 3)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) 								КАК ТребуетсяРазузлование,
		|	(ВЫБОР
		|		КОГДА НЗППоПродукции.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
		|			ТОГДА ЛОЖЬ
		//++ НЕ УТКА
		
		// Разузловывать затраты переработчика, если отчет формируется в валюте регл./упр. учета, по давальцу, не нужно
		|		КОГДА &ДанныеПоСебестоимости > 3
		|			И НЗППоПродукции.Организация = ВЫРАЗИТЬ(ПартииМатериалов.Партия КАК Документ.ОтчетДавальцуМеждуОрганизациями).Давалец
		|				ТОГДА ЛОЖЬ
		//-- НЕ УТКА
		|		КОГДА НЗППоПродукции.РазворачиватьДопРасходы
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) 								КАК ТребуетсяРазузлованиеДопРасходов,
		|	&ТипЗатратМатериальные								КАК ТипЗатрат,
		|	ПартииМатериалов.Количество
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК КоличествоЗатрата,
		|
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	ПартииМатериалов.Материальные
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК Материальные,
		|	ПартииМатериалов.Трудозатраты
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК Трудозатраты,
		|	ПартииМатериалов.ПостатейныеПостоянные
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянные,
		|	ПартииМатериалов.ПостатейныеПеременные
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременные,
		|	ПартииМатериалов.ДопРасходы
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходы,
		|	ПартииМатериалов.СуммаЗатратаЗабалансовая
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СуммаЗатратаЗабалансовая,
		|	ПартииМатериалов.СуммаЗатрата
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СуммаЗатрата,
		|	ПартииМатериалов.НДД
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК НДД,
		|
		// Стоимости с НДС
		|	ПартииМатериалов.МатериальныеСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеСНДС,
		|	ПартииМатериалов.ТрудозатратыСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыСНДС,
		|	ПартииМатериалов.ПостатейныеПостоянныеСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеСНДС,
		|	ПартииМатериалов.ПостатейныеПеременныеСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеСНДС,
		|	ПартииМатериалов.ДопРасходыСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	ПартииМатериалов.МатериальныеБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеБезНДС,
		|	ПартииМатериалов.ПостатейныеПостоянныеБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеБезНДС,
		|	ПартииМатериалов.ПостатейныеПеременныеБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеБезНДС,
		|	ПартииМатериалов.ДопРасходыБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	ПартииМатериалов.МатериальныеУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеУпр,
		|	ПартииМатериалов.ТрудозатратыУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10))	КАК ТрудозатратыУпр,
		|	ПартииМатериалов.ПостатейныеПостоянныеУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеУпр,
		|	ПартииМатериалов.ПостатейныеПеременныеУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель	/ НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеУпр,
		|	ПартииМатериалов.ДопРасходыУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыУпр,
		|	ПартииМатериалов.СтоимостьЗабалансоваяУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель  КАК ЧИСЛО(31,10)) КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	ПартииМатериалов.МатериальныеРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеРегл,
		|	ПартииМатериалов.ТрудозатратыРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыРегл,
		|	ПартииМатериалов.ПостатейныеПостоянныеРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеРегл,
		|	ПартииМатериалов.ПостатейныеПеременныеРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеРегл,
		|	ПартииМатериалов.ДопРасходыРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыРегл,
		|	ПартииМатериалов.СтоимостьЗабалансоваяРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	ПартииМатериалов.НалоговыйУчет
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК НалоговыйУчет,
		|	ПартииМатериалов.ПостояннаяРазница
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостояннаяРазница,
		|	ПартииМатериалов.ВременнаяРазница
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31,10))
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ВременнаяРазница,
		|
		// Включение исключение НДС в стоимости
		|	ВЫБОР
		|		КОГДА ВТВключениеИсключениеНДСВСтоимости.Стоимость ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВТВключениеИсключениеНДСВСтоимости.Стоимость * (ВЫРАЗИТЬ(НЗППоПродукции.Количество / ВыбытиеСводно.Количество КАК ЧИСЛО(31, 10))) * (ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31, 10)))
		|	КОНЕЦ КАК ВключениеИсключениеНДСВСтоимости
		|ПОМЕСТИТЬ РезультатыРазузлованияПредварительная
		|ИЗ
		|	ВыбытиеИзНЗППоПродукции КАК НЗППоПродукции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредварительныйРасходПартий КАК ПартииМатериалов
		|		ПО НЗППоПродукции.Период = ПартииМатериалов.Период
		|			И НЗППоПродукции.АналитикаУчетаНоменклатуры = ПартииМатериалов.КорАналитикаУчетаНоменклатуры
		|			И НЗППоПродукции.Партия = ПартииМатериалов.КорПартия
		|			И НЗППоПродукции.ИдентификаторУзла = ПартииМатериалов.ИдентификаторУзла
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаЗатрат
		|		ПО НЗППоПродукции.АналитикаУчетаНоменклатуры = АналитикаЗатрат.КлючАналитики
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбытиеИзНЗП КАК ВыбытиеСводно
		|		ПО НЗППоПродукции.Период = ВыбытиеСводно.Период
		|			И НЗППоПродукции.АналитикаУчетаНоменклатуры = ВыбытиеСводно.АналитикаУчетаНоменклатуры
		|			И НЗППоПродукции.Партия = ВыбытиеСводно.Партия
		|			И НЗППоПродукции.ИдентификаторУзла = ВыбытиеСводно.ИдентификаторУзла
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПартииПолуфабрикатов КАК ПартииПолуфабрикатов
		|		ПО ПартииМатериалов.Партия = ПартииПолуфабрикатов.Партия
		|			И ПартииМатериалов.АналитикаУчетаПартий = ПартииПолуфабрикатов.АналитикаУчетаПартий
		|			И ПартииМатериалов.АналитикаУчетаНоменклатуры = ПартииПолуфабрикатов.АналитикаУчетаНоменклатуры
		|			И (НЕ НЗППоПродукции.ПартияПродукции = ПартииПолуфабрикатов.Партия
		|				ИЛИ НЕ НЗППоПродукции.АналитикаУчетаПартийПродукции = ПартииПолуфабрикатов.АналитикаУчетаПартий
		|				ИЛИ НЕ НЗППоПродукции.АналитикаУчетаПродукции = ПартииПолуфабрикатов.АналитикаУчетаНоменклатуры)
		|			И НЗППоПродукции.ИдентификаторУзла = ПартииПолуфабрикатов.ИдентификаторУзла
		|
		// Добавляем филиалы головной организации, филиалы с одной и той же головной организацией, и головную организацию филиала.
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВзаимосвязанныеОрганизации КАК ВТВзаимосвязанныеОрганизации
		|		ПО ПартииПолуфабрикатов.Организация = ВТВзаимосвязанныеОрганизации.Организация1
		|			И НЗППоПродукции.Организация = ВТВзаимосвязанныеОрганизации.Организация2
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВключениеИсключениеНДСВСтоимости КАК ВТВключениеИсключениеНДСВСтоимости
		|		ПО НЗППоПродукции.АналитикаУчетаНоменклатуры = ВТВключениеИсключениеНДСВСтоимости.АналитикаУчетаНоменклатуры
		|			И НЗППоПродукции.Партия = ВТВключениеИсключениеНДСВСтоимости.Партия
		|			И НЗППоПродукции.ИдентификаторУзла = ВТВключениеИсключениеНДСВСтоимости.ИдентификаторУзла
		|";
	
	ТекстыЗапросаОбъединение.Добавить(ТекстМатериальныеЗатратыОбъединение);
	#КонецОбласти	
	
	#Область ТекстМатериалыНачальныеОстаткиНЗПОбъединение
	ТекстМатериалыНачальныеОстаткиНЗПОбъединение = "
		|ВЫБРАТЬ
		|	НЗППоПродукции.ИдентификаторУзла КАК ИдентификаторУзла,
		|	НЗППоПродукции.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	НЗППоПродукции.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	НЗППоПродукции.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	НЗППоПродукции.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	НЗППоПродукции.ДатаИсходнойПартии КАК ДатаИсходнойПартии,
		|	НЗППоПродукции.РазворачиватьДопРасходы КАК РазворачиватьДопРасходы,
		|	НЗППоПродукции.ТребуетсяРазузлованиеУзлаИсточника КАК ТребуетсяРазузлованиеУзлаИсточника,
		|
		|	ДАТАВРЕМЯ(1, 1, 1)									КАК МесяцПервичнойПартииВНЗП,
		|
		|	НЗППоПродукции.Организация							КАК Организация,
		|	НЗППоПродукции.ПартияПродукции						КАК ПартияВыходноеИзделие,
		|	НЗППоПродукции.АналитикаУчетаПартийПродукции		КАК АналитикаУчетаПартийВыходноеИзделие,
		|	НЗППоПродукции.АналитикаУчетаЗатрат					КАК АналитикаУчетаВыходноеИзделие,
		|	НЗППоПродукции.Партия								КАК ПартияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартийЗатрата,
		|	ЛОЖЬ												КАК ВключитьНДСВСтоимость,
		|	ЛОЖЬ												КАК ИсключитьНДСИзСтоимости,
		|	НЗППоПродукции.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаЗатрата,
		|	АналитикаЗатрат.Номенклатура						КАК Затрата,
		|	АналитикаЗатрат.Номенклатура.ЕдиницаИзмерения 		КАК ЕдиницаИзмеренияЗатрата,
		|	АналитикаЗатрат.Характеристика						КАК ХарактеристикаЗатрата,
		|	АналитикаЗатрат.Серия								КАК СерияЗатрата,
		|	АналитикаЗатрат.Назначение							КАК НазначениеЗатрата,
		|	АналитикаЗатрат.СтатьяКалькуляции					КАК СтатьяКалькуляции,
		|	АналитикаЗатрат.МестоХранения                       КАК Подразделение,
		|	ЛОЖЬ												КАК ТребуетсяРазузлование,
		|	ЛОЖЬ												КАК ТребуетсяРазузлованиеДопРасходов,
		|	&ТипЗатратМатериальные								КАК ТипЗатрат,
		|	НЗППоПродукции.Количество
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК КоличествоЗатрата,
		|
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	НЗППоПродукции.Материальные
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК Материальные,
		|	НЗППоПродукции.Трудозатраты
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК Трудозатраты,
		|	НЗППоПродукции.ПостатейныеПостоянные
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянные,
		|	НЗППоПродукции.ПостатейныеПеременные
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременные,
		|	НЗППоПродукции.ДопРасходы
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходы,
		|	НЗППоПродукции.СуммаЗатратаЗабалансовая
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СуммаЗатратаЗабалансовая,
		|	НЗППоПродукции.СуммаЗатрата
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СуммаЗатрата,
		|	НЗППоПродукции.НДД
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК НДД,
		|
		// Стоимости с НДС
		|	НЗППоПродукции.МатериальныеСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеСНДС,
		|	НЗППоПродукции.ТрудозатратыСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыСНДС,
		|	НЗППоПродукции.ПостатейныеПостоянныеСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеСНДС,
		|	НЗППоПродукции.ПостатейныеПеременныеСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеСНДС,
		|	НЗППоПродукции.ДопРасходыСНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	НЗППоПродукции.МатериальныеБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеБезНДС,
		|	НЗППоПродукции.ПостатейныеПостоянныеБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеБезНДС,
		|	НЗППоПродукции.ПостатейныеПеременныеБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеБезНДС,
		|	НЗППоПродукции.ДопРасходыБезНДС
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	НЗППоПродукции.МатериальныеУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеУпр,
		|	НЗППоПродукции.ТрудозатратыУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыУпр,
		|	НЗППоПродукции.ПостатейныеПостоянныеУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель	/ НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеУпр,
		|	НЗППоПродукции.ПостатейныеПеременныеУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеУпр,
		|	НЗППоПродукции.ДопРасходыУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель	/ НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыУпр,
		|	НЗППоПродукции.СтоимостьЗабалансоваяУпр
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	НЗППоПродукции.МатериальныеРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК МатериальныеРегл,
		|	НЗППоПродукции.ТрудозатратыРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыРегл,
		|	НЗППоПродукции.ПостатейныеПостоянныеРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеРегл,
		|	НЗППоПродукции.ПостатейныеПеременныеРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеРегл,
		|	НЗППоПродукции.ДопРасходыРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ДопРасходыРегл,
		|	НЗППоПродукции.СтоимостьЗабалансоваяРегл
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	НЗППоПродукции.НалоговыйУчет
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК НалоговыйУчет,
		|	НЗППоПродукции.ПостояннаяРазница
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостояннаяРазница,
		|	НЗППоПродукции.ВременнаяРазница
		|		* ВЫРАЗИТЬ(НЗППоПродукции.Числитель / НЗППоПродукции.Знаменатель КАК ЧИСЛО(31,10)) КАК ВременнаяРазница,
		|
		// Включение исключение НДС в стоимости
		|	0 КАК ВключениеИсключениеНДСВСтоимости
		|
		|ИЗ
		|	ВыбытиеИзНЗППоПродукции КАК НЗППоПродукции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительныйРасходПартий КАК ПартииМатериалов
		|	    ПО НЗППоПродукции.Период = ПартииМатериалов.Период
		|			И НЗППоПродукции.АналитикаУчетаНоменклатуры = ПартииМатериалов.КорАналитикаУчетаНоменклатуры
		|			И НЗППоПродукции.Партия = ПартииМатериалов.КорПартия
		|			И НЗППоПродукции.ИдентификаторУзла = ПартииМатериалов.ИдентификаторУзла
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаЗатрат
		|		ПО НЗППоПродукции.АналитикаУчетаНоменклатуры = АналитикаЗатрат.КлючАналитики
		|ГДЕ
		|	ПартииМатериалов.Партия ЕСТЬ NULL
		|";
	
	ТекстыЗапросаОбъединение.Добавить(ТекстМатериалыНачальныеОстаткиНЗПОбъединение);
	
	#КонецОбласти
	
	#Область ТекстТрудозатратыОбъединение
	ТекстТрудозатратыОбъединение = "
		|ВЫБРАТЬ
		|	ВыпущеннаяПродукция.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ВыпущеннаяПродукция.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	ВыпущеннаяПродукция.ДатаИсходнойПартии КАК ДатаИсходнойПартии,
		|	ВыпущеннаяПродукция.РазворачиватьДопРасходы КАК РазворачиватьДопРасходы,
		|	ВыпущеннаяПродукция.ТребуетсяРазузлованиеУзлаИсточника КАК ТребуетсяРазузлованиеУзлаИсточника,
		|
		|	ДАТАВРЕМЯ(1, 1, 1)								КАК МесяцПервичнойПартииВНЗП,
		|
		|	ТрудозатратыНЗП.Организация						КАК Организация,
		|	ТрудозатратыНЗП.Регистратор						КАК ПартияВыходноеИзделие,
		|	ТрудозатратыНЗП.КорАналитикаУчетаПартий			КАК АналитикаУчетаПартийВыходноеИзделие,
		|	ВыпущеннаяПродукция.АналитикаУчетаЗатрат		КАК АналитикаУчетаВыходноеИзделие,
		|	НЕОПРЕДЕЛЕНО									КАК ПартияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартийЗатрата,
		|	ЛОЖЬ											КАК ВключитьНДСВСтоимость,
		|	ЛОЖЬ											КАК ИсключитьНДСИзСтоимости,
		|	ТрудозатратыНЗП.ВидРабот						КАК АналитикаЗатрата,
		|	ТрудозатратыНЗП.ВидРабот						КАК Затрата,
		|	СпрВидыРабот.ЕдиницаИзмерения					КАК ЕдиницаИзмеренияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеЗатрата,
		|	ТрудозатратыНЗП.СтатьяКалькуляции				КАК СтатьяКалькуляции,
		|	ТрудозатратыНЗП.Подразделение					КАК Подразделение,
		|	ЛОЖЬ											КАК ТребуетсяРазузлование,
		|	ЛОЖЬ											КАК ТребуетсяРазузлованиеДопРасходов,
		|	&ТипЗатратТрудозатраты							КАК ТипЗатрат,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.Количество 
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК КоличествоЗатрата,
		|
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	0												КАК Материальные,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.Стоимость 
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК Трудозатраты,
		|	0												КАК ПостатейныеПостоянные,
		|	0												КАК ПостатейныеПеременные,
		|	0												КАК ДопРасходы,
		|	0												КАК СуммаЗатратаЗабалансовая,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.Стоимость
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК СуммаЗатрата,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.СтоимостьНДД 
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК НДД,
		|
		// Стоимости с НДС
		|	0												КАК МатериальныеСНДС,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.Стоимость
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыСНДС,
		|	0												КАК ПостатейныеПостоянныеСНДС,
		|	0												КАК ПостатейныеПеременныеСНДС,
		|	0												КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	0												КАК МатериальныеБезНДС,
		|	0												КАК ПостатейныеПостоянныеБезНДС,
		|	0												КАК ПостатейныеПеременныеБезНДС,
		|	0												КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	0												КАК МатериальныеУпр,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.Стоимость
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыУпр,
		|	0												КАК ПостатейныеПостоянныеУпр,
		|	0												КАК ПостатейныеПеременныеУпр,
		|	0												КАК ДопРасходыУпр,
		|	0												КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	0												КАК МатериальныеРегл,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.СтоимостьРегл
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК ТрудозатратыРегл,
		|	0												КАК ПостатейныеПостоянныеРегл,
		|	0												КАК ПостатейныеПеременныеРегл,
		|	0												КАК ДопРасходыРегл,
		|	0												КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.НалоговыйУчет 
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК НалоговыйУчет,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.ПостояннаяРазница
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(ТрудозатратыНЗП.ВременнаяРазница
		|		* ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель КАК ЧИСЛО(31,10)) КАК ВременнаяРазница,
		|		
		// Включение исключение НДС в стоимости
		|	0 КАК ВключениеИсключениеНДСВСтоимости
		|
		|ИЗ
		|	ВыпущеннаяПродукция КАК ВыпущеннаяПродукция
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНЗП
		|		ПО ТрудозатратыНЗП.Организация = ВыпущеннаяПродукция.Организация
		|			И ВыпущеннаяПродукция.ПартияПродукции = ТрудозатратыНЗП.Регистратор
		|			И ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции = ТрудозатратыНЗП.КорАналитикаУчетаПартий
		|			И ВыпущеннаяПродукция.АналитикаУчетаПродукции = ТрудозатратыНЗП.КорАналитикаУчетаПродукции

		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРаботСотрудников КАК СпрВидыРабот
		|		ПО СпрВидыРабот.Ссылка = ТрудозатратыНЗП.ВидРабот
		|
		|";
	
	ТекстыЗапросаОбъединение.Добавить(ТекстТрудозатратыОбъединение);
	
	#КонецОбласти
	
	#Область ТекстПрочиеРасходыОбъединение
	ТекстПрочиеРасходыОбъединение = "
		|ВЫБРАТЬ
		|	ВыпущеннаяПродукция.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ВыпущеннаяПродукция.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	МАКСИМУМ(ВыпущеннаяПродукция.ДатаИсходнойПартии) КАК ДатаИсходнойПартии,
		|	МАКСИМУМ(ВыпущеннаяПродукция.РазворачиватьДопРасходы) КАК РазворачиватьДопРасходы,
		|	МАКСИМУМ(ВыпущеннаяПродукция.ТребуетсяРазузлованиеУзлаИсточника) КАК ТребуетсяРазузлованиеУзлаИсточника,
		|
		|	ДАТАВРЕМЯ(1, 1, 1)							КАК МесяцПервичнойПартииВНЗП,
		|
		|	ПрочиеРасходыНЗП.Организация				КАК Организация,
		|	ПрочиеРасходыНЗП.Регистратор				КАК ПартияВыходноеИзделие,
		|	ПрочиеРасходыНЗП.КорАналитикаУчетаПартий	КАК АналитикаУчетаПартийВыходноеИзделие,
		|	ВыпущеннаяПродукция.АналитикаУчетаЗатрат	КАК АналитикаУчетаВыходноеИзделие,
		|	НЕОПРЕДЕЛЕНО								КАК ПартияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартийЗатрата,
		|	ЛОЖЬ										КАК ВключитьНДСВСтоимость,
		|	ЛОЖЬ										КАК ИсключитьНДСИзСтоимости,
		|	ПрочиеРасходыНЗП.СтатьяРасходов				КАК АналитикаЗатрата,
		|	ПрочиеРасходыНЗП.СтатьяРасходов				КАК Затрата,
		|	НЕОПРЕДЕЛЕНО								КАК ЕдиницаИзмеренияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияЗатрата,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеЗатрата,
		|	ПрочиеРасходыНЗП.СтатьяКалькуляции			КАК СтатьяКалькуляции,
		|	ПрочиеРасходыНЗП.Подразделение				КАК Подразделение,
		|	ЛОЖЬ										КАК ТребуетсяРазузлование,
		|	ЛОЖЬ										КАК ТребуетсяРазузлованиеДопРасходов,
		|	&ТипЗатратПостатейные						КАК ТипЗатрат,
		|	0											КАК КоличествоЗатрата,
		|
		// Стоимости согласно параметру ""ДанныеПоСебестоимости""
		|	0											КАК Материальные,
		|	0											КАК Трудозатраты,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПостоянные * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянные,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПеременные * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременные,
		|	0											КАК ДопРасходы,
		|	0											КАК СуммаЗатратаЗабалансовая,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.СуммаЗатрата * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК СуммаЗатрата,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.НДД * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК НДД,
		|
		// Стоимости с НДС
		|	0											КАК МатериальныеСНДС,
		|	0											КАК ТрудозатратыСНДС,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПостоянныеСНДС * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеСНДС,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПеременныеСНДС * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеСНДС,
		|	0											КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	0											КАК МатериальныеБезНДС,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПостоянныеБезНДС * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеБезНДС,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПеременныеБезНДС * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеБезНДС,
		|	0											КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	0											КАК МатериальныеУпр,
		|	0											КАК ТрудозатратыУпр,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПостоянныеУпр * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеУпр,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПеременныеУпр * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеУпр,
		|	0											КАК ДопРасходыУпр,
		|	0											КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	0											КАК МатериальныеРегл,
		|	0											КАК ТрудозатратыРегл,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПостоянныеРегл * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПостоянныеРегл,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостатейныеПеременныеРегл * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостатейныеПеременныеРегл,
		|	0											КАК ДопРасходыРегл,
		|	0											КАК СтоимостьЗабалансоваяРегл,
		|
		// Налоговый учет
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.НалоговыйУчет * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК НалоговыйУчет,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ПостояннаяРазница * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(СУММА(ПрочиеРасходыНЗП.ВременнаяРазница * ВыпущеннаяПродукция.Числитель / ВыпущеннаяПродукция.Знаменатель) КАК ЧИСЛО(31,10)) КАК ВременнаяРазница,
		|
		// Включение исключение НДС в стоимости
		|	0 КАК ВключениеИсключениеНДСВСтоимости
		|
		|ИЗ
		|	ВыпущеннаяПродукция КАК ВыпущеннаяПродукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
		|		ПО ВыпущеннаяПродукция.Организация = ПрочиеРасходыНЗП.Организация
		|			И ВыпущеннаяПродукция.ПартияПродукции = ПрочиеРасходыНЗП.Регистратор
		|			И ВыпущеннаяПродукция.АналитикаУчетаПартийПродукции = ПрочиеРасходыНЗП.КорАналитикаУчетаПартий
		|			И ВыпущеннаяПродукция.АналитикаУчетаПродукции = ПрочиеРасходыНЗП.АналитикаУчетаПродукции
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеРасходыНЗП.Организация,
		|	ПрочиеРасходыНЗП.Регистратор,
		|	ПрочиеРасходыНЗП.КорАналитикаУчетаПартий,
		|	ПрочиеРасходыНЗП.СтатьяРасходов,
		|	ПрочиеРасходыНЗП.СтатьяКалькуляции,
		|	ПрочиеРасходыНЗП.Подразделение,
		|
		|	ВыпущеннаяПродукция.ИдентификаторУзла,
		|	ВыпущеннаяПродукция.ИдентификаторУзлаПервогоУровня,
		|	ВыпущеннаяПродукция.АналитикаУчетаЗатрат,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_ПартияПродукции,
		|	ВыпущеннаяПродукция.УзелПервогоУровня_АналитикаУчетаПартийПродукции
		|";
	
	Если Не ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		// Комментарий 3970.
		// Заполнение колонок ниже необходимо только в случае формирования дерева
		// или если ТребуетсяРазузлование или ТребуетсяРазузлованиеДопРасходов,
		// в данном запросе разузлования данных не требуется.
		УбратьИдентификаторУзла(ТекстПрочиеРасходыОбъединение, "ВыпущеннаяПродукция");
	КонецЕсли;
	ТекстыЗапросаОбъединение.Добавить(ТекстПрочиеРасходыОбъединение);
	
	#КонецОбласти
	
	#Область ТекстДопРасходыОбъединение
	
	Если ВыводитьДопРасходы Тогда
			
		ТекстДопРасходыОбъединение = "
			|ВЫБРАТЬ
			|	ТаблицаОтборовУзлов.ИдентификаторУзла КАК ИдентификаторУзла,
			|	ТаблицаОтборовУзлов.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
			|	МАКСИМУМ(ТаблицаОтборовУзлов.ДатаИсходнойПартии) КАК ДатаИсходнойПартии,
			|	МАКСИМУМ(ТаблицаОтборовУзлов.РазворачиватьДопРасходы) КАК РазворачиватьДопРасходы,
			|	МАКСИМУМ(ТаблицаОтборовУзлов.ТребуетсяРазузлование) КАК ТребуетсяРазузлованиеУзлаИсточника,
			|
			|	ДАТАВРЕМЯ(1, 1, 1)						КАК МесяцПервичнойПартииВНЗП,
			|
			|	ДетализацияСебестоимости.Организация							КАК Организация,
			|	ДетализацияСебестоимости.Партия									КАК ПартияВыходноеИзделие,
			|	ДетализацияСебестоимости.АналитикаУчетаПартий					КАК АналитикаУчетаПартийВыходноеИзделие,
			|	ТаблицаОтборовУзлов.АналитикаУчетаЗатрат						КАК АналитикаУчетаВыходноеИзделие,
			|	ДетализацияСебестоимости.ДокументПоступления КАК ПартияЗатрата,
			|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийЗатрата,
			|	ЛОЖЬ										КАК ВключитьНДСВСтоимость,
			|	ЛОЖЬ										КАК ИсключитьНДСИзСтоимости,
			|	ДетализацияСебестоимости.АналитикаРасходов	КАК АналитикаЗатрата,
			|	ВЫБОР
			|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка))
			|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
			|	КОНЕЦ КАК Затрата,
			|	НЕОПРЕДЕЛЕНО								КАК ЕдиницаИзмеренияЗатрата,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаЗатрата,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияЗатрата,
			|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеЗатрата,
			|	ТаблицаОтборовУзлов.СтатьяКалькуляции		КАК СтатьяКалькуляции,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
			|	ЛОЖЬ										КАК ТребуетсяРазузлование,
			|	ЛОЖЬ										КАК ТребуетсяРазузлованиеДопРасходов,
			|	&ТипЗатратДопРасходы						КАК ТипЗатрат,
			|	0											КАК КоличествоЗатрата,
			|
			// Стоимости согласно параметру ""ДанныеПоСебестоимости""
			|	0											КАК Материальные,
			|	0											КАК Трудозатраты,
			|	0											КАК ПостатейныеПостоянные,
			|	0											КАК ПостатейныеПеременные,
			|	СУММА(ВЫБОР
			|		КОГДА &ДанныеПоСебестоимости = 1
			|			ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
			|		КОГДА &ДанныеПоСебестоимости = 2
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
			|		КОГДА &ДанныеПоСебестоимости = 3
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСУпр ИНАЧЕ 0 КОНЕЦ)
			|		КОГДА &ДанныеПоСебестоимости = 4
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСРегл ИНАЧЕ 0 КОНЕЦ)
			|	КОНЕЦ * ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходы,
			|	0											КАК СуммаЗатратаЗабалансовая,
			|	СУММА(ВЫБОР
			|		КОГДА &ДанныеПоСебестоимости = 1
			|			ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
			|		КОГДА &ДанныеПоСебестоимости = 2
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
			|		КОГДА &ДанныеПоСебестоимости = 3
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСУпр ИНАЧЕ 0 КОНЕЦ)
			|		КОГДА &ДанныеПоСебестоимости = 4
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСРегл ИНАЧЕ 0 КОНЕЦ)
			|	КОНЕЦ * ТаблицаОтборовУзлов.КоличествоПродукции) КАК СуммаЗатрата,
			|	0											КАК НДД,
			|
			// Стоимости с НДС
			|	0											КАК МатериальныеСНДС,
			|	0											КАК ТрудозатратыСНДС,
			|	0											КАК ПостатейныеПостоянныеСНДС,
			|	0											КАК ПостатейныеПеременныеСНДС,
			|	СУММА(ДетализацияСебестоимости.СтоимостьСНДС
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыСНДС,
			|
			// Стоимости без НДС
			|	0											КАК МатериальныеБезНДС,
			|	0											КАК ПостатейныеПостоянныеБезНДС,
			|	0											КАК ПостатейныеПеременныеБезНДС,
			|	СУММА(ДетализацияСебестоимости.СтоимостьБезНДС
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыБезНДС,
			|
			// Стоимости Упр
			|	0											КАК МатериальныеУпр,
			|	0											КАК ТрудозатратыУпр,
			|	0											КАК ПостатейныеПостоянныеУпр,
			|	0											КАК ПостатейныеПеременныеУпр,
			|	СУММА((ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость 
			|				ТОГДА ДетализацияСебестоимости.НДСУпр ИНАЧЕ 0 КОНЕЦ))
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыУпр,
			|	0											КАК СтоимостьЗабалансоваяУпр,
			|
			// Стоимости Регл
			|	0											КАК МатериальныеРегл,
			|	0											КАК ТрудозатратыРегл,
			|	0											КАК ПостатейныеПостоянныеРегл,
			|	0											КАК ПостатейныеПеременныеРегл,
			|	СУММА((ДетализацияСебестоимости.СтоимостьБезНДСРегл 
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСРегл ИНАЧЕ 0 КОНЕЦ))
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыРегл,
			|	0											КАК СтоимостьЗабалансоваяРегл,
			|
			// Налоговый учет
			|	0 КАК НалоговыйУчет,
			|	0 КАК ПостояннаяРазница,
			|	0 КАК ВременнаяРазница,
			|
			// Включение исключение НДС в стоимости
			|	0 КАК ВключениеИсключениеНДСВСтоимости
			|
			|ИЗ
			|	ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
			|		ПО ДетализацияСебестоимости.Партия = ТаблицаОтборовУзлов.ПартияПродукции
			|			И ДетализацияСебестоимости.АналитикаУчетаПартий = ТаблицаОтборовУзлов.АналитикаУчетаПартийПродукции
			|			И ДетализацияСебестоимости.Номенклатура = ТаблицаОтборовУзлов.Продукция
			|			И ДетализацияСебестоимости.Характеристика = ТаблицаОтборовУзлов.ХарактеристикаПродукции
			|ГДЕ
			|	ЕСТЬNULL(ДетализацияСебестоимости.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути)
			|	И НЕ ДетализацияСебестоимости.ЗатратыПредыдущихПеределов
			|	И НЕ ВЫБОР
			|			КОГДА &ДанныеПоСебестоимости = 1
			|				ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
			|			КОГДА &ДанныеПоСебестоимости = 2
			|				ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
			|			КОГДА &ДанныеПоСебестоимости = 3
			|				ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			КОГДА &ДанныеПоСебестоимости = 4
			|				ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|		КОНЕЦ = 0
			|	И ВЫБОР
			|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
			|			ТОГДА ИСТИНА	
			|		КОГДА &ДанныеПоСебестоимости = 4
			|			ТОГДА ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
			|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
			|	КОНЕЦ 
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаОтборовУзлов.АналитикаУчетаЗатрат,
			|	ТаблицаОтборовУзлов.СтатьяКалькуляции,
			|
			|	ДетализацияСебестоимости.Организация,
			|	ДетализацияСебестоимости.Партия,
			|	ДетализацияСебестоимости.АналитикаУчетаПартий,
			|	ДетализацияСебестоимости.ДокументПоступления,
			|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления,
			|	ДетализацияСебестоимости.АналитикаРасходов,
			|	ВЫБОР
			|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка))
			|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
			|	КОНЕЦ,
			|
			|	ТаблицаОтборовУзлов.ИдентификаторУзла,
			|	ТаблицаОтборовУзлов.ИдентификаторУзлаПервогоУровня,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_ПартияПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПартийПродукции
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаОтборовУзлов.ИдентификаторУзла КАК ИдентификаторУзла,
			|	ТаблицаОтборовУзлов.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
			|	МАКСИМУМ(ТаблицаОтборовУзлов.ДатаИсходнойПартии) КАК ДатаИсходнойПартии,
			|	МАКСИМУМ(ТаблицаОтборовУзлов.РазворачиватьДопРасходы) КАК РазворачиватьДопРасходы,
			|	МАКСИМУМ(ТаблицаОтборовУзлов.ТребуетсяРазузлование) КАК ТребуетсяРазузлованиеУзлаИсточника,
			|
			|	ДАТАВРЕМЯ(1, 1, 1)						КАК МесяцПервичнойПартииВНЗП,
			|
			|	ДетализацияСебестоимости.Организация							КАК Организация,
			|	ДетализацияСебестоимости.Партия									КАК ПартияВыходноеИзделие,
			|	ДетализацияСебестоимости.АналитикаУчетаПартий					КАК АналитикаУчетаПартийВыходноеИзделие,
			|	ТаблицаОтборовУзлов.АналитикаУчетаЗатрат						КАК АналитикаУчетаВыходноеИзделие,
			|	ДетализацияСебестоимости.ДокументПоступления КАК ПартияЗатрата,
			|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийЗатрата,
			|	ЛОЖЬ										КАК ВключитьНДСВСтоимость,
			|	ЛОЖЬ										КАК ИсключитьНДСИзСтоимости,
			|	ДетализацияСебестоимости.АналитикаРасходов	КАК АналитикаЗатрата,
			|	ВЫБОР
			|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка))
			|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
			|	КОНЕЦ КАК Затрата,
			|	НЕОПРЕДЕЛЕНО								КАК ЕдиницаИзмеренияЗатрата,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаЗатрата,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияЗатрата,
			|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеЗатрата,
			|	ТаблицаОтборовУзлов.СтатьяКалькуляции		КАК СтатьяКалькуляции,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
			|	ЛОЖЬ										КАК ТребуетсяРазузлование,
			|	ЛОЖЬ										КАК ТребуетсяРазузлованиеДопРасходов,
			|	&ТипЗатратДопРасходы						КАК ТипЗатрат,
			|	0											КАК КоличествоЗатрата,
			|
			// Стоимости согласно параметру ""ДанныеПоСебестоимости""
			|	0											КАК Материальные,
			|	0											КАК Трудозатраты,
			|	0											КАК ПостатейныеПостоянные,
			|	0											КАК ПостатейныеПеременные,
			|	СУММА(ВЫБОР
			|		КОГДА &ДанныеПоСебестоимости = 1
			|			ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
			|		КОГДА &ДанныеПоСебестоимости = 2
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
			|		КОГДА &ДанныеПоСебестоимости = 3
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСУпр ИНАЧЕ 0 КОНЕЦ)
			|		КОГДА &ДанныеПоСебестоимости = 4
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСРегл ИНАЧЕ 0 КОНЕЦ)
			|	КОНЕЦ * ТаблицаОтборовУзлов.КоличествоПродукции)				КАК ДопРасходы,
			|	0											КАК СуммаЗатратаЗабалансовая,
			|	СУММА(ВЫБОР
			|		КОГДА &ДанныеПоСебестоимости = 1
			|			ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
			|		КОГДА &ДанныеПоСебестоимости = 2
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
			|		КОГДА &ДанныеПоСебестоимости = 3
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСУпр ИНАЧЕ 0 КОНЕЦ)
			|		КОГДА &ДанныеПоСебестоимости = 4
			|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСРегл ИНАЧЕ 0 КОНЕЦ)
			|	КОНЕЦ * ТаблицаОтборовУзлов.КоличествоПродукции)				КАК СуммаЗатрата,
			|	0											КАК НДД,
			|
			// Стоимости с НДС
			|	0											КАК МатериальныеСНДС,
			|	0											КАК ТрудозатратыСНДС,
			|	0											КАК ПостатейныеПостоянныеСНДС,
			|	0											КАК ПостатейныеПеременныеСНДС,
			|	СУММА(ДетализацияСебестоимости.СтоимостьСНДС
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыСНДС,
			|
			// Стоимости без НДС
			|	0											КАК МатериальныеБезНДС,
			|	0											КАК ПостатейныеПостоянныеБезНДС,
			|	0											КАК ПостатейныеПеременныеБезНДС,
			|	СУММА(ДетализацияСебестоимости.СтоимостьБезНДС
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыБезНДС,
			|
			// Стоимости Упр
			|	0											КАК МатериальныеУпр,
			|	0											КАК ТрудозатратыУпр,
			|	0											КАК ПостатейныеПостоянныеУпр,
			|	0											КАК ПостатейныеПеременныеУпр,
			|	СУММА((ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСУпр ИНАЧЕ 0 КОНЕЦ))
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыУпр,
			|	0											КАК СтоимостьЗабалансоваяУпр,
			|
			// Стоимости Регл
			|	0											КАК МатериальныеРегл,
			|	0											КАК ТрудозатратыРегл,
			|	0											КАК ПостатейныеПостоянныеРегл,
			|	0											КАК ПостатейныеПеременныеРегл,
			|	СУММА((ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|			+ (ВЫБОР КОГДА ТаблицаОтборовУзлов.ВключитьНДСВСтоимость
			|				ТОГДА ДетализацияСебестоимости.НДСРегл ИНАЧЕ 0 КОНЕЦ))
			|			* ТаблицаОтборовУзлов.КоличествоПродукции) КАК ДопРасходыРегл,
			|	0											КАК СтоимостьЗабалансоваяРегл,
			|
			// Налоговый учет
			|	0 КАК НалоговыйУчет,
			|	0 КАК ПостояннаяРазница,
			|	0 КАК ВременнаяРазница,
			|
			// Включение исключение НДС в стоимости
			|	0 КАК ВключениеИсключениеНДСВСтоимости
			|ИЗ
			|	ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
			|		ПО ДетализацияСебестоимости.Период МЕЖДУ ТаблицаОтборовУзлов.ДатаИсходнойПартии_НачалоМесяца И ТаблицаОтборовУзлов.ДатаИсходнойПартии_КонецМесяца
			|			И ДетализацияСебестоимости.Партия = ТаблицаОтборовУзлов.ПартияПродукции
			|			И ДетализацияСебестоимости.АналитикаУчетаПартий = ТаблицаОтборовУзлов.АналитикаУчетаПартийПродукции
			|			И ДетализацияСебестоимости.АналитикаУчетаНоменклатуры = ТаблицаОтборовУзлов.АналитикаУчетаЗатрат
			|ГДЕ
			|	ДетализацияСебестоимости.РазделУчета В (
			|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
			|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
			|	И НЕ ВЫБОР
			|			КОГДА &ДанныеПоСебестоимости = 1
			|				ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
			|			КОГДА &ДанныеПоСебестоимости = 2
			|				ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
			|			КОГДА &ДанныеПоСебестоимости = 3
			|				ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
			|			КОГДА &ДанныеПоСебестоимости = 4
			|				ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
			|		КОНЕЦ = 0
			|	И ВЫБОР
			|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
			|			ТОГДА ИСТИНА	
			|		КОГДА &ДанныеПоСебестоимости = 4
			|			ТОГДА ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
			|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
			|	КОНЕЦ 
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаОтборовУзлов.СтатьяКалькуляции,
			|	ТаблицаОтборовУзлов.АналитикаУчетаЗатрат,
			|
			|	ДетализацияСебестоимости.Организация,
			|	ДетализацияСебестоимости.Партия,
			|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры,
			|	ДетализацияСебестоимости.АналитикаУчетаПартий,
			|	ДетализацияСебестоимости.ДокументПоступления,
			|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления,
			|	ДетализацияСебестоимости.АналитикаРасходов,
			|	ВЫБОР
			|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка))
			|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
			|	КОНЕЦ,
			|
			|	ТаблицаОтборовУзлов.ИдентификаторУзла,
			|	ТаблицаОтборовУзлов.ИдентификаторУзлаПервогоУровня,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_ПартияПродукции,
			|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПартийПродукции
			|";
		
		Если Не ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
			УбратьИдентификаторУзла(ТекстДопРасходыОбъединение, "ТаблицаОтборовУзлов");
		КонецЕсли;
		ТекстыЗапросаОбъединение.Добавить(ТекстДопРасходыОбъединение);
	
	КонецЕсли;
	
	#КонецОбласти

	ТекстыЗапроса.Добавить(СтрСоединить(ТекстыЗапросаОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()));
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРезультатыРазузлования(ПараметрыДерева)
	
	ТекстыЗапросов = Новый Массив();
	ТекстыЗапросовОбъединение = Новый Массив();
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Т.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	Т.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	Т.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	Т.ТребуетсяРазузлованиеУзлаИсточника КАК ТребуетсяРазузлованиеУзлаИсточника,
		|	Т.ДатаИсходнойПартии КАК ДатаИсходнойПартии,
		|	Т.МесяцПервичнойПартииВНЗП КАК МесяцПервичнойПартииВНЗП,
		|
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|
		|	Т.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
		|	Т.АналитикаУчетаЗатрата КАК АналитикаУчетаЗатрата,
		|	Т.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартийЗатрата,
		|	Т.АналитикаУчетаПартийВыходноеИзделие КАК АналитикаУчетаПартийВыходноеИзделие,
		|	Т.ПартияВыходноеИзделие КАК ПартияВыходноеИзделие,
		|
		|	Т.Затрата КАК Затрата,
		|	Т.ХарактеристикаЗатрата КАК ХарактеристикаЗатрата,
		|	Т.СерияЗатрата КАК СерияЗатрата,
		|	Т.НазначениеЗатрата КАК НазначениеЗатрата,
		|	Т.ПартияЗатрата КАК ПартияЗатрата,
		|
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.ТипЗатрат КАК ТипЗатрат,
		|	Т.ТребуетсяРазузлование
		|		И ВЫРАЗИТЬ(Т.КоличествоЗатрата КАК ЧИСЛО(19, 3)) <> 0
		|		И (Т.СуммаЗатрата <> 0 ИЛИ Т.СуммаЗатратаЗабалансовая <> 0) КАК ТребуетсяРазузлование,
		|	Т.ТребуетсяРазузлованиеДопРасходов
		|		И ВЫРАЗИТЬ(Т.КоличествоЗатрата КАК ЧИСЛО(19, 3)) <> 0
		|		И ВЫРАЗИТЬ(Т.ДопРасходы КАК ЧИСЛО(19, 2)) <> 0 КАК ТребуетсяРазузлованиеДопРасходов,
		|
		|	Т.ЕдиницаИзмеренияЗатрата КАК ЕдиницаИзмеренияЗатрата,
		|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|
		|	Т.КоличествоЗатрата КАК КоличествоЗатрата,
		// Комментарий 3970.
		// Сумму включения/исключения НДС, в рамках регл. учета, добавляем отдельной строкой.
		|	ВЫРАЗИТЬ(Т.СуммаЗатрата КАК ЧИСЛО(19, 2)) КАК СуммаЗатрата,
		|	ВЫРАЗИТЬ(Т.ВключениеИсключениеНДСВСтоимости КАК ЧИСЛО(19, 2)) КАК СуммаВключениеИсключениеНДСВСтоимости,
		|	ВЫРАЗИТЬ(Т.СуммаЗатратаЗабалансовая КАК ЧИСЛО(19, 2)) КАК СуммаЗатратаЗабалансовая,
		|	ВЫРАЗИТЬ(Т.Материальные КАК ЧИСЛО(19, 2)) КАК Материальные,
		|	ВЫРАЗИТЬ(Т.Трудозатраты КАК ЧИСЛО(19, 2)) КАК Трудозатраты,
		|	ВЫРАЗИТЬ(Т.ПостатейныеПостоянные КАК ЧИСЛО(19, 2)) КАК ПостатейныеПостоянные,
		|	ВЫРАЗИТЬ(Т.ПостатейныеПеременные КАК ЧИСЛО(19, 2)) КАК ПостатейныеПеременные,
		|	ВЫРАЗИТЬ(Т.ДопРасходы КАК ЧИСЛО(19, 2)) КАК ДопРасходы,
		|	Т.НДД КАК НДД,
		|	Т.МатериальныеСНДС КАК МатериальныеСНДС,
		|	Т.ТрудозатратыСНДС КАК ТрудозатратыСНДС,
		|	Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
		|	Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
		|	Т.ДопРасходыСНДС КАК ДопРасходыСНДС,
		|	Т.МатериальныеБезНДС КАК МатериальныеБезНДС,
		|	Т.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
		|	Т.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
		|	Т.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
		|	Т.МатериальныеУпр КАК МатериальныеУпр,
		|	Т.ТрудозатратыУпр КАК ТрудозатратыУпр,
		|	Т.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
		|	Т.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
		|	Т.ДопРасходыУпр КАК ДопРасходыУпр,
		|	Т.СтоимостьЗабалансоваяУпр КАК СтоимостьЗабалансоваяУпр,
		|	Т.МатериальныеРегл КАК МатериальныеРегл,
		|	Т.ТрудозатратыРегл КАК ТрудозатратыРегл,
		|	Т.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
		|	Т.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
		|	Т.ДопРасходыРегл КАК ДопРасходыРегл,
		|	Т.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
		|	ВЫРАЗИТЬ(Т.НалоговыйУчет КАК ЧИСЛО(19, 2)) КАК НалоговыйУчет,
		|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
		|	Т.ВременнаяРазница КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ РезультатыРазузлования
		|
		|ИЗ РезультатыРазузлованияПредварительная КАК Т
		|";
	
	ТекстыЗапросовОбъединение.Добавить(ТекстЗапроса);
	
	#Область ВключениеИсключениеНДС
	// Смотри комментарий 3970.	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Т.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	Т.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	Т.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	МАКСИМУМ(Т.ТребуетсяРазузлованиеУзлаИсточника) КАК ТребуетсяРазузлованиеУзлаИсточника,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсходнойПартии,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцПервичнойПартииВНЗП,
		|
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|
		|	Т.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
		|	NULL КАК АналитикаУчетаЗатрата,
		|	NULL КАК АналитикаУчетаПартийЗатрата,
		|	Т.АналитикаУчетаПартийВыходноеИзделие КАК АналитикаУчетаПартийВыходноеИзделие,
		|	Т.ПартияВыходноеИзделие КАК ПартияВыходноеИзделие,
		|
		|	&НоменклатураВключениеИсключениеНДСВСтоимости КАК Затрата,
		|	NULL КАК ХарактеристикаЗатрата,
		|	NULL КАК СерияЗатрата,
		|	NULL КАК НазначениеЗатрата,
		|	NULL КАК ПартияЗатрата,
		|
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	NULL КАК ТипЗатрат,
		|	ЛОЖЬ КАК ТребуетсяРазузлование,
		|	ЛОЖЬ КАК ТребуетсяРазузлованиеДопРасходов,
		|
		|	NULL КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(Т.СтатьяКалькуляции) КАК СтатьяКалькуляции,
		|
		|	0 КАК КоличествоЗатрата,
		|	ВЫРАЗИТЬ(СУММА(Т.ВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19, 2)) КАК СуммаЗатрата,
		|	0 КАК ВключениеИсключениеНДСВСтоимости,
		|	0 КАК СуммаЗатратаЗабалансовая,
		|	ВЫРАЗИТЬ(СУММА(Т.ВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19, 2)) КАК Материальные,
		|	0 КАК Трудозатраты,
		|	0 КАК ПостатейныеПостоянные,
		|	0 КАК ПостатейныеПеременные,
		|	0 КАК ДопРасходы,
		|	0 КАК НДД,
		|	0 КАК МатериальныеСНДС,
		|	0 КАК ТрудозатратыСНДС,
		|	0 КАК ПостатейныеПостоянныеСНДС,
		|	0 КАК ПостатейныеПеременныеСНДС,
		|	0 КАК ДопРасходыСНДС,
		|	0 КАК МатериальныеБезНДС,
		|	0 КАК ПостатейныеПостоянныеБезНДС,
		|	0 КАК ПостатейныеПеременныеБезНДС,
		|	0 КАК ДопРасходыБезНДС,
		|	ВЫРАЗИТЬ(СУММА(Т.ВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19, 2)) КАК МатериальныеУпр,
		|	0 КАК ТрудозатратыУпр,
		|	0 КАК ПостатейныеПостоянныеУпр,
		|	0 КАК ПостатейныеПеременныеУпр,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК СтоимостьЗабалансоваяУпр,
		|	ВЫРАЗИТЬ(СУММА(Т.ВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19, 2)) КАК МатериальныеРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеПостоянныеРегл,
		|	0 КАК ПостатейныеПеременныеРегл,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	ВЫРАЗИТЬ(СУММА(Т.ВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19, 2)) КАК НалоговыйУчет,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ИЗ
		|	РезультатыРазузлованияПредварительная КАК Т
		|ГДЕ
		|	Т.ВключениеИсключениеНДСВСтоимости <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ИдентификаторУзлаПервогоУровня,
		|	Т.ИдентификаторУзла,
		|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	Т.УзелПервогоУровня_АналитикаУчетаПродукции,
		|	Т.УзелПервогоУровня_ПартияПродукции,
		|	Т.АналитикаУчетаВыходноеИзделие,
		|	Т.ПартияВыходноеИзделие,
		|	Т.АналитикаУчетаПартийВыходноеИзделие,
		|	Т.Организация,
		|	Т.Подразделение
		|
		|ИМЕЮЩИЕ
		|	ВЫРАЗИТЬ(СУММА(Т.ВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19, 2)) <> 0
		|";
	Если Не ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		УбратьИдентификаторУзла(ТекстЗапроса, "Т");
	КонецЕсли;
		
	ТекстыЗапросовОбъединение.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область Зацикливание
	
	// При первом проходе нет временной таблицы УзлыСЗацикливанием.
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыДерева.МенеджерВременныхТаблиц,
		"УзлыСЗацикливанием") Тогда
			
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	УЗ.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
			|	УЗ.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
			|	УЗ.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
			|	УЗ.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
			|	УЗ.ТребуетсяРазузлование КАК ТребуетсяРазузлованиеУзлаИсточника,
			|	УЗ.ДатаИсходнойПартии КАК ДатаИсходнойПартии,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцПервичнойПартииВНЗП,
			|
			|	"""" КАК ИдентификаторУзла,
			|
			|	УЗ.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
			|	NULL КАК АналитикаУчетаЗатрата,
			|	NULL КАК АналитикаУчетаПартийЗатрата,
			|	NULL КАК АналитикаУчетаПартийВыходноеИзделие,
			|	УЗ.ПартияПродукции КАК ПартияВыходноеИзделие,
			|
			|	&НоменклатураЗацикливание КАК Затрата,
			|	NULL КАК ХарактеристикаЗатрата,
			|	NULL КАК СерияЗатрата,
			|	NULL КАК НазначениеЗатрата,
			|	NULL КАК ПартияЗатрата,
			|
			|	УЗ.Организация КАК Организация,
			|	УЗ.Подразделение КАК Подразделение,
			|	NULL КАК ТипЗатрат,
			|	ЛОЖЬ КАК ТребуетсяРазузлование,
			|	ЛОЖЬ КАК ТребуетсяРазузлованиеДопРасходов,
			|
			|	NULL КАК ЕдиницаИзмерения,
			|	УЗ.СтатьяКалькуляции КАК СтатьяКалькуляции,
			|
			|	0 КАК КоличествоЗатрата,
			|	УЗ.Сумма КАК СуммаЗатрата,
			|	УЗ.СуммаВключениеИсключениеНДСВСтоимости КАК ВключениеИсключениеНДСВСтоимости,
			|	УЗ.СуммаЗабалансовая КАК СуммаЗатратаЗабалансовая,
			|	УЗ.Материальные КАК Материальные,
			|	УЗ.Трудозатраты КАК Трудозатраты,
			|	УЗ.ПостатейныеПостоянные КАК ПостатейныеПостоянные,
			|	УЗ.ПостатейныеПеременные КАК ПостатейныеПеременные,
			|	УЗ.ДопРасходы КАК ДопРасходы,
			|	0 КАК НДД,
			|	0 КАК МатериальныеСНДС,
			|	0 КАК ТрудозатратыСНДС,
			|	0 КАК ПостатейныеПостоянныеСНДС,
			|	0 КАК ПостатейныеПеременныеСНДС,
			|	0 КАК ДопРасходыСНДС,
			|	0 КАК МатериальныеБезНДС,
			|	0 КАК ПостатейныеПостоянныеБезНДС,
			|	0 КАК ПостатейныеПеременныеБезНДС,
			|	0 КАК ДопРасходыБезНДС,
			|	0 КАК МатериальныеУпр,
			|	0 КАК ТрудозатратыУпр,
			|	0 КАК ПостатейныеПостоянныеУпр,
			|	0 КАК ПостатейныеПеременныеУпр,
			|	0 КАК ДопРасходыУпр,
			|	0 КАК СтоимостьЗабалансоваяУпр,
			|	0 КАК МатериальныеРегл,
			|	0 КАК ТрудозатратыРегл,
			|	0 КАК ПостатейныеПостоянныеРегл,
			|	0 КАК ПостатейныеПеременныеРегл,
			|	0 КАК ДопРасходыРегл,
			|	0 КАК СтоимостьЗабалансоваяРегл,
			|	УЗ.НалоговыйУчет КАК НалоговыйУчет,
			|	УЗ.ПостояннаяРазница КАК ПостояннаяРазница,
			|	УЗ.ВременнаяРазница КАК ВременнаяРазница
			|ИЗ
			|	УзлыСЗацикливанием КАК УЗ
			|";
		ТекстыЗапросовОбъединение.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	#КонецОбласти
	
	ЗапросОбъединение = СтрСоединить(ТекстыЗапросовОбъединение,
		ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыЗапросов.Добавить(ЗапросОбъединение);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаЗатратыНаПродукцию(ПараметрыДерева)
	
	ТекстыЗапросов = Новый Массив();
	ТекстыЗапросовОбъединение = Новый Массив();
	ТекстыЗапросовОбъединение.Добавить(ТекстЗапросаШаблонРезультатыРазузлования(Ложь, ПараметрыДерева));

	#Область ИзменениеСтоимости
	
	ПараметрыДерева.ПараметрыОтчета.Вставить("НоменклатураИзменениеСтоимостиПриХранении",
		НСтр("ru = 'Изменение стоимости при хранении';
			|en = 'Cost change at storage'"));
	ПараметрыДерева.ПараметрыОтчета.Вставить("НоменклатураУсреднениеСтоимостиВНезавершенномПроизводстве",
		НСтр("ru = 'Усреднение стоимости в незавершенном производстве';
			|en = 'Cost averaging in work-in-progress'"));
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Т.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|
		|	NULL КАК ПартияВыходноеИзделие,
		|	Т.УзелПервогоУровня_ПартияПродукции КАК ПартияПродукции,
		|	NULL КАК СтатьяКалькуляции,
		|	NULL КАК Организация,
		|	NULL КАК Подразделение,
		|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
		|	Т.УзелПервогоУровня_АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
		|
		|	Т.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
		|	-СУММА(Т.СуммаЗатрата) КАК СуммаЗатрата,
		|	-СУММА(Т.Материальные) КАК Материальные,
		|	-СУММА(Т.НалоговыйУчет) КАК НалоговыйУчет,
		|	-СУММА(Т.Трудозатраты) КАК Трудозатраты,
		|	-СУММА(Т.ПостатейныеПостоянные) КАК ПостатейныеПостоянные,
		|	-СУММА(Т.ПостатейныеПеременные) КАК ПостатейныеПеременные,
		|	-СУММА(Т.ДопРасходы) КАК ДопРасходы,
		|	-СУММА(Т.СуммаЗатратаЗабалансовая) КАК СуммаЗатратаЗабалансовая,
		|	-СУММА(Т.НДД) КАК НДД
		|ПОМЕСТИТЬ ВТИзменениеСтоимостиПредварительная
		|ИЗ
		|	РезультатыРазузлования КАК Т
		|
		|ГДЕ
		|	Т.ТребуетсяРазузлованиеУзлаИсточника
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ИдентификаторУзлаПервогоУровня,
		|	Т.ИдентификаторУзла,
		|	Т.АналитикаУчетаВыходноеИзделие,
		|	Т.УзелПервогоУровня_ПартияПродукции,
		|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	Т.УзелПервогоУровня_АналитикаУчетаПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	ДД.ИдентификаторУзла КАК ИдентификаторУзла,
		|
		|	ДД.ПартияПродукции КАК ПартияВыходноеИзделие,
		|	ДД.УзелПервогоУровня_ПартияПродукции КАК ПартияПродукции,
		|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	ДД.Организация КАК Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
		|	ДД.УзелПервогоУровня_АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
		|
		|	ДД.АналитикаУчетаЗатрат КАК АналитикаУчетаВыходноеИзделие,
		|	ДД.Сумма,
		|	ДД.Материальные,
		|	ДД.НалоговыйУчет,
		|	ДД.Трудозатраты,
		|	ДД.ПостатейныеПостоянные,
		|	ДД.ПостатейныеПеременные,
		|	ДД.ДопРасходы,
		|	ДД.СуммаЗабалансовая,
		|	0
		|ИЗ
		|	ТаблицаОтборовУзлов КАК ДД
		|ГДЕ
		|	ДД.ТребуетсяРазузлование
		|";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсходнойПартии,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияЗатраты) КАК ВидСтроки,
		|	Т.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
		|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
		|
		|	Т.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
		|	Т.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
		|	NULL КАК АналитикаУчетаЗатрата,
		|	NULL КАК АналитикаУчетаПартий,
		|	Т.АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
		|	NULL КАК АналитикаУчетаПартийВыходноеИзделие,
		|	NULL КАК АналитикаУчетаПартийЗатрата,
		|	МАКСИМУМ(Т.Организация) КАК Организация,
		|	МАКСИМУМ(Т.Подразделение) КАК Подразделение,
		|	NULL КАК ТипЗатрат,
		|	ЛОЖЬ КАК ТребуетсяРазузлование,
		|	ЛОЖЬ КАК ТребуетсяРазузлованиеДопРасходов,
		|	NULL КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА СУММА(Т.СуммаЗатрата) = СУММА(Т.ДопРасходы)
		|			ТОГДА &НоменклатураИзменениеСтоимостиПриХранении
		|		ИНАЧЕ &НоменклатураУсреднениеСтоимостиВНезавершенномПроизводстве
		|	КОНЕЦ КАК Номенклатура,
		|	NULL КАК Характеристика,
		|	NULL КАК Серия,
		|	NULL КАК Назначение,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	МАКСИМУМ(Т.СтатьяКалькуляции) КАК СтатьяКалькуляции,
		|	ВЫРАЗИТЬ(&УровеньУзла КАК ЧИСЛО) КАК Уровень,
		|	NULL КАК Партия,
		|	Т.ПартияПродукции КАК ПартияПродукции,
		|	МАКСИМУМ(Т.ПартияВыходноеИзделие) КАК ПартияВыходноеИзделие,
		|	NULL КАК ПартияЗатрата,
		|
		|	0 КАК Количество,
		|	0 КАК Числитель,
		|	0 КАК Знаменатель,
		|	СУММА(Т.СуммаЗатрата) КАК Сумма,
		|	СУММА(Т.СуммаЗатратаЗабалансовая) КАК СуммаЗабалансовая,
		|	СУММА(Т.Материальные) КАК Материальные,
		|	СУММА(Т.Трудозатраты) КАК Трудозатраты,
		|	СУММА(Т.ПостатейныеПостоянные) КАК ПостатейныеПостоянные,
		|	СУММА(Т.ПостатейныеПеременные) КАК ПостатейныеПеременные,
		|	СУММА(Т.ДопРасходы) КАК ДопРасходы,
		|	СУММА(Т.НДД) КАК НДД,
		|	0 КАК МатериальныеСНДС,
		|	0 КАК ТрудозатратыСНДС,
		|	0 КАК ПостатейныеПостоянныеСНДС,
		|	0 КАК ПостатейныеПеременныеСНДС,
		|	0 КАК ДопРасходыСНДС,
		|	0 КАК МатериальныеБезНДС,
		|	0 КАК ПостатейныеПостоянныеБезНДС,
		|	0 КАК ПостатейныеПеременныеБезНДС,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК МатериальныеУпр,
		|	0 КАК ТрудозатратыУпр,
		|	0 КАК ПостатейныеПостоянныеУпр,
		|	0 КАК ПостатейныеПеременныеУпр,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК СтоимостьЗабалансоваяУпр,
		|	0 КАК МатериальныеРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеПостоянныеРегл,
		|	0 КАК ПостатейныеПеременныеРегл,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	СУММА(Т.НалоговыйУчет) КАК НалоговыйУчет,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК СуммаВключениеИсключениеНДСВСтоимости
		|ИЗ
		|	ВТИзменениеСтоимостиПредварительная КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ИдентификаторУзлаПервогоУровня,
		|	Т.ИдентификаторУзла,
		|	Т.АналитикаУчетаВыходноеИзделие,
		|	Т.АналитикаУчетаПродукции,
		|	Т.АналитикаУчетаПартийПродукции,
		|	Т.ПартияПродукции
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.СуммаЗатрата) <> 0
		|";
		
	Если Не ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		// Смотри комментарий 3970.
		УбратьИдентификаторУзла(ТекстЗапроса, "Т");
	КонецЕсли;
	
	ТекстыЗапросовОбъединение.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	ТекстыЗапросов.Добавить(СтрСоединить(ТекстыЗапросовОбъединение,
		ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()));
	
	ПараметрыДерева.Вставить("ТекстЗапросаЗатратыНаПродукцию",
		СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов()));
	
КонецПроцедуры

Процедура УбратьИдентификаторУзла(ТекстЗапроса, ИмяТаблицы)
	// Смотри комментарий 3970.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		ИмяТаблицы + ".ИдентификаторУзлаПервогоУровня,", ""); //@Query-part
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		ИмяТаблицы + ".ИдентификаторУзла,", ""); //@Query-part
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		ИмяТаблицы + ".ИдентификаторУзлаПервогоУровня", """"""); //@Query-part
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		ИмяТаблицы + ".ИдентификаторУзла", """"""); //@Query-part
КонецПроцедуры

Функция ТекстЗапросаШаблонРезультатыРазузлования(ЗапросДляОтбора, ПараметрыДерева)
	
	// Порядок и наполнение колонок,
	// должен повторять порядок и наполнение колонок в таблице формируемой тут СтруктураПолейДереваСебестоимости()
	Если ЗапросДляОтбора Или ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА Т.ТребуетсяРазузлование ИЛИ Т.ТребуетсяРазузлованиеДопРасходов
			|		ТОГДА Т.МесяцПервичнойПартииВНЗП
			|		ИНАЧЕ Т.ДатаИсходнойПартии
			|	КОНЕЦ КАК ДатаИсходнойПартии,
			|	ВЫБОР КОГДА Т.ТребуетсяРазузлование
			|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияПолуфабриката)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияЗатраты)
			|	КОНЕЦ КАК ВидСтроки,
			|	Т.ИдентификаторУзлаПервогоУровня КАК ИдентификаторУзлаПервогоУровня,
			|	Т.ИдентификаторУзла КАК ИдентификаторУзла,
			|	Т.УзелПервогоУровня_АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
			|	Т.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
			|	Т.АналитикаУчетаЗатрата КАК АналитикаУчетаЗатрата,
			|	Т.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартий,
			|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
			|	Т.АналитикаУчетаПартийВыходноеИзделие КАК АналитикаУчетаПартийВыходноеИзделие,
			|	Т.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартийЗатрата,
			|	Т.Организация КАК Организация,
			|	Т.Подразделение КАК Подразделение,
			|	Т.ТипЗатрат КАК ТипЗатрат,
			|	Т.ТребуетсяРазузлование КАК ТребуетсяРазузлование,
			|	Т.ТребуетсяРазузлованиеДопРасходов КАК ТребуетсяРазузлованиеДопРасходов,
			|	Т.ЕдиницаИзмеренияЗатрата КАК ЕдиницаИзмерения,
			|	Т.Затрата КАК Номенклатура,
			|	Т.ХарактеристикаЗатрата КАК Характеристика,
			|	Т.СерияЗатрата КАК Серия,
			|	Т.НазначениеЗатрата КАК Назначение,
			|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
			|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
			|	ВЫРАЗИТЬ(&УровеньУзла КАК ЧИСЛО(15, 0)) КАК Уровень,
			|	Т.ПартияЗатрата КАК Партия,
			|	Т.УзелПервогоУровня_ПартияПродукции КАК ПартияПродукции,
			|	Т.ПартияВыходноеИзделие КАК ПартияВыходноеИзделие,
			|	Т.ПартияЗатрата КАК ПартияЗатрата,
			|	ВЫРАЗИТЬ(Т.КоличествоЗатрата КАК ЧИСЛО(19,6)) КАК Количество,
			|	ВЫРАЗИТЬ(ВЫБОР КОГДА Т.ТребуетсяРазузлование
			|		ТОГДА Т.КоличествоЗатрата
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЧИСЛО(19,6)) КАК Числитель,
			|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(19,6)) КАК Знаменатель,
			|	ВЫРАЗИТЬ(Т.СуммаЗатрата КАК ЧИСЛО(19,6)) КАК Сумма,
			|	ВЫРАЗИТЬ(Т.СуммаЗатратаЗабалансовая КАК ЧИСЛО(19,6)) КАК СуммаЗабалансовая,
			|	ВЫРАЗИТЬ(Т.Материальные КАК ЧИСЛО(19,6)) КАК Материальные,
			|	ВЫРАЗИТЬ(Т.Трудозатраты КАК ЧИСЛО(19,6)) КАК Трудозатраты,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПостоянные КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянные,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПеременные КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременные,
			|	ВЫРАЗИТЬ(Т.ДопРасходы КАК ЧИСЛО(19,6)) КАК ДопРасходы,
			|	ВЫРАЗИТЬ(Т.НДД КАК ЧИСЛО(19,6)) КАК НДД,
			|	ВЫРАЗИТЬ(Т.МатериальныеСНДС КАК ЧИСЛО(19,6)) КАК МатериальныеСНДС,
			|	ВЫРАЗИТЬ(Т.ТрудозатратыСНДС КАК ЧИСЛО(19,6)) КАК ТрудозатратыСНДС,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеСНДС,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПеременныеСНДС КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеСНДС,
			|	ВЫРАЗИТЬ(Т.ДопРасходыСНДС КАК ЧИСЛО(19,6)) КАК ДопРасходыСНДС,
			|	ВЫРАЗИТЬ(Т.МатериальныеБезНДС КАК ЧИСЛО(19,6)) КАК МатериальныеБезНДС,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеБезНДС,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеБезНДС,
			|	ВЫРАЗИТЬ(Т.ДопРасходыБезНДС КАК ЧИСЛО(19,6)) КАК ДопРасходыБезНДС,
			|	ВЫРАЗИТЬ(Т.МатериальныеУпр КАК ЧИСЛО(19,6)) КАК МатериальныеУпр,
			|	ВЫРАЗИТЬ(Т.ТрудозатратыУпр КАК ЧИСЛО(19,6)) КАК ТрудозатратыУпр,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПостоянныеУпр КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеУпр,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПеременныеУпр КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеУпр,
			|	ВЫРАЗИТЬ(Т.ДопРасходыУпр КАК ЧИСЛО(19,6)) КАК ДопРасходыУпр,
			|	ВЫРАЗИТЬ(Т.СтоимостьЗабалансоваяУпр КАК ЧИСЛО(19,6)) КАК СтоимостьЗабалансоваяУпр,
			|	ВЫРАЗИТЬ(Т.МатериальныеРегл КАК ЧИСЛО(19,6)) КАК МатериальныеРегл,
			|	ВЫРАЗИТЬ(Т.ТрудозатратыРегл КАК ЧИСЛО(19,6)) КАК ТрудозатратыРегл,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПостоянныеРегл КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеРегл,
			|	ВЫРАЗИТЬ(Т.ПостатейныеПеременныеРегл КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеРегл,
			|	ВЫРАЗИТЬ(Т.ДопРасходыРегл КАК ЧИСЛО(19,6)) КАК ДопРасходыРегл,
			|	ВЫРАЗИТЬ(Т.СтоимостьЗабалансоваяРегл КАК ЧИСЛО(19,6)) КАК СтоимостьЗабалансоваяРегл,
			|	ВЫРАЗИТЬ(Т.НалоговыйУчет КАК ЧИСЛО(19,6)) КАК НалоговыйУчет,
			|	ВЫРАЗИТЬ(Т.ПостояннаяРазница КАК ЧИСЛО(19,6)) КАК ПостояннаяРазница,
			|	ВЫРАЗИТЬ(Т.ВременнаяРазница КАК ЧИСЛО(19,6)) КАК ВременнаяРазница,
			|	ВЫРАЗИТЬ(Т.СуммаВключениеИсключениеНДСВСтоимости КАК ЧИСЛО(19,6)) КАК СуммаВключениеИсключениеНДСВСтоимости
			|
			|ДОБАВИТЬ ПредварительныйРезультат2
			|
			|ИЗ РезультатыРазузлования КАК Т
			|
			|ГДЕ
			|	&УсловиеОтбора
			|";
	Иначе
		ТекстЗапроса = "
			|ВЫБРАТЬ
			// Если это не отбор, в данный момент значение данной колонки больше не где не используется,
			// нет смысла тратит время на включение в группировку.
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаИсходнойПартии,
			|	ВЫБОР КОГДА МАКСИМУМ(Т.ТребуетсяРазузлование)
			|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияПолуфабриката)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияЗатраты)
			|	КОНЕЦ КАК ВидСтроки,
			// Смотри комментарий 3970.
			|	"""" КАК ИдентификаторУзлаПервогоУровня,
			|	"""" КАК ИдентификаторУзла,
			|	Т.УзелПервогоУровня_АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
			|	Т.АналитикаУчетаВыходноеИзделие КАК АналитикаУчетаВыходноеИзделие,
			|	Т.АналитикаУчетаЗатрата КАК АналитикаУчетаЗатрата,
			|	Т.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартий,
			|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
			|	Т.АналитикаУчетаПартийВыходноеИзделие КАК АналитикаУчетаПартийВыходноеИзделие,
			|	Т.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартийЗатрата,
			|	Т.Организация КАК Организация,
			|	Т.Подразделение КАК Подразделение,
			|	Т.ТипЗатрат КАК ТипЗатрат,
			|	МАКСИМУМ(Т.ТребуетсяРазузлование) КАК ТребуетсяРазузлование,
			|	МАКСИМУМ(Т.ТребуетсяРазузлованиеДопРасходов) КАК ТребуетсяРазузлованиеДопРасходов,
			|	Т.ЕдиницаИзмеренияЗатрата КАК ЕдиницаИзмерения,
			|	Т.Затрата КАК Номенклатура,
			|	Т.ХарактеристикаЗатрата КАК Характеристика,
			|	Т.СерияЗатрата КАК Серия,
			|	Т.НазначениеЗатрата КАК Назначение,
			|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
			|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
			|	ВЫРАЗИТЬ(&УровеньУзла КАК ЧИСЛО(15, 0)) КАК Уровень,
			|	Т.ПартияЗатрата КАК Партия,
			|	Т.УзелПервогоУровня_ПартияПродукции КАК ПартияПродукции,
			|	Т.ПартияВыходноеИзделие КАК ПартияВыходноеИзделие,
			|	Т.ПартияЗатрата КАК ПартияЗатрата,
			|	
			|	ВЫРАЗИТЬ(СУММА(Т.КоличествоЗатрата) КАК ЧИСЛО(19,6)) КАК Количество,
			|	ВЫРАЗИТЬ(ВЫБОР КОГДА МАКСИМУМ(Т.ТребуетсяРазузлование)
			|		ТОГДА СУММА(Т.КоличествоЗатрата)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЧИСЛО(19,6)) КАК Числитель,
			|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(19,6)) КАК Знаменатель,
			|	ВЫРАЗИТЬ(СУММА(Т.СуммаЗатрата) КАК ЧИСЛО(19,6)) КАК Сумма,
			|	ВЫРАЗИТЬ(СУММА(Т.СуммаЗатратаЗабалансовая) КАК ЧИСЛО(19,6)) КАК СуммаЗабалансовая,
			|	ВЫРАЗИТЬ(СУММА(Т.Материальные) КАК ЧИСЛО(19,6)) КАК Материальные,
			|	ВЫРАЗИТЬ(СУММА(Т.Трудозатраты) КАК ЧИСЛО(19,6)) КАК Трудозатраты,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянные) КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянные,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременные) КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременные,
			|	ВЫРАЗИТЬ(СУММА(Т.ДопРасходы) КАК ЧИСЛО(19,6)) КАК ДопРасходы,
			|	ВЫРАЗИТЬ(СУММА(Т.НДД) КАК ЧИСЛО(19,6)) КАК НДД,
			|	ВЫРАЗИТЬ(СУММА(Т.МатериальныеСНДС) КАК ЧИСЛО(19,6)) КАК МатериальныеСНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ТрудозатратыСНДС) КАК ЧИСЛО(19,6)) КАК ТрудозатратыСНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеСНДС) КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеСНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеСНДС) КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеСНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ДопРасходыСНДС) КАК ЧИСЛО(19,6)) КАК ДопРасходыСНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.МатериальныеБезНДС) КАК ЧИСЛО(19,6)) КАК МатериальныеБезНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеБезНДС) КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеБезНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеБезНДС) КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеБезНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.ДопРасходыБезНДС) КАК ЧИСЛО(19,6)) КАК ДопРасходыБезНДС,
			|	ВЫРАЗИТЬ(СУММА(Т.МатериальныеУпр) КАК ЧИСЛО(19,6)) КАК МатериальныеУпр,
			|	ВЫРАЗИТЬ(СУММА(Т.ТрудозатратыУпр) КАК ЧИСЛО(19,6)) КАК ТрудозатратыУпр,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеУпр) КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеУпр,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеУпр) КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеУпр,
			|	ВЫРАЗИТЬ(СУММА(Т.ДопРасходыУпр) КАК ЧИСЛО(19,6)) КАК ДопРасходыУпр,
			|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьЗабалансоваяУпр) КАК ЧИСЛО(19,6)) КАК СтоимостьЗабалансоваяУпр,
			|	ВЫРАЗИТЬ(СУММА(Т.МатериальныеРегл) КАК ЧИСЛО(19,6)) КАК МатериальныеРегл,
			|	ВЫРАЗИТЬ(СУММА(Т.ТрудозатратыРегл) КАК ЧИСЛО(19,6)) КАК ТрудозатратыРегл,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеРегл) КАК ЧИСЛО(19,6)) КАК ПостатейныеПостоянныеРегл,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеРегл) КАК ЧИСЛО(19,6)) КАК ПостатейныеПеременныеРегл,
			|	ВЫРАЗИТЬ(СУММА(Т.ДопРасходыРегл) КАК ЧИСЛО(19,6)) КАК ДопРасходыРегл,
			|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьЗабалансоваяРегл) КАК ЧИСЛО(19,6)) КАК СтоимостьЗабалансоваяРегл,
			|	ВЫРАЗИТЬ(СУММА(Т.НалоговыйУчет) КАК ЧИСЛО(19,6)) КАК НалоговыйУчет,
			|	ВЫРАЗИТЬ(СУММА(Т.ПостояннаяРазница) КАК ЧИСЛО(19,6)) КАК ПостояннаяРазница,
			|	ВЫРАЗИТЬ(СУММА(Т.ВременнаяРазница) КАК ЧИСЛО(19,6)) КАК ВременнаяРазница,
			|	ВЫРАЗИТЬ(СУММА(Т.СуммаВключениеИсключениеНДСВСтоимости) КАК ЧИСЛО(19,6)) КАК СуммаВключениеИсключениеНДСВСтоимости
			|
			|ДОБАВИТЬ ПредварительныйРезультат2
			|
			|ИЗ РезультатыРазузлования КАК Т
			|
			|ГДЕ
			|	&УсловиеОтбора
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР КОГДА Т.ТребуетсяРазузлование
			|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияПолуфабриката)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСтрокДереваСебестоимости.ПартияЗатраты)
			|	КОНЕЦ, // ВидСтроки
			|	Т.Организация,
			|	Т.Подразделение,
			|	Т.УзелПервогоУровня_АналитикаУчетаПродукции,
			|	Т.УзелПервогоУровня_АналитикаУчетаПартийПродукции,
			|	Т.УзелПервогоУровня_ПартияПродукции,
			|	Т.АналитикаУчетаВыходноеИзделие,
			|	Т.АналитикаУчетаПартийВыходноеИзделие,
			|	Т.ПартияВыходноеИзделие,
			|	Т.АналитикаУчетаПартийЗатрата,
			|	Т.ПартияЗатрата,
			|	Т.Затрата,
			|	Т.ХарактеристикаЗатрата,
			|	Т.СтатьяКалькуляции,
			|	Т.ЕдиницаИзмеренияЗатрата,
			|
			|	Т.СерияЗатрата,
			|	Т.НазначениеЗатрата,
			|	Т.АналитикаУчетаЗатрата,
			|	Т.ТипЗатрат
			|";
	КонецЕсли;
	
	Если ЗапросДляОтбора Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора",
			"Т.ТребуетсяРазузлование ИЛИ Т.ТребуетсяРазузлованиеДопРасходов"); //@Query-part
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДОБАВИТЬ ПредварительныйРезультат2", ""); //@Query-part
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора",
			"&ДобавлятьПолуфабрикатыВРезультат ИЛИ НЕ Т.ТребуетсяРазузлование"); //@Query-part
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

#Область ЗапросПоВыпущеннойПродукции

Функция ШаблонЗапросаВыпущеннойПродукции(ЕстьОтборПоТаблицеОтбораУзлов, ПомещатьВВТ, ПараметрыДерева)
	
	ТекстыЗапросов = Новый Массив();
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СебестоимостьТоваров.Организация				КАК Организация,
		|	СебестоимостьТоваров.Партия						КАК ПартияПродукции,
		|	СебестоимостьТоваров.АналитикаУчетаПартий		КАК АналитикаУчетаПартийПродукции,
		|	СУММА(СебестоимостьТоваров.Количество)			КАК Числитель
		|ПОМЕСТИТЬ ТаблицаОтборов
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|ГДЕ
		|	&РасшифровкаДвиженийДокумента
		|	И СебестоимостьТоваров.РазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранениеКОформлениюСписания),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранениеПереданныеПартнерам),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику))
		|	И НЕ СебестоимостьТоваров.Партия = НЕОПРЕДЕЛЕНО
		|	И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И СебестоимостьТоваров.Регистратор В (&Регистраторы)
		|	И (СебестоимостьТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|{ГДЕ
		|	СебестоимостьТоваров.Организация.*	КАК Организация,
		|	СебестоимостьТоваров.Партия.*		КАК ПартияПродукции
		|}
		|СГРУППИРОВАТЬ ПО
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.АналитикаУчетаПартий
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ПартияПродукции,
		|	АналитикаУчетаПартийПродукции
		|";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	#Область СебестоимостьТоваров
	
	УсловиеОтбораПоТаблицеОтбора = "НЕ СебестоимостьТоваров.Партия = НЕОПРЕДЕЛЕНО";
	Если ЕстьОтборПоТаблицеОтбораУзлов Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ПартияПродукции КАК ПартияПродукции
		|
		|ПОМЕСТИТЬ ОтборПоПродукцииИПартии
		|ИЗ ТаблицаОтборовУзлов КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПартияПродукции
		|";
		
		УсловиеОтбораПоТаблицеОтбора = "
		|ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
		|		ИЗ ОтборПоПродукцииИПартии КАК ОтборПоПродукцииИПартии
		|		ГДЕ СебестоимостьТоваров.Партия = ОтборПоПродукцииИПартии.ПартияПродукции
		|)
		|";
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СебестоимостьТоваров.Период КАК Период,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.РазделУчета КАК РазделУчета,
		|	СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
		|	СебестоимостьТоваров.Организация КАК Организация,
		|	СебестоимостьТоваров.Партия КАК Партия,
		|	СебестоимостьТоваров.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	СебестоимостьТоваров.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	СебестоимостьТоваров.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	
		|	СебестоимостьТоваров.Количество КАК Количество,
		|	СебестоимостьТоваров.Стоимость КАК Стоимость,
		|	СебестоимостьТоваров.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	СебестоимостьТоваров.СтоимостьУпр КАК СтоимостьУпр,
		|	СебестоимостьТоваров.СтоимостьРегл КАК СтоимостьРегл,
		|	СебестоимостьТоваров.Трудозатраты КАК Трудозатраты,
		|	СебестоимостьТоваров.ТрудозатратыУпр КАК ТрудозатратыУпр,
		|	СебестоимостьТоваров.ТрудозатратыРегл КАК ТрудозатратыРегл,
		|	СебестоимостьТоваров.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
		|	СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
		|	СебестоимостьТоваров.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
		|	СебестоимостьТоваров.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
		|	СебестоимостьТоваров.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
		|	СебестоимостьТоваров.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
		|	СебестоимостьТоваров.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр, 
		|	СебестоимостьТоваров.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
		|	СебестоимостьТоваров.ДопРасходы КАК ДопРасходы,
		|	СебестоимостьТоваров.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
		|	СебестоимостьТоваров.ДопРасходыУпр КАК ДопРасходыУпр,
		|	СебестоимостьТоваров.ДопРасходыРегл КАК ДопРасходыРегл,
		|	СебестоимостьТоваров.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
		|	СебестоимостьТоваров.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
		|	СебестоимостьТоваров.СтоимостьНДД КАК СтоимостьНДД,
		|	СебестоимостьТоваров.ПостояннаяРазница КАК ПостояннаяРазница,
		|	СебестоимостьТоваров.ВременнаяРазница КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ВТСебестоимостьТоваров
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|ГДЕ
		|	&УсловиеОтбораПоТаблицеОтбора
		|	И СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|	И СебестоимостьТоваров.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
		|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
		|
		|	И СебестоимостьТоваров.РазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ВыпускПродукции),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранениеКОформлениюСписания),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранениеПереданныеПартнерам),
		|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику))
		|	И &РасшифровкаДвиженийДокумента
		|{ГДЕ
		|	СебестоимостьТоваров.Организация.*		КАК Организация,
		|	СебестоимостьТоваров.Партия.*			КАК ПартияПродукции
		|}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"И &РасшифровкаДвиженийДокумента",
		?(ПараметрыДерева.ПараметрыОтчета.РасшифровкаДвиженийДокумента,
			"",
			"И (СебестоимостьТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))")); //@Query-part

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоТаблицеОтбора", УсловиеОтбораПоТаблицеОтбора);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
		
	//++ Устарело_Переработка24
	#Область РаботыДавальца
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ТаблицаОтборовУзлов.ИдентификаторУзла КАК ИдентификаторУзла,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.РазделУчета,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
		|	СебестоимостьТоваров.ВидДеятельностиНДС,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры
		|ПОМЕСТИТЬ РаботыДавальца
		|ИЗ
		|	ВТСебестоимостьТоваров КАК СебестоимостьТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|		ПО КлючиАналитики.Ссылка = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СпрПодразделения
		|		ПО ВЫБОР
		|				КОГДА КлючиАналитики.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
		|					ТОГДА КлючиАналитики.СкладскаяТерритория.Подразделение
		|				ИНАЧЕ КлючиАналитики.МестоХранения
		|			КОНЕЦ = СпрПодразделения.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
		|			ПО (&УсловияСоединения_ТаблицаОтборовУзлов)
		|		
		|ГДЕ
		|	НЕ &РасшифровкаДвиженийДокумента
		|	И СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|	И СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|	И (СебестоимостьТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|{ГДЕ
		|	СебестоимостьТоваров.Организация.*		КАК Организация,
		|	СпрПодразделения.Ссылка.*				КАК Подразделение,
		|	КлючиАналитики.Номенклатура.*			КАК Продукция,
		|	СебестоимостьТоваров.Партия.*			КАК ПартияПродукции,
		|	КлючиАналитики.Характеристика.*			КАК ХарактеристикаПродукции,
		|	КлючиАналитики.Серия.*					КАК СерияПродукции,
		|	КлючиАналитики.Назначение.*				КАК НазначениеПродукции
		|}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаОтборовУзлов.ИдентификаторУзла КАК ИдентификаторУзла,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СебестоимостьТоваров.РазделУчета,
		|	СебестоимостьТоваров.ВидЗапасов,
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
		|	СебестоимостьТоваров.ВидДеятельностиНДС,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры
		|ИЗ
		|	ТаблицаОтборов КАК ТаблицаОтборов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимостьТоваров КАК СебестоимостьТоваров
		|			ПО ТаблицаОтборов.Организация = СебестоимостьТоваров.Организация
		|			И ТаблицаОтборов.ПартияПродукции = СебестоимостьТоваров.Партия
		|			И ТаблицаОтборов.АналитикаУчетаПартийПродукции = СебестоимостьТоваров.АналитикаУчетаПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|			ПО КлючиАналитики.Ссылка = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СпрПодразделения
		|		ПО ВЫБОР
		|				КОГДА КлючиАналитики.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
		|					ТОГДА КлючиАналитики.СкладскаяТерритория.Подразделение
		|				ИНАЧЕ КлючиАналитики.МестоХранения
		|			КОНЕЦ = СпрПодразделения.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
		|			ПО (&УсловияСоединения_ТаблицаОтборовУзлов)
		|			
		|ГДЕ
		|	&РасшифровкаДвиженийДокумента
		|	И СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|	И СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|	И (СебестоимостьТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|{ГДЕ
		|	СебестоимостьТоваров.Организация.*		КАК Организация,
		|	СпрПодразделения.Ссылка.*				КАК Подразделение,
		|	КлючиАналитики.Номенклатура.*			КАК Продукция,
		|	СебестоимостьТоваров.Партия.*			КАК ПартияПродукции,
		|	КлючиАналитики.Характеристика.*			КАК ХарактеристикаПродукции,
		|	КлючиАналитики.Серия.*					КАК СерияПродукции,
		|	КлючиАналитики.Назначение.*				КАК НазначениеПродукции
		|}
		|
		|";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	//-- Устарело_Переработка24
	
	#Область ВтПродукция
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаОтборовУзлов.ИдентификаторУзла КАК ИдентификаторУзла,
		|	МАКСИМУМ(СебестоимостьТоваров.Период)					КАК ДатаВыпускаПродукции,
		|	СебестоимостьТоваров.Организация						КАК Организация,
		|	СебестоимостьТоваров.Партия								КАК ПартияПродукции,
		|	СебестоимостьТоваров.АналитикаУчетаПартий				КАК АналитикаУчетаПартийПродукции,
		|	ВЫБОР
		//++ Устарело_Переработка24
		|		КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|			ТОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры
		//-- Устарело_Переработка24
		|		КОГДА ИСТИНА
		|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|	КОНЕЦ													КАК АналитикаУчетаПродукции,
		|	КлючиАналитики.Номенклатура								КАК Продукция,
		|	КлючиАналитики.Характеристика							КАК ХарактеристикаПродукции,
		|	КлючиАналитики.Серия									КАК СерияПродукции,
		|	КлючиАналитики.Назначение								КАК НазначениеПродукции,
		|	СпрПодразделения.Ссылка									КАК Подразделение,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ЕСТЬNULL(ТаблицаОтборовУзлов.Числитель, 0)) = 0
		|			ТОГДА СУММА(
		|					ВЫБОР
								//++ Устарело_Переработка24
		|						КОГДА НЕ РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ NULL
		|							ТОГДА 0
								//-- Устарело_Переработка24
		|						КОГДА ИСТИНА
		|							ТОГДА СебестоимостьТоваров.Количество
		|					КОНЕЦ)
		|			ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ТаблицаОтборовУзлов.Числитель, 0))
		|		КОНЕЦ												КАК Числитель,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ЕСТЬNULL(ТаблицаОтборовУзлов.Знаменатель, 0)) = 0
		|			ТОГДА СУММА(
		|					ВЫБОР
								//++ Устарело_Переработка24
		|						КОГДА НЕ РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ NULL
		|							ТОГДА 0
								//-- Устарело_Переработка24
		|						КОГДА ИСТИНА
		|							ТОГДА СебестоимостьТоваров.Количество
		|					КОНЕЦ)
		|			ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(ТаблицаОтборовУзлов.Знаменатель, 0))
		|		КОНЕЦ												КАК Знаменатель,
		|	СУММА(
		|		ВЫБОР
					//++ Устарело_Переработка24
		|			КОГДА НЕ РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ NULL
		|				ТОГДА 0
					//-- Устарело_Переработка24
		|			КОГДА ИСТИНА
		|				ТОГДА СебестоимостьТоваров.Количество
		|		КОНЕЦ)					КАК КоличествоПродукция,
		|
		// Стоимости согласно параметру "ДанныеПоСебестоимости"
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаПродукцияЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|					+ СебестоимостьТоваров.Трудозатраты
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|					+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|					+ СебестоимостьТоваров.Трудозатраты
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|					+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|					+ СебестоимостьТоваров.ТрудозатратыУпр
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|					+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|					+ СебестоимостьТоваров.ТрудозатратыРегл
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|					+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаПродукция,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|	
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|
		|ПОМЕСТИТЬ ВтПродукция
		|ИЗ
		|	ВТСебестоимостьТоваров КАК СебестоимостьТоваров
		|	
			//++ Устарело_Переработка24
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК ОтчетыПереработчика
		|		ПО ОтчетыПереработчика.Ссылка = СебестоимостьТоваров.Партия
			//-- Устарело_Переработка24
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5 КАК ОтчетыПереработчика2_5
		|		ПО ОтчетыПереработчика2_5.Ссылка = СебестоимостьТоваров.Партия
		|	
			//++ Устарело_Переработка24
		|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДавальца КАК РаботыДавальца
		|	ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = РаботыДавальца.АналитикаУчетаНоменклатуры
		|		И СебестоимостьТоваров.РазделУчета = РаботыДавальца.РазделУчета
		|		И СебестоимостьТоваров.ВидЗапасов = РаботыДавальца.ВидЗапасов
		|		И СебестоимостьТоваров.Организация = РаботыДавальца.Организация
		|		И СебестоимостьТоваров.Партия = РаботыДавальца.Партия
		|		И СебестоимостьТоваров.АналитикаУчетаПартий = РаботыДавальца.АналитикаУчетаПартий
		|		И СебестоимостьТоваров.АналитикаФинансовогоУчета = РаботыДавальца.АналитикаФинансовогоУчета
		|		И СебестоимостьТоваров.ВидДеятельностиНДС = РаботыДавальца.ВидДеятельностиНДС
			//-- Устарело_Переработка24
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|		ПО КлючиАналитики.Ссылка =
		|				ВЫБОР
							//++ Устарело_Переработка24
		|					КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|						ТОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры
							//-- Устарело_Переработка24
		|					КОГДА ИСТИНА
		|						ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|				КОНЕЦ
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СпрПодразделения
		|		ПО ВЫБОР
					//++ Устарело_Переработка24
		|			КОГДА ОтчетыПереработчика.Ссылка ЕСТЬ НЕ NULL
		|				ТОГДА ОтчетыПереработчика.Подразделение
					//-- Устарело_Переработка24
		|			КОГДА ОтчетыПереработчика2_5.Ссылка ЕСТЬ НЕ NULL
		|				ТОГДА ОтчетыПереработчика2_5.Подразделение
		|			КОГДА КлючиАналитики.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
		|				ТОГДА КлючиАналитики.СкладскаяТерритория.Подразделение
		|			ИНАЧЕ КлючиАналитики.МестоХранения
		|		КОНЕЦ = СпрПодразделения.Ссылка
		|		
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
		|		ПО (&УсловияСоединения_ТаблицаОтборовУзлов)
		|		
		|ГДЕ
		|	НЕ &РасшифровкаДвиженийДокумента
		|	И (СебестоимостьТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|
		|{ГДЕ
		|	СебестоимостьТоваров.Организация.*		КАК Организация,
		|	СпрПодразделения.Ссылка.*				КАК Подразделение,
		|	КлючиАналитики.Номенклатура.*			КАК Продукция,
		|	СебестоимостьТоваров.Партия.*			КАК ПартияПродукции,
		|	КлючиАналитики.Характеристика.*			КАК ХарактеристикаПродукции,
		|	КлючиАналитики.Серия.*					КАК СерияПродукции,
		|	КлючиАналитики.Назначение.*				КАК НазначениеПродукции
		|}
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОтборовУзлов.ИдентификаторУзла,
		|	СебестоимостьТоваров.Организация,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.АналитикаУчетаПартий,
		|	ВЫБОР
		//++ Устарело_Переработка24
		|		КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|			ТОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры
		//-- Устарело_Переработка24
		|		КОГДА ИСТИНА
		|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|	КОНЕЦ,
		|	КлючиАналитики.Номенклатура,
		|	КлючиАналитики.Характеристика,
		|	КлючиАналитики.Серия,
		|	КлючиАналитики.Назначение,
		|	СпрПодразделения.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаОтборовУзлов.ИдентификаторУзла КАК ИдентификаторУзла,
		|	МАКСИМУМ(СебестоимостьТоваров.Период)					КАК ДатаВыпускаПродукции,
		|	ТаблицаОтборов.Организация								КАК Организация,
		|	ТаблицаОтборов.ПартияПродукции							КАК ПартияПродукции,
		|	ТаблицаОтборов.АналитикаУчетаПартийПродукции			КАК АналитикаУчетаПартийПродукции,
		|	ВЫБОР
		//++ Устарело_Переработка24
		|		КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|			ТОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры
		//-- Устарело_Переработка24
		|		КОГДА ИСТИНА
		|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|	КОНЕЦ													КАК АналитикаУчетаПродукции,
		|	КлючиАналитики.Номенклатура								КАК Продукция,
		|	КлючиАналитики.Характеристика							КАК ХарактеристикаПродукции,
		|	КлючиАналитики.Серия									КАК СерияПродукции,
		|	КлючиАналитики.Назначение								КАК НазначениеПродукции,
		|	СпрПодразделения.Ссылка									КАК Подразделение,
		|	МАКСИМУМ(ТаблицаОтборов.Числитель)						КАК Числитель,
		|	СУММА(
		|		ВЫБОР
		//++ Устарело_Переработка24
		|			КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|				ТОГДА 0
		//-- Устарело_Переработка24
		|			КОГДА ИСТИНА
		|				ТОГДА СебестоимостьТоваров.Количество
		|		КОНЕЦ)												КАК Знаменатель,
		|	МАКСИМУМ(ТаблицаОтборов.Числитель)						КАК КоличествоПродукция,
		|
		// Стоимости согласно параметру "ДанныеПоСебестоимости"
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ)												КАК Материальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.Трудозатраты
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
		|		КОНЕЦ)												КАК Трудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		КОНЕЦ)												КАК ПостатейныеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК ДопРасходы,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансовая
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|		КОНЕЦ)												КАК СуммаПродукцияЗабалансовая,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|					+ СебестоимостьТоваров.Трудозатраты
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеСНДС
		|					+ СебестоимостьТоваров.ДопРасходы
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|					+ СебестоимостьТоваров.Трудозатраты
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
		|					+ СебестоимостьТоваров.ДопРасходыБезНДС
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьУпр
		|					+ СебестоимостьТоваров.ТрудозатратыУпр
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеУпр
		|					+ СебестоимостьТоваров.ДопРасходыУпр
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьРегл
		|					+ СебестоимостьТоваров.ТрудозатратыРегл
		|					+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|					+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|					+ СебестоимостьТоваров.ДопРасходыРегл
		|		КОНЕЦ)												КАК СуммаПродукция,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 4
		|				ТОГДА СебестоимостьТоваров.СтоимостьНДД
		|			ИНАЧЕ 0
		|		КОНЕЦ)												КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(СебестоимостьТоваров.Стоимость)					КАК МатериальныеСНДС,
		|	СУММА(СебестоимостьТоваров.Трудозатраты)				КАК ТрудозатратыСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеСНДС)	КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеСНДС)	КАК ПостатейныеПеременныеСНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходы)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(СебестоимостьТоваров.СтоимостьБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС)	КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеБезНДС)	КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(СебестоимостьТоваров.ДопРасходыБезНДС)			КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(СебестоимостьТоваров.СтоимостьУпр)				КАК МатериальныеУпр,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыУпр)				КАК ТрудозатратыУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеУпр)	КАК ПостатейныеПостоянныеУпр,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеУпр)	КАК ПостатейныеПеременныеУпр,
		|	СУММА(СебестоимостьТоваров.ДопРасходыУпр)				КАК ДопРасходыУпр,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансовая)		КАК СтоимостьЗабалансоваяУпр,
		|
		// Стоимости Регл
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл)				КАК МатериальныеРегл,
		|	СУММА(СебестоимостьТоваров.ТрудозатратыРегл)			КАК ТрудозатратыРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПостоянныеРегл)	КАК ПостатейныеПостоянныеРегл,
		|	СУММА(СебестоимостьТоваров.ПостатейныеПеременныеРегл)	КАК ПостатейныеПеременныеРегл,
		|	СУММА(СебестоимостьТоваров.ДопРасходыРегл)				КАК ДопРасходыРегл,
		|	СУММА(СебестоимостьТоваров.СтоимостьЗабалансоваяРегл)	КАК СтоимостьЗабалансоваяРегл,
		|	
		// Налоговый учет
		|	СУММА(СебестоимостьТоваров.СтоимостьРегл
		|		+ СебестоимостьТоваров.ДопРасходыРегл
		|		+ СебестоимостьТоваров.ТрудозатратыРегл
		|		+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
		|		+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
		|		- СебестоимостьТоваров.ПостояннаяРазница
		|		- СебестоимостьТоваров.ВременнаяРазница)			КАК НалоговыйУчет,
		|	СУММА(СебестоимостьТоваров.ПостояннаяРазница)			КАК ПостояннаяРазница,
		|	СУММА(СебестоимостьТоваров.ВременнаяРазница)			КАК ВременнаяРазница
		|ИЗ
		|	ТаблицаОтборов КАК ТаблицаОтборов
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимостьТоваров КАК СебестоимостьТоваров
		|		ПО ТаблицаОтборов.ПартияПродукции = СебестоимостьТоваров.Партия
		|		И ТаблицаОтборов.АналитикаУчетаПартийПродукции = СебестоимостьТоваров.АналитикаУчетаПартий
		|		И (СебестоимостьТоваров.Период <= &ДатаОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1,1,1))
		|		
			//++ Устарело_Переработка24
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК ОтчетыПереработчика
		|		ПО ОтчетыПереработчика.Ссылка = СебестоимостьТоваров.Партия
			//-- Устарело_Переработка24
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5 КАК ОтчетыПереработчика2_5
		|		ПО ОтчетыПереработчика2_5.Ссылка = СебестоимостьТоваров.Партия
		|	
			//++ Устарело_Переработка24
		|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДавальца КАК РаботыДавальца
		|	ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = РаботыДавальца.АналитикаУчетаНоменклатуры
		|		И СебестоимостьТоваров.РазделУчета = РаботыДавальца.РазделУчета
		|		И СебестоимостьТоваров.ВидЗапасов = РаботыДавальца.ВидЗапасов
		|		И СебестоимостьТоваров.Организация = РаботыДавальца.Организация
		|		И СебестоимостьТоваров.Партия = РаботыДавальца.Партия
		|		И СебестоимостьТоваров.АналитикаУчетаПартий = РаботыДавальца.АналитикаУчетаПартий
		|		И СебестоимостьТоваров.АналитикаФинансовогоУчета = РаботыДавальца.АналитикаФинансовогоУчета
		|		И СебестоимостьТоваров.ВидДеятельностиНДС = РаботыДавальца.ВидДеятельностиНДС
			//-- Устарело_Переработка24
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|		ПО КлючиАналитики.Ссылка = 
		|				ВЫБОР
							//++ Устарело_Переработка24
		|					КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|						ТОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры
							//-- Устарело_Переработка24
		|					КОГДА ИСТИНА
		|						ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|				КОНЕЦ
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СпрПодразделения
		|		ПО ВЫБОР
					//++ Устарело_Переработка24
		|			КОГДА ОтчетыПереработчика.Ссылка ЕСТЬ НЕ NULL
		|				ТОГДА ОтчетыПереработчика.Подразделение
					//-- Устарело_Переработка24
		|			КОГДА ОтчетыПереработчика2_5.Ссылка ЕСТЬ НЕ NULL
		|				ТОГДА ОтчетыПереработчика2_5.Подразделение
		|			КОГДА КлючиАналитики.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
		|				ТОГДА КлючиАналитики.СкладскаяТерритория.Подразделение
		|			ИНАЧЕ КлючиАналитики.МестоХранения
		|		КОНЕЦ = СпрПодразделения.Ссылка
		|		
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
		|		ПО (&УсловияСоединения_ТаблицаОтборовУзлов)
		|	
		|ГДЕ
		|	&РасшифровкаДвиженийДокумента
		|
		|{ГДЕ
		|	СпрПодразделения.Ссылка.*				КАК Подразделение,
		|	КлючиАналитики.Номенклатура.*			КАК Продукция,
		|	КлючиАналитики.Характеристика.*			КАК ХарактеристикаПродукции,
		|	КлючиАналитики.Серия.*					КАК СерияПродукции,
		|	КлючиАналитики.Назначение.*				КАК НазначениеПродукции
		|}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОтборовУзлов.ИдентификаторУзла,
		|	ТаблицаОтборов.Организация,
		|	ТаблицаОтборов.ПартияПродукции,
		|	ТаблицаОтборов.АналитикаУчетаПартийПродукции,
		|	ВЫБОР
		//++ Устарело_Переработка24
		|		КОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры ЕСТЬ НЕ NULL
		|			ТОГДА РаботыДавальца.КорАналитикаУчетаНоменклатуры
		//-- Устарело_Переработка24
		|		КОГДА ИСТИНА
		|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры
		|	КОНЕЦ,
		|	КлючиАналитики.Номенклатура,
		|	КлючиАналитики.Характеристика,
		|	КлючиАналитики.Серия,
		|	КлючиАналитики.Назначение,
		|	СпрПодразделения.Ссылка
		|";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
		#КонецОбласти
		
	#Область ИтогВыпущеннаяПродукция
		
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВтПродукция.ИдентификаторУзла КАК ИдентификаторУзла,
		|	МАКСИМУМ(ВтПродукция.ДатаВыпускаПродукции) КАК ДатаВыпускаПродукции,
		|	ВтПродукция.Организация						КАК Организация,
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ВтПродукция.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ КАК Валюта,
		|	ВтПродукция.ПартияПродукции					КАК ПартияПродукции,
		|	ВтПродукция.АналитикаУчетаПартийПродукции	КАК АналитикаУчетаПартийПродукции,
		|	ВтПродукция.АналитикаУчетаПродукции			КАК АналитикаУчетаПродукции,
		|	ВтПродукция.Продукция						КАК Продукция,
		|	СпрНоменклатура.Наименование				КАК ПродукцияПредставление,
		|	ВтПродукция.ХарактеристикаПродукции			КАК ХарактеристикаПродукции,
		|	СпрХарактеристики.Наименование				КАК ХарактеристикаПродукцииПредставление,
		|	ВтПродукция.СерияПродукции					КАК СерияПродукции,
		|	СпрСерии.Наименование						КАК СерияПродукцииПредставление,
		|	ВтПродукция.НазначениеПродукции				КАК НазначениеПродукции,
		|	СпрНазначения.Наименование					КАК НазначениеПродукцииПредставление,
		|	СпрНоменклатура.ЕдиницаИзмерения			КАК ЕдиницаИзмеренияПродукция,
		|	ВтПродукция.Подразделение					КАК Подразделение,
		|	ВЫБОР
		|		КОГДА АналитикиУчетаПартий.КодСтроки = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ										КАК ТребуетсяРазузлование,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ВтПродукция.Числитель) = 0
		|			ТОГДА 1
		|		ИНАЧЕ МАКСИМУМ(ВтПродукция.Числитель)
		|	КОНЕЦ										КАК Числитель,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ВтПродукция.Знаменатель) = 0
		|			ТОГДА 1
		|		ИНАЧЕ МАКСИМУМ(ВтПродукция.Знаменатель)
		|	КОНЕЦ										КАК Знаменатель,
		|
		// Стоимости согласно параметру "ДанныеПоСебестоимости"
		|	СУММА(ВтПродукция.КоличествоПродукция)		КАК КоличествоПродукция,
		|	СУММА(ВтПродукция.Материальные)				КАК Материальные,
		|	СУММА(ВтПродукция.Трудозатраты)				КАК Трудозатраты,
		|	СУММА(ВтПродукция.ПостатейныеПостоянные)	КАК ПостатейныеПостоянные,
		|	СУММА(ВтПродукция.ПостатейныеПеременные)	КАК ПостатейныеПеременные,
		|	СУММА(ВтПродукция.ДопРасходы)				КАК ДопРасходы,
		|	СУММА(ВтПродукция.СуммаПродукцияЗабалансовая) КАК СуммаПродукцияЗабалансовая,
		|	СУММА(ВтПродукция.СуммаПродукция)			КАК СуммаПродукция,
		|	СУММА(ВтПродукция.НДД)						КАК НДД,
		|
		// Стоимости с НДС
		|	СУММА(ВтПродукция.МатериальныеСНДС)					КАК МатериальныеСНДС,
		|	СУММА(ВтПродукция.ТрудозатратыСНДС)					КАК ТрудозатратыСНДС,
		|	СУММА(ВтПродукция.ПостатейныеПостоянныеСНДС)		КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(ВтПродукция.ПостатейныеПеременныеСНДС)		КАК ПостатейныеПеременныеСНДС,
		|	СУММА(ВтПродукция.ДопРасходыСНДС)					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	СУММА(ВтПродукция.МатериальныеБезНДС)				КАК МатериальныеБезНДС,
		|	СУММА(ВтПродукция.ПостатейныеПостоянныеБезНДС)		КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(ВтПродукция.ПостатейныеПеременныеБезНДС)		КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(ВтПродукция.ДопРасходыБезНДС)					КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	СУММА(ВтПродукция.МатериальныеУпр)					КАК МатериальныеУпр,
		|	СУММА(ВтПродукция.ТрудозатратыУпр)					КАК ТрудозатратыУпр,
		|	СУММА(ВтПродукция.ПостатейныеПостоянныеУпр)			КАК ПостатейныеПостоянныеУпр,
		|	СУММА(ВтПродукция.ПостатейныеПеременныеУпр)			КАК ПостатейныеПеременныеУпр,
		|	СУММА(ВтПродукция.ДопРасходыУпр)					КАК ДопРасходыУпр,
		|	СУММА(ВтПродукция.СтоимостьЗабалансоваяУпр)			КАК СтоимостьЗабалансоваяУпр,
		|	
		// Стоимости Регл
		|	СУММА(ВтПродукция.МатериальныеРегл)					КАК МатериальныеРегл,
		|	СУММА(ВтПродукция.ТрудозатратыРегл)					КАК ТрудозатратыРегл,
		|	СУММА(ВтПродукция.ПостатейныеПостоянныеРегл)		КАК ПостатейныеПостоянныеРегл,
		|	СУММА(ВтПродукция.ПостатейныеПеременныеРегл)		КАК ПостатейныеПеременныеРегл,
		|	СУММА(ВтПродукция.ДопРасходыРегл)					КАК ДопРасходыРегл,
		|	СУММА(ВтПродукция.СтоимостьЗабалансоваяРегл)		КАК СтоимостьЗабалансоваяРегл,
		|	
		// Налоговый учет
		|	СУММА(ВтПродукция.НалоговыйУчет)					КАК НалоговыйУчет,
		|	СУММА(ВтПродукция.ПостояннаяРазница)				КАК ПостояннаяРазница,
		|	СУММА(ВтПродукция.ВременнаяРазница)					КАК ВременнаяРазница
		|	
		|ПОМЕСТИТЬ ИтогВыпущеннаяПродукция
		|ИЗ
		|	ВтПродукция КАК ВтПродукция
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВтПродукция.Продукция = СпрНоменклатура.Ссылка
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристики
		|		ПО ВтПродукция.ХарактеристикаПродукции = СпрХарактеристики.Ссылка
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СпрСерии
		|		ПО ВтПродукция.СерияПродукции = СпрСерии.Ссылка
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|		ПО ВтПродукция.НазначениеПродукции = СпрНазначения.Ссылка
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
		|		ПО ВтПродукция.АналитикаУчетаПартийПродукции = АналитикиУчетаПартий.КлючАналитики
		|	
		|СГРУППИРОВАТЬ ПО
		|	ВтПродукция.ИдентификаторУзла,
		|	ВтПродукция.Организация,
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ВтПродукция.Организация.ВалютаРегламентированногоУчета
		|		ИНАЧЕ &ВалютаУправленческогоУчета
		|	КОНЕЦ,
		|	ВтПродукция.ПартияПродукции,
		|	ВтПродукция.АналитикаУчетаПартийПродукции,
		|	ВтПродукция.АналитикаУчетаПродукции,
		|	ВтПродукция.Продукция,
		|	СпрНоменклатура.Наименование,
		|	ВтПродукция.ХарактеристикаПродукции,
		|	СпрХарактеристики.Наименование,
		|	ВтПродукция.СерияПродукции,
		|	СпрСерии.Наименование,
		|	ВтПродукция.НазначениеПродукции,
		|	СпрНазначения.Наименование,
		|	СпрНоменклатура.ЕдиницаИзмерения,
		|	АналитикиУчетаПартий.КодСтроки,
		|	ВтПродукция.Подразделение
		|";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
		
	#Область ВыпущеннаяПродукция
		
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВтПродукция.ИдентификаторУзла КАК ИдентификаторУзла,
		|	ТаблицаОтборовУзлов.ИдентификаторУзлаПервогоУровня	КАК ИдентификаторУзлаПервогоУровня,
		|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПродукции КАК УзелПервогоУровня_АналитикаУчетаПродукции,
		|	ТаблицаОтборовУзлов.УзелПервогоУровня_ПартияПродукции КАК УзелПервогоУровня_ПартияПродукции,
		|	ТаблицаОтборовУзлов.УзелПервогоУровня_АналитикаУчетаПартийПродукции КАК УзелПервогоУровня_АналитикаУчетаПартийПродукции,
		|	ЕСТЬNULL(ТаблицаОтборовУзлов.ДатаИсходнойПартии, ВтПродукция.ДатаВыпускаПродукции) КАК ДатаИсходнойПартии,
		|	ТаблицаОтборовУзлов.РазворачиватьДопРасходы КАК РазворачиватьДопРасходы,
		|	ТаблицаОтборовУзлов.ТребуетсяРазузлование КАК ТребуетсяРазузлованиеУзлаИсточника,
		|	ТаблицаОтборовУзлов.АналитикаУчетаЗатрат КАК АналитикаУчетаЗатрат,
		|	
		|	ВтПродукция.Организация							КАК Организация,
		|	ВтПродукция.Валюта								КАК Валюта,
		|	ВтПродукция.ПартияПродукции						КАК ПартияПродукции,
		|	ВтПродукция.АналитикаУчетаПартийПродукции		КАК АналитикаУчетаПартийПродукции,
		|	ВтПродукция.АналитикаУчетаПродукции				КАК АналитикаУчетаПродукции,
		|	ВтПродукция.Продукция							КАК Продукция,
		|	ВтПродукция.ПродукцияПредставление				КАК ПродукцияПредставление,
		|	ВтПродукция.ХарактеристикаПродукции				КАК ХарактеристикаПродукции,
		|	ВтПродукция.ХарактеристикаПродукцииПредставление КАК ХарактеристикаПродукцииПредставление,
		|	ВтПродукция.СерияПродукции						КАК СерияПродукции,
		|	ВтПродукция.СерияПродукцииПредставление			КАК СерияПродукцииПредставление,
		|	ВтПродукция.НазначениеПродукции					КАК НазначениеПродукции,
		|	ВтПродукция.НазначениеПродукцииПредставление	КАК НазначениеПродукцииПредставление,
		|	ВтПродукция.ЕдиницаИзмеренияПродукция			КАК ЕдиницаИзмеренияПродукция,
		|	ВтПродукция.Подразделение						КАК Подразделение,
		|	&ТипЗатратПродукция								КАК ТипЗатрат,
		|	ВтПродукция.ТребуетсяРазузлование				КАК ТребуетсяРазузлование,
		|	ВтПродукция.Числитель							КАК Числитель,
		|	ВтПродукция.Знаменатель							КАК Знаменатель,
		|	ВтПродукция.КоличествоПродукция					КАК КоличествоПродукция,
		|
		// Стоимости согласно параметру "ДанныеПоСебестоимости"
		|	ВтПродукция.Материальные
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК Материальные,
		|	ВтПродукция.Трудозатраты
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК Трудозатраты,
		|	ВтПродукция.ПостатейныеПостоянные
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПостоянные,
		|	ВтПродукция.ПостатейныеПеременные
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПеременные,
		|	ВтПродукция.ДопРасходы
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ДопРасходы,
		|	ВтПродукция.СуммаПродукцияЗабалансовая
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК СуммаПродукцияЗабалансовая,
		|	ВтПродукция.СуммаПродукция
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК СуммаПродукция,
		|	ВтПродукция.НДД
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК НДД,
		|
		// Стоимости с НДС
		|	ВтПродукция.МатериальныеСНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК МатериальныеСНДС,
		|	ВтПродукция.ТрудозатратыСНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ТрудозатратыСНДС,
		|	ВтПродукция.ПостатейныеПостоянныеСНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПостоянныеСНДС,
		|	ВтПродукция.ПостатейныеПеременныеСНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПеременныеСНДС,
		|	ВтПродукция.ДопРасходыСНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	ВтПродукция.МатериальныеБезНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК МатериальныеБезНДС,
		|	ВтПродукция.ПостатейныеПостоянныеБезНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПостоянныеБезНДС,
		|	ВтПродукция.ПостатейныеПеременныеБезНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПеременныеБезНДС,
		|	ВтПродукция.ДопРасходыБезНДС
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	ВтПродукция.МатериальныеУпр
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК МатериальныеУпр,
		|	ВтПродукция.ТрудозатратыУпр
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ТрудозатратыУпр,
		|	ВтПродукция.ПостатейныеПостоянныеУпр
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПостоянныеУпр,
		|	ВтПродукция.ПостатейныеПеременныеУпр
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПеременныеУпр,
		|	ВтПродукция.ДопРасходыУпр
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ДопРасходыУпр,
		|	ВтПродукция.СтоимостьЗабалансоваяУпр
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК СтоимостьЗабалансоваяУпр,
		|		
		// Стоимости Регл
		|	ВтПродукция.МатериальныеРегл
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК МатериальныеРегл,
		|	ВтПродукция.ТрудозатратыРегл
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ТрудозатратыРегл,
		|	ВтПродукция.ПостатейныеПостоянныеРегл
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПостоянныеРегл,
		|	ВтПродукция.ПостатейныеПеременныеРегл
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостатейныеПеременныеРегл,
		|	ВтПродукция.ДопРасходыРегл
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ДопРасходыРегл,
		|	ВтПродукция.СтоимостьЗабалансоваяРегл
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК СтоимостьЗабалансоваяРегл,
		|	ВтПродукция.НалоговыйУчет
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК НалоговыйУчет,
		|	ВтПродукция.ПостояннаяРазница
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ПостояннаяРазница,
		|	ВтПродукция.ВременнаяРазница
		|		* ВтПродукция.Числитель
		|		/ ВтПродукция.Знаменатель					КАК ВременнаяРазница
		|		
		|ПОМЕСТИТЬ ВыпущеннаяПродукция
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Валюта.*,
		|	ПартияПродукции.*,
		|	АналитикаУчетаПартийПродукции.*,
		|	АналитикаУчетаПродукции.*,
		|	Продукция.*,
		|	ПродукцияПредставление,
		|	ХарактеристикаПродукции.*,
		|	ХарактеристикаПродукцииПредставление,
		|	СерияПродукции.*,
		|	СерияПродукцииПредставление,
		|	НазначениеПродукции.*,
		|	НазначениеПродукцииПредставление,
		|	ЕдиницаИзмеренияПродукция.*,
		|	Подразделение.*,
		|	ТипЗатрат,
		|	ТребуетсяРазузлование,
		|	Числитель,
		|	Знаменатель,
		|	КоличествоПродукция,
		|
		// Стоимости согласно параметру "ДанныеПоСебестоимости"
		|	Материальные,
		|	Трудозатраты,
		|	ПостатейныеПостоянные,
		|	ПостатейныеПеременные,
		|	ДопРасходы,
		|	СуммаПродукцияЗабалансовая,
		|	СуммаПродукция,
		|	НДД,
		|
		// Стоимости с НДС
		|	МатериальныеСНДС,
		|	ТрудозатратыСНДС,
		|	ПостатейныеПостоянныеСНДС,
		|	ПостатейныеПеременныеСНДС,
		|	ДопРасходыСНДС,
		|
		// Стоимости без НДС
		|	МатериальныеБезНДС,
		|	ПостатейныеПостоянныеБезНДС,
		|	ПостатейныеПеременныеБезНДС,
		|	ДопРасходыБезНДС,
		|
		// Стоимости Упр
		|	МатериальныеУпр,
		|	ТрудозатратыУпр,
		|	ПостатейныеПостоянныеУпр,
		|	ПостатейныеПеременныеУпр,
		|	ДопРасходыУпр,
		|	СтоимостьЗабалансоваяУпр,
		|	
		// Стоимости Регл
		|	МатериальныеРегл,
		|	ТрудозатратыРегл,
		|	ПостатейныеПостоянныеРегл,
		|	ПостатейныеПеременныеРегл,
		|	ДопРасходыРегл,
		|	СтоимостьЗабалансоваяРегл,
		|	
		// Налоговый учет
		|	НалоговыйУчет,
		|	ПостояннаяРазница,
		|	ВременнаяРазница
		|}
		|ИЗ
		|	ИтогВыпущеннаяПродукция КАК ВтПродукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов
		|		ПО ВтПродукция.ИдентификаторУзла = ТаблицаОтборовУзлов.ИдентификаторУзла
		|";
		
	Если ПомещатьВВТ Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ИНДЕКСИРОВАТЬ ПО
		|	ПартияПродукции,
		|	АналитикаУчетаПродукции,
		|	АналитикаУчетаПартийПродукции,
		|	Организация,
		|	ИдентификаторУзла
		|" //@Query-part
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВыпущеннаяПродукция", "");
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	ВтПродукция.ПродукцияПредставление,
		|	ВтПродукция.ХарактеристикаПродукцииПредставление,
		|	ВтПродукция.СерияПродукцииПредставление,
		|	ВтПродукция.НазначениеПродукцииПредставление,
		|	ВтПродукция.ПартияПродукции
		|"; //@Query-part
		
	КонецЕсли;
	ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	#КонецОбласти
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросВыпущеннаяПродукция(ПомещатьВВТ, ПараметрыДерева)
	
	ЕстьОтборПоТаблицеОтбораУзлов = ПараметрыДерева.ПараметрыОтчета.КоличествоУзловОтбора > 0;
	 
	Если ПараметрыДерева.ИнтерактивнаяНастройка Тогда
		АдаптироватьЗапросСКД(ПараметрыДерева.СхемаКД, ЕстьОтборПоТаблицеОтбораУзлов, ПомещатьВВТ, ПараметрыДерева);
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(ПараметрыДерева.СхемаКД,
			ПараметрыДерева.НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		НаборДанных = МакетКомпоновки.НаборыДанных.Найти("ВыпущеннаяПродукция");
		ПараметрыЗапроса = МакетКомпоновки.ЗначенияПараметров;
		КлючПараметра = "Имя";
	Иначе
		НаборДанных = ПараметрыДерева.СхемаКД.НаборыДанных.Найти("ВыпущеннаяПродукция");
		НаборДанных.Запрос = ШаблонЗапросаВыпущеннойПродукции(ЕстьОтборПоТаблицеОтбораУзлов, ПомещатьВВТ, ПараметрыДерева);
		ПараметрыДерева.ПараметрыОтчета.РасшифровкаДвиженийДокумента = ПараметрыДерева.ПараметрыОтчета.Регистраторы.Количество() > 0;
		ПараметрыЗапроса = ПараметрыДерева.ПараметрыОтчета;
		КлючПараметра = "Ключ";
	КонецЕсли;
	
	ТекстЗапроса = НаборДанных.Запрос;

	Если ЕстьОтборПоТаблицеОтбораУзлов Тогда
		УсловияСоединенияМассив = Новый Массив();
		
		Если Не ПараметрыДерева.ПараметрыОтчета.ПоВсемОрганизациям Тогда
			УсловияСоединенияМассив.Добавить("СебестоимостьТоваров.Организация = ТаблицаОтборовУзлов.Организация"); //@Query-part
		КонецЕсли;

		Если Не ПараметрыДерева.ПараметрыОтчета.ПоВсемПодразделениям Тогда
			УсловияСоединенияМассив.Добавить("СпрПодразделения.Ссылка = ТаблицаОтборовУзлов.Подразделение"); //@Query-part
		КонецЕсли;
		
		#Область ВариантыУсловийСоединенияПоПараметрамУзлов
		// Смотри комментарий 204.
		
		УсловиеСоединения = "КлючиАналитики.Номенклатура = ТаблицаОтборовУзлов.Продукция"; //@Query-part
		Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 1 Тогда
			УсловияСоединенияМассив.Добавить(УсловиеСоединения);
		ИначеЕсли ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.Продукция = 2 Тогда
			УсловияСоединенияМассив.Добавить(
				"(ТаблицаОтборовУзлов.ПоВсейПродукции ИЛИ " + УсловиеСоединения + ")"); //@Query-part
		КонецЕсли;
		
		УсловиеСоединения = "СебестоимостьТоваров.Партия = ТаблицаОтборовУзлов.ПартияПродукции"; //@Query-part
		Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 1 Тогда
			УсловияСоединенияМассив.Добавить(УсловиеСоединения);
		ИначеЕсли ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ПартияПродукции = 2 Тогда
			УсловияСоединенияМассив.Добавить(
				"ТаблицаОтборовУзлов.ПоВсемПартиям ИЛИ " + УсловиеСоединения + ")"); //@Query-part
		КонецЕсли;
		
		УсловиеСоединения = "КлючиАналитики.Характеристика = ТаблицаОтборовУзлов.ХарактеристикаПродукции"; //@Query-part
		Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 1 Тогда
			УсловияСоединенияМассив.Добавить(УсловиеСоединения); 
		ИначеЕсли ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.ХарактеристикаПродукции = 2 Тогда
			УсловияСоединенияМассив.Добавить(
				"(ТаблицаОтборовУзлов.ПоВсемХарактеристикам ИЛИ " + УсловиеСоединения + ")"); //@Query-part
		КонецЕсли;
		
		УсловиеСоединения = "КлючиАналитики.Серия = ТаблицаОтборовУзлов.СерияПродукции"; //@Query-part
		Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 1 Тогда
			УсловияСоединенияМассив.Добавить(УсловиеСоединения);
		ИначеЕсли ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.СерияПродукции = 2 Тогда
			УсловияСоединенияМассив.Добавить(
				"(ТаблицаОтборовУзлов.ПоВсемСериям ИЛИ " + УсловиеСоединения + ")"); //@Query-part
		КонецЕсли;
		
		УсловиеСоединения = "КлючиАналитики.Назначение = ТаблицаОтборовУзлов.НазначениеПродукции"; //@Query-part
		Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 1 Тогда
			УсловияСоединенияМассив.Добавить(УсловиеСоединения);
		ИначеЕсли ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.НазначениеПродукции = 2 Тогда
			УсловияСоединенияМассив.Добавить(
				"(ТаблицаОтборовУзлов.ПоВсемНазначениям
				| ИЛИ КлючиАналитики.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				| ИЛИ " + УсловиеСоединения + ")"); //@Query-part
		КонецЕсли;
		
		УсловиеСоединения = "СебестоимостьТоваров.АналитикаУчетаПартий = ТаблицаОтборовУзлов.АналитикаУчетаПартийПродукции"; //@Query-part
		Если ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 1 Тогда
			УсловияСоединенияМассив.Добавить(УсловиеСоединения);
		ИначеЕсли ПараметрыДерева.ВариантыУсловийСоединенияПоПараметрамУзлов.АналитикаУчетаПартийПродукции = 2 Тогда
			УсловияСоединенияМассив.Добавить(
				"(ТаблицаОтборовУзлов.ПоВсемАналитикамПартий ИЛИ " + УсловиеСоединения + ")"); //@Query-part
		КонецЕсли;

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияСоединения_ТаблицаОтборовУзлов",
			СтрСоединить(УсловияСоединенияМассив, Символы.ПС + " И ")); //@Query-part
			
		#КонецОбласти
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов", 
			"ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтборовУзлов КАК ТаблицаОтборовУзлов");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияСоединения_ТаблицаОтборовУзлов", "ИСТИНА"); //@Query-part
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыДерева.МенеджерВременныхТаблиц;

	Запрос.Текст = ТекстЗапроса;
	УстановитьПараметрыДереваСебестоимости(Запрос, ПараметрыЗапроса, КлючПараметра);
	Возврат Запрос;
	
КонецФункции

Процедура УстановитьПараметрыДереваСебестоимости(Запрос, ПараметрыЗапроса, КлючПараметра)
	
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр[КлючПараметра], ТекПараметр.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСНеУчитываетсяВСтоимости",
		УчетНДСУП.ТипыНалогообложенияНДСНеУчитываетсяВСтоимости());
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСУчитываетсяВСтоимости",
		УчетНДСУП.ВидыДеятельностиНДСУчитываетсяВСтоимости());
	
	ВозможныеТипыЗатратДереваСебестоимости = СтруктураСебестоимости.ТипыЗатратДереваСебестоимости();
	Для Каждого ТипЗатраты Из ВозможныеТипыЗатратДереваСебестоимости Цикл
		Запрос.УстановитьПараметр(ТипЗатраты.Ключ, ТипЗатраты.Значение);
	КонецЦикла;

КонецПроцедуры

Процедура АдаптироватьЗапросСКД(СхемаКомпоновки, ЕстьОтборПоТаблицеОтбораУзлов, ПомещатьВВТ, ПараметрыДерева) Экспорт
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Найти("ВыпущеннаяПродукция");
	
	Если НаборДанных = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Изменен перечень наборов данных схемы компоновки дерева себестоимости.';
								|en = 'List of data sets of cost tree composition schema is changed.'");
	Иначе
		Если ПараметрыДерева = Неопределено Тогда
			ПараметрыДерева = ПараметрыДереваСебестоимости();
		КонецЕсли;
		НаборДанных.Запрос = ШаблонЗапросаВыпущеннойПродукции(ЕстьОтборПоТаблицеОтбораУзлов, ПомещатьВВТ, ПараметрыДерева);
		НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "И &ТекстУсловия", "");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтруктураДереваСебестоимости

Процедура ПустоеДеревоСебестоимости(ПараметрыДерева)
	
	Если ПараметрыДерева.ТипРезультатаДеревоЗначений Тогда
		ПараметрыДерева.Результат = Новый ДеревоЗначений;
		ИнициализироватьПоляДереваСебестоимости(ПараметрыДерева.Результат, ПараметрыДерева.СтруктураПолей);
	ИначеЕсли ПараметрыДерева.ТипРезультатаТаблицаЗначений Тогда
		ПараметрыДерева.Результат = Новый ТаблицаЗначений;
		ИнициализироватьПоляДереваСебестоимости(ПараметрыДерева.Результат, ПараметрыДерева.СтруктураПолей);
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьПоляДереваСебестоимости(Результат, СтруктураПолей)
	
	Для Каждого ТекПоле Из СтруктураПолей Цикл
		Если ТекПоле.Значение = Неопределено Тогда
			Результат.Колонки.Добавить(ТекПоле.Ключ);
		Иначе
			Результат.Колонки.Добавить(ТекПоле.Ключ, ТекПоле.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеТиповИзОдногоТипа(ИмяТипа)
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип(ИмяТипа));
	Возврат Новый ОписаниеТипов(МассивТипов);
КонецФункции

Функция СтруктураПолейДереваСебестоимости()
	
	СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("ВидСтроки", ОписаниеТиповИзОдногоТипа("ПеречислениеСсылка.ВидыСтрокДереваСебестоимости"));
	СтруктураПолей.Вставить("Идентификатор", ОписаниеТиповИзОдногоТипа("УникальныйИдентификатор"));
		
	МассивТиповСтрока = Новый Массив;
	МассивТиповСтрока.Добавить(Тип("Строка"));
	ОписаниеТипаСтрока_36 = Новый ОписаниеТипов(МассивТиповСтрока, , Новый КвалификаторыСтроки(36));
	СтруктураПолей.Вставить("ИдентификаторУзлаПервогоУровня", ОписаниеТипаСтрока_36);
	СтруктураПолей.Вставить("ИдентификаторУзла", ОписаниеТипаСтрока_36);
		
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДатаВремя = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	СтруктураПолей.Вставить("ДатаИсходнойПартии", ОписаниеТиповДатаВремя);
	
	ОписаниеТиповКлючиАналитикиУчетаНоменклатуры = ОписаниеТиповИзОдногоТипа(
		"СправочникСсылка.КлючиАналитикиУчетаНоменклатуры");
	СтруктураПолей.Вставить("АналитикаУчетаПродукции", ОписаниеТиповКлючиАналитикиУчетаНоменклатуры);
	СтруктураПолей.Вставить("АналитикаУчетаВыходноеИзделие", ОписаниеТиповКлючиАналитикиУчетаНоменклатуры);
	
	ТипыАналитикиЗатрат = Новый Массив;
	ТипыАналитикиЗатрат.Добавить(Тип("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	ТипыАналитикиЗатрат.Добавить(Тип("СправочникСсылка.ВидыРаботСотрудников"));
	ТипыАналитикиЗатрат.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ТипыАналитикиЗатрат = Новый ОписаниеТипов(ТипыАналитикиЗатрат);
	СтруктураПолей.Вставить("АналитикаУчетаЗатрата", ТипыАналитикиЗатрат);
	
	ТипыАналитикиУчетаПартий = ОписаниеТиповИзОдногоТипа("СправочникСсылка.КлючиАналитикиУчетаПартий");
	СтруктураПолей.Вставить("АналитикаУчетаПартий",					ТипыАналитикиУчетаПартий);
	СтруктураПолей.Вставить("АналитикаУчетаПартийПродукции",		ТипыАналитикиУчетаПартий);
	СтруктураПолей.Вставить("АналитикаУчетаПартийВыходноеИзделие",	ТипыАналитикиУчетаПартий);
	СтруктураПолей.Вставить("АналитикаУчетаПартийЗатрата",			ТипыАналитикиУчетаПартий);
	
	СтруктураПолей.Вставить("Организация", ОписаниеТиповИзОдногоТипа("СправочникСсылка.Организации"));
	СтруктураПолей.Вставить("Подразделение", ОписаниеТиповИзОдногоТипа("СправочникСсылка.СтруктураПредприятия"));
	СтруктураПолей.Вставить("ТипЗатрат", Новый ОписаниеТипов(МассивТиповСтрока,, Новый КвалификаторыСтроки(255)));
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТиповБулево = Новый ОписаниеТипов(МассивТипов);
	СтруктураПолей.Вставить("ТребуетсяРазузлование", ОписаниеТиповБулево);
	СтруктураПолей.Вставить("ТребуетсяРазузлованиеДопРасходов", ОписаниеТиповБулево);
	
	СтруктураПолей.Вставить("ЕдиницаИзмерения", ОписаниеТиповИзОдногоТипа("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	ТипыЗатраты = Новый Массив;
	ТипыЗатраты.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ТипыЗатраты.Добавить(Тип("СправочникСсылка.ВидыРаботСотрудников"));
	ТипыЗатраты.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ТипыЗатраты.Добавить(Тип("Строка"));
	ТипыЗатраты = Новый ОписаниеТипов(ТипыЗатраты,, Новый КвалификаторыСтроки(255));
	СтруктураПолей.Вставить("Номенклатура", ТипыЗатраты);
	
	СтруктураПолей.Вставить("Характеристика", ОписаниеТиповИзОдногоТипа("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СтруктураПолей.Вставить("Серия", ОписаниеТиповИзОдногоТипа("СправочникСсылка.СерииНоменклатуры"));
	СтруктураПолей.Вставить("Назначение", ОписаниеТиповИзОдногоТипа("СправочникСсылка.Назначения"));
	СтруктураПолей.Вставить("Валюта", ОписаниеТиповИзОдногоТипа("СправочникСсылка.Валюты"));
	СтруктураПолей.Вставить("СтатьяКалькуляции", ОписаниеТиповИзОдногоТипа("СправочникСсылка.СтатьиКалькуляции"));
	
	ТипыПартий = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ДокументПартии.Тип.Типы());
	СтруктураПолей.Вставить("Партия",					ТипыПартий);
	СтруктураПолей.Вставить("ПартияПродукции",			ТипыПартий);
	СтруктураПолей.Вставить("ПартияВыходноеИзделие",	ТипыПартий);
	СтруктураПолей.Вставить("ПартияЗатрата",			ТипыПартий);
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТиповЧисло_15_0 = Новый ОписаниеТипов(МассивТипов,,, Новый КвалификаторыЧисла(15, 0));
	ОписаниеТиповЧисло_19_6 = Новый ОписаниеТипов(МассивТипов,,, Новый КвалификаторыЧисла(19, 6));
	СтруктураПолей.Вставить("Уровень", ОписаниеТиповЧисло_15_0);
	
	СтруктураПолей.Вставить("Количество",			ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("Числитель",			ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("Знаменатель",			ОписаниеТиповЧисло_19_6);
	
	// Стоимости согласно параметру "ДанныеПоСебестоимости"
	СтруктураПолей.Вставить("Сумма",					ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("СуммаЗабалансовая",		ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("Материальные",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("Трудозатраты",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПостоянные",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПеременные",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ДопРасходы",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("НДД",						ОписаниеТиповЧисло_19_6);
	
	// Стоимости с НДС
	СтруктураПолей.Вставить("МатериальныеСНДС",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ТрудозатратыСНДС",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПостоянныеСНДС",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПеременныеСНДС", 	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ДопРасходыСНДС",				ОписаниеТиповЧисло_19_6);
	
	// Стоимости без НДС
	СтруктураПолей.Вставить("МатериальныеБезНДС",			ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПостоянныеБезНДС",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПеременныеБезНДС",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ДопРасходыБезНДС",				ОписаниеТиповЧисло_19_6);
	
	// Стоимости Упр
	СтруктураПолей.Вставить("МатериальныеУпр",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ТрудозатратыУпр",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПостоянныеУпр",		ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПеременныеУпр",		ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ДопРасходыУпр",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("СтоимостьЗабалансоваяУпр",		ОписаниеТиповЧисло_19_6);
	
	// Стоимости Регл
	СтруктураПолей.Вставить("МатериальныеРегл",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ТрудозатратыРегл",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПостоянныеРегл",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостатейныеПеременныеРегл",	ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ДопРасходыРегл",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("СтоимостьЗабалансоваяРегл",	ОписаниеТиповЧисло_19_6);
	
	// Налоговый учет
	СтруктураПолей.Вставить("НалоговыйУчет",				ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ПостояннаяРазница",			ОписаниеТиповЧисло_19_6);
	СтруктураПолей.Вставить("ВременнаяРазница",				ОписаниеТиповЧисло_19_6);
	
	Возврат СтруктураПолей;
	
КонецФункции

Функция ПустаяТаблицаОтборовУзлов(СтруктураПолей)
	ТаблицаОтборовУзлов = Новый ТаблицаЗначений();

	ОписаниеТиповБулево = ОписаниеТиповИзОдногоТипа("Булево");
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДатаВремя = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

	ТаблицаОтборовУзлов.Колонки.Добавить("ИдентификаторУзлаПервогоУровня", 
		СтруктураПолей.ИдентификаторУзлаПервогоУровня);
	
	ТаблицаОтборовУзлов.Колонки.Добавить("Уровень", СтруктураПолей.Уровень);
	
	ТаблицаОтборовУзлов.Колонки.Добавить("УзелПервогоУровня_АналитикаУчетаПродукции",
		СтруктураПолей.АналитикаУчетаПродукции);
	ТаблицаОтборовУзлов.Колонки.Добавить("УзелПервогоУровня_ПартияПродукции", СтруктураПолей.ПартияПродукции);
	ТаблицаОтборовУзлов.Колонки.Добавить("УзелПервогоУровня_АналитикаУчетаПартийПродукции",
		СтруктураПолей.АналитикаУчетаПартийПродукции);
	
	ТаблицаОтборовУзлов.Колонки.Добавить("ИдентификаторУзла", СтруктураПолей.ИдентификаторУзла);

	ТаблицаОтборовУзлов.Колонки.Добавить("Организация", СтруктураПолей.Организация);
	ТаблицаОтборовУзлов.Колонки.Добавить("Подразделение", СтруктураПолей.Подразделение);
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаОтборовУзлов.Колонки.Добавить("ДанныеПоСебестоимости",
		Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтборовУзлов.Колонки.Добавить("ДатаНачала", ОписаниеТиповДатаВремя);
	ТаблицаОтборовУзлов.Колонки.Добавить("ДатаОкончания", ОписаниеТиповДатаВремя);
	ТаблицаОтборовУзлов.Колонки.Добавить("Регистратор",
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.СтандартныеРеквизиты.Регистратор.Тип);

	ТаблицаОтборовУзлов.Колонки.Добавить("РазворачиватьДопРасходы", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("ТребуетсяРазузлование", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПоВсейПродукции", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("Продукция", ОписаниеТиповИзОдногоТипа("СправочникСсылка.Номенклатура"));
	ТаблицаОтборовУзлов.Колонки.Добавить("ПоВсемХарактеристикам", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("ХарактеристикаПродукции",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаОтборовУзлов.Колонки.Добавить("ПоВсемСериям", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("СерияПродукции",
		ОписаниеТиповИзОдногоТипа("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаОтборовУзлов.Колонки.Добавить("НазначениеПродукции",
		ОписаниеТиповИзОдногоТипа("СправочникСсылка.Назначения"));
	ТаблицаОтборовУзлов.Колонки.Добавить("ПоВсемНазначениям", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПоВсемПартиям", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПартияПродукции", СтруктураПолей.ПартияПродукции);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПоВсемАналитикамПартий", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("АналитикаУчетаПартийПродукции", СтруктураПолей.АналитикаУчетаПартийПродукции);
	ТаблицаОтборовУзлов.Колонки.Добавить("АналитикаУчетаЗатрат",
		ОписаниеТиповИзОдногоТипа("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	
	ТаблицаОтборовУзлов.Колонки.Добавить("ПартияЗатрата", СтруктураПолей.ПартияПродукции);
		
	ТаблицаОтборовУзлов.Колонки.Добавить("Числитель", СтруктураПолей.Числитель);
	ТаблицаОтборовУзлов.Колонки.Добавить("Знаменатель", СтруктураПолей.Знаменатель);
	ТаблицаОтборовУзлов.Колонки.Добавить("КоличествоПродукции", СтруктураПолей.Количество);
	
	ТаблицаОтборовУзлов.Колонки.Добавить("ВалютаУправленческогоУчета", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаОтборовУзлов.Колонки.Добавить("АналитикаУчетаВыходноеИзделие", СтруктураПолей.АналитикаУчетаВыходноеИзделие);
	ТаблицаОтборовУзлов.Колонки.Добавить("СтатьяКалькуляции", СтруктураПолей.СтатьяКалькуляции);
	

	ТаблицаОтборовУзлов.Колонки.Добавить("ДатаИсходнойПартии", ОписаниеТиповДатаВремя);
	ТаблицаОтборовУзлов.Колонки.Добавить("ДатаИсходнойПартии_НачалоМесяца", ОписаниеТиповДатаВремя);
	ТаблицаОтборовУзлов.Колонки.Добавить("ДатаИсходнойПартии_КонецМесяца", ОписаниеТиповДатаВремя);
	ТаблицаОтборовУзлов.Колонки.Добавить("ВключитьНДСВСтоимость", ОписаниеТиповБулево);
	ТаблицаОтборовУзлов.Колонки.Добавить("ИсключитьНДСИзСтоимости", ОписаниеТиповБулево);
	
	// Для того чтобы считать разницу верхнеуровневого узла с итогом по узлам нижнего уровня,
	// добавляем суммы к строкам отбора по уровню.
	ТаблицаОтборовУзлов.Колонки.Добавить("Сумма", СтруктураПолей.Сумма);
	ТаблицаОтборовУзлов.Колонки.Добавить("Материальные", СтруктураПолей.Материальные);
	ТаблицаОтборовУзлов.Колонки.Добавить("ДопРасходы", СтруктураПолей.ДопРасходы);
	ТаблицаОтборовУзлов.Колонки.Добавить("Трудозатраты", СтруктураПолей.Трудозатраты);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПостатейныеПеременные", СтруктураПолей.ПостатейныеПеременные);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПостатейныеПостоянные", СтруктураПолей.ПостатейныеПостоянные);
	ТаблицаОтборовУзлов.Колонки.Добавить("НалоговыйУчет", СтруктураПолей.НалоговыйУчет);
	ТаблицаОтборовУзлов.Колонки.Добавить("ПостояннаяРазница", СтруктураПолей.ПостояннаяРазница);
	ТаблицаОтборовУзлов.Колонки.Добавить("ВременнаяРазница", СтруктураПолей.ВременнаяРазница);
	ТаблицаОтборовУзлов.Колонки.Добавить("СуммаЗабалансовая", СтруктураПолей.СуммаЗабалансовая);
	
	ТаблицаОтборовУзлов.Колонки.Добавить("СуммаВключениеИсключениеНДСВСтоимости", СтруктураПолей.СуммаЗабалансовая);
	
	Возврат ТаблицаОтборовУзлов;
КонецФункции

#КонецОбласти

#КонецОбласти
