////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотКлиентСервер: клиент, сервер
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает представление типа объекта XDTO Документооборота по имени типа.
// По умолчанию возвращает представление в единственном числе.
//
// Параметры:
//   ТипXDTO - Строка - имя типа объекта XDTO.
//   МножественноеЧисло - Булево - требуется вернуть представление во множественном числе.
//   ДляФормыВыбора - Булево - требуется вернуть представление для формы выбора, начинающееся с "Выбор ...".
//
// Возвращаемое значение:
//   Строка - представление типа объекта XDTO Документооборота по имени типа.
//
Функция ПредставлениеТипаОбъектаXDTO(ТипXDTO, МножественноеЧисло = Ложь, ДляФормыВыбора = Ложь) Экспорт
	
	ЕдинственноеЧисло = Не МножественноеЧисло И Не ДляФормыВыбора;
	
	ПредставленияТипов = Новый Соответствие;
	
	// Справочники.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Контрагент, Организация, Пользователь';
							|en = 'Counterparty, Company, User'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор стороны';
							|en = 'Select a party'");
	Иначе
		Представление = НСтр("ru = 'Контрагенты, Организации, Пользователи';
							|en = 'Counterparties, Companies, Users'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMParty", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Проект';
							|en = 'Project'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор проекта';
							|en = 'Select project '");
	Иначе
		Представление = НСтр("ru = 'Проекты';
							|en = 'Projects'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProject", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Проектная задача';
							|en = 'Project task'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор проектной задачи';
							|en = 'Select project task'");
	Иначе
		Представление = НСтр("ru = 'Проектные задачи';
							|en = 'Project tasks'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProjectTask", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Мероприятие';
							|en = 'Activity'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор мероприятия';
							|en = 'Select an activity'");
	Иначе
		Представление = НСтр("ru = 'Мероприятия';
							|en = 'Activities'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeeting", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тема обсуждения';
							|en = 'Discussion topic'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор темы обсуждений';
							|en = 'Select a discussion topic'");
	Иначе
		Представление = НСтр("ru = 'Темы обсуждений';
							|en = 'Discussion topics'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDiscussionTopic", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Сообщение обсуждения';
							|en = 'Discussion message'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор сообщения обсуждений';
							|en = 'Select a discussion message'");
	Иначе
		Представление = НСтр("ru = 'Сообщения обсуждений';
							|en = 'Discussion messages'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDiscussionMessage", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Файл';
							|en = 'File'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор файла';
							|en = 'Select file'");
	Иначе
		Представление = НСтр("ru = 'Файлы';
							|en = 'Files'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMFile", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Папка файлов';
							|en = 'File folder'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор папки файлов';
							|en = 'Select file folder'");
	Иначе
		Представление = НСтр("ru = 'Папки файлов';
							|en = 'File folders'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMFileFolder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Папка внутренних документов';
							|en = 'Folder of internal documents'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор папки внутренних документов';
							|en = 'Select an internal documents folder'");
	Иначе
		Представление = НСтр("ru = 'Папки внутренних документов';
							|en = 'Internal document folders'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInternalDocumentFolder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Папка мероприятий';
							|en = 'Event folder'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор папки мероприятий';
							|en = 'Select an event folder'");
	Иначе
		Представление = НСтр("ru = 'Папки мероприятий';
							|en = 'Event folders'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingFolder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Пользователь';
							|en = 'User'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор пользователя';
							|en = 'Select user'");
	Иначе
		Представление = НСтр("ru = 'Пользователи';
							|en = 'Users'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMUser", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Группа пользователей';
							|en = 'User group'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор группы пользователей';
							|en = 'Select user group'");
	Иначе
		Представление = НСтр("ru = 'Группы пользователей';
							|en = 'User groups'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMUserGroup", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вопрос деятельности';
							|en = 'Activity issue'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вопроса деятельности';
							|en = 'Select activity issue'");
	Иначе
		Представление = НСтр("ru = 'Вопросы деятельности';
							|en = 'Activity issues'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMActivityMatter", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Валюта';
							|en = 'Currency'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор валюты';
							|en = 'Select currency '");
	Иначе
		Представление = НСтр("ru = 'Валюты';
							|en = 'Currencies'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCurrency", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Внутренний документ';
							|en = 'Internal document'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор внутреннего документа';
							|en = 'Select internal document'");
	Иначе
		Представление = НСтр("ru = 'Внутренние документы';
							|en = 'Internal documents'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInternalDocument", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Входящий документ';
							|en = 'Incoming document'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор входящего документа';
							|en = 'Select incoming document'");
	Иначе
		Представление = НСтр("ru = 'Входящие документы';
							|en = 'Incoming documents'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingDocument", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Исходящий документ';
							|en = 'Outgoing document'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор исходящего документа';
							|en = 'Select outgoing document'");
	Иначе
		Представление = НСтр("ru = 'Исходящие документы';
							|en = 'Outgoing documents'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOutgoingDocument", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Организация';
							|en = 'Company'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор организации';
							|en = 'Select company'");
	Иначе
		Представление = НСтр("ru = 'Организации';
							|en = 'Companies'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOrganization", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Контрагент';
							|en = 'Counterparty'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор контрагента';
							|en = 'Select a counterparty'");
	Иначе
		Представление = НСтр("ru = 'Контрагенты';
							|en = 'Counterparties'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCorrespondent", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Контактное лицо';
							|en = 'Contact person'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор контактного лица';
							|en = 'Select contact person'");
	Иначе
		Представление = НСтр("ru = 'Контактные лица';
							|en = 'Contact persons'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMContactPerson", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Гриф доступа';
							|en = 'Access label'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор грифа доступа';
							|en = 'Select access label'");
	Иначе
		Представление = НСтр("ru = 'Грифы доступа';
							|en = 'Access labels'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMAccessLevel", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Способ доставки';
							|en = 'Delivery method'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор способа доставки';
							|en = 'Select delivery method'");
	Иначе
		Представление = НСтр("ru = 'Способы доставки';
							|en = 'Delivery methods'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDeliveryMethod", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Подразделение';
							|en = 'Business unit'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор подразделения';
							|en = 'Select business unit'");
	Иначе
		Представление = НСтр("ru = 'Подразделения';
							|en = 'Business units'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMSubdivision", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид внутреннего документа';
							|en = 'Internal document kind'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида внутренних документов';
							|en = 'Select an internal document kind'");
	Иначе
		Представление = НСтр("ru = 'Виды внутренних документов';
							|en = 'Kinds of internal documents'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInternalDocumentType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид входящего документа';
							|en = 'Incoming document kind'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида входящих документов';
							|en = 'Select an incoming document kind'");
	Иначе
		Представление = НСтр("ru = 'Виды входящих документов';
							|en = 'Kinds of incoming documents'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingDocumentType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид исходящего документа';
							|en = 'Outgoing document kind'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида исходящих документов';
							|en = 'Select an outgoing document kind'");
	Иначе
		Представление = НСтр("ru = 'Виды исходящих документов';
							|en = 'Kinds of outgoing documents'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOutgoingDocumentType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид мероприятия';
							|en = 'Event type'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида мероприятия';
							|en = 'Select an event type'");
	Иначе
		Представление = НСтр("ru = 'Виды мероприятий';
							|en = 'Event types'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид работ';
							|en = 'Activity kind'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида работ';
							|en = 'Select activity kind'");
	Иначе
		Представление = НСтр("ru = 'Виды работ';
							|en = 'Activity kinds'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMWorkType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип связей';
							|en = 'Link type'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа связей';
							|en = 'Select a link type'");
	Иначе
		Представление = НСтр("ru = 'Типы связей';
							|en = 'Link types'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMRelationType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Значение свойств объектов';
							|en = 'Object property value'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор значения свойств объектов';
							|en = 'Select an object property value'");
	Иначе
		Представление = НСтр("ru = 'Значения свойств объектов';
							|en = 'Object property values'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMObjectPropertyValue", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Физическое лицо';
							|en = 'Person'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор физического лица';
							|en = 'Select person'");
	Иначе
		Представление = НСтр("ru = 'Физические лица';
							|en = 'Persons'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPrivatePerson", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Условие маршрутизации';
							|en = 'Routing condition'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор условия маршрутизации';
							|en = 'Select a routing condition'");
	Иначе
		Представление = НСтр("ru = 'Условия маршрутизации';
							|en = 'Routing conditions'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMRoutingCondition", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Личный адресат';
							|en = 'Personal addressee'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор личного адресата';
							|en = 'Select a personal addressee'");
	Иначе
		Представление = НСтр("ru = 'Личные адресаты';
							|en = 'Personal addressees'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPersonalRecipient", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Группа личных адресатов';
							|en = 'Personal addressees group'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор группы личных адресатов';
							|en = 'Select personal addressees group'");
	Иначе
		Представление = НСтр("ru = 'Группы личных адресатов';
							|en = 'Personal addressee groups'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPersonalRecipientGroup", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Роль исполнителя';
							|en = 'Business role'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор роли исполнителей';
							|en = 'Select a business role'");
	Иначе
		Представление = НСтр("ru = 'Роли исполнителей';
							|en = 'Assignee roles'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessExecutorRole", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Статья движения денежных средств';
							|en = 'Cash flow item'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор статьи движения денежных средств';
							|en = 'Select a cash flow item'");
	Иначе
		Представление = НСтр("ru = 'Статьи движения денежных средств';
							|en = 'Cash flow items'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCashFlowItem", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Единица измерения';
							|en = 'Unit'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор единицы измерения';
							|en = 'Select a unit'");
	Иначе
		Представление = НСтр("ru = 'Единицы измерения';
							|en = 'Units of measure'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeasurementUnit", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Товар, услуга';
							|en = 'Good, service'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор номенклатуры';
							|en = 'Select items'");
	Иначе
		Представление = НСтр("ru = 'Товары и услуги';
							|en = 'Goods and services'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProduct", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ставка НДС';
							|en = 'VAT rate'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ставки НДС';
							|en = 'Select a VAT rate'");
	Иначе
		Представление = НСтр("ru = 'Ставки НДС';
							|en = 'VAT rates'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMVATRateUniversal", Представление);
	
	// Письма электронной почты.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Входящее письмо';
							|en = 'Incoming mail'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор входящего письма';
							|en = 'Select incoming email'");
	Иначе
		Представление = НСтр("ru = 'Входящие письма';
							|en = 'Incoming mails'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingEMail", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Исходящее письмо';
							|en = 'Outgoing mail'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор исходящего письма';
							|en = 'Select outgoing email'");
	Иначе
		Представление = НСтр("ru = 'Исходящие письма';
							|en = 'Outgoing mails'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOutgoingEMail", Представление);
	
	// Рабочие отчеты.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ежедневный отчет';
							|en = 'Daily report'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ежедневного отчета';
							|en = 'Select daily report'");
	Иначе
		Представление = НСтр("ru = 'Ежедневные отчеты';
							|en = 'Daily reports'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDailyReport", Представление);
	
	// Фактические трудозатраты.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Фактические трудозатраты';
							|en = 'Actual labor costs'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор фактических трудозатрат';
							|en = 'Select actual labor costs'");
	Иначе
		Представление = НСтр("ru = 'Фактические трудозатраты';
							|en = 'Actual labor costs'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMActualWork", Представление);
	
	// Используемые перечисления.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип ответа';
							|en = 'Response type'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа ответа';
							|en = 'Select a response type'");
	Иначе
		Представление = НСтр("ru = 'Типы ответа';
							|en = 'Response types'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMEMailAnswerType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид вопросов выполнения задач';
							|en = 'Question kind of task execution'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида вопросов выполнения задач';
							|en = 'Select a question kind of task execution'");
	Иначе
		Представление = НСтр("ru = 'Виды вопросов выполнения задач';
							|en = 'Issue kinds of task execution'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIssueType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Порядок продления';
							|en = 'Extension procedure'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор порядка продления';
							|en = 'Select an extension procedure'");
	Иначе
		Представление = НСтр("ru = 'Порядки продления';
							|en = 'Extension procedures'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProlongationProcedure", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние документа';
							|en = 'Document state'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния документа';
							|en = 'Select document state'");
	Иначе
		Представление = НСтр("ru = 'Состояния документов';
							|en = 'Document states'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDocumentStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние мероприятия';
							|en = 'Event state'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния мероприятия';
							|en = 'Select event state'");
	Иначе
		Представление = НСтр("ru = 'Состояния мероприятий';
							|en = 'Event states'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние протокола мероприятия';
							|en = 'Event protocol state'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния протокола мероприятия';
							|en = 'Select an event protocol state'");
	Иначе
		Представление = НСтр("ru = 'Состояния протоколов мероприятий';
							|en = 'Event protocol states'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingMinutesItemStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Юридическое\физическое лицо';
							|en = 'Business entity\person'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор юр\физ лица';
							|en = 'Select a legal entity\person'");
	Иначе
		Представление = НСтр("ru = 'Юридическое\физическое лица';
							|en = 'Legal entity\person'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMLegalPrivatePerson", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ставка НДС';
							|en = 'VAT rate'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ставки НДС';
							|en = 'Select a VAT rate'");
	Иначе
		Представление = НСтр("ru = 'Ставки НДС';
							|en = 'VAT rates'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMVATRate", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант подписания';
							|en = 'How to sign'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта подписания';
							|en = 'Select how to sign'");
	Иначе
		Представление = НСтр("ru = 'Варианты подписания';
							|en = 'Signing options'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMSignatureOption", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип контактной информации';
							|en = 'Contact information type'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа контактной информации';
							|en = 'Select a contact information type'");
	Иначе
		Представление = НСтр("ru = 'Типы контактной информации';
							|en = 'Contact information types'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMContactInformationType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Категория дел';
							|en = 'Case category'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор категории дел';
							|en = 'Select a case category'");
	Иначе
		Представление = НСтр("ru = 'Категории дел';
							|en = 'Case categories'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCategoriesOfCases", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'День недели';
							|en = 'Week day'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор дня недели';
							|en = 'Select a week day'");
	Иначе
		Представление = НСтр("ru = 'Дни недели';
							|en = 'Week days'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDaysOfTheWeek", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид дня';
							|en = 'Day type'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида дня';
							|en = 'Select a day kind'");
	Иначе
		Представление = НСтр("ru = 'Виды дней';
							|en = 'Day kinds'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMKindsOfDays", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Политика учета рабочего времени';
							|en = 'Working time tracking policy'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор политики учета рабочего времени';
							|en = 'Select a working time tracking policy'");
	Иначе
		Представление = НСтр("ru = 'Политики учета рабочего времени';
							|en = 'Working time tracking policies'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMTimeTrackingPolicy", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип ответа';
							|en = 'Response type'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа ответа';
							|en = 'Select a response type'");
	Иначе
		Представление = НСтр("ru = 'Типы ответа';
							|en = 'Response types'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingEMailAnswerType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние приглашения';
							|en = 'Invitation state'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния приглашения';
							|en = 'Select an invitation state'");
	Иначе
		Представление = НСтр("ru = 'Состояния приглашения';
							|en = 'Invitation states'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInvitationStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат приглашения';
							|en = 'Invitation result'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата приглашения';
							|en = 'Select an invitation result'");
	Иначе
		Представление = НСтр("ru = 'Результаты приглашения';
							|en = 'Invitation results'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInvitationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Общий результат приглашения';
							|en = 'General invitation result'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор общего результата приглашения';
							|en = 'Select a general invitation result'");
	Иначе
		Представление = НСтр("ru = 'Общие результаты приглашения';
							|en = 'General invitation results'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMGeneralInvitationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат согласования';
							|en = 'Approval result'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата согласования';
							|en = 'Select an approval result'");
	Иначе
		Представление = НСтр("ru = 'Результаты согласования';
							|en = 'Approval results '");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMApprovalResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат утверждения';
							|en = 'Confirmation result'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата утверждения';
							|en = 'Select a confirmation result'");
	Иначе
		Представление = НСтр("ru = 'Результаты утверждения';
							|en = 'Confirmation results'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMConfirmationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат регистрации';
							|en = 'Registration result'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата регистрации';
							|en = 'Select a registration result'");
	Иначе
		Представление = НСтр("ru = 'Результаты регистрации';
							|en = 'Registration results'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMRegistrationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Дополнительный реквизит / сведение';
							|en = 'Additional attribute or information record'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор дополнительного реквизита';
							|en = 'Select an additional attribute'");
	Иначе
		Представление = НСтр("ru = 'Дополнительные реквизиты и сведения';
							|en = 'Additional attributes and information'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMAdditionalProperty", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Способ указания времени';
							|en = 'Time specification method'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор способа указания времени';
							|en = 'Select a time specification method'");
	Иначе
		Представление = НСтр("ru = 'Способы указания времени';
							|en = 'Time specification methods '");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMTimeInputMethod", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант маршрутизации задач';
							|en = 'Task routing option'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта маршрутизации задач';
							|en = 'Select a task routing option'");
	Иначе
		Представление = НСтр("ru = 'Варианты маршрутизации задач';
							|en = 'Task routing options'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMApprovalType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Порядок выполнения задач';
							|en = 'Task fulfillment procedure '");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор порядка выполнения задач';
							|en = 'Select a task execution order'");
	Иначе
		Представление = НСтр("ru = 'Порядок выполнения задач';
							|en = 'Task fulfillment procedure '");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMTaskExecutionOrder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Порядок согласования';
							|en = 'Approval procedure'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор порядка согласования';
							|en = 'Select an approval order'");
	Иначе
		Представление = НСтр("ru = 'Порядок согласования';
							|en = 'Approval procedure'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMApprovalOrder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Важность писем';
							|en = 'Email importance '");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор важности писем';
							|en = 'Select email importance'");
	Иначе
		Представление = НСтр("ru = 'Важность писем';
							|en = 'Email importance '");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMEMailImportance", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние бизнес-процесса';
							|en = 'Business process state'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор бизнес-процесса';
							|en = 'Select a business process'");
	Иначе
		Представление = НСтр("ru = 'Состояния бизнес-процессов';
							|en = 'Business process states'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessState", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант маршрутизации задач';
							|en = 'Task routing option'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта маршрутизации задач';
							|en = 'Select a task routing option'");
	Иначе
		Представление = НСтр("ru = 'Варианты маршрутизации задач';
							|en = 'Task routing options'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessRoutingType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Условие рассмотрения предшественников этапа';
							|en = 'Review condition of step predecessors'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор условия рассмотрения предшественников этапа';
							|en = 'Select a review condition of step predecessors'");
	Иначе
		Представление = НСтр("ru = 'Условия рассмотрения предшественников этапа';
							|en = 'Review conditions of step predecessors'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPredecessorsStageConsiderationCondition", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант важности задачи';
							|en = 'Task priority option'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта важности задачи';
							|en = 'Select a task priority option'");
	Иначе
		Представление = НСтр("ru = 'Варианты важности задачи';
							|en = 'Task importance options'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessTaskImportance", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант важности задачи';
							|en = 'Task priority option'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта важности задачи';
							|en = 'Select a task priority option'");
	Иначе
		Представление = НСтр("ru = 'Варианты важности задачи';
							|en = 'Task importance options'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessImportance", Представление);
	
	// Типизированные задачи.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Задача исполнителя';
							|en = 'Task of assignee'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор задачи исполнителя';
							|en = 'Select task of assignee'");
	Иначе
		Представление = НСтр("ru = 'Задачи исполнителей';
							|en = 'Tasks of assignees'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessTask", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessOrderTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTaskApproval", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTaskConfirmation", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTaskRegistration", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessPerfomanceTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessConsiderationTaskAcquaint", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolutionTaskQuestion", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolutionTaskAnswer", Представление);
	
	// Шаблоны бизнес-процессов.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Шаблон %1';
							|en = '%1 template'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор шаблона %1';
							|en = 'Select the %1 template'");
	Иначе
		Представление = НСтр("ru = 'Шаблоны %1';
							|en = '%1 templates'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessOrderTemplate", СтрШаблон(Представление, НСтр("ru = 'поручения';
																								|en = 'instructions'")));
	ПредставленияТипов.Вставить("DMBusinessProcessConsiderationTemplate", СтрШаблон(Представление, НСтр("ru = 'рассмотрения';
																										|en = 'reviews'")));
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTemplate", СтрШаблон(Представление, НСтр("ru = 'регистрации';
																										|en = 'registrations'")));
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTemplate", СтрШаблон(Представление, НСтр("ru = 'согласования';
																									|en = 'approvals'")));
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTemplate", СтрШаблон(Представление, НСтр("ru = 'утверждения';
																										|en = 'confirmations'")));
	ПредставленияТипов.Вставить("DMBusinessProcessPerformanceTemplate", СтрШаблон(Представление, НСтр("ru = 'исполнения';
																										|en = 'executions'")));
	ПредставленияТипов.Вставить("DMBusinessProcessAcquaintanceTemplate", СтрШаблон(Представление, НСтр("ru = 'ознакомления';
																										|en = 'previews'")));
	ПредставленияТипов.Вставить("DMCompoundBusinessProcessTemplate", СтрШаблон(Представление, НСтр("ru = 'составных бизнес процессов';
																									|en = 'multiple business processes'")));
	
	// Бизнес-процессы.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Поручение';
							|en = 'Instruction'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор поручения';
							|en = 'Select an instruction'");
	Иначе
		Представление = НСтр("ru = 'Поручения';
							|en = 'Instructions'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessOrder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Рассмотрение';
							|en = 'Review'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор рассмотрения';
							|en = 'Select a review'");
	Иначе
		Представление = НСтр("ru = 'Рассмотрения';
							|en = 'Reviews'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessConsideration", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Регистрация';
							|en = 'Registration'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор регистрации';
							|en = 'Select a registration'");
	Иначе
		Представление = НСтр("ru = 'Регистрации';
							|en = 'Registrations'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessRegistration", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Согласование';
							|en = 'Approval'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор согласования';
							|en = 'Select an approval'");
	Иначе
		Представление = НСтр("ru = 'Согласования';
							|en = 'Approvals'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessApproval", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessApproval_1.2.1.11", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Утверждение';
							|en = 'Confirmation'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор утверждения';
							|en = 'Select confirmation'");
	Иначе
		Представление = НСтр("ru = 'Утверждения';
							|en = 'Confirmations'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmation", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Исполнение';
							|en = 'Execution'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор исполнения';
							|en = 'Select execution'");
	Иначе
		Представление = НСтр("ru = 'Исполнения';
							|en = 'Executions'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessPerformance", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessPerformance_1.2.1.11", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ознакомление';
							|en = 'Preview'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ознакомления';
							|en = 'Select preview'");
	Иначе
		Представление = НСтр("ru = 'Ознакомления';
							|en = 'Previews'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessAcquaintance", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Решение вопросов выполнения задач';
							|en = 'Resolve Task execution issues'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор решения вопросов выполнения задач';
							|en = 'Select resolve tasks execution issues'");
	Иначе
		Представление = НСтр("ru = 'Решения вопросов выполнения задач';
							|en = 'Resolve tasks execution issues'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolution", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Обработка внутреннего документа';
							|en = 'Internal document processing'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор обработки внутреннего документа';
							|en = 'Select internal document processing'");
	Иначе
		Представление = НСтр("ru = 'Обработки внутреннего документа';
							|en = 'Internal document processing'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessInternalDocumentProcessing", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Обработка входящего документа';
							|en = 'Incoming document processing'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор обработки входящего документа';
							|en = 'Select incoming document processing'");
	Иначе
		Представление = НСтр("ru = 'Обработки входящего документа';
							|en = 'Incoming document processing'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessIncomingDocumentProcessing", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Обработка исходящего документа';
							|en = 'Outgoing document processing'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор обработки исходящего документа';
							|en = 'Select outgoing document processing'");
	Иначе
		Представление = НСтр("ru = 'Обработки исходящего документа';
							|en = 'Outgoing document processing'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessOutgoingDocumentProcessing", Представление);
	
	ПредставлениеТипа = ПредставленияТипов.Получить(ТипXDTO);
	
	Если ЗначениеЗаполнено(ПредставлениеТипа) Тогда
		Возврат ПредставлениеТипа;
	Иначе
		Возврат ТипXDTO;
	КонецЕсли;
	
КонецФункции

// Преобразует длительность интервала времени в строку вида час:мин.
//
// Параметры:
//   Длительность - Число - длительность интервала времени в секундах.
//   ПредставлениеНуля - Строка - представление интервала нулевой длительности.
//
// Возвращаемое значение:
//   Строка - представление интервала в виде час:мин.
//
Функция ЧислоВСтроку(Длительность, ПредставлениеНуля = "'") Экспорт
	
	Если Длительность = 0 Тогда
		Возврат ПредставлениеНуля;
	КонецЕсли;
	
	Час = Цел(Длительность / 3600);
	Мин = (Длительность - Час*3600) / 60;
	
	Возврат Формат(Час, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=") + ":" + Формат(Мин, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=");
	
КонецФункции

// Преобразует строку вида час:мин в длительность интервала времени.
//
// Параметры:
//   ДлительностьСтр - Строка - представление интервала времени в виде строки час:мин.
//
// Возвращаемое значение:
//   Число - длительность интервала времени в секундах.
//
Функция ЧислоИзСтроки(ДлительностьСтр) Экспорт
	
	Если Не ЗначениеЗаполнено(ДлительностьСтр) Тогда
		Возврат 0;
	КонецЕсли;
	
	Поз = Найти(ДлительностьСтр, ":");
	Если Поз = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Час = Лев(ДлительностьСтр, Поз-1);
	Мин = Сред(ДлительностьСтр, Поз+1);
	
	Возврат Число(Час) * 3600 + Число(Мин) * 60;
	
КонецФункции

// Выполняет проверку строки на соответствие представлению интервала времени в виде час:мин.
//
// Параметры:
//   ДлительностьСтр - Строка - проверяемая строка.
//
// Возвращаемое значение:
//   Булево - Истина, если переданная строка соответствует виду час:мин, и Ложь в противном случае.
//
Функция ПроверитьФормат(ДлительностьСтр) Экспорт
	
	Поз = Найти(ДлительностьСтр, ":");
	Если Поз = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧасСтр = Лев(ДлительностьСтр, Поз-1);
	МинСтр = Сред(ДлительностьСтр, Поз+1);
	
	Если Не ЗначениеЗаполнено(ЧасСтр) Тогда
		ЧасСтр = "00";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(МинСтр) Тогда
		МинСтр = "00";
	КонецЕсли;
	
	Час = Число(ЧасСтр);
	Мин = Число(МинСтр);
	Если (Час >= 24) Или (Мин >= 60) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Час < 10 Тогда
		ЧасСтр = "0" + Час;
	КонецЕсли;
	Если Мин < 10 Тогда
		МинСтр = "0" + Мин;
	КонецЕсли;
	
	ДлительностьСтр = ЧасСтр + ":" + МинСтр;
	
	Возврат Истина;
	
КонецФункции

// Возвращает строку представления проекта и проектной задачи для одного поля.
//
// Параметры:
//   Проект - ЛюбаяСсылка, Строка - ссылка или строка представления проекта.
//   ПроектнаяЗадача - ЛюбаяСсылка, Строка - ссылка или строка представления проектной задачи.
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеПроектаЗадачи(Проект, ПроектнаяЗадача) Экспорт
	
	ПредставлениеПроектаЗадачи = "";
	
	Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		
		ПредставлениеПроектаЗадачи = Строка(Проект) + " (" + Строка(ПроектнаяЗадача) + ")";
		
	ИначеЕсли ЗначениеЗаполнено(Проект) Тогда
		
		ПредставлениеПроектаЗадачи = Строка(Проект);
		
	КонецЕсли;
	
	Возврат ПредставлениеПроектаЗадачи;
	
КонецФункции

// Добавляет к Строке Разделитель и ДобавляемоеЗначение в случае, если Строка и
// ДобавляемоеЗначение не пустые. Если Строка пустая или ДобавляемоеЗначение
// не заполнено - то добавляет к Строке ДобавляемоеЗначение.
//
// Параметры:
//   ИсходнаяСтрока - Строка - Модифицируется в процедуре.
//   Разделитель - Строка - Разделитель.
//   ДобавляемоеЗначение - Строка - Добавляемое значение.
//
Процедура ДобавитьЗначениеКСтрокеЧерезРазделитель(ИсходнаяСтрока, Разделитель, ДобавляемоеЗначение) Экспорт
	
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		ИсходнаяСтрока = Строка(ДобавляемоеЗначение);
	ИначеЕсли Не ПустаяСтрока(ДобавляемоеЗначение) Тогда
		ИсходнаяСтрока = Строка(ИсходнаяСтрока) + Разделитель + ДобавляемоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

// Получает картинку предмета из библиотеки согласно его роли.
//
// Параметры:
//   РольПредмета - Строка - роль предмета.
//
// Возвращаемое значение:
//   Картинка - картинка из библиотеки.
//
Функция КартинкаПоРолиПредмета(РольПредмета) Экспорт
	
	Если РольПредмета = "Заполняемый" Тогда //@NON-NLS-1
		Возврат БиблиотекаКартинок.ПредметЗаполняемый16;
	ИначеЕсли РольПредмета = "Вспомогательный" Тогда //@NON-NLS-1
		Возврат БиблиотекаКартинок.ПредметВспомогательный16;
	Иначе
		Возврат БиблиотекаКартинок.ПредметОсновной16;
	КонецЕсли;
	
КонецФункции

// Получает номер картинки предмета в коллекции согласно его роли.
//
// Параметры:
//   РольПредмета - Строка - роль предмета.
//
// Возвращаемое значение:
//   Число - номер картинки из КоллекцияРолиПредметов
//
Функция НомерКартинкиПоРолиПредмета(РольПредмета) Экспорт
	
	Если РольПредмета = "Заполняемый" Тогда //@NON-NLS-1
		Возврат 5;
	ИначеЕсли РольПредмета = "Вспомогательный" Тогда //@NON-NLS-1
		Возврат 3;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Проверяет, является ли справочником тип объекта ДО.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует справочнику ДО.
//
Функция ЭтоСправочник(Тип) Экспорт
	
	Возврат Тип = "DMCorrespondent"
		Или Тип = "DMCurrency"
		Или Тип = "DMOrganization"
		Или Тип = "DMFile"
		Или Тип = "DMProject"
		Или Тип = "DMSubdivision";
	
КонецФункции

// Проверяет, является ли документом в прикладном смысле тип объекта ДО.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует документу ДО (в прикладном смысле).
//
Функция ЭтоДокумент(Тип) Экспорт
	
	Возврат Тип = "DMInternalDocument"
		Или Тип = "DMIncomingDocument"
		Или Тип = "DMOutgoingDocument";
	
КонецФункции

// Проверяет, является ли тип объекта ДО бизнес-процессом.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует бизнес-процессу ДО.
//
Функция ЭтоБизнесПроцесс(Тип) Экспорт
	
	// Проверка родительского типа средствами фабрики слишком медленна.
	Возврат Тип = "DMBusinessProcess"
		Или Тип = "DMBusinessProcessAcquaintance"
		Или Тип = "DMBusinessProcessApproval"
		Или Тип = "DMBusinessProcessApproval_1.2.1.11"
		Или Тип = "DMBusinessProcessConfirmation"
		Или Тип = "DMBusinessProcessConsideration"
		Или Тип = "DMBusinessProcessInvitation"
		Или Тип = "DMBusinessProcessIssuesSolution"
		Или Тип = "DMBusinessProcessOrder"
		Или Тип = "DMBusinessProcessPerformance"
		Или Тип = "DMBusinessProcessPerformance_1.2.1.11"
		Или Тип = "DMBusinessProcessRegistration"
		Или Тип = "DMBusinessProcessIncomingDocumentProcessing"
		Или Тип = "DMBusinessProcessInternalDocumentProcessing"
		Или Тип = "DMBusinessProcessOutgoingDocumentProcessing"
		Или Тип = "DMComplexBusinessProcess";
	
КонецФункции

// Проверяет, является ли тип объекта ДО задачей бизнес-процесса.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует задаче ДО.
//
Функция ЭтоЗадачаБизнесПроцесса(Тип) Экспорт
	
	// Проверка родительского типа средствами фабрики слишком медленна.
	Возврат Тип = "DMBusinessProcessTask"
		Или Тип = "DMBusinessProcessApprovalTaskApproval"
		Или Тип = "DMBusinessProcessApprovalTaskCheckup"
		Или Тип = "DMBusinessProcessConfirmationTaskCheckup"
		Или Тип = "DMBusinessProcessConfirmationTaskConfirmation"
		Или Тип = "DMBusinessProcessConsiderationTaskAcquaint"
		Или Тип = "DMBusinessProcessInvitationTaskAcquaint"
		Или Тип = "DMBusinessProcessInvitationTaskInvitation"
		Или Тип = "DMBusinessProcessInvitationTaskNotify"
		Или Тип = "DMBusinessProcessIssuesSolutionTaskAnswer"
		Или Тип = "DMBusinessProcessIssuesSolutionTaskQuestion"
		Или Тип = "DMBusinessProcessOrderTaskCheckup"
		Или Тип = "DMBusinessProcessPerfomanceTaskCheckup"
		Или Тип = "DMBusinessProcessRegistrationTaskCheckup"
		Или Тип = "DMBusinessProcessRegistrationTaskRegistration";
	
КонецФункции

// Получает строковое представление срока действия по значениям реквизитов формы.
//
// Параметры:
//   ДатаНачала - Дата - дата начала действия.
//   Бессрочный - Булево - Истина, если документ бессрочный.
//   ДатаОкончания - Дата - дата окончания действия.
//   ПорядокПродленияID - Строка - порядок продления.
//   ПорядокПродления - Строка - описание порядка продления.
//
// Возвращаемое значение:
//   Строка - представление срока действия.
//
Функция ПредставлениеСрокаДействияДокумента(ДатаНачала, Бессрочный, ДатаОкончания,  ПорядокПродленияID,
		ПорядокПродления) Экспорт
	
	Результат = "";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'с %1';
				|en = 'from %1'"),
			Формат(ДатаНачала, "ДЛФ=D"));
	КонецЕсли;
	
	Если Бессрочный = Истина Тогда
		Результат = СтрШаблон(НСтр("ru = '%1, бессрочный';
									|en = '%1, indefinite'"),
			Результат);
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		Результат = СтрШаблон(НСтр("ru = '%1 по %2';
									|en = '%1 for %2'"),
			Результат,
			Формат(ДатаОкончания, "ДЛФ=D"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПорядокПродленияID) Тогда
		Если ПорядокПродленияID = "НеПродлевается" Тогда //@NON-NLS-1
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
					НСтр("ru = 'Не продлевается';
						|en = 'Not extended'"));
		ИначеЕсли ПорядокПродленияID = "ДопускаетПродление" Тогда //@NON-NLS-1
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
					НСтр("ru = 'Допускает продление';
						|en = 'Allows extension'"));
		Иначе
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Продлевается %1';
						|en = 'Extended %1'"),
					НРег(ПорядокПродления)));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает HTML-представление документа для показа в карточке по объекту XDTO.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки ИнтеграцияС1СДокументооборот с данными документа.
//
// Возвращаемое значение:
//   Строка - HTML-представление документа.
//
Функция ПолучитьОбзорДокумента(Форма) Экспорт
	
	HTMLЗаголовок =
		"<html>
		|<head>
		|<style type=""text/css"">
		|	body {
		|		overflow:    auto;
		|		margin-top:  6px;
		|		margin-left: 10px;
		|		margin-bottom: 0px;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|	table {
		|		width:       100%;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|	td {vertical-align: top;}
		| 	a:link {
		|		color: #006699; text-decoration: none;}
		|	a:visited {
		|		color: #006699; text-decoration: none;}
		|	a:hover {
		|		color: #006699; text-decoration: underline;}
		|	p {
		|		margin-top: 7px;}
		|</style>
		|<body>";
	
	HTMLЗавершение = "</body></html>";
	HTMLТекст = HTMLЗаголовок;
	
	HTMLТекст = HTMLТекст + "<table>";
	HTMLТекст = HTMLТекст + "<tr>";
	
	Если Форма.Тип = "DMIncomingDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td width=""40%"" align=center >";
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'От кого:';
												|en = 'From:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Отправитель,
			Форма.ОтправительID, Форма.ОтправительТип);
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + ВРег(Форма.ВидДокумента);
		HTMLТекст = HTMLТекст + "<p>";
		
		Если ЗначениеЗаполнено(Форма.НомерОтправителя) И ЗначениеЗаполнено(Форма.ДатаОтправителя) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				Формат(Форма.ДатаОтправителя, "ДЛФ=D") + " № " + Форма.НомерОтправителя);
		Иначе
			ДобавитьРеквизитКHTML(HTMLТекст, "__________ №__________", "");
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td width=""40%"">";
		
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Кому:';
												|en = 'To:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
		Если ЗначениеЗаполнено(Форма.Адресат) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Адресат);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:';
													|en = 'Business unit:'"), Форма.Подразделение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.ДатаРегистрации) И ЗначениеЗаполнено(Форма.РегистрационныйНомер) Тогда
			
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Рег. № %1 от %2';
						|en = 'Reg. No. %1 from %2'"),
					Форма.РегистрационныйНомер, Формат(Форма.ДатаРегистрации, "ДЛФ=D")));
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Срок исполнения:';
													|en = 'Due date:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"),,,
				?(Форма.СостояниеИсполнениеID <> "Исполнен" И Форма.СрокИсполнения < НачалоДня(ТекущаяДата()),
					"B22222",
					"")); //@NON-NLS-3
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:';
													|en = 'Amount:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
		КонецЕсли;
		
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		Если ЗначениеЗаполнено(Форма.Подписал) Тогда
			
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<td colspan=""3"">";
			
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
													|en = 'Signed:'"), Форма.Подписал);
			
			HTMLТекст = HTMLТекст + "</td></tr>";
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		Если ЗначениеЗаполнено(Форма.Ответственный)
			Или ЗначениеЗаполнено(Форма.Подразделение) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:';
													|en = 'Responsible person:'"), Форма.Ответственный);
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</tr>";
		
	ИначеЕсли Форма.Тип = "DMInternalDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
		
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 № %2 от %3';
				|en = '%1 No. %2 from %3'"),
			ВРег(Форма.ВидДокумента),
			?(ЗначениеЗаполнено(Форма.РегистрационныйНомер), Форма.РегистрационныйНомер, "_____"),
			?(ЗначениеЗаполнено(Форма.ДатаРегистрации), Формат(Форма.ДатаРегистрации, "ДЛФ=D"), "_____"));
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"" >";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" >";
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(
				HTMLТекст,
				НСтр("ru = 'Срок исполнения:';
					|en = 'Due date:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"),,,
				?(Форма.СостояниеИсполнениеID <> "Исполнен" И Форма.СрокИсполнения < НачалоДня(ТекущаяДата()),
					"B22222",
					"")); //@NON-NLS-3
		КонецЕсли;
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:';
													|en = 'Amount:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
			
			Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВнутреннийДокумент"
					И Форма.УчитыватьНДС Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма НДС:';
														|en = 'VAT amount:'"),
					Формат(Форма.СуммаНДС, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
			КонецЕсли;
			
			Если Форма.ВестиУчетТоваровИУслуг И Форма.Товары.Количество() > 0 Тогда
				КоличествоПозиций = Форма.Товары.Количество();
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Товары и услуги:';
														|en = 'Goods and services:'"),
					Формат(КоличествоПозиций, "ЧГ=") + " "
						+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(
							КоличествоПозиций,
							"",
							НСтр("ru = 'позиция,позиции,позиций,,,,,,0';
								|en = 'position,positions,positions,,,,,,0'")));
			КонецЕсли;
			
			Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВнутреннийДокумент"
					И Форма.ВестиУчетПоСтатьямДДС Тогда
				СтатьиДДС = Форма.СтатьиДДС;
				КоличествоСтатей = СтатьиДДС.Количество();
				Если КоличествоСтатей = 1 Тогда
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Статья ДДС:';
															|en = 'Cash flow item:'"),
						СтатьиДДС[0].СтатьяДДС);
				ИначеЕсли КоличествоСтатей > 1 Тогда
					ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Статьи ДДС:';
														|en = 'Cash flow items:'"));
					Разделитель = "";
					Для Каждого Строка Из СтатьиДДС Цикл
						HTMLТекст = HTMLТекст + Разделитель;
						ДобавитьЗначениеКHTML(HTMLТекст, Строка.СтатьяДДС, "");
						Разделитель = "; ";
					КонецЦикла;
					HTMLТекст = HTMLТекст + "<br>";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДобавитьПредставлениеСрокаДействия(HTMLТекст, Форма);
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		Если Форма.ВестиУчетПоКонтрагентам
				И (ЗначениеЗаполнено(Форма.Контрагент)
					Или Форма.Контрагенты.Количество()
					Или Форма.ЯвляетсяЗаявкойНаОплату) Тогда
			HTMLТекст = HTMLТекст + "<tr>";
			
			HTMLТекст = HTMLТекст + "<td width=""70%"">";
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Наша организация:';
													|en = 'Our company:'"), "");
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
			
			Если ЗначениеЗаполнено(Форма.Подписал) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
														|en = 'Signed:'"), Форма.Подписал);
			КонецЕсли;
			HTMLТекст = HTMLТекст + "</td>";
			
			ИспользоватьТерминКорреспонденты = Ложь;
			
			Если Не Форма.НесколькоКонтрагентов Тогда
				Если ЗначениеЗаполнено(Форма.Контрагент) Тогда
					HTMLТекст = HTMLТекст + "<td>";
					HTMLТекст = HTMLТекст + "<p>";
					
					Если ИспользоватьТерминКорреспонденты Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Корреспондент:';
																|en = 'Correspondent:'"), "");
					Иначе
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагент:';
																|en = 'Counterparty:'"), "");
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "<p>";
					
					ДобавитьРеквизитКHTML(HTMLТекст, "",
						Форма.Контрагент,
						Форма.КонтрагентID,
						Форма.КонтрагентТип);
					
					Если ЗначениеЗаполнено(Форма.ПодписалОтКонтрагента) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
																|en = 'Signed:'"), Форма.ПодписалОтКонтрагента);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Форма.КонтактноеЛицо) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контакт:';
																|en = 'Contact:'"), Форма.КонтактноеЛицо);
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "</td></tr>";
				КонецЕсли;
			Иначе
				HTMLТекст = HTMLТекст + "<td>";
				HTMLТекст = HTMLТекст + "<p>";
				
				Количество = 0;
				Для Каждого СтрокаКонтрагент Из Форма.Контрагенты Цикл
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентID) Тогда
						Количество = Количество + 1;
					КонецЕсли;
				КонецЦикла;
				
				Если Количество = 1 Тогда
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагент:';
															|en = 'Counterparty:'"), "");
				Иначе
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагенты:';
															|en = 'Counterparties:'"), "");
				КонецЕсли;
				
				HTMLТекст = HTMLТекст + "<p>";
				
				Для Каждого СтрокаКонтрагент Из Форма.Контрагенты Цикл
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентID) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, "",
							СтрокаКонтрагент.Контрагент,
							СтрокаКонтрагент.КонтрагентID,
							СтрокаКонтрагент.КонтрагентТип);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаКонтрагент.ПодписалОтКонтрагента) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст,
							НСтр("ru = 'Подписал:';
								|en = 'Signed:'"),
							СтрокаКонтрагент.ПодписалОтКонтрагента);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтактноеЛицо) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст,
							НСтр("ru = 'Контакт:';
								|en = 'Contact:'"),
							СтрокаКонтрагент.КонтактноеЛицо);
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "<p>";
				КонецЦикла;
				
				// Удаление лишнего отступа
				HTMLТекст = Лев(HTMLТекст, СтрДлина(HTMLТекст) - 3);
			КонецЕсли;
			HTMLТекст = HTMLТекст + "</tr>";
		Иначе
			ДобавитьСтороны(HTMLТекст, Форма);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		
		Если ЗначениеЗаполнено(Форма.Ответственный)
				Или ЗначениеЗаполнено(Форма.Подразделение)
				Или ЗначениеЗаполнено(Форма.Подготовил) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подготовил) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подготовил:';
													|en = 'Prepared:'"), Форма.Подготовил);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:';
													|en = 'Business unit:'"), Форма.Подразделение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:';
													|en = 'Responsible person:'"), Форма.Ответственный);
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</tr>";
		
	ИначеЕсли Форма.Тип = "DMOutgoingDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td width=""40%"" align=center >";
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'От кого:';
												|en = 'From:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + ВРег(Форма.ВидДокумента);
		HTMLТекст = HTMLТекст + "<p>";
		
		Если ЗначениеЗаполнено(Форма.ДатаРегистрации) И ЗначениеЗаполнено(Форма.РегистрационныйНомер) Тогда
			
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				Формат(Форма.ДатаРегистрации, "ДЛФ=D") + " № " +  Форма.РегистрационныйНомер);
			
		Иначе
			
			ДобавитьРеквизитКHTML(HTMLТекст, "__________ №__________", "");
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td width=""40%"">";
		
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Кому:';
												|en = 'To:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Получатель,
			Форма.ПолучательID, Форма.ПолучательТип);
		Если ЗначениеЗаполнено(Форма.Адресат) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Адресат);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Срок ответа:';
													|en = 'Period for response:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"));
		КонецЕсли;
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:';
													|en = 'Amount:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
		КонецЕсли;
		
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		Если ЗначениеЗаполнено(Форма.Подписал) Или ЗначениеЗаполнено(Форма.Подготовил)
				Или ЗначениеЗаполнено(Форма.Подразделение) Тогда
			
			Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
				HTMLТекст = HTMLТекст + "<p>";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Форма.Подписал) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
														|en = 'Signed:'"), Форма.Подписал);
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Подготовил) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подготовил:';
														|en = 'Prepared:'"), Форма.Подготовил);
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:';
														|en = 'Business unit:'"), Форма.Подразделение);
			КонецЕсли;
			
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:';
													|en = 'Responsible person:'"), Форма.Ответственный);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</tr>";
		
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""3"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если Форма.Тип = "DMInternalDocument" И ЗначениеЗаполнено(Форма.Папка) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Папка:';
												|en = 'Folder:'"), Форма.Папка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ГрифДоступа) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Гриф:';
												|en = 'Label:'"), Форма.ГрифДоступа);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ВопросДеятельности) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Вопрос:';
												|en = 'Question:'"), Форма.ВопросДеятельности);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Проект) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Проект:';
												|en = 'Project:'"), Форма.Проект);
	КонецЕсли;
	
	ДобавитьПредставлениеСостояний(HTMLТекст, Форма);
	
	Если ЗначениеЗаполнено(Форма.Комментарий) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Комментарий:';
												|en = 'Comment:'"), Форма.Комментарий);
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
	HTMLТекст = HTMLТекст + "</table>";
	
	HTMLТекст = HTMLТекст + HTMLЗавершение;
	
	Возврат HTMLТекст;
	
КонецФункции

// Формирует текстовое представление состава документа.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения -  форма обработки ИнтеграцияС1СДокументооборот с данными документа.
//
// Возвращаемое значение:
//   Строка - текстовое представление состава документа.
//
Функция ПолучитьСтрокуСоставДокумента(Форма) Экспорт
	
	СтрокаСостав = ?(Форма.КоличествоЛистов > 0, СтрШаблон(
		НСтр("ru = 'листов %1,';
			|en = 'pages %1,'") + " ", Форма.КоличествоЛистов), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.КоличествоПриложений > 0, СтрШаблон(
		НСтр("ru = 'приложений %1,';
			|en = 'appendices %1,'") + " ", Форма.КоличествоПриложений), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.ЛистовВПриложениях > 0, СтрШаблон(
		НСтр("ru = 'листов в приложениях %1,';
			|en = 'pages in appendices %1,'") + " ", Форма.ЛистовВПриложениях), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.КоличествоЭкземпляров > 0, СтрШаблон(
		НСтр("ru = 'экземпляров %1,';
			|en = 'copies %1,'") + " ", Форма.КоличествоЭкземпляров), "");
			
	СтрокаСостав = ВРег(Лев(СтрокаСостав,1)) + Прав(СтрокаСостав, СтрДлина(СтрокаСостав) - 1);
	
	Если Прав(СтрокаСостав, 2) = ", " Тогда
		СтрокаСостав = Лев(СтрокаСостав, СтрДлина(СтрокаСостав) - 2);
	КонецЕсли;
	
	Возврат СтрокаСостав;
	
КонецФункции

// Строковое описание разности дат в днях с учетом склонений
//
// Параметры:
//   Дата1 - Дата - первая дата.
//   Дата2 - Дата - вторая дата.
//   ИспользоватьДатуИВремяВСрокахЗадач - Булево - признак использования даты в сроках задач.
//
// Возвращаемое значение:
//   Строка - текстовое представление разности дат.
//
Функция РазностьДатВДнях(Дата1, Дата2, ИспользоватьДатуИВремяВСрокахЗадач = Истина) Экспорт
	
	Если ИспользоватьДатуИВремяВСрокахЗадач Тогда
		ЧислоЧасов = Окр((Дата1 - Дата2) / (60*60));
		ЧислоДней = Окр(ЧислоЧасов / 24);
		ЧислоЧасов = ЧислоЧасов - ЧислоДней * 24;
	Иначе
		ЧислоЧасов = 0;
		ЧислоДней = (НачалоДня(Дата1) - НачалоДня(Дата2)) / (60*60*24);
	КонецЕсли;
		
	Если ЧислоЧасов < 0 Тогда
		ЧислоДней = ЧислоДней - 1;
		ЧислоЧасов = ЧислоЧасов + 24;
	КонецЕсли;
	ПодписьДней = ПолучитьПодписьДней(ЧислоДней);
	ПодписьЧасов = ПолучитьПодписьЧасов(ЧислоЧасов);
	
	Если ИспользоватьДатуИВремяВСрокахЗадач Тогда
		Если ЧислоДней > 0 И ЧислоЧасов > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 %2 и %3 %4';
					|en = '%1 %2 and %3 %4'"),
				Строка(ЧислоДней),
				ПодписьДней,
				Строка(ЧислоЧасов),
				ПодписьЧасов);
		ИначеЕсли ЧислоДней > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоДней),
				ПодписьДней);
		ИначеЕсли ЧислоЧасов > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоЧасов),
				ПодписьЧасов);
		Иначе
			Возврат НСтр("ru = 'Менее 1 часа';
						|en = 'Less than 1 hour'");
		КонецЕсли;
	Иначе
		Если ЧислоДней > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоДней),
				ПодписьДней);
		Иначе
			Возврат НСтр("ru = 'Менее 1 дня';
						|en = 'Less than 1 day'");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет подпись к HTML-представлению объекта.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Подпись - Строка - текст подписи.
//
Процедура ДобавитьПодписьКHTML(HTMLТекст, Подпись)
	
	Если ЗначениеЗаполнено(Подпись) Тогда
		HTMLТекст = HTMLТекст + "<FONT color=#413003>";
		HTMLТекст = HTMLТекст + Подпись + " ";
		HTMLТекст = HTMLТекст + "</FONT>";
	КонецЕсли;
	
КонецПроцедуры

// Добавляет значение к HTML-представлению, оформляя его как ссылку при необходимости.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Представление - Строка - добавляемое значение.
//   Идентификатор - Строка - идентификатор добавляемого значения.
//   Тип - Строка - тип добавляемого значения.
//
Процедура ДобавитьЗначениеКHTML(HTMLТекст, Представление, Идентификатор = Неопределено, Тип = Неопределено, Цвет = "")
	
	Если ЗначениеЗаполнено(Идентификатор) И ЗначениеЗаполнено(Тип) Тогда
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<A href=dmil:%1>%2</A>",
			Тип + ":" + Идентификатор,
			Представление);
	Иначе
		Если ЗначениеЗаполнено(Цвет) Тогда
			HTMLТекст = HTMLТекст + "<FONT color=#"+Цвет+">";
			HTMLТекст = HTMLТекст + Представление;
			HTMLТекст = HTMLТекст + "</FONT>";
		Иначе
			HTMLТекст = HTMLТекст + Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет реквизит (подпись и значение) к HTML-представлению объекта
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Подпись - Строка - подпись реквизита.
//   Представление - Строка - добавляемое значение.
//   Идентификатор - Строка - идентификатор добавляемого значения.
//   Тип - Строка - тип добавляемого значения.
//
Процедура ДобавитьРеквизитКHTML(HTMLТекст, Подпись, Представление, Идентификатор = Неопределено, Тип = Неопределено,
		Цвет = "")
	
	ДобавитьПодписьКHTML(HTMLТекст, Подпись);
	ДобавитьЗначениеКHTML(HTMLТекст, Представление, Идентификатор, Тип, Цвет);
	HTMLТекст = HTMLТекст + "<br>";
	
КонецПроцедуры

// Добавляет представление состояний документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьПредставлениеСостояний(HTMLТекст, Форма)
	
	ПредставлениеМассив = Новый Массив;
	Последовательность = Новый Структура;
	Последовательность.Вставить("СостояниеСогласование");
	Последовательность.Вставить("СостояниеУтверждение");
	Последовательность.Вставить("СостояниеРегистрация");
	Последовательность.Вставить("СостояниеРассмотрение");
	Если Форма.Тип = "DMInternalDocument" Тогда
		Последовательность.Вставить("СостояниеПодписание");
	КонецЕсли;
	Последовательность.Вставить("СостояниеИсполнение");
	Для Каждого ТипСостояния Из Последовательность Цикл
		Состояние = Форма[ТипСостояния.Ключ];
		Если ЗначениеЗаполнено(Состояние) Тогда
			ПредставлениеМассив.Добавить(Состояние);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСостояний = ПредставлениеМассив.Количество();
	Если КоличествоСостояний > 1 Тогда
		Для Индекс = 0 По КоличествоСостояний - 1 Цикл
			Если ПредставлениеМассив[Индекс] = "Проект" Тогда
				ПредставлениеМассив.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Представление = СтрСоединить(ПредставлениеМассив, ", ");
	
	// Старые версии сервиса дают только одно состояние.
	Представление = ?(Представление = "", Форма.Состояние, Представление);
	Если Представление = "" Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Состояние:';
										|en = 'State:'"));
	HTMLТекст = HTMLТекст
		+ ?(Форма.ДоступенФункционалКОРП,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<A href=dmil:%1:%2:%3>%4</A>",
				Форма.Тип, Форма.ID, "status",
				Представление),
			Представление)
		+ "<br>";
	
КонецПроцедуры

// Добавляет представление срока действия документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьПредставлениеСрокаДействия(HTMLТекст, Форма)
	
	Представление = ПредставлениеСрокаДействияДокумента(
		Форма.ДатаНачалаДействия, Форма.Бессрочный, Форма.ДатаОкончанияДействия,
		Форма.ПорядокПродленияID, Форма.ПорядокПродления);
	Если Представление = "" Тогда
		Возврат;
	КонецЕсли;
		
	ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Срок действия:';
										|en = 'Validity period:'"));
	HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<A href=dmil:%1:%2:%3>%4</A>",
		Форма.Тип, Форма.ID, "term",
		Представление)
		+ "<br>";
		
КонецПроцедуры

// Добавляет дополнительные свойства документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьДополнительныеСвойства(HTMLТекст, Форма)
	
	Для Каждого СтрокаСвойства Из Форма.Свойства Цикл
		Если ЗначениеЗаполнено(СтрокаСвойства.Значение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст,
				СтрокаСвойства.Свойство + ":",
				СтрокаСвойства.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет стороны документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьСтороны(HTMLТекст, Форма)
	
	Если Не Форма.ВестиУчетСторон И Форма.Стороны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОрганизации = Новый Массив;
	СтрокиКонтрагенты = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Форма.Стороны Цикл
		Если СтрокаТаблицы.СторонаТип = "DMOrganization"
				Или ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИмяТипаXDTO(
					СтрокаТаблицы.СторонаТип) = "DMOrganization" Тогда
			СтрокиОрганизации.Добавить(СтрокаТаблицы);
		Иначе
			СтрокиКонтрагенты.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если Не СтрокиКонтрагенты.Количество() Тогда
		ИндексПоследнего = СтрокиОрганизации.ВГраница();
		Для Счетчик = 1 По ИндексПоследнего Цикл
			СтрокиКонтрагенты.Добавить(СтрокиОрганизации[Счетчик]);
		КонецЦикла;
		Для Счетчик = 0 По ИндексПоследнего - 1 Цикл
			СтрокиОрганизации.Удалить(ИндексПоследнего - Счетчик);
		КонецЦикла;
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
	HTMLТекст = HTMLТекст + "<p>";
	ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'СТОРОНЫ';
											|en = 'PARTIES'"), "");
	HTMLТекст = HTMLТекст + "</td></tr>";

	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td width=""70%"">";
	
	ДобавитьОписаниеСтороны(HTMLТекст, СтрокиОрганизации);
	ДобавитьОписаниеСтороны(HTMLТекст, СтрокиКонтрагенты);
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
КонецПроцедуры

// Добавляет стороны документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Сторона - Массив из СтрокаТаблицыЗначений - строки таблицы "Стороны" с формы внутреннего документа.
//
Процедура ДобавитьОписаниеСтороны(HTMLТекст, Сторона)
	
	Для Каждого ОписаниеСтороны Из Сторона Цикл
		
		Если ЗначениеЗаполнено(ОписаниеСтороны.Наименование) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, СокрЛП(ОписаниеСтороны.Наименование) + ":", "");
		КонецЕсли;
		ДобавитьРеквизитКHTML(HTMLТекст, "", ОписаниеСтороны.Сторона);
		
		Если ОписаниеСтороны.Подписан Тогда
			Подписант = ОписаниеСтороны.Подписал;
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:';
													|en = 'Signed:'"), Подписант);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеСтороны.КонтактноеЛицо) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контакт:';
													|en = 'Contact:'"), ОписаниеСтороны.КонтактноеЛицо);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
	КонецЦикла;
	
	HTMLТекст = HTMLТекст + "</td><td>";
	
КонецПроцедуры

// Подпись к количеству дней по склонениям
//
Функция ПолучитьПодписьДней(ЧислоДней)
	
	Если ЧислоДней > 10 И ЧислоДней < 20 Тогда
		Подпись = НСтр("ru = 'дней';
						|en = 'days'");
	Иначе
		ПоследниеДвеЦифры = ЧислоДней - Цел(ЧислоДней / 100) * 100;
		ПоследняяЦифра = ЧислоДней - Цел(ЧислоДней / 10) * 10;
		
		Если ПоследняяЦифра = 0 Тогда
			Подпись = НСтр("ru = 'дней';
							|en = 'days'");
		ИначеЕсли ПоследниеДвеЦифры > 10 И ПоследниеДвеЦифры < 20 Тогда
			Подпись = НСтр("ru = 'дней';
							|en = 'days'");
		ИначеЕсли ПоследниеДвеЦифры < 10 Или ПоследниеДвеЦифры > 20 Тогда
			Если ПоследняяЦифра = 1 Тогда
				Подпись = НСтр("ru = 'день';
								|en = 'day'");
			ИначеЕсли ПоследняяЦифра < 5 Тогда
				Подпись = НСтр("ru = 'дня';
								|en = 'days'");
			Иначе
				Подпись = НСтр("ru = 'дней';
								|en = 'days'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Подпись;
	
КонецФункции

// Подпись к количеству часов по склонениям
//
Функция ПолучитьПодписьЧасов(ЧислоЧасов)
	
	Если ЧислоЧасов > 10 И ЧислоЧасов < 20 Тогда
		Подпись = НСтр("ru = 'часов';
						|en = 'hours'");
	Иначе
		Срок = ЧислоЧасов - Цел(ЧислоЧасов / 10) * 10;
		Если Срок = 0 Тогда
			Подпись = НСтр("ru = 'часов';
							|en = 'hours'");
		ИначеЕсли Срок = 1 Тогда
			Подпись = НСтр("ru = 'час';
							|en = 'hour'");
		ИначеЕсли Срок < 5 Тогда
			Подпись = НСтр("ru = 'часа';
							|en = 'hours'");
		Иначе
			Подпись = НСтр("ru = 'часов';
							|en = 'hours'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Подпись;
	
КонецФункции

#КонецОбласти