////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Корректировка стоимости и амортизации ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения -
// 	ВспомогательныеРеквизиты - Структура -
Процедура ДополнитьВспомогательныеРеквизиты(Форма, ВспомогательныеРеквизиты) Экспорт

	//++ Локализация
	
	ВспомогательныеРеквизиты.Вставить("ПлательщикНалогаНаПрибыль", Форма.СлужебныеПараметрыФормы.ПлательщикНалогаНаПрибыль);
	ВспомогательныеРеквизиты.Вставить("ВедетсяУчетПостоянныхИВременныхРазниц", Форма.СлужебныеПараметрыФормы.ВедетсяУчетПостоянныхИВременныхРазниц);
	ВспомогательныеРеквизиты.Вставить("ВариантУчетаОтложенногоНалога", Форма.СлужебныеПараметрыФормы.ВариантУчетаОтложенногоНалога);
	ВспомогательныеРеквизиты.Вставить("ПоказатьПР", Форма.Элементы.ОСПоказатьПР.Пометка);
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
// 	Объект - ДокументОбъект.КорректировкаСтоимостиИАмортизацииОС -
// 	ВспомогательныеРеквизиты - Структура -
// 	СтруктураИзмененныхРеквизитов - Структура -
// 	ПараметрыРеквизитовОбъекта - Структура -
Процедура ДополнитьЗначенияСвойствЗависимыхРеквизитов(Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта) Экспорт

	//++ Локализация
	
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	СобственныеОС = (Объект.ВидИмущества <> ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное"));

	ЭтоКорректировкаНаНачалоГода = 
		НачалоДня(Объект.Дата) = НачалоГода(Объект.Дата)
		И НЕ Объект.ВключаетАмортизациюТекущегоМесяца;
	
	ДоступныПараметрыЗаПериод = 
		Объект.РежимИсправленияСПрошлойДаты
		И СобственныеОС;
	
	Если Объект.ПараметрыЗаПериодБУ.Количество() <> 0 Тогда
		МетодНачисленияАмортизацииБУ = Объект.ПараметрыЗаПериодБУ[0].МетодНачисленияАмортизацииБУ;
	Иначе
		МетодНачисленияАмортизацииБУ = Неопределено;
	КонецЕсли;
	
	#Область СтраницаОсновное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОтражатьВБУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидИмущества", 
			"ВидИмущества", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КорректировкаАмортизацииЗаПериод", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СобытиеОС", 
			"СобытиеОС", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.ИспользоватьУчетВнеоборотныхАктивовПоНаправлениямДеятельности
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПрименениеЦелевогоФинансирования", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И Объект.КорректировкаСтоимости 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеИзмененияСтоимостиНУЗаСчетПР", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И (Объект.ОтражатьВБУ
					И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
					И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6
				ИЛИ Объект.ОтражатьВУпрУчете
					И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КорректировкаПараметровРасчетаАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремии")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ОтражатьВНУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КорректировкаАмортизационнойПремии", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ОтражатьВНУ 
			И Объект.КорректировкаАмортизационнойПремии;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУвеличенияАмортизационнойПремии", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияАмортизационнойПремии", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ОтражатьВНУ
			И Объект.КорректировкаАмортизационнойПремии
			И Объект.ОтражениеУменьшенияАмортизационнойПремии;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияАмортизационнойПремииСторно", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	#КонецОбласти
	
	#Область СтраницаОС

	#Область БУ
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода")
		ИЛИ ОбновитьВсе Тогда
			
		ЕстьМетодЛинейный = Ложь;
		ЕстьМетодУменьшаемогоОстатка = Ложь;
		ЕстьМетодПоСуммеЧиселЛетИспользования = Ложь;
		ЕстьМетодПоЕНАОФ = Ложь;
		
		Если НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6 Тогда
			
			Для Каждого ДанныеСтроки Из Объект.ПараметрыЗаПериодБУ Цикл
				
				Если ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный") Тогда
					ЕстьМетодЛинейный = Истина;
				ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка") Тогда
					ЕстьМетодУменьшаемогоОстатка = Истина;
				ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования") Тогда
					ЕстьМетодПоСуммеЧиселЛетИспользования = Истина;
				ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ")
					ИЛИ ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега") Тогда
					ЕстьМетодПоЕНАОФ = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ДоступныПараметрыЗаПериод
			И ЕстьМетодПоЕНАОФ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУГодоваяНормаАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ДоступныПараметрыЗаПериод
			И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6
			И (ЕстьМетодЛинейный
				ИЛИ ЕстьМетодУменьшаемогоОстатка
				ИЛИ ЕстьМетодПоСуммеЧиселЛетИспользования);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУГрафикАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	#КонецОбласти
	
	#Область НУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПервоначальнойСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РаздельнаяКорректировкаТекущегоИПрошлогоПериодов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизацииЗаПериод")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСуммыРасходовНУПриИНВ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И Объект.КорректировкаСтоимости
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль;
					
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьНУ", 
			"ОССтоимостьНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		//
		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И Объект.КорректировкаАмортизации
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И НЕ Объект.КорректировкаАмортизацииЗаПериод;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияНУ", 
			"ОСАмортизацияНУ", 
			"Видимость", 
			ЗначениеСвойства И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияНаНачалоГодаНУ", 
			"ОСАмортизацияНаНачалоГодаНУ", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И Объект.КорректировкаПервоначальнойСтоимости
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ПервоначальнаяСтоимостьНУ", 
			"ОСПервоначальнаяСтоимостьНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И Объект.КорректировкаСуммыРасходовНУПриИНВ
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СуммаРасходовНУПриИНВ", 
			"ОССуммаРасходовНУПриИНВ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПР
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПервоначальнойСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПараметровРасчетаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизацииЗаПериод")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеИзмененияСтоимостиНУЗаСчетПР")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПоказатьПР")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.КорректировкаСтоимости 
			И НЕ Объект.ОтражениеИзмененияСтоимостиНУЗаСчетПР 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И (ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
				ИЛИ ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод"));

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьПР", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.КорректировкаСтоимости 
			И НЕ Объект.ОтражениеИзмененияСтоимостиНУЗаСчетПР 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И (ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
				ИЛИ ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод")
					И ВспомогательныеРеквизиты.ПоказатьПР);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьПР", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.КорректировкаАмортизации
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
				ИЛИ НЕ ЭтоКорректировкаНаНачалоГода)
			И (ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
				ИЛИ ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод"));
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияПР", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.КорректировкаАмортизации 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
				ИЛИ НЕ ЭтоКорректировкаНаНачалоГода)
			И (ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
				ИЛИ ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод")
					И ВспомогательныеРеквизиты.ПоказатьПР);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияПР", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.КорректировкаАмортизации 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов
			И (ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
				ИЛИ ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияНаНачалоГодаПР", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.КорректировкаАмортизации 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов
			И (ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
				ИЛИ ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод")
					И ВспомогательныеРеквизиты.ПоказатьПР);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияНаНачалоГодаПР", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.КорректировкаПараметровРасчетаАмортизации 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И ВспомогательныеРеквизиты.ВедетсяУчетПостоянныхИВременныхРазниц
			И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ПРДляВычисленияАмортизации", 
			"ОСПРДляВычисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И (Объект.КорректировкаСтоимости
					И НЕ Объект.ОтражениеИзмененияСтоимостиНУЗаСчетПР 
				ИЛИ Объект.КорректировкаАмортизации) 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			И ВспомогательныеРеквизиты.ВариантУчетаОтложенногоНалога = ПредопределенноеЗначение("Перечисление.ВариантыУчетаОтложенногоНалога.БалансовыйМетод");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСПоказатьПР", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЦФ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РаздельнаяКорректировкаТекущегоИПрошлогоПериодов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПрименениеЦелевогоФинансирования")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.КорректировкаСтоимости 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ПрименениеЦелевогоФинансирования;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьЦФ", 
			"ОССтоимостьЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.КорректировкаАмортизации 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ПрименениеЦелевогоФинансирования;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияЦФ", 
			"ОСАмортизацияЦФ", 
			"Видимость", 
			ЗначениеСвойства И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияНаНачалоГодаЦФ", 
			"ОСАмортизацияНаНачалоГодаЦФ", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЗалоговаяСтоимость
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное"); 
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ЗалоговаяСтоимость", 
			"ОСЗалоговаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	#КонецОбласти
	
	#Область АмортизационнаяПремия
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизационнойПремии")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И Объект.КорректировкаАмортизационнойПремии
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
					
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизационнаяПремия", 
			"ОСАмортизационнаяПремия", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
						
	КонецЕсли;
	
	#КонецОбласти
	
	#КонецОбласти
		
	#Область ПараметрыНУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И ДоступныПараметрыЗаПериод;
					
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыЗаПериодНУ", 
			"ПараметрыЗаПериодНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДатаВводаВЭксплуатациюНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АмортизацияНУНаНачалоПериода", 
			"АмортизацияНУНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНУНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АмортизацияПРНаНачалоПериода", 
			"АмортизацияПРНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияПРНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияНУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДатаВводаВЭксплуатациюНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВНУ
			И ДоступныПараметрыЗаПериод
			И Объект.ДатаВводаВЭксплуатациюНУ < '200901010000'
			И ЗначениеЗаполнено(Объект.ДатаВводаВЭксплуатациюНУ);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ФактическийСрокИспользованияДо2009", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ФактическийСрокИспользованияДо2009Расшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияДо2009", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияДо2009Валюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	#КонецОбласти

	#Область СтраницаРасходыИДоходы
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремииСторно")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.ОтражатьВНУ
			И Объект.КорректировкаАмортизационнойПремии
			И (Объект.ОтражениеУвеличенияАмортизационнойПремии
				ИЛИ Объект.ОтражениеУменьшенияАмортизационнойПремии
					И Объект.ОтражениеУменьшенияАмортизационнойПремииСторно)
			И СобственныеОС;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовАмортизационнаяПремия", 
			"СпособОтраженияРасходовАмортизационнаяПремия", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеАмортизационнаяПремия", 
			"ПодразделениеАмортизационнаяПремия", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиАмортизационнаяПремия", 
			"НаправлениеДеятельностиАмортизационнаяПремия", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаАмортизационнаяПремия", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаАмортизационнаяПремия", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУвеличениеАмортизационнойПремии", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремииСторно")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.ОтражатьВНУ
			И Объект.КорректировкаАмортизационнойПремии
			И Объект.ОтражениеУменьшенияАмортизационнойПремии
			И НЕ Объект.ОтражениеУменьшенияАмортизационнойПремииСторно
			И СобственныеОС;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизационнойПремии", 
			"ПодразделениеУменьшениеАмортизационнойПремии", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизационнойПремии", 
			"НаправлениеДеятельностиУменьшениеАмортизационнойПремии", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизационнойПремии", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизационнойПремии", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеАмортизационнойПремии", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПрименениеЦелевогоФинансирования")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.ОтражатьВБУ
			И Объект.КорректировкаСтоимости
			И Объект.ОтражениеУвеличенияСтоимости
			И Объект.ПрименениеЦелевогоФинансирования
			И СобственныеОС;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеДоходовЦФ", 
			"ПодразделениеУвеличениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеДоходовЦФ", 
			"НаправлениеДеятельностиУвеличениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУвеличениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПрименениеЦелевогоФинансирования")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.ОтражатьВБУ
			И Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости
			И Объект.ПрименениеЦелевогоФинансирования
			И СобственныеОС;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеДоходовЦФ", 
			"ПодразделениеУменьшениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеДоходовЦФ", 
			"НаправлениеДеятельностиУменьшениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеДоходовЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.КорректировкаСтоимости
			И Объект.ОтражениеУвеличенияСтоимости
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеДоходовЦФ", 
			"ПодразделениеУвеличениеДоходовЦФ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеДоходовЦФ", 
			"НаправлениеДеятельностиУвеличениеДоходовЦФ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеДоходовЦФ", 
			"ПодразделениеУменьшениеДоходовЦФ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеДоходовЦФ", 
			"НаправлениеДеятельностиУменьшениеДоходовЦФ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения -
// 	СтруктураИзмененныхРеквизитов - Структура -
Процедура НастроитьЗависимыеЭлементыФормы(Форма, СтруктураИзмененныхРеквизитов) Экспорт

	//++ Локализация
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	СлужебныеПараметрыФормы = Форма.СлужебныеПараметрыФормы;

	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	Если ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			?(СлужебныеПараметрыФормы.ИспользоватьУчетВнеоборотныхАктивовПоНаправлениямДеятельности,
				НСтр("ru = 'Стоимость (собственные средства)';
					|en = 'Cost (own funds)'"),
				НСтр("ru = 'Стоимость';
					|en = 'Profit'"));
				
		Элементы.ОСГруппаСтоимость.Заголовок = ЗначениеСвойства;
		
		//
		ЗначениеСвойства = 
			?(СлужебныеПараметрыФормы.ИспользоватьУчетВнеоборотныхАктивовПоНаправлениямДеятельности,
				НСтр("ru = 'Амортизация (собственные средства)';
					|en = 'Depreciation (own funds)'"),
				НСтр("ru = 'Амортизация';
					|en = 'Depreciation'"));
				
		Элементы.ОСГруппаАмортизация.Заголовок = ЗначениеСвойства;
		
	КонецЕсли;
	
	#Область СтраницаПараметры
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СрокИспользованияДляВычисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ ОбновитьВсе Тогда
		
		Если Объект.ПараметрыЗаПериодБУ.Количество() > 0 Тогда
			Форма.СрокИспользованияБУРасшифровка = 
				ВнеоборотныеАктивыКлиентСервер.ПредставлениеКоличестваМесяцевСтрокой(Объект.ПараметрыЗаПериодБУ[0].СрокИспользованияДляВычисленияАмортизации);
		Иначе
			Форма.СрокИспользованияБУРасшифровка = "";
		КонецЕсли;
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СрокПолезногоИспользованияНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ ОбновитьВсе Тогда
		
		Если Объект.ПараметрыЗаПериодНУ.Количество() > 0 Тогда
			Форма.СрокИспользованияНУРасшифровка = 
				ВнеоборотныеАктивыКлиентСервер.ПредставлениеКоличестваМесяцевСтрокой(Объект.ПараметрыЗаПериодНУ[0].СрокПолезногоИспользованияНУ);
		Иначе
			Форма.СрокИспользованияНУРасшифровка = "";
		КонецЕсли;
			
	КонецЕсли;
	
	#КонецОбласти
		
	#Область ПараметрыБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ ОбновитьВсе Тогда
		
		ВалютаРеглПредставление = СлужебныеПараметрыФормы.ВалютаРеглПредставление;
		
		Элементы.ПараметрыЗаПериодБУАмортизацияЦФ.Заголовок = СтрШаблон(НСтр("ru = 'Целевые средства в амортизации (%1)';
																			|en = 'Target funds in depreciation (%1)'"), ВалютаРеглПредставление);
		
		Элементы.ПараметрыЗаПериодБУСтоимостьПР.Заголовок = СтрШаблон(НСтр("ru = 'Постоянные разницы (%1)';
																			|en = 'Permanent differences (%1)'"), ВалютаРеглПредставление);
		Элементы.ПараметрыЗаПериодБУСтоимостьЦФ.Заголовок = СтрШаблон(НСтр("ru = 'Целевые средства в стоимости (%1)';
																			|en = 'Target funds in cost (%1)'"), ВалютаРеглПредставление);
		Элементы.ПараметрыЗаПериодБУСтоимостьПРЦФ.Заголовок = СтрШаблон(НСтр("ru = 'Постоянные разницы целевых средств (%1)';
																			|en = 'Permanent differences of target funds (%1)'"), ВалютаРеглПредставление);
		
		Элементы.ПараметрыЗаПериодБУЛиквидационнаяСтоимость.Заголовок = СтрШаблон(НСтр("ru = 'Ликвидационная стоимость (%1)';
																						|en = 'Residual value (%1)'"), ВалютаРеглПредставление);

		Элементы.ПараметрыЗаПериодБУГруппаИзменениеАмортизации.Заголовок = СтрШаблон(НСтр("ru = 'Изменение амортизации (%1)';
																							|en = 'Change depreciation (%1)'"), ВалютаРеглПредставление);

		Если НЕ Элементы.ПараметрыЗаПериодБУАмортизацияПРИзменение.Видимость
			И НЕ Элементы.ПараметрыЗаПериодБУАмортизацияЦФИзменение.Видимость
			И НЕ Элементы.ПараметрыЗаПериодБУАмортизацияПРЦФИзменение.Видимость Тогда
				
			Элементы.ПараметрыЗаПериодБУГруппаИзменениеАмортизации.ОтображатьВШапке = Ложь;
			Элементы.ПараметрыЗаПериодБУАмортизацияРеглИзменение.Заголовок = СтрШаблон(НСтр("ru = 'Изменение амортизации (%1)';
																							|en = 'Change depreciation (%1)'"), ВалютаРеглПредставление);
			
		Иначе
			Элементы.ПараметрыЗаПериодБУГруппаИзменениеАмортизации.ОтображатьВШапке = Истина;
			Элементы.ПараметрыЗаПериодБУАмортизацияРеглИзменение.Заголовок = НСтр("ru = 'БУ';
																					|en = 'AC'");
		КонецЕсли;

	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыНУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ ОбновитьВсе Тогда
		
		ВалютаРеглПредставление = СлужебныеПараметрыФормы.ВалютаРеглПредставление;
		
		Элементы.ПараметрыЗаПериодБУАмортизацияПР.Заголовок = СтрШаблон(НСтр("ru = 'Постоянные разницы в амортизации (%1)';
																			|en = 'Permanent differences in depreciation (%1)'"), ВалютаРеглПредставление);
		Элементы.ПараметрыЗаПериодБУПРДляВычисленияАмортизации.Заголовок = СтрШаблон(НСтр("ru = 'Постоянные разницы (%1)';
																							|en = 'Permanent differences (%1)'"), ВалютаРеглПредставление);

		Элементы.ПараметрыЗаПериодНУАмортизацияНУ.Заголовок = СтрШаблон(НСтр("ru = 'Амортизация (%1)';
																			|en = 'Depreciation (%1)'"), ВалютаРеглПредставление);
		Элементы.ПараметрыЗаПериодНУСтоимостьНУ.Заголовок = СтрШаблон(НСтр("ru = 'Стоимость (%1)';
																			|en = 'Cost (%1)'"), ВалютаРеглПредставление);
		Элементы.ПараметрыЗаПериодНУАмортизационнаяПремия.Заголовок = СтрШаблон(НСтр("ru = 'Амортизационная премия (%1)';
																					|en = 'Bonus depreciation (%1)'"), ВалютаРеглПредставление);
		Элементы.ПараметрыЗаПериодНУАмортизацияНУИзменение.Заголовок = СтрШаблон(НСтр("ru = 'Изменение амортизации (%1)';
																						|en = 'Change depreciation (%1)'"), ВалютаРеглПредставление);
		
	КонецЕсли;

	#КонецОбласти
	
	#Область СтраницаРасходыИДоходы
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовАмортизационнаяПремия") 
		ИЛИ ОбновитьВсе Тогда
			
		ИменаПолей = 
			"СтатьяРасходовАмортизационнаяПремия,АналитикаРасходовАмортизационнаяПремия,
			|ПодразделениеАмортизационнаяПремия,НаправлениеДеятельностиАмортизационнаяПремия,
			|ПараметрыРасходовСовпадаютСДаннымиУчетаАмортизационнаяПремия";
			
		ВнеоборотныеАктивыКлиентСервер.НастроитьЭлементыПоСпособуОтраженияРасходов(
			Объект.СпособОтраженияРасходовАмортизационнаяПремия,
			Форма, 
			ИменаПолей);
	
	КонецЕсли;
	
	#КонецОбласти
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения -
// 	ВспомогательныеРеквизиты - Структура -
// 	СписокРеквизитов - Массив -
Процедура ПриИзмененииРеквизитов(Форма, ВспомогательныеРеквизиты, СписокРеквизитов) Экспорт

	//++ Локализация
	
	Объект = Форма.Объект;
	
	// ВАЖНО: Порядок имеет значение!
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено
		ИЛИ СписокРеквизитов.Найти("ОтражатьВБУ") <> Неопределено
		ИЛИ СписокРеквизитов.Найти("ОтражатьВНУ") <> Неопределено
		ИЛИ СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено Тогда
	
		Если Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное")
			И (Объект.ОтражатьВНУ ИЛИ Объект.ОтражатьВУпрУчете) Тогда
			
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
			
			СписокРеквизитов.Добавить("ВидИмущества");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ВидИмущества") <> Неопределено Тогда
	
		Если Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное")
			И (Объект.ОтражатьВУпрУчете
				ИЛИ Объект.ОтражатьВНУ) Тогда
				
			Объект.ОтражатьВРеглУчете = Истина;
			Объект.ОтражатьВБУ = Истина;
			Объект.ОтражатьВНУ = Ложь;
			Объект.ОтражатьВУпрУчете = Ложь;
			Объект.ОтражатьВНУ = Ложь;
			
			СписокРеквизитов.Добавить("ОтражатьВУпрУчете,ОтражатьВНУ");
			
			СписокРеквизитов.Добавить("ОтражатьВУпрУчете,ОтражатьВРеглУчете,ОтражатьВБУ,ОтражатьВНУ");
		КонецЕсли;
		
		Если Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное")
			И Объект.РежимИсправленияСПрошлойДаты Тогда
				
			Объект.РежимИсправленияСПрошлойДаты = Ложь;
			Объект.НачалоПериода = '000101010000';
			
			СписокРеквизитов.Добавить("РежимИсправленияСПрошлойДаты,НачалоПериода");
			
		КонецЕсли;
		
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

// 
// Параметры:
// 	Объект - ДокументОбъект.КорректировкаСтоимостиИАмортизацииОС -
// 	ПараметрыРеквизита - см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта
// 	Действие - Строка -
// 	ИзмененныеРеквизиты - Массив -
Процедура ЗаполнитьРеквизитыВЗависимостиОтСвойств(Объект, ПараметрыРеквизита, Действие, ИзмененныеРеквизиты) Экспорт

	//++ Локализация
	
	Если ПараметрыРеквизита.ИмяРеквизита = "ВидИмущества" Тогда
		Если Действие = "Заполнить" Тогда
			Объект[ПараметрыРеквизита.ИмяРеквизита] = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
			ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
		КонецЕсли; 
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры
 
#КонецОбласти
