////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Корректировка стоимости и амортизации ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
// 
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения - Строка - 
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоступлениеАрендованныхОС") Тогда
		
		ЗаполнитьНаОснованииПоступленияАрендованныхОС(Объект, ДанныеЗаполнения, СтандартнаяОбработка);
		
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьВспомогательныеРеквизиты(Объект, ВспомогательныеРеквизиты) Экспорт

	//++ Локализация
	
	ДатаДок = ?(Объект.Дата <> '000101010000', Объект.Дата, ТекущаяДатаСеанса());
	
	ВспомогательныеРеквизиты.Вставить("ПлательщикНалогаНаПрибыль", УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Объект.Организация, ДатаДок));
	ВспомогательныеРеквизиты.Вставить("ПоддержкаПБУ18", УчетнаяПолитика.ПоддержкаПБУ18(Объект.Организация, ДатаДок));
	ВспомогательныеРеквизиты.Вставить("ВедетсяУчетПостоянныхИВременныхРазниц", УчетнаяПолитика.ВедетсяУчетПостоянныхИВременныхРазниц(Объект.Организация, ДатаДок));
	ВспомогательныеРеквизиты.Вставить("ВариантУчетаОтложенногоНалога", НалоговыйУчет.ВариантУчетаОтложенногоНалога(ДатаДок, Объект.Организация));
	ВспомогательныеРеквизиты.Вставить("ПоказатьПР", Истина);
	
	//-- Локализация
	
КонецПроцедуры

Процедура НастроитьЗависимыеЭлементыФормы(Форма, СтруктураИзмененныхРеквизитов) Экспорт

	//++ Локализация
	
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	Объект = Форма.Объект; // ДокументОбъект.КорректировкаСтоимостиИАмортизацииОС
	Элементы = Форма.Элементы;
	СлужебныеПараметрыФормы = Форма.СлужебныеПараметрыФормы;
	
	ВалютаУпрПредставление = СлужебныеПараметрыФормы.ВалютаУпрПредставление;
	ВалютаРеглПредставление = СлужебныеПараметрыФормы.ВалютаРеглПредставление;
	
	Если ОбновитьВсе Тогда

		Элементы.ПараметрыЗаПериодАмортизацияРегл.Видимость = Ложь;
		Элементы.ПараметрыЗаПериодАмортизация.Заголовок = СтрШаблон(НСтр("ru = 'Амортизация (%1)';
																		|en = 'Depreciation (%1)'"), ВалютаУпрПредставление);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ ОбновитьВсе Тогда
		
		ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
			"ПлательщикНалогаНаПрибыль",
			УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Объект.Организация, Объект.Дата),
			Форма.СлужебныеПараметрыФормы);
			
		ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
			"ВедетсяУчетПостоянныхИВременныхРазниц",
			УчетнаяПолитика.ВедетсяУчетПостоянныхИВременныхРазниц(Объект.Организация, Объект.Дата),
			Форма.СлужебныеПараметрыФормы);
			
		ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
			"ВариантУчетаОтложенногоНалога",
			НалоговыйУчет.ВариантУчетаОтложенногоНалога(Объект.Дата, Объект.Организация),
			Форма.СлужебныеПараметрыФормы);
			
		Если Элементы.ОСПоказатьПР.Видимость Тогда
			
			Для Каждого ДанныеСтроки Из Объект.ОС Цикл
				
				Если ДанныеСтроки.СтоимостьПР <> 0
					ИЛИ ДанныеСтроки.АмортизацияПР <> 0
					ИЛИ ДанныеСтроки.АмортизацияНаНачалоГодаПР <> 0 Тогда
					
					Элементы.ОСПоказатьПР.Пометка = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества") 
		ИЛИ ОбновитьВсе Тогда
		
		СписокПараметровВыбора = Новый Массив;
		ПараметрВыбора = Новый ПараметрВыбора("Контекст", "БУ,УУ");
		СписокПараметровВыбора.Добавить(ПараметрВыбора);
		ПараметрВыбора = Новый ПараметрВыбора("РеквизитыКоторыеДолжныСовпадать", "Организация,Подразделение");
		СписокПараметровВыбора.Добавить(ПараметрВыбора);
		
		Если Объект.ВидИмущества = Перечисления.ВидыИмущества.Арендованное Тогда
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Состояние", Перечисления.СостоянияОС.ПринятоКЗабалансовомуУчету);
		Иначе
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Состояние", Перечисления.СостоянияОС.ПринятоКУчету);
		КонецЕсли; 
		СписокПараметровВыбора.Добавить(ПараметрВыбора);
		
		Элементы.ОСОсновноеСредство.ПараметрыВыбора = Новый ФиксированныйМассив(СписокПараметровВыбора);
				
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ ОбновитьВсе Тогда
		
		Элементы.ОССтоимостьНУ.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'НУ';
																		|en = 'TA'"), ВалютаРеглПредставление);
		
		Элементы.ОССтоимостьПР.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'ПР';
																		|en = 'PD'"), ВалютаРеглПредставление);
		
		Элементы.ОССтоимостьЦФ.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'Стоимость (целевое финансирование)';
																		|en = 'Cost (target financing)'"), ВалютаРеглПредставление);
		
		Элементы.ОСАмортизацияНУ.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'НУ';
																		|en = 'TA'"), ВалютаРеглПредставление);
		
		Элементы.ОСАмортизацияПР.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'ПР';
																		|en = 'PD'"), ВалютаРеглПредставление);
		
		Элементы.ОСАмортизацияЦФ.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'Амортизация (целевое финансирование)';
																		|en = 'Depreciation (target financing)'"), ВалютаРеглПредставление);

		Элементы.ОСПервоначальнаяСтоимостьНУ.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'НУ';
																		|en = 'TA'"), ВалютаРеглПредставление);
		
		Элементы.ОСЗалоговаяСтоимость.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'Залоговая стоимость';
																		|en = 'Collateral value'"), ВалютаРеглПредставление);
		
		Элементы.ОСПРДляВычисленияАмортизации.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'Постоянные разницы для вычисления амортизации';
																		|en = 'Permanent differences for depreciation calculation'"), ВалютаРеглПредставление);
	
		Элементы.ОССуммаРасходовНУПриИНВ.Заголовок = 
			ВнеоборотныеАктивыКлиентСервер.ДобавитьКСтрокеВалюту(НСтр("ru = 'Сумма расходов НУ при ИНВ';
																		|en = 'TA expense amount of investment tax deduction'"), ВалютаРеглПредставление)

	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода") 
		ИЛИ ОбновитьВсе Тогда
	
		ВнеоборотныеАктивыКлиентСервер.УстановитьВидимостьЗначенияСпискаВыбора(
			Элементы.ПараметрыЗаПериодБУМетодНачисленияАмортизацииБУ.СписокВыбора, 
			НЕ Форма.СлужебныеПараметрыФормы.ПрименяетсяФСБУ6_ЗаПериод, 
			ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования"));
			
		ВнеоборотныеАктивыКлиентСервер.УстановитьВидимостьЗначенияСпискаВыбора(
			Элементы.ПараметрыЗаПериодБУМетодНачисленияАмортизацииБУ.СписокВыбора, 
			НЕ Форма.СлужебныеПараметрыФормы.ПрименяетсяФСБУ6_ЗаПериод, 
			ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФ"));
			
		ВнеоборотныеАктивыКлиентСервер.УстановитьВидимостьЗначенияСпискаВыбора(
			Элементы.ПараметрыЗаПериодБУМетодНачисленияАмортизацииБУ.СписокВыбора, 
			НЕ Форма.СлужебныеПараметрыФормы.ПрименяетсяФСБУ6_ЗаПериод, 
			ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега"));
		
	КонецЕсли;

	//-- Локализация
	
КонецПроцедуры

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	
	ТекстЗапросаТаблицаПараметрыАмортизацииОСБУ(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСобытияОСОрганизаций(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаИсправлениеПараметровНалогаНаИмущество(ТекстыЗапроса, Регистры);
	
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(ТекстыЗапроса, Регистры);
	
	//-- Локализация
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт

	//++ Локализация
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	#Область ОССтоимостьБУ_ОтметкаНезаполненного
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОССтоимостьБУ.Имя);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	#КонецОбласти
		
	//-- Локализация
	
КонецПроцедуры

Функция ТекстЗапросаЗаполнитьПоДаннымУчета() Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьИАмортизация.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(СтоимостьИАмортизация.СтоимостьУУ) КАК СтоимостьУУ,
	|	СУММА(СтоимостьИАмортизация.СтоимостьБУ) КАК СтоимостьБУ,
	|	СУММА(СтоимостьИАмортизация.СтоимостьНУ) КАК СтоимостьНУ,
	|	СУММА(СтоимостьИАмортизация.СтоимостьПР) КАК СтоимостьПР,
	|	СУММА(СтоимостьИАмортизация.СтоимостьЦФ) КАК СтоимостьЦФ,
	|	СУММА(СтоимостьИАмортизация.АмортизацияБУ) КАК АмортизацияБУ,
	|	СУММА(СтоимостьИАмортизация.АмортизацияНУ) КАК АмортизацияНУ,
	|	СУММА(СтоимостьИАмортизация.АмортизацияПР) КАК АмортизацияПР,
	|	СУММА(СтоимостьИАмортизация.АмортизацияУУ) КАК АмортизацияУУ,
	|	СУММА(СтоимостьИАмортизация.АмортизацияЦФ) КАК АмортизацияЦФ,
	|	СУММА(СтоимостьИАмортизация.ЗалоговаяСтоимость) КАК ЗалоговаяСтоимость
	|
	|ПОМЕСТИТЬ СтоимостьИАмортизация
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|		СтоимостьОСОстатки.СтоимостьОстаток КАК СтоимостьУУ,
	|		СтоимостьОСОстатки.СтоимостьРеглОстаток КАК СтоимостьБУ,
	|		СтоимостьОСОстатки.СтоимостьНУОстаток КАК СтоимостьНУ,
	|		СтоимостьОСОстатки.СтоимостьПРОстаток КАК СтоимостьПР,
	|		СтоимостьОСОстатки.СтоимостьЦФОстаток КАК СтоимостьЦФ,
	|		СтоимостьОСОстатки.ЗалоговаяСтоимостьОстаток КАК ЗалоговаяСтоимость,
	|		0 КАК АмортизацияБУ,
	|		0 КАК АмортизацияНУ,
	|		0 КАК АмортизацияПР,
	|		0 КАК АмортизацияУУ,
	|		0 КАК АмортизацияЦФ
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС.Остатки(
	|			&ПериодГраница,
	|			&КорректировкаСтоимости 
	|			И Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)) КАК СтоимостьОСОстатки
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СтоимостьОС.ОсновноеСредство,
	|		СтоимостьОС.Стоимость,
	|		ВЫБОР
	|			КОГДА СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -СтоимостьОС.СтоимостьРегл
	|			ИНАЧЕ СтоимостьОС.СтоимостьРегл
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -СтоимостьОС.СтоимостьНУ
	|			ИНАЧЕ СтоимостьОС.СтоимостьНУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -СтоимостьОС.СтоимостьПР
	|			ИНАЧЕ СтоимостьОС.СтоимостьПР
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -СтоимостьОС.СтоимостьЦФ
	|			ИНАЧЕ СтоимостьОС.СтоимостьЦФ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -СтоимостьОС.ЗалоговаяСтоимость
	|			ИНАЧЕ СтоимостьОС.ЗалоговаяСтоимость
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|	ГДЕ
	|		СтоимостьОС.Регистратор = &Ссылка
	|		И СтоимостьОС.Организация = &Организация
	|		И СтоимостьОС.Период < &Период
	|		И &КорректировкаСтоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		АмортизацияОСОстатки.ОсновноеСредство,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		-АмортизацияОСОстатки.АмортизацияРеглОстаток,
	|		-АмортизацияОСОстатки.АмортизацияНУОстаток,
	|		-АмортизацияОСОстатки.АмортизацияПРОстаток,
	|		-АмортизацияОСОстатки.АмортизацияОстаток,
	|		-АмортизацияОСОстатки.АмортизацияЦФОстаток
	|	ИЗ
	|		РегистрНакопления.АмортизацияОС.Остатки(
	|			&ПериодГраница, 
	|			&КорректировкаАмортизации
	|				И Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)) КАК АмортизацияОСОстатки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		АмортизацияОС.ОсновноеСредство,
	|		АмортизацияОС.Амортизация,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияРегл
	|			ИНАЧЕ АмортизацияОС.АмортизацияРегл
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияНУ
	|			ИНАЧЕ АмортизацияОС.АмортизацияНУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияПР
	|			ИНАЧЕ АмортизацияОС.АмортизацияПР
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.Амортизация
	|			ИНАЧЕ АмортизацияОС.Амортизация
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияЦФ
	|			ИНАЧЕ АмортизацияОС.АмортизацияЦФ
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.АмортизацияОС КАК АмортизацияОС
	|	ГДЕ
	|		АмортизацияОС.Регистратор = &Ссылка
	|		И АмортизацияОС.Организация = &Организация
	|		И АмортизацияОС.Период < &Период
	|		И &КорректировкаАмортизации
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		АмортизацияОС.ОсновноеСредство,
	|		АмортизацияОС.Амортизация,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияРегл
	|			ИНАЧЕ АмортизацияОС.АмортизацияРегл
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияНУ
	|			ИНАЧЕ АмортизацияОС.АмортизацияНУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияПР
	|			ИНАЧЕ АмортизацияОС.АмортизацияПР
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.Амортизация
	|			ИНАЧЕ АмортизацияОС.Амортизация
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -АмортизацияОС.АмортизацияЦФ
	|			ИНАЧЕ АмортизацияОС.АмортизацияЦФ
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.АмортизацияОС КАК АмортизацияОС
	|	ГДЕ
	|		АмортизацияОС.Регистратор ССЫЛКА Документ.АмортизацияОС2_4
	|		И АмортизацияОС.Организация = &Организация
	|		И АмортизацияОС.Период < &Период
	|		И АмортизацияОС.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|		И &КорректировкаАмортизации
	|
	|	) КАК СтоимостьИАмортизация
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьИАмортизация.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОСОстатки.ОсновноеСредство,
	|	-АмортизацияОСОстатки.АмортизацияРеглОстаток КАК АмортизацияБУ,
	|	-АмортизацияОСОстатки.АмортизацияНУОстаток КАК АмортизацияНУ,
	|	-АмортизацияОСОстатки.АмортизацияПРОстаток КАК АмортизацияПР,
	|	-АмортизацияОСОстатки.АмортизацияОстаток КАК АмортизацияУУ,
	|	-АмортизацияОСОстатки.АмортизацияЦФОстаток КАК АмортизацияЦФ
	|
	|ПОМЕСТИТЬ АмортизацияНаНачалоГода
	|
	|ИЗ
	|	РегистрНакопления.АмортизацияОС.Остатки(
	|			&НачалоГода,
	|			&РаздельнаяКорректировкаТекущегоИПрошлогоПериодов
	|				И Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)) КАК АмортизацияОСОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОС.Ссылка КАК ОсновноеСредство,
	|
	|	СтоимостьИАмортизация.СтоимостьУУ КАК СтоимостьУУ,
	|	СтоимостьИАмортизация.СтоимостьБУ КАК СтоимостьБУ,
	|	СтоимостьИАмортизация.СтоимостьНУ КАК СтоимостьНУ,
	|	СтоимостьИАмортизация.СтоимостьПР КАК СтоимостьПР,
	|	СтоимостьИАмортизация.СтоимостьЦФ КАК СтоимостьЦФ,
	|	СтоимостьИАмортизация.ЗалоговаяСтоимость КАК ЗалоговаяСтоимость,
	|
	|	ВЫБОР
	|		КОГДА &ИзменениеУП = ИСТИНА
	|		И ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ, 0) <> 0
	|				И СтоимостьИАмортизация.СтоимостьБУ + СтоимостьИАмортизация.СтоимостьЦФ <> 0
	|					ТОГДА (СтоимостьИАмортизация.СтоимостьБУ + СтоимостьИАмортизация.СтоимостьЦФ -
	|						ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость, 0)) /
	|						ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ, 0) *
	|						РАЗНОСТЬДАТ(ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1, 1, 1)), &Период, МЕСЯЦ) *
	|						СтоимостьИАмортизация.СтоимостьБУ / (СтоимостьИАмортизация.СтоимостьБУ + СтоимостьИАмортизация.СтоимостьЦФ)
	|				ИНАЧЕ СтоимостьИАмортизация.АмортизацияБУ
	|			КОНЕЦ
	|		ИНАЧЕ СтоимостьИАмортизация.АмортизацияБУ
	|	КОНЕЦ КАК АмортизацияБУ,
	|
	|	СтоимостьИАмортизация.АмортизацияНУ КАК АмортизацияНУ,
	|	СтоимостьИАмортизация.АмортизацияПР КАК АмортизацияПР,
	|	СтоимостьИАмортизация.АмортизацияУУ КАК АмортизацияУУ,
	|
	|	ВЫБОР
	|		КОГДА &ИзменениеУП = ИСТИНА
	|		И ЕСТЬNULL(УчетнаяПолитика.ПрименяетсяФСБУ6, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ, 0) <> 0
	|				И СтоимостьИАмортизация.СтоимостьБУ + СтоимостьИАмортизация.СтоимостьЦФ <> 0
	|					ТОГДА (СтоимостьИАмортизация.СтоимостьБУ + СтоимостьИАмортизация.СтоимостьЦФ -
	|						ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость, 0)) /
	|						ЕСТЬNULL(ПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ, 0) *
	|						РАЗНОСТЬДАТ(ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1, 1, 1)), &Период, МЕСЯЦ) *
	|						СтоимостьИАмортизация.СтоимостьЦФ / (СтоимостьИАмортизация.СтоимостьБУ + СтоимостьИАмортизация.СтоимостьЦФ)
	|				ИНАЧЕ СтоимостьИАмортизация.АмортизацияЦФ
	|			КОНЕЦ
	|		ИНАЧЕ СтоимостьИАмортизация.АмортизацияЦФ
	|	КОНЕЦ КАК АмортизацияЦФ,
	|
	|	АмортизацияНаНачалоГода.АмортизацияБУ КАК АмортизацияНаНачалоГодаБУ,
	|	АмортизацияНаНачалоГода.АмортизацияНУ КАК АмортизацияНаНачалоГодаНУ,
	|	АмортизацияНаНачалоГода.АмортизацияПР КАК АмортизацияНаНачалоГодаПР,
	|	АмортизацияНаНачалоГода.АмортизацияУУ КАК АмортизацияНаНачалоГодаУУ,
	|	АмортизацияНаНачалоГода.АмортизацияЦФ КАК АмортизацияНаНачалоГодаЦФ,
	|
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьБУ КАК ПервоначальнаяСтоимостьБУ,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимостьУУ КАК ПервоначальнаяСтоимостьУУ,
	|
	|	ПараметрыАмортизацииОСУУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииБУ,
	|
	|	ПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации
	|
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК СписокОС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьИАмортизация КАК СтоимостьИАмортизация
	|		ПО СтоимостьИАмортизация.ОсновноеСредство = СписокОС.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНаНачалоГода КАК АмортизацияНаНачалоГода
	|		ПО АмортизацияНаНачалоГода.ОсновноеСредство = СписокОС.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(
	|			&Период, 
	|			&КорректировкаПервоначальнойСтоимости
	|				И Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.ОсновноеСредство = СписокОС.Ссылка)
	|			И (ПервоначальныеСведенияОС.Организация = &Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСУУ.СрезПоследних(
	|			&Период, 
	|			&КорректировкаПараметровРасчетаАмортизации
	|				И Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)) КАК ПараметрыАмортизацииОСУУ
	|		ПО (ПараметрыАмортизацииОСУУ.ОсновноеСредство = СписокОС.Ссылка)
	|			И (ПараметрыАмортизацииОСУУ.Организация = &Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБУ.СрезПоследних(
	|			&Период, 
	|			&КорректировкаПараметровРасчетаАмортизации
	|				И Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)) КАК ПараметрыАмортизацииОСБУ
	|		ПО (ПараметрыАмортизацииОСБУ.ОсновноеСредство = СписокОС.Ссылка)
	|			И (ПараметрыАмортизацииОСБУ.Организация = &Организация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&ПериодУП, Организация = &ГоловнаяОрганизация) КАК УчетнаяПолитика
	|		ПО (ИСТИНА)
	|
	|ГДЕ
	|	СписокОС.Ссылка В (&СписокОС)
	|";
	
	//-- Локализация

	Возврат ТекстЗапроса;

КонецФункции
 
// 
// Параметры:
//  Объект - ДокументОбъект.КорректировкаСтоимостиИАмортизацииОС - 
//  СлужебныеПараметрыФормы - Структура - 
// 
// Возвращаемое значение:
//  Булево - 
Функция ПолучитьПараметрыУчетныхПолитикЗаПериод(Объект, СлужебныеПараметрыФормы) Экспорт
	
	ПараметрыРеглПолучены = Ложь;
	
	//++ Локализация
	
	ПараметрыРеглПолучены = Истина;
	
	ПорядокНачисленияАмортизацииРегл = Перечисления.ПорядокНачисленияАмортизации.СДатыПринятияКУчету;
	ПорядокНачисленияАмортизацииАрендаРегл = Перечисления.ПорядокНачисленияАмортизации.СДатыПринятияКУчету;
	РеглУчетВНАВедетсяНезависимо = Истина;
	ПрименяетсяФСБУ6 = Истина;
	
	Если Объект.РежимИсправленияСПрошлойДаты
		И ЗначениеЗаполнено(Объект.НачалоПериода)
		И ЗначениеЗаполнено(Объект.Организация) Тогда
			
		ДатаДокумента = ?(Объект.Дата <> '000101010000', Объект.Дата, ТекущаяДатаСеанса());
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР 
		|		КОГДА УчетнаяПолитика.ПорядокНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) 
		|			ТОГДА ИСТИНА 
		|		ИНАЧЕ ЛОЖЬ 
		|	КОНЕЦ), ИСТИНА) КАК СДатыПринятияКУчетуРегл,
		|
		|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР 
		|		КОГДА УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) 
		|			ТОГДА ИСТИНА 
		|		ИНАЧЕ ЛОЖЬ 
		|	КОНЕЦ), ИСТИНА) КАК СДатыПринятияКУчетуРеглАренда,
		|
		|	ЕСТЬNULL(МАКСИМУМ(УчетнаяПолитика.ПрименяетсяФСБУ6), ИСТИНА) КАК ПрименяетсяФСБУ6
		|
		|ИЗ
		|	(ВЫБРАТЬ
		|		УчетнаяПолитика.ПорядокНачисленияАмортизацииОС КАК ПорядокНачисленияАмортизации,
		|		УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда КАК ПорядокНачисленияАмортизацииАренда,
		|		УчетнаяПолитика.ПрименяетсяФСБУ6 КАК ПрименяетсяФСБУ6
		|	ИЗ
		|		РегистрСведений.УчетнаяПолитикаБухУчета КАК УчетнаяПолитика
		|	ГДЕ
		|		УчетнаяПолитика.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И УчетнаяПолитика.Организация = &ГоловнаяОрганизация
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		УчетнаяПолитика.ПорядокНачисленияАмортизацииОС КАК ПорядокНачисленияАмортизации,
		|		УчетнаяПолитика.ПорядокНачисленияАмортизацииАренда КАК ПорядокНачисленияАмортизацииАренда,
		|		УчетнаяПолитика.ПрименяетсяФСБУ6 КАК ПорядокУчетаВНАРегл
		|	ИЗ
		|		РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&НачалоПериода, Организация = &ГоловнаяОрганизация) КАК УчетнаяПолитика
		|
		|	) КАК УчетнаяПолитика
		|";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ГоловнаяОрганизация"));
		Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", НачалоДня(ДатаДокумента) - 1);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.СДатыПринятияКУчетуРегл Тогда
				ПорядокНачисленияАмортизацииРегл = Перечисления.ПорядокНачисленияАмортизации.СДатыПринятияКУчету;
			Иначе
				ПорядокНачисленияАмортизацииРегл = Перечисления.ПорядокНачисленияАмортизации.СоСледующегоМесяца;
			КонецЕсли;
			
			Если Выборка.СДатыПринятияКУчетуРеглАренда Тогда
				ПорядокНачисленияАмортизацииАрендаРегл = Перечисления.ПорядокНачисленияАмортизации.СДатыПринятияКУчету;
			Иначе
				ПорядокНачисленияАмортизацииАрендаРегл = Перечисления.ПорядокНачисленияАмортизации.СоСледующегоМесяца;
			КонецЕсли;
			
			ПрименяетсяФСБУ6 = Выборка.ПрименяетсяФСБУ6;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
		"ПорядокНачисленияАмортизацииРегл_ЗаПериод",
		ПорядокНачисленияАмортизацииРегл,
		СлужебныеПараметрыФормы);

	ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
		"ПорядокНачисленияАмортизацииРеглАренда_ЗаПериод",
		ПорядокНачисленияАмортизацииАрендаРегл,
		СлужебныеПараметрыФормы);

	ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
		"РеглУчетВНАВедетсяНезависимо_ЗаПериод",
		Истина,
		СлужебныеПараметрыФормы);
		
	ВнеоборотныеАктивыСлужебный.УстановитьСвойствоСтруктуры(
		"ПрименяетсяФСБУ6_ЗаПериод",
		ПрименяетсяФСБУ6,
		СлужебныеПараметрыФормы);
			
	//-- Локализация
	
	Возврат ПараметрыРеглПолучены;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.КорректировкаСтоимостиИАмортизацииОС - 
//  Основание - ДокументСсылка.ИзменениеПараметровОС2_4 - 
// 
// Возвращаемое значение:
//  Булево - 
Функция ЗаполнитьДокументНаОснованииИзмененияПараметровОС(Объект, Основание) Экспорт
	
	ПродолжитьЗаполнение = Истина;
	
	//++ Локализация
	
	ПродолжитьЗаполнение = ЗаполнитьДляПримененияИНВ(Объект, Основание);
	
	//-- Локализация
	
	Возврат ПродолжитьЗаполнение;
	
КонецФункции

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	МеханизмыДокумента.Добавить("ИмущественныеНалоги");
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- Локализация
	
КонецПроцедуры

Процедура ТаблицыОтложенногоФормированияДвижений(ТекстыЗапроса) Экспорт

	//++ Локализация
	ТекстЗапросаТаблицаПараметрыАмортизацииОСБУ(ТекстыЗапроса, Неопределено);
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(ТекстыЗапроса, Неопределено);
	//-- Локализация
	
КонецПроцедуры
 
Функция ТекстЗапросаТаблицаПервоначальныеСведенияОС(ТекстыЗапроса) Экспорт

	ТекстЗапроса = Неопределено;
	
	//++ Локализация
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаВтПервоначальныеСведенияОС(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Регистратор,
	|	ДанныеДокумента.Период КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	втПервоначальныеСведенияОС.СпособПоступления КАК СпособПоступления,
	|	втПервоначальныеСведенияОС.ПорядокУчетаБУ КАК ПорядокУчетаБУ,
	|	втПервоначальныеСведенияОС.ПорядокУчетаНУ КАК ПорядокУчетаНУ,
	|	втПервоначальныеСведенияОС.ПорядокУчетаУУ КАК ПорядокУчетаУУ,
	|	втПервоначальныеСведенияОС.МетодНачисленияАмортизацииБУ КАК МетодНачисленияАмортизацииБУ,
	|	втПервоначальныеСведенияОС.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
	|	втПервоначальныеСведенияОС.СтоимостьДо2002 КАК СтоимостьДо2002,
	|	втПервоначальныеСведенияОС.АмортизацияДо2002 КАК АмортизацияДо2002,
	|	втПервоначальныеСведенияОС.АмортизацияДо2009 КАК АмортизацияДо2009,
	|	втПервоначальныеСведенияОС.ФактическийСрокИспользованияДо2009 КАК ФактическийСрокИспользованияДо2009,
	|	втПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ КАК ДатаВводаВЭксплуатациюБУ,
	|	втПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюНУ КАК ДатаВводаВЭксплуатациюНУ,
	|	втПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюУУ КАК ДатаВводаВЭксплуатациюУУ,
	|	втПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ КАК ДокументВводаВЭксплуатациюБУ,
	|	втПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ КАК ДокументВводаВЭксплуатациюНУ,
	|	втПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюУУ КАК ДокументВводаВЭксплуатациюУУ,
	|	втПервоначальныеСведенияОС.ДокументСнятияСУчетаБУ КАК ДокументСнятияСУчетаБУ,
	|	втПервоначальныеСведенияОС.ДокументСнятияСУчетаНУ КАК ДокументСнятияСУчетаНУ,
	|	втПервоначальныеСведенияОС.ДокументСнятияСУчетаУУ КАК ДокументСнятияСУчетаУУ,
	|	втПервоначальныеСведенияОС.Контрагент КАК Контрагент,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ОтражатьВБУ
	|			ТОГДА ТаблицаОС.ПервоначальнаяСтоимостьБУ
	|		ИНАЧЕ втПервоначальныеСведенияОС.ПервоначальнаяСтоимостьБУ
	|	КОНЕЦ КАК ПервоначальнаяСтоимостьБУ,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ОтражатьВНУ
	|			ТОГДА ТаблицаОС.ПервоначальнаяСтоимостьНУ
	|		ИНАЧЕ втПервоначальныеСведенияОС.ПервоначальнаяСтоимостьНУ
	|	КОНЕЦ КАК ПервоначальнаяСтоимостьНУ,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ОтражатьВУпрУчете
	|			ТОГДА ТаблицаОС.ПервоначальнаяСтоимостьУУ
	|		ИНАЧЕ втПервоначальныеСведенияОС.ПервоначальнаяСтоимостьУУ
	|	КОНЕЦ КАК ПервоначальнаяСтоимостьУУ
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПервоначальныеСведенияОС КАК втПервоначальныеСведенияОС
	|		ПО втПервоначальныеСведенияОС.Ссылка = ТаблицаОС.Ссылка
	|			И втПервоначальныеСведенияОС.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеДокумента.КорректировкаПервоначальнойСтоимости
	|	И (ДанныеДокумента.ОтражатьВБУ
	|			И втПервоначальныеСведенияОС.ПервоначальнаяСтоимостьБУ <> ТаблицаОС.ПервоначальнаяСтоимостьБУ
	|		ИЛИ ДанныеДокумента.ОтражатьВНУ
	|			И втПервоначальныеСведенияОС.ПервоначальнаяСтоимостьНУ <> ТаблицаОС.ПервоначальнаяСтоимостьНУ
	|		ИЛИ ДанныеДокумента.ОтражатьВУпрУчете
	|			И втПервоначальныеСведенияОС.ПервоначальнаяСтоимостьУУ <> ТаблицаОС.ПервоначальнаяСтоимостьУУ)
	|";

	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции
 
//++ Локализация

Процедура ТекстЗапросаТаблицаПараметрыАмортизацииОСБУ(ТекстыЗапроса, Регистры)

	ИмяРегистра = "ПараметрыАмортизацииОСБУ";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаВтПараметрыАмортизацииОСБУ(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Регистратор,
	|	ДанныеДокумента.Период КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	втПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияБУ КАК СрокПолезногоИспользованияБУ,
	|	втПараметрыАмортизацииОСБУ.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользованияНУ,
	|	втПараметрыАмортизацииОСБУ.КоэффициентАмортизацииБУ КАК КоэффициентАмортизацииБУ,
	|	втПараметрыАмортизацииОСБУ.КоэффициентУскорения КАК КоэффициентУскорения,
	|	втПараметрыАмортизацииОСБУ.ГрафикАмортизации КАК ГрафикАмортизации,
	|	втПараметрыАмортизацииОСБУ.СпециальныйКоэффициент КАК СпециальныйКоэффициент,
	|	втПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	втПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	втПараметрыАмортизацииОСБУ.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	втПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	ТаблицаОС.СтоимостьДляВычисленияАмортизацииБУ КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаОС.ПРДляВычисленияАмортизации КАК ПРДляВычисленияАмортизации
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыАмортизацииОСБУ КАК втПараметрыАмортизацииОСБУ
	|		ПО втПараметрыАмортизацииОСБУ.Ссылка = ТаблицаОС.Ссылка
	|			И втПараметрыАмортизацииОСБУ.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
	|
	|ГДЕ
	|	ДанныеДокумента.ОтражатьВБУ
	|	И ДанныеДокумента.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.Собственное)
	|	И ДанныеДокумента.КорректировкаПараметровРасчетаАмортизации
	|	И (втПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации <> ТаблицаОС.СтоимостьДляВычисленияАмортизацииБУ
	|			ИЛИ втПараметрыАмортизацииОСБУ.ПРДляВычисленияАмортизации <> ТаблицаОС.ПРДляВычисленияАмортизации)
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Истина);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаСобытияОСОрганизаций(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "СобытияОСОрганизаций";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Регистратор,
	|	ДанныеДокумента.Период КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.СобытиеОС КАК Событие,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&НомерНаПечать КАК НомерДокумента
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|ГДЕ
	|	ДанныеДокумента.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.Собственное)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Истина);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаИсправлениеПараметровНалогаНаИмущество(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ИсправлениеПараметровНалогаНаИмущество";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтСтоимостьОС(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Регистратор,
	|	ДанныеДокумента.Период КАК ДатаИсправления,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПараметрыЗаПериод.Дата, ДЕНЬ, 1), ДЕНЬ) КАК ДатаДействия,
	|
	|	ЕСТЬNULL(втСтоимостьОС.Стоимость, 0) КАК Стоимость,
	|
	|	ПараметрыЗаПериод.АмортизацияБУ
	|		+ ПараметрыЗаПериод.АмортизацияЦФ
	|		+ СУММА(ЕСТЬNULL(ПараметрыЗаПериодПредыдущие.АмортизацияБУ, 0))
	|		+ СУММА(ЕСТЬNULL(ПараметрыЗаПериодПредыдущие.АмортизацияЦФ, 0))
	|		+ СУММА(ЕСТЬNULL(ПараметрыЗаПериодПредыдущие.АмортизацияРеглИзменение, 0))
	|		+ СУММА(ЕСТЬNULL(ПараметрыЗаПериодПредыдущие.АмортизацияЦФИзменение, 0)) КАК Амортизация
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = ДанныеДокумента.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаПараметрыЗаПериодБУ КАК ПараметрыЗаПериод
	|		ПО ПараметрыЗаПериод.Ссылка = ТаблицаОС.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаПараметрыЗаПериодБУ КАК ПараметрыЗаПериодПредыдущие
	|		ПО ПараметрыЗаПериодПредыдущие.Ссылка = ПараметрыЗаПериод.Ссылка
	|			И ПараметрыЗаПериодПредыдущие.Дата < ПараметрыЗаПериод.Дата
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтоимостьОС КАК втСтоимостьОС
	|		ПО втСтоимостьОС.Ссылка = ПараметрыЗаПериод.Ссылка
	|			И втСтоимостьОС.Дата = ПараметрыЗаПериод.Дата
	|
	|ГДЕ
	|	ДанныеДокумента.ОтражатьВБУ
	|	И ДанныеДокумента.РежимИсправленияСПрошлойДаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Период,
	|	ДанныеДокумента.Организация,
	|	ТаблицаОС.ОсновноеСредство,
	|	ПараметрыЗаПериод.Дата,
	|	ЕСТЬNULL(втСтоимостьОС.Стоимость, 0),
	|	ПараметрыЗаПериод.АмортизацияБУ,
	|	ПараметрыЗаПериод.АмортизацияЦФ
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Истина);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтСтоимостьОС(ТекстыЗапроса)
	
	ИмяРегистра = "втСтоимостьОС";
	
	Если ПроведениеДокументов.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтПризнакАрендованныеОС(ТекстыЗапроса);
	ТекстЗапросаТаблицаВтДатаСледующихПараметров(ТекстыЗапроса);
	ВнеоборотныеАктивыЛокализация.ТекстЗапросаТаблицаВтУчетнаяПолитикаБухУчета(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПараметрыЗаПериод.Ссылка КАК Ссылка,
	|	ПараметрыЗаПериод.Дата КАК Дата,
	|	                      
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(втПризнакАрендованныеОС.ЭтоАрендованныеОС, ЛОЖЬ)
	|						И ВтУчетнаяПолитикаБухУчета.ПорядокНачисленияАмортизацииАренда= ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
	|					ИЛИ НЕ ЕСТЬNULL(втПризнакАрендованныеОС.ЭтоАрендованныеОС, ЛОЖЬ)
	|						И ВтУчетнаяПолитикаБухУчета.ПорядокНачисленияАмортизацииОС = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца))
	|				И НЕ СледующиеПараметрыЗаПериод.СтоимостьБУ ЕСТЬ NULL
	|			ТОГДА СледующиеПараметрыЗаПериод.СтоимостьБУ + СледующиеПараметрыЗаПериод.СтоимостьЦФ
	|		ИНАЧЕ ПараметрыЗаПериод.СтоимостьБУ + ПараметрыЗаПериод.СтоимостьЦФ
	|	КОНЕЦ КАК Стоимость
	|
	|ПОМЕСТИТЬ втСтоимостьОС
	|
	|ИЗ
	|	ДанныеДокументаТаблицаПараметрыЗаПериодБУ КАК ПараметрыЗаПериод
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПризнакАрендованныеОС КАК втПризнакАрендованныеОС
	|		ПО втПризнакАрендованныеОС.Ссылка = ПараметрыЗаПериод.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатаСледующихПараметров КАК втДатаСледующихПараметров
	|		ПО втДатаСледующихПараметров.Ссылка = ПараметрыЗаПериод.Ссылка
	|			И втДатаСледующихПараметров.Дата = ПараметрыЗаПериод.Дата
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаПараметрыЗаПериодБУ КАК СледующиеПараметрыЗаПериод
	|		ПО СледующиеПараметрыЗаПериод.Ссылка = ПараметрыЗаПериод.Ссылка
	|			И СледующиеПараметрыЗаПериод.Дата = втДатаСледующихПараметров.ДатаСледующихПараметров
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУчетнаяПолитикаБухУчета КАК ВтУчетнаяПолитикаБухУчета
	|		ПО ВтУчетнаяПолитикаБухУчета.Ссылка = ПараметрыЗаПериод.Ссылка
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Ложь);

КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтДатаСледующихПараметров(ТекстыЗапроса)
	
	ИмяРегистра = "втДатаСледующихПараметров";
	
	Если ПроведениеДокументов.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПараметрыЗаПериод.Ссылка КАК Ссылка,
	|	ПараметрыЗаПериод.Дата КАК Дата,
	|	МИНИМУМ(СледующиеПараметрыЗаПериод.Дата) КАК ДатаСледующихПараметров
	|	
	|ПОМЕСТИТЬ втДатаСледующихПараметров
	|
	|ИЗ
	|	ДанныеДокументаТаблицаПараметрыЗаПериодБУ КАК ПараметрыЗаПериод
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаПараметрыЗаПериодБУ КАК СледующиеПараметрыЗаПериод
	|		ПО СледующиеПараметрыЗаПериод.Ссылка = ПараметрыЗаПериод.Ссылка
	|			И СледующиеПараметрыЗаПериод.Дата > ПараметрыЗаПериод.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыЗаПериод.Ссылка,
	|	ПараметрыЗаПериод.Дата
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Ложь);

КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтПризнакАрендованныеОС(ТекстыЗапроса)
	
	ИмяРегистра = "втПризнакАрендованныеОС";
	
	Если ПроведениеДокументов.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаВтАрендованныеОС(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ВЫБОР 
	|		КОГДА ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ВтАрендованныеОС КАК ВтАрендованныеОС 
	|			ГДЕ 
	|				ВтАрендованныеОС.Ссылка = ДанныеДокумента.Ссылка
	|				И ВтАрендованныеОС.Состояние В (
	|					ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВАренде),
	|					ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКЗабалансовомуУчету)))
	|			ТОГДА ИСТИНА 
	|		ИНАЧЕ ЛОЖЬ 
	|	КОНЕЦ КАК ЭтоАрендованныеОС
	|
	|ПОМЕСТИТЬ втПризнакАрендованныеОС
	|
	|ИЗ
	|	ДанныеДокументаРеквизиты КАК ДанныеДокумента
	|
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Ложь);

КонецПроцедуры

//-- Локализация

#КонецОбласти

#Область ПроводкиРегУчета

Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	//++ Локализация
	
	ТекстыЗапроса = Новый Массив;
		
	#Область УвеличениеСтоимости
	
	// УВЕЛИЧЕНИЕ НА СТАТЬЮ ДОХОДОВ
	
	#Область УвеличениеСтоимости_Дт_СчетУчета__Кт_СчетДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение стоимости (Дт СчетУчета :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУвеличениеСтоимости КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Увеличение стоимости"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_561"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|	И (Строки.Стоимость <> 0 
	|		ИЛИ Строки.СтоимостьРегл <> 0 
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УвеличениеСтоимостиЦФ_Дт_СчетУчета_ЦФ__Кт_СчетДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение стоимости ЦФ (Дт СчетУчета_ЦФ :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУвеличениеСтоимости КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	""Увеличение стоимости ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_562"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|	И (Строки.СтоимостьЦФ <> 0 
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	// УВЕЛИЧЕНИЕ НА СТАТЬЮ ПАССИВОВ
	
	#Область УвеличениеСтоимости_Дт_СчетУчета__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение стоимости (Дт СчетУчета :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Увеличение стоимости"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_563"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.Стоимость <> 0 
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УвеличениеСтоимостиЦФ_Дт_СчетУчета_ЦФ__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение стоимости ЦФ (Дт СчетУчета_ЦФ :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУвеличениеСтоимости.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	""Увеличение стоимости ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_564"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяДоходовУвеличениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.СтоимостьЦФ <> 0 
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
	
	#Область УменьшениеСтоимости
	
	// УМЕНЬШЕНИЕ НА СТАТЬЮ РАСХОДОВ
	
	#Область УменьшениеСтоимости_Дт_СчетРасходов__Кт_СчетУчета
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости (Дт СчетРасходов :: Кт СчетУчета)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.СтоимостьРегл КАК Сумма,
	|	СтрокиКт.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	СтрокиКт.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.СтоимостьНУ КАК СуммаНУКт,
	|	СтрокиКт.СтоимостьПР КАК СуммаПРКт,
	|	СтрокиКт.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_565"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиОС)
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (СтрокиКт.Стоимость <> 0 
	|		ИЛИ СтрокиКт.СтоимостьРегл <> 0 
	|		ИЛИ СтрокиКт.СтоимостьНУ <> 0
	|		ИЛИ СтрокиКт.СтоимостьПР <> 0
	|		ИЛИ СтрокиКт.СтоимостьВР <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УменьшениеСтоимостиЦФ_Дт_СчетРасходов__Кт_СчетУчета_ЦФ
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости ЦФ (Дт СчетРасходов :: Кт СчетУчета_ЦФ)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	СтрокиКт.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.СтоимостьНУЦФ КАК СуммаНУКт,
	|	СтрокиКт.СтоимостьПРЦФ КАК СуммаПРКт,
	|	СтрокиКт.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_566"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (СтрокиКт.СтоимостьЦФ <> 0 
	|		ИЛИ СтрокиКт.СтоимостьНУЦФ <> 0
	|		ИЛИ СтрокиКт.СтоимостьПРЦФ <> 0
	|		ИЛИ СтрокиКт.СтоимостьВРЦФ <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	// УМЕНЬШЕНИЕ НА СТАТЬЮ АКТИВОВ
	
	#Область УменьшениеСтоимости_Дт_Счет__Кт_СчетУчета
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости (Дт Счет :: Кт СчетУчета)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.СчетУчета КАК СчетДт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто1 КАК СубконтоДт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто2 КАК СубконтоДт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	Строки.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_567"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяРасходовУменьшениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.Стоимость <> 0 
	|		ИЛИ Строки.СтоимостьРегл <> 0 
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УменьшениеСтоимостиЦФ_Дт_Счет__Кт_СчетУчета_ЦФ
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости ЦФ (Дт Счет :: Кт СчетУчета_ЦФ)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.КорПодразделение КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.СчетУчета КАК СчетДт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто1 КАК СубконтоДт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто2 КАК СубконтоДт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	Строки.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_568"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И ДанныеДокумента.СтатьяРасходовУменьшениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.СтоимостьЦФ <> 0 
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти

	#Область УменьшениеСтоимостиСторно
	
	// УМЕНЬШЕНИЕ НА СТАТЬЮ РАСХОДОВ
	
	#Область УменьшениеСтоимостиСторно_Дт_СчетУчета__Кт_СчетРасходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости (Дт СчетУчета :: Кт СчетРасходов)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиКт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиДт.СтоимостьРегл КАК Сумма,
	|	СтрокиДт.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	СтрокиДт.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.ОсновноеСредство КАК СубконтоДт1,
	|	СтрокиДт.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СтоимостьНУ КАК СуммаНУДт,
	|	СтрокиДт.СтоимостьПР КАК СуммаПРДт,
	|	СтрокиДт.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаКт,
	|	СтрокиКт.СтатьяРасходов КАК АналитикаУчетаКт,
	|	СтрокиКт.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.СтатьяРасходов КАК СубконтоКт1,
	|	СтрокиКт.АналитикаРасходов КАК СубконтоКт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.СуммаРегл - СтрокиКт.ПостояннаяРазница - СтрокиКт.ВременнаяРазница КАК СуммаНУКт,
	|	СтрокиКт.ПостояннаяРазница КАК СуммаПРКт,
	|	СтрокиКт.ВременнаяРазница КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости (сторно)"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_569"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиКт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиКт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиОС)
	|	И СтрокиКт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (СтрокиДт.Стоимость <> 0 
	|		ИЛИ СтрокиДт.СтоимостьРегл <> 0 
	|		ИЛИ СтрокиДт.СтоимостьНУ <> 0
	|		ИЛИ СтрокиДт.СтоимостьПР <> 0
	|		ИЛИ СтрокиДт.СтоимостьВР <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УменьшениеСтоимостиСторноЦФ_Дт_СчетУчетаЦФ__Кт_СчетРасходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости ЦФ (Дт СчетУчетаЦФ :: Кт СчетРасходов)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиКт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиДт.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаДт,
	|	СтрокиДт.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.ОсновноеСредство КАК СубконтоДт1,
	|	СтрокиДт.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СтоимостьНУЦФ КАК СуммаНУДт,
	|	СтрокиДт.СтоимостьПРЦФ КАК СуммаПРДт,
	|	СтрокиДт.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаКт,
	|	СтрокиКт.СтатьяРасходов КАК АналитикаУчетаКт,
	|	СтрокиКт.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.СтатьяРасходов КАК СубконтоКт1,
	|	СтрокиКт.АналитикаРасходов КАК СубконтоКт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.СуммаРегл - СтрокиКт.ПостояннаяРазница - СтрокиКт.ВременнаяРазница КАК СуммаНУКт,
	|	СтрокиКт.ПостояннаяРазница КАК СуммаПРКт,
	|	СтрокиКт.ВременнаяРазница КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости ЦФ (сторно)"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_570"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиКт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиКт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И СтрокиКт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (СтрокиДт.СтоимостьЦФ <> 0 
	|		ИЛИ СтрокиДт.СтоимостьНУЦФ <> 0
	|		ИЛИ СтрокиДт.СтоимостьПРЦФ <> 0
	|		ИЛИ СтрокиДт.СтоимостьВРЦФ <> 0)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	// УМЕНЬШЕНИЕ НА СТАТЬЮ АКТИВОВ
	
	#Область УменьшениеСтоимостиСторно_Дт_СчетУчета__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости сторно (Дт СчетУчета :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.СчетУчета КАК СчетКт,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости (сторно)"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_571"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяРасходовУменьшениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (Строки.Стоимость <> 0 
	|		ИЛИ Строки.СтоимостьРегл <> 0 
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УменьшениеСтоимостиСторноЦФ_Дт_СчетУчетаЦФ__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости ЦФ сторно (Дт СчетУчетаЦФ :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.СчетУчета КАК СчетКт,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУменьшениеСтоимости.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости ЦФ (сторно)"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_572"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяРасходовУменьшениеСтоимости ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (Строки.СтоимостьЦФ <> 0 
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#КонецОбласти
	
	#Область УвеличениеСтоимостиНУЗаСчетПР
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение стоимости НУ за счет ПР (Дт СчетУчета :: Кт СчетУчета)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	-Строки.СтоимостьНУ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	Строки.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	Строки.СтоимостьНУ КАК СуммаПРКт,
	|	-Строки.СтоимостьНУ КАК СуммаВРКт,
	|	
	|	""Увеличение стоимости НУ за счет ПР"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1988"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	ДанныеДокумента.ОтражениеИзмененияСтоимостиНУЗаСчетПР
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УвеличениеСтоимостиОС)
	|	И Строки.СтоимостьНУ <> 0
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УменьшениеСтоимостиНУЗаСчетПР
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости НУ за счет ПР (Дт СчетУчета :: Кт СчетУчета)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьНУ КАК СуммаПРДт,
	|	-Строки.СтоимостьНУ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	Строки.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	-Строки.СтоимостьНУ КАК СуммаВРКт,
	|	
	|	""Уменьшение стоимости НУ за счет ПР"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1989"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	ДанныеДокумента.ОтражениеИзмененияСтоимостиНУЗаСчетПР
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УменьшениеСтоимостиОС)
	|	И Строки.СтоимостьНУ <> 0
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УвеличениеАмортизации
	
	// УВЕЛИЧЕНИЕ НА СТАТЬЮ РАСХОДОВ
	
	#Область УвеличениеАмортизации_Дт_СчетРасходов__Кт_СчетАмортизации
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение амортизации (Дт СчетРасходов :: Кт СчетАмортизации)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.АмортизацияРегл КАК Сумма,
	|	СтрокиКт.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.АмортизацияНУ КАК СуммаНУКт,
	|	СтрокиКт.АмортизацияПР КАК СуммаПРКт,
	|	СтрокиКт.АмортизацияВР КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Увеличение амортизации на начало года""
	|		ИНАЧЕ ""Увеличение амортизации"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1741"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииОСНаНачалоГода))
	|
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (СтрокиКт.Амортизация <> 0 
	|		ИЛИ СтрокиКт.АмортизацияРегл <> 0 
	|		ИЛИ СтрокиКт.АмортизацияНУ <> 0
	|		ИЛИ СтрокиКт.АмортизацияПР <> 0
	|		ИЛИ СтрокиКт.АмортизацияВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УвеличениеАмортизацииЦФ_Дт_СчетРасходов__Кт_СчетАмортизации_ЦФ
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение амортизации (Дт СчетРасходов :: Кт СчетАмортизации_ЦФ)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.АмортизацияНУЦФ КАК СуммаНУКт,
	|	СтрокиКт.АмортизацияПРЦФ КАК СуммаПРКт,
	|	СтрокиКт.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииЦФОСНаНачалоГода)
	|			ТОГДА ""Увеличение амортизации ЦФ на начало года""
	|		ИНАЧЕ ""Увеличение амортизации ЦФ"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1742"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииЦФОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииЦФОСНаНачалоГода))
	|
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (СтрокиКт.АмортизацияЦФ <> 0 
	|		ИЛИ СтрокиКт.АмортизацияНУЦФ <> 0
	|		ИЛИ СтрокиКт.АмортизацияПРЦФ <> 0
	|		ИЛИ СтрокиКт.АмортизацияВРЦФ <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	// УВЕЛИЧЕНИЕ НА СТАТЬЮ АКТИВОВ
	
	#Область УвеличениеАмортизации_Дт_Счет__Кт_СчетАмортизации
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение амортизации (Дт Счет :: Кт СчетАмортизации)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.СчетУчета КАК СчетДт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.Субконто1 КАК СубконтоДт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.Субконто2 КАК СубконтоДт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Увеличение амортизации на начало года""
	|		ИНАЧЕ ""Увеличение амортизации"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1743"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииОСНаНачалоГода))
	|
	|	И ДанныеДокумента.СтатьяРасходовУвеличениеАмортизации ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.Амортизация <> 0 
	|		ИЛИ Строки.АмортизацияРегл <> 0 
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УвеличениеАмортизацииЦФ_Дт_Счет__Кт_СчетАмортизации_ЦФ
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение амортизации (Дт Счет :: Кт СчетАмортизации_ЦФ)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.СчетУчета КАК СчетДт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.Субконто1 КАК СубконтоДт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.Субконто2 КАК СубконтоДт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеАмортизации.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.АмортизацияНУЦФ КАК СуммаНУДт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРДт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.АмортизацияНУЦФ КАК СуммаНУКт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРКт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииЦФОСНаНачалоГода)
	|			ТОГДА ""Увеличение амортизации ЦФ на начало года""
	|		ИНАЧЕ ""Увеличение амортизации ЦФ"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1744"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииЦФОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеАмортизацииЦФОСНаНачалоГода))
	|	И ДанныеДокумента.СтатьяРасходовУвеличениеАмортизации ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.АмортизацияЦФ <> 0 
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти

	#Область УменьшениеАмортизации
	
	// УМЕНЬШЕНИЕ НА СТАТЬЮ ДОХОДОВ
	
	#Область УменьшениеАмортизации_Дт_СчетАмортизации__Кт_СчетДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизации (Дт СчетАмортизации :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУменьшениеАмортизации КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Уменьшение амортизации на начало года""
	|		ИНАЧЕ ""Уменьшение амортизации"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1745"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода))
	|
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|
	|	И (Строки.Амортизация <> 0 
	|		ИЛИ Строки.АмортизацияРегл <> 0 
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УменьшениеАмортизацииЦФ_Дт_СчетАмортизации_ЦФ__Кт_СчетДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизации (Дт СчетАмортизации_ЦФ :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУЦФ КАК СуммаНУДт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРДт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУменьшениеАмортизации КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.АмортизацияНУЦФ КАК СуммаНУКт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРКт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Уменьшение амортизации ЦФ на начало года""
	|		ИНАЧЕ ""Уменьшение амортизации ЦФ"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1746"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода))
	|
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|
	|	И (Строки.АмортизацияЦФ <> 0 
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	// УМЕНЬШЕНИЕ НА СТАТЬЮ ПАССИВОВ
	
	#Область УменьшениеАмортизации_Дт_СчетАмортизации__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизации (Дт СчетАмортизации :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Уменьшение амортизации на начало года""
	|		ИНАЧЕ ""Уменьшение амортизации"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1747"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода))
	|
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|
	|	И (Строки.Амортизация <> 0 
	|		ИЛИ Строки.АмортизацияРегл <> 0 
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УменьшениеАмортизацииЦФ_Дт_СчетАмортизации_ЦФ__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизации (Дт СчетАмортизации_ЦФ :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.АмортизацияНУЦФ КАК СуммаНУДт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРДт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизации.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.АмортизацияНУЦФ КАК СуммаНУКт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРКт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Уменьшение амортизации ЦФ на начало года""
	|		ИНАЧЕ ""Уменьшение амортизации ЦФ"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1748"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода))
	|
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеАмортизации ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|
	|	И (Строки.АмортизацияЦФ <> 0 
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти

	#Область УменьшениеАмортизацииСторно
	
	// УМЕНЬШЕНИЕ НА СТАТЬЮ РАСХОДОВ
	
	#Область УменьшениеАмортизацииСторно_Дт_СчетРасходов__Кт_СчетАмортизации
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизации сторно (Дт СчетРасходов :: Кт СчетАмортизации)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.АмортизацияРегл КАК Сумма,
	|	СтрокиКт.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.АмортизацияНУ КАК СуммаНУКт,
	|	СтрокиКт.АмортизацияПР КАК СуммаПРКт,
	|	СтрокиКт.АмортизацияВР КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Уменьшение амортизации на начало года (сторно)""
	|		ИНАЧЕ ""Уменьшение амортизации (сторно)"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1749"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода))
	|
	|	И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (СтрокиКт.Амортизация <> 0 
	|		ИЛИ СтрокиКт.АмортизацияРегл <> 0 
	|		ИЛИ СтрокиКт.АмортизацияНУ <> 0
	|		ИЛИ СтрокиКт.АмортизацияПР <> 0
	|		ИЛИ СтрокиКт.АмортизацияВР <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УменьшениеАмортизацииЦФСторно_Дт_СчетРасходов__Кт_СчетАмортизации_ЦФ
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизации (Дт СчетРасходов :: Кт СчетАмортизации_ЦФ)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.АмортизацияНУЦФ КАК СуммаНУКт,
	|	СтрокиКт.АмортизацияПРЦФ КАК СуммаПРКт,
	|	СтрокиКт.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР
	|		КОГДА СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода)
	|			ТОГДА ""Уменьшение амортизации ЦФ на начало года (сторно)""
	|		ИНАЧЕ ""Уменьшение амортизации ЦФ (сторно)"" 
	|	КОНЕЦ КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_1750"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации В (
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизацииОСНаНачалоГода))
	|
	|	И СтрокиДт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (СтрокиКт.АмортизацияЦФ <> 0 
	|		ИЛИ СтрокиКт.АмортизацияНУЦФ <> 0
	|		ИЛИ СтрокиКт.АмортизацияПРЦФ <> 0
	|		ИЛИ СтрокиКт.АмортизацияВРЦФ <> 0)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
		
	#Область ЗалоговаяСтоимость
	
	#Область УвеличениеЗалоговойСтоимости_Дт_СчетЗабалансовогоУчета
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение залоговой стоимости (Дт СчетЗабалансовогоУчета:: Кт ---)
	|ВЫБРАТЬ
	|
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.ЗалоговаяСтоимость КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗабалансовыйУчетВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.КорКонтрагент КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|
	|	""Увеличение залоговой стоимости"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_573"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Строки.ЗалоговаяСтоимость <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область УменьшениеЗалоговойСтоимости_Кт_СчетЗабалансовогоУчета
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение залоговой стоимости (Дт --- :: Кт СчетЗабалансовогоУчета)
	|ВЫБРАТЬ
	|
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.ЗалоговаяСтоимость КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗабалансовыйУчетВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	Строки.КорКонтрагент КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|
	|	""Уменьшение залоговой стоимости"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_574"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Строки.ЗалоговаяСтоимость <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
	
	#Область УвеличениеДоходовЦФ
			
	#Область УвеличениеДоходовЦФ_Дт_СчетРасходов__Кт_98
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение доходов ЦФ (Дт СчетРасходов :: Кт 98)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ КАК АналитикаУчетаДт,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУвеличениеДоходовЦФ
	|	КОНЕЦ КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУвеличениеДоходовЦФ
	|	КОНЕЦ КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиУвеличениеДоходовЦФ
	|	КОНЕЦ КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ КАК СубконтоДт1,
	|	ДанныеДокумента.АналитикаРасходовУвеличениеДоходовЦФ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьЦФ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	Строки.СтоимостьЦФ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Увеличение доходов ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_575"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = ДанныеДокумента.АналитикаРасходовУвеличениеДоходовЦФ
	|
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|	И Строки.СтоимостьЦФ <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область УвеличениеДоходовЦФ_Дт_Счет__Кт_98
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Увеличение доходов ЦФ на статью активов (Дт Счет :: Кт 98)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУвеличениеДоходовЦФ
	|	КОНЕЦ КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеДоходовЦФ
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиУвеличениеДоходовЦФ
	|	КОНЕЦ КАК НаправлениеДеятельностиДт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеДоходовЦФ.СчетУчета КАК СчетДт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеДоходовЦФ.Субконто1 КАК СубконтоДт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеДоходовЦФ.Субконто2 КАК СубконтоДт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаРасходовУвеличениеДоходовЦФ.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьЦФ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетКт,
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	Строки.СтоимостьЦФ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Увеличение доходов ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_576"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УвеличениеСтоимостиОС)
	|	И ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	И ДанныеДокумента.СтатьяРасходовУвеличениеДоходовЦФ ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.СтоимостьЦФ <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#КонецОбласти
	
	#Область УменьшениеДоходовЦФ

	#Область УменьшениеДоходовЦФ_Дт_98__Кт_СчетДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение доходов ЦФ (Дт 98 :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьЦФ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУменьшениеДоходовЦФ
	|	КОНЕЦ КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиУменьшениеДоходовЦФ
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУменьшениеДоходовЦФ КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	Строки.СтоимостьЦФ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уменьшение доходов ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_577"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|	И Строки.СтоимостьЦФ <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УменьшениеДоходовЦФ_Дт_98__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение доходов ЦФ (Дт 98 :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	Строки.СтоимостьЦФ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУменьшениеДоходовЦФ
	|	КОНЕЦ КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиУменьшениеДоходовЦФ
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	Строки.СтоимостьЦФ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уменьшение доходов ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_578"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.СтоимостьЦФ <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#КонецОбласти
		
	#Область УменьшениеДоходовЦФСторно

	#Область УменьшениеДоходовЦФСторно_Дт_98__Кт_СчетДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение доходов ЦФ сторно (Дт 98 :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	-Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	-Строки.СтоимостьЦФ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУменьшениеДоходовЦФ
	|	КОНЕЦ КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиУменьшениеДоходовЦФ
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУменьшениеДоходовЦФ КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	-Строки.СтоимостьЦФ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уменьшение доходов ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_579"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|	И Строки.СтоимостьЦФ <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УменьшениеДоходовЦФСторно_Дт_98__Кт_Счет
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение доходов ЦФ сторно (Дт 98 :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	-Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	0 КАК СуммаНУДт,
	|	-Строки.СтоимостьЦФ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ ДанныеДокумента.ПодразделениеУменьшениеДоходовЦФ
	|	КОНЕЦ КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ ДанныеДокумента.НаправлениеДеятельностиУменьшениеДоходовЦФ
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеДоходовЦФ.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	0 КАК СуммаНУКт,
	|	-Строки.СтоимостьЦФ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уменьшение доходов ЦФ"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_580"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеСтоимостиЦФОС)
	|	И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеДоходовЦФ ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.СтоимостьЦФ <> 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#КонецОбласти
		
	#Область УвеличениеИлиСторноАмортизационнойПремии
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение стоимости (Дт СчетРасходов :: Кт СчетУчета)
	|ВЫБРАТЬ 
	|	
	|	СтрокиДт.Регистратор КАК Ссылка,
	|	СтрокиДт.Период КАК Период,
	|	СтрокиДт.Организация КАК Организация,
	|	СтрокиДт.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	СтрокиКт.СтоимостьРегл КАК Сумма,
	|	СтрокиКт.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	СтрокиДт.СтатьяРасходов КАК АналитикаУчетаДт,
	|	СтрокиДт.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	СтрокиДт.Подразделение КАК ПодразделениеДт,
	|	СтрокиДт.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	СтрокиДт.СтатьяРасходов КАК СубконтоДт1,
	|	СтрокиДт.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|				ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|						ТОГДА ОбъектыСтроительства.СпособСтроительства
	|					ИНАЧЕ 
	|						ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|				КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	СтрокиДт.СуммаРегл - СтрокиДт.ПостояннаяРазница - СтрокиДт.ВременнаяРазница КАК СуммаНУДт,
	|	СтрокиДт.ПостояннаяРазница КАК СуммаПРДт,
	|	СтрокиДт.ВременнаяРазница КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	СтрокиКт.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	СтрокиКт.Подразделение КАК ПодразделениеКт,
	|	СтрокиКт.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	СтрокиКт.ОсновноеСредство КАК СубконтоКт1,
	|	СтрокиКт.Арендатор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	СтрокиКт.СтоимостьНУ КАК СуммаНУКт,
	|	СтрокиКт.СтоимостьПР КАК СуммаПРКт,
	|	СтрокиКт.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Амортизационная премия"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_581"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК СтрокиДт
	|		ПО СтрокиДт.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК СтрокиКт
	|		ПО СтрокиКт.Регистратор = СтрокиДт.Регистратор
	|			И СтрокиКт.НастройкаХозяйственнойОперации = СтрокиДт.НастройкаХозяйственнойОперации
	|			И СтрокиКт.ИдентификаторФинЗаписи = СтрокиДт.ИдентификаторФинЗаписи
	|			И СтрокиКт.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|		ПО СтрокиДт.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|			И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|		ПО ОбъектыСтроительства.Ссылка = СтрокиДт.АналитикаРасходов
	|
	|ГДЕ
	|	СтрокиДт.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы)
	|	И СтрокиДт.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
		
	#Область УменьшениеАмортизационнойПремииНаСтатьюДоходов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уменьшение амортизационной премии (Дт СчетУчета :: Кт СчетДоходов)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	Строки.ИдентификаторФинЗаписи КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеАмортизационнойПремии КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ДанныеДокумента.СтатьяДоходовУменьшениеАмортизационнойПремии КАК СубконтоКт1,
	|	ДанныеДокумента.АналитикаДоходовУменьшениеАмортизационнойПремии КАК СубконтоКт2,
	|	Строки.ОсновноеСредство КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Амортизационная премия"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_582"" КАК НомерФрагмента
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизационнойПремии)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеАмортизационнойПремии ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область УменьшениеАмортизационнойПремииНаСтатьюАктивов
	ТекстЗапроса =	
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизационная премия (Дт СчетУчета :: Кт Счет)
	|ВЫБРАТЬ 
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	Строки.Арендатор КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизационнойПремии.СчетУчета КАК СчетКт,
	|
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизационнойПремии.Субконто1 КАК СубконтоКт1,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизационнойПремии.Субконто2 КАК СубконтоКт2,
	|	ДанныеДокумента.НастройкаСчетовУчетаДоходовУменьшениеАмортизационнойПремии.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	""Амортизационная премия"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_583"" КАК НомерФрагмента
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|	
	|ГДЕ
	|	Строки.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизационнойПремии)
	|	И ДанныеДокумента.СтатьяДоходовУменьшениеАмортизационнойПремии ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти

	#Область ПрименениеИНВ_ФБ
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Применение ФИНВ  (Дт ИНВ.ФБ)
	|
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	ТаблицаОС.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФедеральныйИнвестиционныйНалоговыйВычет) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРасходовПоИнвестиционномуВычету.ПервоначальнаяСтоимостьОС) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(УчетнаяПолитикаОрганизаций.ДоляРасходовИНВ, 0) * Строки.СуммаРасходовНУПриИНВ КАК ЧИСЛО(31,0)) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	ВЫРАЗИТЬ(ЕСТЬNULL(УчетнаяПолитикаОрганизаций.ДоляРасходовИНВ, 0) * Строки.СуммаРасходовНУПриИНВ КАК ЧИСЛО(31,0)) КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|
	|	""Применение инвестиционного налогового вычета"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_2001"" КАК НомерФрагмента
	|ИЗ
	|	РазрезыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|			И Строки.Организация = ДокументыКОтражению.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = Строки.Регистратор
	|			И ТаблицаОС.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО ПервоначальныеСведенияОС.Ссылка = Строки.Регистратор
	|			И ПервоначальныеСведенияОС.ОсновноеСредство = Строки.ОсновноеСредство
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО ПорядокУчетаОСБУ.Ссылка = Строки.Регистратор
	|			И ПорядокУчетаОСБУ.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО УчетнаяПолитикаОрганизаций.Ссылка = ДокументыКОтражению.Ссылка
	|			И УчетнаяПолитикаОрганизаций.Организация = ДокументыКОтражению.Организация
	|			И УчетнаяПолитикаОрганизаций.ДатаОтражения = НАЧАЛОПЕРИОДА(Строки.Период, ДЕНЬ)
	|
	|ГДЕ
	|	Строки.СуммаРасходовНУПриИНВ <> 0
	|	И ПорядокУчетаОСБУ.ИнвестиционныйНалоговыйВычет = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.Федеральный)
	|	И ЕСТЬNULL(УчетнаяПолитикаОрганизаций.ПрименяетсяФедеральныйИНВ, ЛОЖЬ)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область ПрименениеИНВ_РБ
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Применение РИНВ региональная часть (Дт ИНВ.РБ.1)
	|
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	ТаблицаОС.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РегиональныйИнвестиционныйНалоговыйВычетРегиональнаяЧасть) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРасходовПоИнвестиционномуВычету.ПервоначальнаяСтоимостьОС) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Вт_ПрименениеРИНВ.ДоляРасходовИНВ_РБ * Строки.СуммаРасходовНУПриИНВ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Вт_ПрименениеРИНВ.ДоляРасходовИНВ_РБ * Строки.СуммаРасходовНУПриИНВ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|
	|	""Применение инвестиционного налогового вычета"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_2002"" КАК НомерФрагмента
	|ИЗ
	|	РазрезыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|			И Строки.Организация = ДокументыКОтражению.Организация
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = Строки.Регистратор
	|			И ТаблицаОС.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО ПервоначальныеСведенияОС.Ссылка = Строки.Регистратор
	|			И ПервоначальныеСведенияОС.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО ПорядокУчетаОСБУ.Ссылка = Строки.Регистратор
	|			И ПорядокУчетаОСБУ.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_ПрименениеРегиональныхИНВ КАК Вт_ПрименениеРИНВ
	|		ПО ДокументыКОтражению.ГоловнаяОрганизация = Вт_ПрименениеРИНВ.Организация
	|			И ДанныеДокумента.Подразделение = Вт_ПрименениеРИНВ.Подразделение
	|			И ДанныеДокумента.Дата = Вт_ПрименениеРИНВ.Дата
	|
	|ГДЕ
	|	Строки.СуммаРасходовНУПриИНВ <> 0
	|	И ПорядокУчетаОСБУ.ИнвестиционныйНалоговыйВычет = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.Региональный)
	|	И Вт_ПрименениеРИНВ.ПрименяетсяРегиональныйИНВ = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Применение РИНВ федеральная часть (Дт ИНВ.РБ.2)
	|
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	ТаблицаОС.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РегиональныйИнвестиционныйНалоговыйВычетФедеральнаяЧасть) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюНУ КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРасходовПоИнвестиционномуВычету.ПервоначальнаяСтоимостьОС) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|
	|	Вт_ПрименениеРИНВ.ДоляРасходовИНВ_ФБ * Строки.СуммаРасходовНУПриИНВ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|
	|	Вт_ПрименениеРИНВ.ДоляРасходовИНВ_ФБ * Строки.СуммаРасходовНУПриИНВ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|
	|	""Применение инвестиционного налогового вычета"" КАК Содержание,
	|	""КорректировкаСтоимостиИАмортизацииОСЛокализация_2003"" КАК НомерФрагмента
	|ИЗ
	|	РазрезыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|		ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|			И Строки.Организация = ДокументыКОтражению.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТаблицаОС
	|		ПО ТаблицаОС.Ссылка = Строки.Регистратор
	|			И ТаблицаОС.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО ПервоначальныеСведенияОС.Ссылка = Строки.Регистратор
	|			И ПервоначальныеСведенияОС.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО ПорядокУчетаОСБУ.Ссылка = Строки.Регистратор
	|			И ПорядокУчетаОСБУ.ОсновноеСредство = Строки.ОсновноеСредство
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_ПрименениеРегиональныхИНВ КАК Вт_ПрименениеРИНВ
	|		ПО ДокументыКОтражению.ГоловнаяОрганизация = Вт_ПрименениеРИНВ.Организация
	|			И ДанныеДокумента.Подразделение = Вт_ПрименениеРИНВ.Подразделение
	|			И ДанныеДокумента.Дата = Вт_ПрименениеРИНВ.Дата
	|
	|ГДЕ
	|	Строки.СуммаРасходовНУПриИНВ <> 0
	|	И ПорядокУчетаОСБУ.ИнвестиционныйНалоговыйВычет = ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.Региональный)
	|	И Вт_ПрименениеРИНВ.ПрименяетсяФедеральныйИНВ = ИСТИНА
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";

	//++ Локализация

	СписокЗапросов = Новый Массив;

	#Область ТаблицыДляОтраженияИНВ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредство
	|
	|ПОМЕСТИТЬ ТаблицаОС
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ТаблицаДокумента
	|		ПО ТаблицаДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК ТабличнаяЧасть
	|		ПО ТабличнаяЧасть.Ссылка = ТаблицаДокумента.Ссылка
	|
	|ГДЕ
	|	ТаблицаДокумента.КорректировкаСуммыРасходовНУПриИНВ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Дата,
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезРегистратор.Ссылка КАК Ссылка,
	|	СрезРегистратор.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.ДокументВводаВЭксплуатациюНУ КАК ДокументВводаВЭксплуатациюНУ
	|
	|ПОМЕСТИТЬ ПервоначальныеСведенияОС
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПериод.Ссылка КАК Ссылка,
	|		СрезПериод.Организация КАК Организация,
	|		СрезПериод.ОсновноеСредство КАК ОсновноеСредство,
	|		СрезПериод.ДанныеРегистраПериод КАК ДанныеРегистраПериод,
	|		МАКСИМУМ(ДанныеРегистра.Регистратор) КАК ДанныеРегистраРегистратор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаОС.Ссылка КАК Ссылка,
	|			ТаблицаОС.Организация КАК Организация,
	|			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|			МАКСИМУМ(ДанныеРегистра.Период) КАК ДанныеРегистраПериод
	|		ИЗ
	|			ТаблицаОС КАК ТаблицаОС
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|				ПО ДанныеРегистра.Период <= ТаблицаОС.Дата
	|					И ДанныеРегистра.Организация = ТаблицаОС.Организация
	|					И ДанныеРегистра.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
	|					И ДанныеРегистра.Регистратор <> ТаблицаОС.Ссылка
	|					И ДанныеРегистра.Активность
	|
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаОС.Ссылка,
	|			ТаблицаОС.Организация,
	|			ТаблицаОС.ОсновноеСредство
	|
	|		) КАК СрезПериод
	|		
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|			ПО ДанныеРегистра.Период = СрезПериод.ДанныеРегистраПериод
	|				И ДанныеРегистра.Организация = СрезПериод.Организация
	|				И ДанныеРегистра.ОсновноеСредство = СрезПериод.ОсновноеСредство
	|				И ДанныеРегистра.Регистратор <> СрезПериод.Ссылка
	|				И ДанныеРегистра.Активность
	|
	|	СГРУППИРОВАТЬ ПО
	|		СрезПериод.Ссылка,
	|		СрезПериод.Организация,
	|		СрезПериод.ОсновноеСредство,
	|		СрезПериод.ДанныеРегистраПериод
	|
	|	) КАК СрезРегистратор
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС КАК ДанныеРегистра
	|		ПО ДанныеРегистра.Период = СрезРегистратор.ДанныеРегистраПериод
	|			И ДанныеРегистра.Регистратор = СрезРегистратор.ДанныеРегистраРегистратор
	|			И ДанныеРегистра.Организация = СрезРегистратор.Организация
	|			И ДанныеРегистра.ОсновноеСредство = СрезРегистратор.ОсновноеСредство
	|			И ДанныеРегистра.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезРегистратор.Ссылка КАК Ссылка,
	|	СрезРегистратор.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.ИнвестиционныйНалоговыйВычет КАК ИнвестиционныйНалоговыйВычет
	|
	|ПОМЕСТИТЬ ПорядокУчетаОСБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПериод.Ссылка КАК Ссылка,
	|		СрезПериод.Организация КАК Организация,
	|		СрезПериод.ОсновноеСредство КАК ОсновноеСредство,
	|		СрезПериод.ДанныеРегистраПериод КАК ДанныеРегистраПериод,
	|		МАКСИМУМ(ДанныеРегистра.Регистратор) КАК ДанныеРегистраРегистратор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаОС.Ссылка КАК Ссылка,
	|			ТаблицаОС.Организация КАК Организация,
	|			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|			МАКСИМУМ(ДанныеРегистра.Период) КАК ДанныеРегистраПериод
	|		ИЗ
	|			ТаблицаОС КАК ТаблицаОС
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|				ПО ДанныеРегистра.Период <= ТаблицаОС.Дата
	|					И ДанныеРегистра.Организация = ТаблицаОС.Организация
	|					И ДанныеРегистра.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
	|					И ДанныеРегистра.Регистратор <> ТаблицаОС.Ссылка
	|					И ДанныеРегистра.Активность
	|
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаОС.Ссылка,
	|			ТаблицаОС.Организация,
	|			ТаблицаОС.ОсновноеСредство
	|
	|		) КАК СрезПериод
	|		
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|			ПО ДанныеРегистра.Период = СрезПериод.ДанныеРегистраПериод
	|				И ДанныеРегистра.Организация = СрезПериод.Организация
	|				И ДанныеРегистра.ОсновноеСредство = СрезПериод.ОсновноеСредство
	|				И ДанныеРегистра.Регистратор <> СрезПериод.Ссылка
	|				И ДанныеРегистра.Активность
	|
	|	СГРУППИРОВАТЬ ПО
	|		СрезПериод.Ссылка,
	|		СрезПериод.Организация,
	|		СрезПериод.ОсновноеСредство,
	|		СрезПериод.ДанныеРегистраПериод
	|
	|	) КАК СрезРегистратор
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|		ПО ДанныеРегистра.Период = СрезРегистратор.ДанныеРегистраПериод
	|			И ДанныеРегистра.Регистратор = СрезРегистратор.ДанныеРегистраРегистратор
	|			И ДанныеРегистра.Организация = СрезРегистратор.Организация
	|			И ДанныеРегистра.ОсновноеСредство = СрезРегистратор.ОсновноеСредство
	|			И ДанныеРегистра.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ
	|	ТаблицаОС
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти

	#Область ПрименениеИНВ

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|
	|ПОМЕСТИТЬ ДанныеДокументов
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС КАК ТаблицаДокумента
	|		ПО ТаблицаДокумента.Ссылка = ДокументыКОтражению.Ссылка
	|
	|ГДЕ
	|	ТаблицаДокумента.КорректировкаСуммыРасходовНУПриИНВ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	Период";
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	РегистрыСведений.ПрименениеРегиональныхИНВ.ТекстЗапросаПараметровПримененияРегиональныхИНВ(СписокЗапросов);
	
	#КонецОбласти
	
	СписокЗапросов.Добавить(Символы.ПС);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());

	//-- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ФормаДокумента

Процедура ОбработатьРезультатЗаполненияПараметровРасчетаАмортизации(Объект, ПараметрыДляРасчета, РазделУчета) Экспорт
	
	//++ Локализация
	
	Если НЕ Объект.РежимИсправленияСПрошлойДаты
		ИЛИ Объект.НачалоПериода = '000101010000' Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ОтражатьВБУ
		И (РазделУчета = "БУ" ИЛИ РазделУчета = Неопределено) Тогда
		
		Объект.АмортизацияПРНаНачалоПериода = ПараметрыДляРасчета.АмортизацияПРНаНачалоПериода;
		Объект.АмортизацияЦФНаНачалоПериода = ПараметрыДляРасчета.АмортизацияЦФНаНачалоПериода;
		Объект.АмортизацияПРЦФНаНачалоПериода = ПараметрыДляРасчета.АмортизацияПРЦФНаНачалоПериода;
	КонецЕсли;

	Если Объект.ОтражатьВНУ
		И (РазделУчета = "НУ" ИЛИ РазделУчета = Неопределено) Тогда
			
		Объект.ДатаВводаВЭксплуатациюНУ = ПараметрыДляРасчета.ДатаВводаВЭксплуатациюНУ;
		Объект.АмортизацияНУНаНачалоПериода = ПараметрыДляРасчета.АмортизацияНУНаНачалоПериода;
		Объект.АмортизацияДо2009 = ПараметрыДляРасчета.АмортизацияДо2009;
		Объект.ФактическийСрокИспользованияДо2009 = ПараметрыДляРасчета.ФактическийСрокИспользованияДо2009;
			
		Объект.ПараметрыЗаПериодНУ.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПараметрыДляРасчета.ПараметрыЗаПериодНУ, Объект.ПараметрыЗаПериодНУ);
		Объект.ПараметрыЗаПериодНУ.Сортировать("Дата");
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область Локализация

Процедура ЗаполнитьНаОснованииПоступленияАрендованныхОС(Объект, Основание, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Объект.ДокументОснование = Основание;
	Объект.ВидИмущества = Перечисления.ВидыИмущества.Арендованное;
	Объект.ОтражатьВУпрУчете = Ложь;
	Объект.ОтражатьВРеглУчете = Истина;
	Объект.ОтражатьВБУ = Истина;
	Объект.ОтражатьВНУ = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.ПоступлениеАрендованныхОС.ОС КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Основание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТабличнаяЧасть.НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Объект.ОС.Загрузить(РезультатЗапроса.Выгрузить());
		
		ПервоначальныеСведения = Справочники.ОбъектыЭксплуатации.ПервоначальныеСведения(Объект.ОС[0].ОсновноеСредство);
		Объект.Организация = ПервоначальныеСведения.Организация;
		Объект.Подразделение = ПервоначальныеСведения.Местонахождение;
		
		Документы.КорректировкаСтоимостиИАмортизацииОС.ЗаполнитьПоДаннымУчета(Объект);
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ЗаполнитьДляПримененияИНВ(Объект, Основание)
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Заполнение документа для сценария с применением инвестиционного налогового вычета.
	// Выполняется когда ранее вычет не применялся и требуется скорректировать стоимость и амортизацию.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка.Дата КАК Дата,
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредство
	|
	|ПОМЕСТИТЬ ТаблицаОС
	|
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4.ОС КАК ТабличнаяЧасть
	|
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Основание
	|	И ТабличнаяЧасть.Ссылка.ОтражатьВНУ
	|	И ТабличнаяЧасть.Ссылка.ИнвестиционныйНалоговыйВычетФлаг
	|	И ТабличнаяЧасть.Ссылка.ИнвестиционныйНалоговыйВычет В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.Региональный),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.Федеральный))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Дата,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезРегистратор.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.ИнвестиционныйНалоговыйВычет КАК ИнвестиционныйНалоговыйВычет
	|
	|ПОМЕСТИТЬ ПорядокУчетаОСБУ
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПериод.ОсновноеСредство КАК ОсновноеСредство,
	|		СрезПериод.ДанныеРегистраПериод КАК ДанныеРегистраПериод,
	|		МАКСИМУМ(ДанныеРегистра.Регистратор) КАК ДанныеРегистраРегистратор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
	|			МАКСИМУМ(ДанныеРегистра.Период) КАК ДанныеРегистраПериод
	|		ИЗ
	|			ТаблицаОС КАК ТаблицаОС
	|
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|				ПО ДанныеРегистра.Период < ТаблицаОС.Дата
	|					И ДанныеРегистра.ОсновноеСредство = ТаблицаОС.ОсновноеСредство
	|					И ДанныеРегистра.Регистратор <> &Основание
	|					И ДанныеРегистра.Активность
	|
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаОС.ОсновноеСредство
	|
	|		) КАК СрезПериод
	|		
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|			ПО ДанныеРегистра.Период = СрезПериод.ДанныеРегистраПериод
	|				И ДанныеРегистра.ОсновноеСредство = СрезПериод.ОсновноеСредство
	|				И ДанныеРегистра.Регистратор <> &Основание
	|				И ДанныеРегистра.Активность
	|
	|	СГРУППИРОВАТЬ ПО
	|		СрезПериод.ОсновноеСредство,
	|		СрезПериод.ДанныеРегистраПериод
	|
	|	) КАК СрезРегистратор
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ КАК ДанныеРегистра
	|		ПО ДанныеРегистра.Период = СрезРегистратор.ДанныеРегистраПериод
	|			И ДанныеРегистра.Регистратор = СрезРегистратор.ДанныеРегистраРегистратор
	|			И ДанныеРегистра.ОсновноеСредство = СрезРегистратор.ОсновноеСредство
	|			И ДанныеРегистра.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВложенныйЗапрос.СуммаАмортизационнойПремииКВ) КАК СуммаАмортизационнойПремииКВ,
	|	СУММА(ВложенныйЗапрос.СуммаАмортизационнойПремииВключеннойВРасходы) КАК СуммаАмортизационнойПремииВключеннойВРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|		СтоимостьОСОбороты.АмортизационнаяПремияПриход КАК СуммаАмортизационнойПремииКВ,
	|		СтоимостьОСОбороты.АмортизационнаяПремияРасход КАК СуммаАмортизационнойПремииВключеннойВРасходы
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС.Обороты(
	|				,
	|				&КонецПериода,
	|				,
	|				ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ТаблицаОС.ОсновноеСредство
	|					ИЗ
	|						ТаблицаОС КАК ТаблицаОС)) КАК СтоимостьОСОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
	|		0 КАК СуммаАмортизационнойПремииКВ,
	|
	|		ВЫБОР
	|			КОГДА СтоимостьОС.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы)
	|				ТОГДА СтоимостьОС.СтоимостьНУ
	|			ИНАЧЕ -СтоимостьОС.СтоимостьНУ
	|		КОНЕЦ КАК СуммаАмортизационнойПремииВключеннойВРасходы
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
	|
	|	ГДЕ
	|		СтоимостьОС.Период <= &КонецПериода
	|		И СтоимостьОС.Регистратор <> &Ссылка
	|		И СтоимостьОС.Регистратор ССЫЛКА Документ.КорректировкаСтоимостиИАмортизацииОС
	|		И СтоимостьОС.Активность
	|
	|		И СтоимостьОС.НастройкаХозяйственнойОперации В (
	|			ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеАмортизационнойПремииВРасходы),
	|			ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.УменьшениеАмортизационнойПремии))
	|
	|		И СтоимостьОС.ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ТаблицаОС.ОсновноеСредство
	|					ИЗ
	|						ТаблицаОС КАК ТаблицаОС)
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка КАК ДокументОснование,
	|	ИСТИНА КАК ДокументНаОсновании,
	|	ДанныеДокумента.СобытиеОС КАК СобытиеОС,
	|	ДанныеДокумента.ИнвестиционныйНалоговыйВычет КАК ИнвестиционныйНалоговыйВычет,
	|	ЛОЖЬ КАК ОтражатьВУпрУчете,
	|	ИСТИНА КАК ОтражатьВРеглУчете,
	|	ИСТИНА КАК ОтражатьВБУ,
	|	ИСТИНА КАК ОтражатьВНУ
	|
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4 КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Основание
	|	И ДанныеДокумента.ИнвестиционныйНалоговыйВычетФлаг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.ИзменениеПараметровОС2_4.ОС КАК ТабличнаяЧасть
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|		ПО ПорядокУчетаОСБУ.ОсновноеСредство = ТабличнаяЧасть.ОсновноеСредство
	|
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Основание
	|	И ПорядокУчетаОСБУ.ИнвестиционныйНалоговыйВычет В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.НеПрименяется),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыПримененияИНВ.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТабличнаяЧасть.НомерСтроки
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("КонецПериода", НачалоМесяца(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Дата"))-1);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[РезультатЗапроса.ВГраница()].Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Объект.ОС.Загрузить(РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить());

	ПервоначальныеСведения = Справочники.ОбъектыЭксплуатации.ПервоначальныеСведения(Объект.ОС[0].ОсновноеСредство);
	
	Если НЕ ЗначениеЗаполнено(ПервоначальныеСведения.ДатаВводаВЭксплуатациюНУ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	АмортизационнаяПремия = РезультатЗапроса[РезультатЗапроса.ВГраница()-2].Выгрузить();
	СуммаАмортизационнойПремииВключеннойВРасходы = 
		?(АмортизационнаяПремия.Количество() <> 0, АмортизационнаяПремия[0].СуммаАмортизационнойПремииВключеннойВРасходы, 0);
	
	СуммаАмортизационнойПремииКВ = 
		?(АмортизационнаяПремия.Количество() <> 0, АмортизационнаяПремия[0].СуммаАмортизационнойПремииКВ, 0);
	
	Объект.ВидИмущества = Перечисления.ВидыИмущества.Собственное;
	
	ВыборкаРеквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выбрать();
	ВыборкаРеквизиты.Следующий();
	ЗаполнитьЗначенияСвойств(Объект, ВыборкаРеквизиты);

	Объект.Дата = Мин(ВыборкаРеквизиты.Дата + 1, КонецДня(ВыборкаРеквизиты.Дата));
	Объект.Организация = ПервоначальныеСведения.Организация;
	Объект.Подразделение = ПервоначальныеСведения.Местонахождение;

	Объект.РежимИсправленияСПрошлойДаты = Истина;
	Объект.НачалоПериода = НачалоМесяца(ПервоначальныеСведения.ДатаВводаВЭксплуатациюНУ);
	
	Документы.КорректировкаСтоимостиИАмортизацииОС.ЗаполнитьПоДаннымУчета(Объект);
	
	КорректировкаВСледующемМесяце = НачалоМесяца(ПервоначальныеСведения.ДатаВводаВЭксплуатациюНУ) = ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1);

	СтоимостьОтличается = Ложь;
	АмортизацияОтличается = Ложь;
	ТребуетсяКорректировкаАмортизационнойПремии = Ложь;
	
	ИсходныеЗначения = Новый Структура("ПервоначальнаяСтоимостьНУ,СтоимостьНУ,СтоимостьПР,АмортизацияНУ,АмортизацияПР");
	
	ПараметрыРасчетаАмортизации = Новый Структура;
	ПараметрыРасчетаАмортизации.Вставить("Организация", Объект.Организация);
	ПараметрыРасчетаАмортизации.Вставить("ОсновноеСредство", Объект.ОС[0].ОсновноеСредство);
	ПараметрыРасчетаАмортизации.Вставить("ДатаВводаВЭксплуатациюУУ", Объект.ДатаВводаВЭксплуатациюУУ);
	ПараметрыРасчетаАмортизации.Вставить("ДатаВводаВЭксплуатациюБУ", Объект.ДатаВводаВЭксплуатациюБУ);
	ПараметрыРасчетаАмортизации.Вставить("ДатаВводаВЭксплуатациюНУ", Объект.ДатаВводаВЭксплуатациюНУ);
	ПараметрыРасчетаАмортизации.Вставить("СтоимостьНаНачалоГода", Объект.СтоимостьНаНачалоГода);
	ПараметрыРасчетаАмортизации.Вставить("СтоимостьРеглНаНачалоГода", Объект.СтоимостьРеглНаНачалоГода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияНаНачалоГода", Объект.АмортизацияНаНачалоГода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияРеглНаНачалоГода", Объект.АмортизацияРеглНаНачалоГода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияНаНачалоПериода", Объект.АмортизацияНаНачалоПериода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияРеглНаНачалоПериода", Объект.АмортизацияРеглНаНачалоПериода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияНУНаНачалоПериода", Объект.АмортизацияНУНаНачалоПериода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияПРНаНачалоПериода", Объект.АмортизацияПРНаНачалоПериода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияЦФНаНачалоПериода", Объект.АмортизацияЦФНаНачалоПериода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияПРЦФНаНачалоПериода", Объект.АмортизацияПРЦФНаНачалоПериода);
	ПараметрыРасчетаАмортизации.Вставить("АмортизацияДо2009", Объект.АмортизацияДо2009);
	ПараметрыРасчетаАмортизации.Вставить("ФактическийСрокИспользованияДо2009", Объект.ФактическийСрокИспользованияДо2009);
	ПараметрыРасчетаАмортизации.Вставить("ЭтоАрендованныеОС", УчетАрендованныхОС.ОсновноеСредствоПолученоВАренду(Объект.ОС[0].ОсновноеСредство, Объект.Дата));
	
	#Область ЗаполнениеПараметровКорректировки
	
	Объект.КорректировкаПервоначальнойСтоимости = Ложь;
	Объект.КорректировкаСтоимости = Истина;
	Объект.ОтражениеУвеличенияСтоимости = Ложь;
	Объект.ОтражениеУменьшенияСтоимости = Истина;
	Объект.ОтражениеИзмененияСтоимостиНУЗаСчетПР = Истина;
	Объект.КорректировкаАмортизации = Истина;
	Объект.ОтражениеУвеличенияАмортизации = Истина;
	Объект.ОтражениеУменьшенияАмортизации = Истина;
	Объект.ОтражениеУменьшенияАмортизацииСторно = Истина;
	Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеДоходовЦФ = Истина;
	Объект.ВключаетАмортизациюТекущегоМесяца = Истина;
	Объект.КорректировкаАмортизационнойПремии = Истина;
	Объект.ОтражениеУменьшенияАмортизационнойПремии = Истина;
	Объект.ОтражениеУменьшенияАмортизационнойПремииСторно = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаАмортизационнаяПремия = Истина;
	Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизационнойПремии = Истина;
	Объект.КорректировкаСуммыРасходовНУПриИНВ = Истина;
	Объект.КорректировкаПараметровРасчетаАмортизации = Ложь;
	Объект.ПрименениеЦелевогоФинансирования = ПервоначальныеСведения.ПрименениеЦелевогоФинансирования;

	#КонецОбласти

	#Область ЗаполнениеДокументаЕслиПрименяетсяФИНВ
	
	Если ВыборкаРеквизиты.ИнвестиционныйНалоговыйВычет = Перечисления.ВариантыПримененияИНВ.Федеральный Тогда
	
		// Сумма расходов по ФИНВ равна стоимости в НУ
		// Стоимость в НУ нужно уменьшить на сумму расходов по ФИНВ * доля расходов ИНВ %
		// ПР в стоимости нужно увеличить на сумму расходов по ФИНВ * доля расходов ИНВ %
		// Амортизация в НУ пересчитывается с даты принятия к учету, исходя из новой стоимости 
		// ПР в амортизации нужно увеличить по правилам его расчета при начислении амортизации в БУ

		// Нужно рассчитать амортизацию за период исходя из стоимости НУ с учетом ФИНВ
		// Для расчета ПР в амортизации выполняется расчет амортизации в БУ исходя из суммы ПР с учетом ФИНВ
		
		ПараметрыФункции = Документы.КорректировкаСтоимостиИАмортизацииОС.ПараметрыРасчета(Объект);
		ПараметрыФункции.Вставить("РазделУчета", "БУ,НУ");
		ПараметрыДляРасчета = Документы.КорректировкаСтоимостиИАмортизацииОС.ПараметрыРасчетаАмортизации(ПараметрыФункции);
			
		Документы.КорректировкаСтоимостиИАмортизацииОС.ОбработатьПараметрыРасчетаАмортизации(Объект, ПараметрыДляРасчета);
		
		НастройкиУчетаНалогаНаПрибыль = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиУчетаНалогаНаПрибыль", Объект.Организация, Объект.Дата);
			
		Если НастройкиУчетаНалогаНаПрибыль <> Неопределено Тогда
			ДоляРасходовИНВ = НастройкиУчетаНалогаНаПрибыль.ДоляРасходовИНВ;
		Иначе
			ДоляРасходовИНВ = 0;
		КонецЕсли;
		
		Для Сч = 1 По Объект.ПараметрыЗаПериодБУ.Количество() Цикл
			
			ДанныеСтроки = Объект.ПараметрыЗаПериодБУ[Сч-1];
			
			Если Сч = 1 Тогда
				
				Если Объект.ПараметрыЗаПериодНУ.Количество() > 1 Тогда
					СтоимостьНУ = Объект.ПараметрыЗаПериодНУ[0].СтоимостьНУ;
					КорректировкаСтоимостиИНВ = Окр(СтоимостьНУ * ДоляРасходовИНВ / 100, 0);
					ДанныеСтроки.СтоимостьПР = ДанныеСтроки.СтоимостьПР + КорректировкаСтоимостиИНВ;
				КонецЕсли;
				
			Иначе	
				
				СтрокаНУ = Объект.ПараметрыЗаПериодНУ.Найти(НачалоДня(КонецМесяца(ДанныеСтроки.Дата)), "Дата");
				Если СтрокаНУ <> Неопределено Тогда
					СтоимостьНУ = СтрокаНУ.СтоимостьНУ + СуммаАмортизационнойПремииВключеннойВРасходы;
					КорректировкаСтоимостиИНВ = Окр(СтоимостьНУ * ДоляРасходовИНВ / 100, 0);
					ДанныеСтроки.СтоимостьПР = ДанныеСтроки.СтоимостьПР + КорректировкаСтоимостиИНВ;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

		Для Сч = 1 По Объект.ПараметрыЗаПериодНУ.Количество() Цикл
			
			ДанныеСтроки = Объект.ПараметрыЗаПериодНУ[Сч-1];
			
			Если ДанныеСтроки.СтоимостьНУ = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Сч = 1 Тогда
				СтоимостьНУ = ДанныеСтроки.СтоимостьНУ;
			Иначе
				СтоимостьНУ = ДанныеСтроки.СтоимостьНУ + СуммаАмортизационнойПремииВключеннойВРасходы;
			КонецЕсли;
			
			КорректировкаСтоимостиИНВ = Окр(СтоимостьНУ * ДоляРасходовИНВ / 100, 0);
			ДанныеСтроки.СтоимостьНУ = ДанныеСтроки.СтоимостьНУ - КорректировкаСтоимостиИНВ;
			
		КонецЦикла;
		
		Если КорректировкаВСледующемМесяце
			И СуммаАмортизационнойПремииКВ <> 0
			И Объект.ПараметрыЗаПериодНУ.Количество() > 1 Тогда
			
			СтрокаНУ = Объект.ПараметрыЗаПериодНУ[1];
			СтрокаНУ.СтоимостьНУ = СтрокаНУ.СтоимостьНУ - СуммаАмортизационнойПремииКВ; 
		КонецЕсли;
		
		ТаблицыРасчета = Новый Структура;
		ТаблицыРасчета.Вставить("ПараметрыЗаПериодБУ", Объект.ПараметрыЗаПериодБУ.Выгрузить());
		ТаблицыРасчета.Вставить("ПараметрыЗаПериодНУ", Объект.ПараметрыЗаПериодНУ.Выгрузить());
		
		РезультатРасчета = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПоТаблице(ТаблицыРасчета, ПараметрыРасчетаАмортизации);
		Документы.КорректировкаСтоимостиИАмортизацииОС.ОбработатьРезультатРасчетаАмортизации(Объект, РезультатРасчета);
	
		АмортизацияНУ = 0;
		АмортизацияНаНачалоГодаНУ = 0;
		Для Каждого Элемент Из Объект.ПараметрыЗаПериодНУ Цикл
			Если Элемент.Дата < НачалоГода(Объект.Дата) Тогда
				АмортизацияНаНачалоГодаНУ = АмортизацияНаНачалоГодаНУ + Элемент.АмортизацияНУ;
			Иначе
				АмортизацияНУ = АмортизацияНУ + Элемент.АмортизацияНУ;
			КонецЕсли;
		КонецЦикла;
	
		АмортизацияПР = 0;
		АмортизацияНаНачалоГодаПР = 0;
		Для Каждого Элемент Из Объект.ПараметрыЗаПериодБУ Цикл
			Если Элемент.Дата < НачалоГода(Объект.Дата) Тогда
				АмортизацияНаНачалоГодаПР = АмортизацияНаНачалоГодаПР + Элемент.АмортизацияПР;
			Иначе
				АмортизацияПР = АмортизацияПР + Элемент.АмортизацияПР;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ДанныеСтроки Из Объект.ОС Цикл
			
			ЗаполнитьЗначенияСвойств(ИсходныеЗначения, ДанныеСтроки);
			
			СтоимостьНУ = ДанныеСтроки.СтоимостьНУ + СуммаАмортизационнойПремииВключеннойВРасходы;
			
			КорректировкаСтоимостиИНВ = Окр(СтоимостьНУ * ДоляРасходовИНВ / 100, 0);
			
			ДанныеСтроки.СтоимостьНУ = ДанныеСтроки.СтоимостьНУ - КорректировкаСтоимостиИНВ;
			ДанныеСтроки.СтоимостьПР = ДанныеСтроки.СтоимостьПР + КорректировкаСтоимостиИНВ;
			ДанныеСтроки.СуммаРасходовНУПриИНВ = СтоимостьНУ;
			
			Если КорректировкаВСледующемМесяце
				И СуммаАмортизационнойПремииКВ <> 0 Тогда
				ДанныеСтроки.СтоимостьНУ = ДанныеСтроки.СтоимостьНУ - СуммаАмортизационнойПремииКВ;
			КонецЕсли;
			
			ДанныеСтроки.АмортизацияНУ = АмортизацияНУ;
			ДанныеСтроки.АмортизацияНаНачалоГодаНУ = АмортизацияНаНачалоГодаНУ;
			
			ДанныеСтроки.АмортизацияПР = АмортизацияПР;
			ДанныеСтроки.АмортизацияНаНачалоГодаПР = АмортизацияНаНачалоГодаПР;
						
			Если ДанныеСтроки.СтоимостьНУ <> ИсходныеЗначения.СтоимостьНУ
				ИЛИ ДанныеСтроки.СтоимостьПР <> ИсходныеЗначения.СтоимостьПР Тогда
				
				СтоимостьОтличается = Истина;
			КонецЕсли;
			
			Если ДанныеСтроки.АмортизацияНУ <> ИсходныеЗначения.АмортизацияНУ
				ИЛИ ДанныеСтроки.АмортизацияПР <> ИсходныеЗначения.АмортизацияПР
				ИЛИ КорректировкаВСледующемМесяце Тогда
				
				АмортизацияОтличается = Истина;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЗаполнениеДокументаЕслиПрименяетсяРИНВ
	
	Если ВыборкаРеквизиты.ИнвестиционныйНалоговыйВычет = Перечисления.ВариантыПримененияИНВ.Региональный Тогда
	
		// Сумма расходов по РИНВ должна равняться исходной стоимости
		// Стоимость и амортизация НУ должны быть нулевыми
		// ПР в стоимости должен увеличиться на текущую стоимость в НУ
		// ПР в амортизации нужно увеличить по правилам его расчета при начислении амортизации в БУ
		
		ПараметрыФункции = Документы.КорректировкаСтоимостиИАмортизацииОС.ПараметрыРасчета(Объект);
		ПараметрыФункции.Вставить("РазделУчета", "БУ,НУ");
		ПараметрыДляРасчета = Документы.КорректировкаСтоимостиИАмортизацииОС.ПараметрыРасчетаАмортизации(ПараметрыФункции);
			
		Документы.КорректировкаСтоимостиИАмортизацииОС.ОбработатьПараметрыРасчетаАмортизации(Объект, ПараметрыДляРасчета);
		
		Для Сч = 1 По Объект.ПараметрыЗаПериодБУ.Количество() Цикл
			
			ДанныеСтроки = Объект.ПараметрыЗаПериодБУ[Сч-1];
			
			Если Сч < 3 Тогда
				
				Если Объект.ПараметрыЗаПериодНУ.Количество() > 1 Тогда
					СтрокаНУ = Объект.ПараметрыЗаПериодНУ[0];
					КорректировкаСтоимостиИНВ = СтрокаНУ.СтоимостьНУ;
					ДанныеСтроки.СтоимостьПР = ДанныеСтроки.СтоимостьПР + КорректировкаСтоимостиИНВ;
				КонецЕсли;
				
			Иначе	
				
				СтрокаНУ = Объект.ПараметрыЗаПериодНУ.Найти(НачалоДня(КонецМесяца(ДанныеСтроки.Дата)), "Дата");
				Если СтрокаНУ <> Неопределено Тогда
					КорректировкаСтоимостиИНВ = СтрокаНУ.СтоимостьНУ + СуммаАмортизационнойПремииВключеннойВРасходы;
					ДанныеСтроки.СтоимостьПР = ДанныеСтроки.СтоимостьПР + КорректировкаСтоимостиИНВ;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
		ТаблицыРасчета = Новый Структура;
		ТаблицыРасчета.Вставить("ПараметрыЗаПериодБУ", Объект.ПараметрыЗаПериодБУ.Выгрузить());
		
		РезультатРасчета = Документы.АмортизацияОС2_4.РассчитатьАмортизациюПоТаблице(ТаблицыРасчета, ПараметрыРасчетаАмортизации);
		Документы.КорректировкаСтоимостиИАмортизацииОС.ОбработатьРезультатРасчетаАмортизации(Объект, РезультатРасчета);
		
		АмортизацияПР = 0;
		АмортизацияНаНачалоГодаПР = 0;
		Для Каждого ДанныеСтроки Из Объект.ПараметрыЗаПериодБУ Цикл
			Если ДанныеСтроки.Дата < НачалоГода(Объект.Дата) Тогда
				АмортизацияНаНачалоГодаПР = АмортизацияНаНачалоГодаПР + ДанныеСтроки.АмортизацияПР;
			Иначе
				АмортизацияПР = АмортизацияПР + ДанныеСтроки.АмортизацияПР;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ДанныеСтроки Из Объект.ОС Цикл
			
			ЗаполнитьЗначенияСвойств(ИсходныеЗначения, ДанныеСтроки);

			КорректировкаСтоимостиИНВ = ДанныеСтроки.СтоимостьНУ + СуммаАмортизационнойПремииВключеннойВРасходы;

			ДанныеСтроки.СтоимостьНУ = 0;
			ДанныеСтроки.СтоимостьПР = ДанныеСтроки.СтоимостьПР + КорректировкаСтоимостиИНВ;
			ДанныеСтроки.СуммаРасходовНУПриИНВ = КорректировкаСтоимостиИНВ;
			
			ДанныеСтроки.АмортизацияНУ = 0;
			ДанныеСтроки.АмортизацияНаНачалоГодаНУ = 0;
			
			ДанныеСтроки.АмортизацияПР = АмортизацияПР;
			ДанныеСтроки.АмортизацияНаНачалоГодаПР = АмортизацияНаНачалоГодаПР;
			
			Если СуммаАмортизационнойПремииВключеннойВРасходы <> 0 Тогда
				
				ДанныеСтроки.АмортизационнаяПремия = СуммаАмортизационнойПремииВключеннойВРасходы;
				ТребуетсяКорректировкаАмортизационнойПремии = Истина;
				
			ИначеЕсли КорректировкаВСледующемМесяце 
				И СуммаАмортизационнойПремииКВ <> 0 Тогда
					
				ДанныеСтроки.АмортизационнаяПремия = СуммаАмортизационнойПремииКВ;
				ТребуетсяКорректировкаАмортизационнойПремии = Истина;

			КонецЕсли;
			
			Если ДанныеСтроки.СтоимостьНУ <> ИсходныеЗначения.СтоимостьНУ
				ИЛИ ДанныеСтроки.СтоимостьПР <> ИсходныеЗначения.СтоимостьПР Тогда
				
				СтоимостьОтличается = Истина;
			КонецЕсли;
			
			Если ДанныеСтроки.АмортизацияНУ <> ИсходныеЗначения.АмортизацияНУ
				ИЛИ ДанныеСтроки.АмортизацияПР <> ИсходныеЗначения.АмортизацияПР
				ИЛИ КорректировкаВСледующемМесяце
					И СуммаАмортизационнойПремииКВ <> 0 Тогда
				
				АмортизацияОтличается = Истина;
			КонецЕсли;
			
		КонецЦикла;
	
		Объект.РежимИсправленияСПрошлойДаты = Ложь;
		Объект.НачалоПериода = '00010101';
	
	КонецЕсли;
	
	#КонецОбласти
		
	Объект.ОтражатьВБУ = Ложь;
	Объект.ОтражатьВНУ = Истина;
	Объект.ОтражатьВРеглУчете = Истина;
	Объект.ОтражатьВУпрУчете = Ложь;
	
	Объект.ПараметрыЗаПериод.Очистить();
	Объект.ПараметрыЗаПериодБУ.Очистить();
	
	Если КорректировкаВСледующемМесяце
		И СуммаАмортизационнойПремииКВ <> 0 Тогда
		// Чтобы отразилось включение ам. премии в расходы при начислении амортизации 
		Объект.ВключаетАмортизациюТекущегоМесяца = Ложь;
	КонецЕсли;
	
	// Сброс параметров, которые не изменились
	Если НЕ СтоимостьОтличается Тогда
		Объект.КорректировкаСтоимости = Ложь;
	КонецЕсли;
	
	Если НЕ АмортизацияОтличается Тогда
		Объект.КорректировкаАмортизации = Ложь;
	КонецЕсли;

	Если НЕ ТребуетсяКорректировкаАмортизационнойПремии Тогда
		Объект.КорректировкаАмортизационнойПремии = Ложь;
	КонецЕсли;

	Если ПервоначальныеСведения.ДатаВводаВЭксплуатациюНУ >= НачалоГода(Объект.Дата) Тогда
		Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов = Ложь;
	КонецЕсли;

	// Очистка зависимых реквизитов
	ПараметрыРеквизитовОбъекта = ВнеоборотныеАктивыКлиентСервер.ЗначенияСвойствЗависимыхРеквизитов_КорректировкаСтоимостиИАмортизацииОС(
		Объект, Документы.КорректировкаСтоимостиИАмортизацииОС.ВспомогательныеРеквизиты(Объект));
	
	ОбщегоНазначенияУТКлиентСервер.ОчиститьНеиспользуемыеРеквизиты(
		Объект, ПараметрыРеквизитовОбъекта, "ОС,ПараметрыЗаПериод,ПараметрыЗаПериодБУ,ПараметрыЗаПериодНУ");

	Возврат Ложь;
	
КонецФункции

#КонецОбласти

//-- Локализация

#КонецОбласти
