#Область СлужебныеПроцедурыИФункции

#Область УчетВходящегоНДС

#Область РегистрацияСчетовФактурПолученных

// см. УчетНДСУПКлиент.ОбработкаНавигационнойСсылкиСчетаФактурыПолученные
Процедура ОбработкаНавигационнойСсылкиСчетаФактурыПолученные(Форма, НавигационнаяСсылка, СтандартнаяОбработка, ПараметрыРегистрации) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылка = "ОткрытьСписокСчетовФактурПолученных" Тогда
		СтруктураОтбор = Новый Структура();
		СтруктураОтбор.Вставить("ДокументОснование", ПараметрыРегистрации.Ссылка);
		СтруктураОтбор.Вставить("Организация",       ПараметрыРегистрации.Организация);
		СтруктураОтбор.Вставить("ПометкаУдаления",   Ложь);
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбор);
		Если ПараметрыРегистрации.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя") Тогда
			ОткрытьФорму("Документ.СчетФактураПолученныйНалоговыйАгент.ФормаСписка", ПараметрыФормы, Форма);
		Иначе
			ОткрытьФорму("Документ.СчетФактураПолученный.ФормаСписка", ПараметрыФормы, Форма);
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылка = "ОткрытьСчетФактуруПолученный" Тогда
		Ключ = УчетНДСРФВызовСервера.СчетФактураПолученныйПоОснованию(ПараметрыРегистрации);
		ПараметрыФормы = Новый Структура("Ключ", Ключ);
		Если ПараметрыРегистрации.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя") Тогда
			ОткрытьФорму("Документ.СчетФактураПолученныйНалоговыйАгент.ФормаОбъекта", ПараметрыФормы, Форма);
		Иначе
			ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормы, Форма);
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылка = "ОткрытьИнойДокументПодтвержденияНДС" Тогда
		Ключ = УчетНДСРФВызовСервера.ИнойДокументПодтвержденияНДСПоОснованию(ПараметрыРегистрации);
		ПараметрыФормы = Новый Структура("Ключ", Ключ);
		ОткрытьФорму("Документ.ИнойДокументПодтвержденияНДС.ФормаОбъекта", ПараметрыФормы, Форма);
	ИначеЕсли НавигационнаяСсылка = "ОткрытьЗаявлениеОВвозеТоваров" Тогда
		Ключ = УчетНДСРФВызовСервера.ЗаявлениеОВвозеТоваровПоОснованию(
					ПараметрыРегистрации.Ссылка, ПараметрыРегистрации.Организация);
		ПараметрыФормы = Новый Структура("Ключ", Ключ);
		ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаОбъекта", ПараметрыФормы, Форма);
	ИначеЕсли НавигационнаяСсылка = "ВвестиНовыйСчетФактуру" Тогда
		ВвестиСчетФактуруПолученный(Форма, ПараметрыРегистрации);
	ИначеЕсли НавигационнаяСсылка = "ВвестиНовыйЗаявлениеОВвозеТоваров" Тогда
		ВвестиЗаявлениеОВвозеТоваров(Форма, ПараметрыРегистрации);
	ИначеЕсли НавигационнаяСсылка = "ОчиститьДокументПриобретения" Тогда
		Ключ = УчетНДСРФВызовСервера.СчетФактураПолученныйПоОснованию(ПараметрыРегистрации);
		УчетНДСРФВызовСервера.ОчиститьДокументПриобретенияВСчетеФактуреПолученномНалоговогоАгента(Ключ);
		Форма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ЗаконченоРедактированиеСчетаФактурыПолученного
Функция ЗаконченоРедактированиеСчетаФактурыПолученного(РезультатВыбора, ИсточникВыбора) Экспорт
	
	Результат = Ложь;

	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактураПолученный.Форма.ФормаДокумента"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураПолученный.Форма.ФормаСписка"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураПолученныйНалоговыйАгент.Форма.ФормаДокумента"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураПолученныйНалоговыйАгент.Форма.ФормаСписка"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураПолученныйНалоговыйАгент.Форма.ФормаВыбора"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.ЗаявлениеОВвозеТоваров.Форма.ФормаДокумента"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.ЗаявлениеОВвозеТоваров.Форма.ФормаРабочееМесто" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// см. УчетНДСУПКлиент.ВвестиСчетФактуруПолученный
Процедура ВвестиСчетФактуруПолученный(Форма, ПараметрыРегистрации) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыРегистрации",  ПараметрыРегистрации);
	ДополнительныеПараметры.Вставить("ОткрыватьСуществующую", Ложь);
	ДополнительныеПараметры.Вставить("Форма",                 Форма);
	
	Оповещение = Новый ОписаниеОповещения("ВвестиСчетФактуруПолученныйЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОбщегоНазначенияУТКлиент.ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокумента(Форма, Оповещение);
	
КонецПроцедуры

Процедура ВвестиСчетФактуруПолученныйЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыРегистрации = ДополнительныеПараметры.ПараметрыРегистрации;
		
	Если ЗначениеЗаполнено(ПараметрыРегистрации.Ссылка) Тогда
		ДокументОснование = ПараметрыРегистрации.Ссылка;
	Иначе
		ДокументОснование = ДополнительныеПараметры.Форма.Объект.Ссылка;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыОткрытия.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ПараметрыОткрытия.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	ПараметрыОткрытия.Вставить("Исправление",       ПараметрыРегистрации.ИсправлениеОшибок);
	ПараметрыОткрытия.Вставить("Корректировочный",  ПараметрыРегистрации.КорректировкаПоСогласованиюСторон);
	
	ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
	Если ПараметрыРегистрации.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя") Тогда
		
		// Проверяем, если по контрагенту и организации есть счета-фактуры по товарам в пути, то
		// выводим дополнительное окно для выбора таких счетов-фактур, иначе создаем новую счет-фактуру.
		
		СчетаФактурыВПути = УчетНДСРФВызовСервера.СчетаФактурыПоТоварамВПути(ПараметрыОткрытия);
		Если СчетаФактурыВПути.Количество() = 0 Тогда
			ОткрытьФорму("Документ.СчетФактураПолученныйНалоговыйАгент.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
		Иначе
			СтруктураОтбора = Новый Структура("Контрагент,Организация");
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, ПараметрыОткрытия);
			СтруктураОтбора.Вставить("ДатаПереходаПраваСобственности", Дата(1,1,1));
			
			ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
			ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
			
			Оповещение = Новый ОписаниеОповещения("ВыборСчетаФактурыВПутиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("Документ.СчетФактураПолученныйНалоговыйАгент.Форма.ФормаВыбора", ПараметрыФормы,
				ДополнительныеПараметры.Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	Иначе
		ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборСчетаФактурыВПутиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОткрытьФорму("Документ.СчетФактураПолученныйНалоговыйАгент.ФормаОбъекта",
			ДополнительныеПараметры.ПараметрыФормы,
			ДополнительныеПараметры.Форма);
	Иначе
		УчетНДСРФВызовСервера.ОтразитьПолучениеТовараСОбратнымОбложениемНДС(
			Результат,
			ДополнительныеПараметры.ПараметрыФормы.ДокументОснование);
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Данные счета-фактуры успешно изменены';
														|en = 'The tax invoice data is successfully changed'"));
		Оповестить();
	КонецЕсли;
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ВвестиЗаявлениеОВвозеТоваров
Процедура ВвестиЗаявлениеОВвозеТоваров(Форма, ПараметрыРегистрации) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыРегистрации",  ПараметрыРегистрации);
	ДополнительныеПараметры.Вставить("ОткрыватьСуществующую", Ложь);
	ДополнительныеПараметры.Вставить("Форма",                 Форма);
	
	Оповещение = Новый ОписаниеОповещения("ВвестиЗаявлениеОВвозеТоваровЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОбщегоНазначенияУТКлиент.ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокумента(Форма, Оповещение);
	
КонецПроцедуры

Процедура ВвестиЗаявлениеОВвозеТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыРегистрации = ДополнительныеПараметры.ПараметрыРегистрации;
	
	Если ЗначениеЗаполнено(ПараметрыРегистрации.Ссылка) Тогда
		ДокументОснование = ПараметрыРегистрации.Ссылка;
	Иначе
		ДокументОснование = ДополнительныеПараметры.Форма.Объект.Ссылка;
	КонецЕсли;
	
	ДанныеЗаявленияОВвозеТоваров = Новый Структура;
	ДанныеЗаявленияОВвозеТоваров.Вставить("ДокументОснование", ДокументОснование);
	ДанныеЗаявленияОВвозеТоваров.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ДанныеЗаявленияОВвозеТоваров.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Основание", ДанныеЗаявленияОВвозеТоваров);
	ПараметрыФормы.Вставить("ДокументОснование", ПараметрыРегистрации.Ссылка);
	
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваров.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Выводит печатную форму заявления о ввозе товаров из ЕАЭС.
//
// Параметры:
//  ОписаниеКоманды	 - Структура - структура с описанием команды.
// 
// Возвращаемое значение:
//  Неопределено - ничего не возвращается.
//
Функция ПечатьЗаявлениеОВвозеТоваров(ОписаниеКоманды) Экспорт

	ПараметрыПечати = ОбщегоНазначенияБПКлиент.ПолучитьЗаголовокПечатнойФормы(ОписаниеКоманды.ОбъектыПечати);
	
	Если ОписаниеКоманды.Свойство("ДополнительныеПараметры") 
		И ПараметрыПечати <> Неопределено Тогда
		ПараметрыПечати.Вставить("ДополнительныеПараметры", ОписаниеКоманды.ДополнительныеПараметры);
	КонецЕсли;

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Документ.ЗаявлениеОВвозеТоваров",
		"ЗаявлениеОВвозеТоваров",
		ОписаниеКоманды.ОбъектыПечати,
		ОписаниеКоманды.Форма,
		ПараметрыПечати);
	
КонецФункции

#КонецОбласти

//++ НЕ УТ

#Область Выгрузка

Процедура ВыгрузкаЗаявленияОВвозеТоваров(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
		
		УникальныйИдентификаторЗаявлениеОВвозе = Новый УникальныйИдентификатор;
		УникальныйИдентификаторУчетПеремещенияТоваров = Новый УникальныйИдентификатор;
		
		ВыгружаемыеДанные = УчетНДСРФВызовСервера.ПолучитьВыгружаемыеДанныеЗаявлениеОВвозеТоваров(
			Ссылка, 
			УникальныйИдентификаторЗаявлениеОВвозе,
			УникальныйИдентификаторУчетПеремещенияТоваров);
			
		Если ВыгружаемыеДанные.ЗаявлениеОВвозеТоваров <> Неопределено Тогда
			
			Для Каждого ФайлВыгрузки Из ВыгружаемыеДанные.ЗаявлениеОВвозеТоваров Цикл
				
				Попытка
					
					ПолучитьФайл(ФайлВыгрузки.АдресФайлаВыгрузки, ФайлВыгрузки.ИмяФайлаВыгрузки);
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					
					ТекстСообщения = "Не удалось записать файл """ + ФайлВыгрузки.ИмяФайлаВыгрузки 
					+ """! Возможно, недостаточно места на диске или диск защищен от записи.";
					
					Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1';
																									|en = '%1'"), ТекстСообщения);
					
					Сообщение.Сообщить();
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
			
		Если ВыгружаемыеДанные.УчетПеремещенияТоваров <> Неопределено Тогда
			
			Для Каждого ФайлВыгрузки Из ВыгружаемыеДанные.УчетПеремещенияТоваров Цикл
				
				Попытка
					
					ПолучитьФайл(ФайлВыгрузки.АдресФайлаВыгрузки, ФайлВыгрузки.ИмяФайлаВыгрузки);
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					
					ТекстСообщения = "Не удалось записать файл """ + ФайлВыгрузки.ИмяФайлаВыгрузки 
					+ """! Возможно, недостаточно места на диске или диск защищен от записи.";
					
					Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1';
																									|en = '%1'"), ТекстСообщения);
					
					Сообщение.Сообщить();
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ

#КонецОбласти

#Область УчетИсходящегоНДС

#Область ФормированиеСчетовФактурВыданных

// см. УчетНДСУПКлиент.ОбработкаНавигационнойСсылкиСчетаФактурыВыданные
Процедура ОбработкаНавигационнойСсылкиСчетаФактурыВыданные(Форма, НавигационнаяСсылка, СтандартнаяОбработка, ПараметрыРегистрации) Экспорт
	
	Если НавигационнаяСсылка = "ОткрытьСписокСчетовФактурВыданных" Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОтбор = Новый Структура();
		СтруктураОтбор.Вставить("ДокументОснование", ПараметрыРегистрации.Ссылка);
		СтруктураОтбор.Вставить("Организация",       ПараметрыРегистрации.Организация);
		СтруктураОтбор.Вставить("ПометкаУдаления",   Ложь);
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбор);
		ОткрытьФорму("Документ.СчетФактураВыданный.ФормаСписка", ПараметрыФормы, Форма);
	ИначеЕсли НавигационнаяСсылка = "ОткрытьСчетФактуруВыданный" Тогда
		СтандартнаяОбработка = Ложь;
		Ключ = УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(
				ПараметрыРегистрации.Ссылка, ПараметрыРегистрации.Организация);
		ПараметрыФормы = Новый Структура("Ключ", Ключ);
		ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, Форма);
	ИначеЕсли НавигационнаяСсылка = "ВвестиНовыйСчетФактуруВыданный" Тогда
		СтандартнаяОбработка = Ложь;
		ВвестиСчетФактуруВыданный(Форма, ПараметрыРегистрации);
	ИначеЕсли НавигационнаяСсылка = "ВвестиКорректировочныйСчетФактуруВыданныйПоОтгрузке" Тогда 
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", ПараметрыРегистрации.Организация);
		Отбор.Вставить("Контрагент", ПараметрыРегистрации.Контрагент);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", Отбор);
		ПараметрыФормы.Вставить("ДокументПереходаПраваСобственности", ПараметрыРегистрации.Ссылка);
		ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаРабочееМестоДляОформленияИсправленныхСчетовФактурПоОтгрузкам", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ЗаконченоРедактированиеСчетаФактурыВыданного
Функция ЗаконченоРедактированиеСчетаФактурыВыданного(РезультатВыбора, ИсточникВыбора) Экспорт
	
	Результат = Ложь;
	
	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактураВыданный.Форма.ФормаДокумента"
		  ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураВыданный.Форма.ФормаСписка" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// см. УчетНДСУПКлиент.ПечатьИсправительныхСчетовФактурПоИзмененнымДокументам
Процедура ПечатьИсправительныхСчетовФактурПоИзмененнымДокументам(ТаблицаИзмененныхДокументов, Форма) Экспорт
	
	МассивДокументов = Новый Массив;
	Для каждого Строка Из ТаблицаИзмененныхДокументов Цикл
		Если МассивДокументов.Найти(Строка.Документ) = Неопределено Тогда
			МассивДокументов.Добавить(Строка.Документ);
		КонецЕсли;
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьОбщихФорм",
		"СчетФактура",
		МассивДокументов,
		Форма, // ВладелецФормы
		Новый Структура("ПечатьВВалюте", Ложь)); // ПараметрыПечати
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ВвестиСчетФактуруВыданный
Процедура ВвестиСчетФактуруВыданный(Форма, ПараметрыРегистрации) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыРегистрации",  ПараметрыРегистрации);
	ДополнительныеПараметры.Вставить("ОткрыватьСуществующую", Ложь);
	ДополнительныеПараметры.Вставить("Форма",                 Форма);
	
	Оповещение = Новый ОписаниеОповещения("ВвестиСчетФактуруВыданныйЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОбщегоНазначенияУТКлиент.ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокумента(Форма, Оповещение);
	
КонецПроцедуры

Процедура ВвестиСчетФактуруВыданныйЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыРегистрации = ДополнительныеПараметры.ПараметрыРегистрации;
		
	Если ЗначениеЗаполнено(ПараметрыРегистрации.Ссылка) Тогда
		ДокументОснование = ПараметрыРегистрации.Ссылка;
	Иначе
		ДокументОснование = ДополнительныеПараметры.Форма.Объект.Ссылка;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыОткрытия.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ПараметрыОткрытия.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	ПараметрыОткрытия.Вставить("Исправление",       ПараметрыРегистрации.ИсправлениеОшибок);
	ПараметрыОткрытия.Вставить("Корректировочный",  ПараметрыРегистрации.КорректировкаПоСогласованиюСторон);
	ПараметрыОткрытия.Вставить("РеализацияЧерезКомиссионера",
													ПараметрыРегистрации.РеализацияЧерезКомиссионера);
	ПараметрыОткрытия.Вставить("НачислениеНДСПриОтгрузке",    ПараметрыРегистрации.НачислениеНДСПриОтгрузке);

	Если ПараметрыРегистрации.ИсправлениеОшибок Тогда 
		СчетаФактурыОснования = УчетНДСРФВызовСервера.ЗаполнитьСчетаФактурыОснования(ПараметрыОткрытия);
		Если СчетаФактурыОснования = Неопределено Тогда
			ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
			ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
		Иначе
			ТекстВопроса = НСтр("ru = 'По выбранным документам-основаниям необходимо выставить несколько исправленных счетов-фактур.';
								|en = 'Several adjusted tax invoices must be drawn by selected base documents.'") + Символы.ПС 
			+ НСтр("ru = 'Будет создано несколько исправленных счетов-фактур, в которых необходимо вручную заполнить сведения об исправлениях.';
					|en = 'Several corrected tax invoices will be created. Enter the information on corrections manually.'") + Символы.ПС 
			+ НСтр("ru = 'Создать отдельные документы?';
					|en = 'Do you want to create separate documents?'");
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СчетаФактурыОснования", СчетаФактурыОснования);
			ДополнительныеПараметры.Вставить("ДокументОснование", ДокументОснование);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиОтдельныеСчетаФактурыВыданныеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		КонецЕсли;
	Иначе
	
		ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
		ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВвестиОтдельныеСчетаФактурыВыданныеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	СписокСчетовФактурОснования = Новый СписокЗначений;
	Для Каждого КлючИЗначение Из ДополнительныеПараметры.СчетаФактурыОснования Цикл 
		СписокСчетовФактурОснования.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	СписокСчетовФактурОснования.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СчетаФактурыОснования = СписокСчетовФактурОснования.ВыгрузитьЗначения();
	
	Инд = 1;
	
	Для Каждого СчетФактураОснование Из СчетаФактурыОснования Цикл 
		
		СчетФактураИсправление = ДополнительныеПараметры.СчетаФактурыОснования.Получить(СчетФактураОснование);
		Если ЗначениеЗаполнено(СчетФактураИсправление) Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭтоКорректировочныйСФ = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СчетФактураОснование, "Корректировочный");
		
		Если Инд = 1
			И ЭтоКорректировочныйСФ Тогда
			ПараметрыСоздания = Новый Структура("Уникальность, РучнаяКорректировкаСуммДокумента", Истина, Истина);
			ПараметрыСоздания.Вставить("ДокументОснование", ДополнительныеПараметры.ДокументОснование);
			ПараметрыСоздания.Вставить("СозданНаОсновании", ДополнительныеПараметры.ДокументОснование);
			ПараметрыВыполнения = Новый Структура("ОписаниеКоманды", Новый Структура("МножественныйВыбор, ДополнительныеПараметры", Ложь, ПараметрыСоздания));
		Иначе
			ПараметрыВыполнения = Новый Структура("ОписаниеКоманды", Новый Структура("МножественныйВыбор, ДополнительныеПараметры", Ложь, Новый Структура("Уникальность, СозданНаОсновании", Истина, ДополнительныеПараметры.ДокументОснование)));
		КонецЕсли;
		
		КорректировочныйСчетФактура(СчетФактураОснование, ПараметрыВыполнения);
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеСчетовФактурКомиссионеру
	
// см. УчетНДСУПКлиент.ОбработкаНавигационнойСсылкиСчетаФактурыКомиссионеру
Процедура ОбработкаНавигационнойСсылкиСчетаФактурыКомиссионеру(Форма, НавигационнаяСсылка, СтандартнаяОбработка, ПараметрыРегистрации) Экспорт

	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылка = "ОткрытьСписокСчетовФактурКомиссионеру" Тогда
		СтруктураОтбор = Новый Структура();
		СтруктураОтбор.Вставить("ДокументОснование", ПараметрыРегистрации.Ссылка);
		СтруктураОтбор.Вставить("Организация",       ПараметрыРегистрации.Организация);
		СтруктураОтбор.Вставить("ПометкаУдаления",   Ложь);
		СтруктураОтбор.Вставить("КОформлению",       Ложь);
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбор);
		Если ПараметрыРегистрации.РеализацияЧерезКомиссионера Тогда
			ОбщегоНазначенияУТКлиент.ОткрытьФормуПослеПроверкиПроведенностиДокумента("Документ.СчетФактураВыданный.Форма.ФормаСпискаПоОтчетуКомиссионера",ПараметрыФормы, Форма);
		Иначе
			ОбщегоНазначенияУТКлиент.ОткрытьФормуПослеПроверкиПроведенностиДокумента("Документ.СчетФактураКомиссионеру.Форма.ФормаСпискаПоОтчетуКомиссионера",ПараметрыФормы, Форма);
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылка = "ОткрытьСчетФактуруКомиссионеру" Тогда
		Ключ = УчетНДСРФВызовСервера.СчетФактураКомиссионеруПоОснованию(
					ПараметрыРегистрации.Ссылка, ПараметрыРегистрации.Организация, ПараметрыРегистрации.РеализацияЧерезКомиссионера);
		ПараметрыФормы = Новый Структура("Ключ", Ключ);
		Если ПараметрыРегистрации.РеализацияЧерезКомиссионера Тогда
			ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, Форма);
		Иначе
			ОткрытьФорму("Документ.СчетФактураКомиссионеру.ФормаОбъекта", ПараметрыФормы, Форма);
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылка = "ОткрытьСчетаФактурыКомиссионеруКОформлению" Тогда
		СтруктураОтбор = Новый Структура();
		СтруктураОтбор.Вставить("ДокументОснование", ПараметрыРегистрации.Ссылка);
		СтруктураОтбор.Вставить("Организация",       ПараметрыРегистрации.Организация);
		СтруктураОтбор.Вставить("ПометкаУдаления",   Ложь);
		СтруктураОтбор.Вставить("КОформлению",       Истина);
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбор);
		Если ПараметрыРегистрации.РеализацияЧерезКомиссионера Тогда
			ОбщегоНазначенияУТКлиент.ОткрытьФормуПослеПроверкиПроведенностиДокумента("Документ.СчетФактураВыданный.Форма.ФормаСпискаПоОтчетуКомиссионера", ПараметрыФормы, Форма);
		Иначе
			ОбщегоНазначенияУТКлиент.ОткрытьФормуПослеПроверкиПроведенностиДокумента("Документ.СчетФактураКомиссионеру.Форма.ФормаСпискаПоОтчетуКомиссионера", ПараметрыФормы, Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ЗаконченоРедактированиеСчетовФактурКомиссионеру
Функция ЗаконченоРедактированиеСчетовФактурКомиссионеру(РезультатВыбора, ИсточникВыбора) Экспорт
	
	Результат = Ложь;
	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактураКомиссионеру.Форма.ФормаДокумента"
	      ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураКомиссионеру.Форма.ФормаСписка"
	      ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СчетФактураКомиссионеру.Форма.ФормаСпискаПоОтчетуКомиссионера" Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#Область ВыборИОформлениеСчетовФактурДляОтчетаКомитенту

// см. УчетНДСУПКлиент.НачалоВыбораСчетаФактурыДляОтчетаКомитенту
Процедура НачалоВыбораСчетаФактурыДляОтчетаКомитенту(Элемент, ПараметрыВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ВыборСчетаФактурыВыданногоПокупателюКомиссионногоТовара", ПараметрыВыбора, Элемент);
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ОткрытьФормуОформленияСчетовФактурДляОтчетаКомитенту
Процедура ОткрытьФормуОформленияСчетовФактурДляОтчетаКомитенту(ПараметрыФормы, ФормаВладелец) Экспорт
	
	ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаОформленияСчетовФактур", ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ЗаконченоОформлениеСчетовФактурВыданных
Функция ЗаконченоОформлениеСчетовФактурВыданных(РезультатВыбора, ИсточникВыбора) Экспорт
	
	Результат = Ложь;
	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактураВыданный.Форма.ФормаОформленияСчетовФактур" Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПеречислениеНДСВБюджетПоОтдельнымОперациям

// см. УчетНДСУПКлиент.ОткрытьФормуПодбораСчетовФактурТребующихОплатыНДС
Процедура ОткрытьФормуПодбораСчетовФактурТребующихОплатыНДС(ПараметрыПодбора, ОповещениеОПодборе) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыПодбора.Организация) Тогда
		ОткрытьФорму("Обработка.ПеречислениеНДСВБюджетПоОтдельнымОперациям.Форма.ПодборНДСКУплате", ПараметрыПодбора,,,,,ОповещениеОПодборе);
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать организацию.';
														|en = 'You need to select a company'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	КонецЕсли;
	
КонецПроцедуры

// Выполняет обработку навигационной ссылки форматированной строки.
// Открывает форму Рабочего места установки соответствия ДокументаПоставки и ДОПП.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа
// 	Параметры - Структура:
// 	*Основание - ДокументСсылка
// 	*Организация - СправочникСсылка.Организации
// 	*Дата - Дата
// 	НавигационнаяСсылка - Строка - Навигационная ссылка форматированной строки.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
//
Процедура ОбработкаНавигационнойСсылкиДОПП(Форма, Параметры, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
	//++ НЕ УТ
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Параметры.Организация);
	ПараметрыФормы.Вставить("Основание",   Параметры.Основание);
	
	Если НавигационнаяСсылка = "ОткрытьСписокДОПП" Тогда
		
		ИмяФормыУведомлений = "РегистрСведений.ДокументыОПредстоящейПоставке.Форма.СписокДОПППоОснованиям";
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(
			ИмяФормыУведомлений,
			ПараметрыФормы,
			Форма,
			,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	ИначеЕсли НавигационнаяСсылка = "ОткрытьДОПП" Тогда
		
		Ключ = УчетНДСРФВызовСервера.ПолучитьДОПППоОснованию(Параметры.Основание);
		Если ЗначениеЗаполнено(Ключ) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Ключ.Ссылка);
			ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылка = "СоздатьДОПП" Тогда
		
		СсылкаНаДОПП = УчетНДСРФВызовСервера.СоздатьРеглОтчетДОПП(Параметры);
		Если ЗначениеЗаполнено(СсылкаНаДОПП) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", СсылкаНаДОПП);
			ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.ФормаДокумента", ПараметрыФормы, Форма);
		КонецЕсли;
		
	КонецЕсли;
	
	//-- НЕ УТ
	
КонецПроцедуры

// см. УчетНДСУПКлиент.ОткрытьФормуСостоянияОплатыНДСПоСчетуФактуре
Процедура ОткрытьФормуСостоянияОплатыНДСПоСчетуФактуре(СчетФактура, ФормаВладелец) Экспорт
	
	ПараметрыФормы = Новый Структура("СчетФактура", СчетФактура);
	
	ОбщегоНазначенияУТКлиент.ОткрытьФормуПослеПроверкиПроведенностиДокумента("РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Форма.ФормаДокументыОплаты",
		ПараметрыФормы,
		ФормаВладелец);

КонецПроцедуры

// см. УчетНДСУПКлиент.ОбработкаИзмененияСостоянияОплатыНДСПоСчетуФактуре
Процедура ОбработкаИзмененияСостоянияОплатыНДСПоСчетуФактуре(ИсточникВыбора, ТекстСостояния, КомандаСостояния) Экспорт
	
	Если ИсточникВыбора.ИмяФормы = "РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Форма.ФормаДокументыОплаты" Тогда
		КомандаСостояния.Заголовок = ТекстСостояния;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаНавигационныхСсылок

// Обрабатывает нажатие на навигационную ссылку заявления о ввозе, полученного от покупателя из ЕАЭС.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа отгрузки.
//  Элемент - ПолеФормы - поле формы клиентского приложения.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - наименование навигационной ссылки.
//  СтандартнаяОбработка - Булево - признак стандартной обработки элемента формы клиентского приложения.
//
Процедура ОбработкаНавигационнойСсылкиЗаявленияОВвозеТоваровПолученного(Форма, Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	//++ НЕ УТ
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОформитьЗаявлениеОВвозеПолученное" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияУТКлиент.ОткрытьФормуПослеПроверкиПроведенностиДокумента("Документ.ЗаявлениеОВвозеТоваровПолученное.ФормаОбъекта",
			Новый Структура,
			Форма,
			"Независимый",
			"Основание");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ВыборИзСпискаЗаявленийОВвозеПолученных" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("СоздатьПоказатьЗаявленияОВвозеПолученныеОповещение", ЭтотОбъект, Форма);
		Форма.ПоказатьВыборИзМеню(Оповещение, Форма.СписокЗаявленийОтПокупателя, Элемент);
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

// Создает новый или показывает существующий элемент списка навигационных ссылок
// заявления о ввозе, полученного от покупателя из ЕАЭС.
//
// Параметры:
//  ВыбранныйЭлемент - ПолеФормы - поле формы клиентского приложения.
//  Форма - ФормаКлиентскогоПриложения - форма документа отгрузки.
//
Процедура СоздатьПоказатьЗаявленияОВвозеПолученныеОповещение(ВыбранныйЭлемент, Форма) Экспорт
	//++ НЕ УТ
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранныйЭлемент.Значение)
	КонецЕсли
	//-- НЕ УТ
	
КонецПроцедуры

// Обрабатывает нажатие на навигационную ссылку статистической формы учета перемещения товаров.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа отгрузки.
//  НаправлениеПеремещения - Строка - - направление перемещения товаров.
//                           Значения: "ЭК" - экспорт товаров в страны ЕАЭС, "ИМ" - импорт товаров из стран ЕАЭС.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - наименование навигационной ссылки.
//  СтандартнаяОбработка - Булево - признак стандартной обработки элемента формы клиентского приложения.
//
Процедура ОбработкаНавигационнойСсылкиСтатформыФТС(Форма, НаправлениеПеремещения, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка) Экспорт
	
	//++ НЕ УТ
	Если НавигационнаяСсылкаФорматированнойСтроки = "СтатформаВФТС" Тогда

		СтандартнаяОбработка = Ложь;
		СтатформаВФТС(Форма, НаправлениеПеремещения);
		
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманд

Процедура КорректировочныйСчетФактура(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
	
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ПараметрКоманды = МассивСсылок;
	Иначе
		ПараметрКоманды = МассивСсылок[0];
	КонецЕсли;
	
	РеквизитыДляОбработки = УчетНДСРФВызовСервера.СтруктураРеквизитовДляОбработки(ПараметрКоманды);
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ТипСчетФактуры = "Выданный";
	ИначеЕсли ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		ТипСчетФактуры = "Полученный";
	ИначеЕсли ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.СчетФактураПолученныйНалоговыйАгент") Тогда
		ТипСчетФактуры = "ПолученныйНалоговыйАгент";
	КонецЕсли;
	
	Если РеквизитыДляОбработки.Исправление Тогда
		
		ЗначенияЗаполнения.Вставить("Исправление", Истина);
		ЗначенияЗаполнения.Вставить("СчетФактураОснование", ПараметрКоманды);
		Если ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.Свойство("ДокументОснование") Тогда
			ЗначенияЗаполнения.Вставить("ДокументОснование", ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.ДокументОснование);
		КонецЕсли;
		Если ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.Свойство("РучнаяКорректировкаСуммДокумента") Тогда
			ЗначенияЗаполнения.Вставить("РучнаяКорректировкаСуммДокумента", ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.РучнаяКорректировкаСуммДокумента);
		КонецЕсли;
		Если ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.Свойство("СозданНаОсновании") Тогда
			ЗначенияЗаполнения.Вставить("СозданНаОсновании", ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.СозданНаОсновании);
		КонецЕсли;
		ЗначенияЗаполнения.Вставить("ЭтоИсправлениеНаОснованииСФ", Истина);
		
	ИначеЕсли РеквизитыДляОбработки.Свойство("Перевыставленный") И РеквизитыДляОбработки.Перевыставленный = Истина Тогда
		
		Если ТипСчетФактуры="Выданный" Тогда
						
			ТекстСообщения = НСтр("ru = 'Для выбранного документа нельзя ввести корректировочный счет-фактуру.
			|Необходимо воспользоваться рабочим местом ""Перевыставление комитенту(принципалу) счетов-фактур""';
			|en = 'A corrective tax invoice cannot be entered for the selected document.
			|You must use the ""Reissuing invoices to the consignor (principal)"" workplace'");
			
			ВызватьИсключение ТекстСообщения;
			
		КонецЕсли;
		
	Иначе
		
		ЗначенияЗаполнения.Вставить("Исправление", Истина);
		ЗначенияЗаполнения.Вставить("СчетФактураОснование", ПараметрКоманды);
		Если ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.Свойство("ДокументОснование") Тогда 
			ЗначенияЗаполнения.Вставить("ДокументОснование", ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.ДокументОснование);
		КонецЕсли;
		Если ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.Свойство("СозданНаОсновании") Тогда
			ЗначенияЗаполнения.Вставить("СозданНаОсновании", ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.СозданНаОсновании);
		КонецЕсли;
		ЗначенияЗаполнения.Вставить("ЭтоИсправлениеНаОснованииСФ", Истина);
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.СчетФактура"+ТипСчетФактуры+".ФормаОбъекта",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

Процедура ИсправленныйСчетФактура(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
	
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ДокументОснование = МассивСсылок;
	Иначе
		ДокументОснование = МассивСсылок[0];
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации")
		И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ДокументОснование, "ХозяйственнаяОперация") = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПереходПраваСобственности") Тогда 
		ТекстСообщения = НСтр("ru = 'Для документа корректировки реализации с операцией ""Переход права собственности"" не требуется оформление счета-фактуры';
								|en = 'For the sales adjustment document with the ""Transfer of title to goods"" transaction, registering a tax invoice is not required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ПараметрыРегистрации = УчетНДСРФВызовСервера.ПараметрыРегистрацииСчетовФактурВыданных(ДокументОснование);
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыОткрытия.Вставить("Организация",       ПараметрыРегистрации.Организация);
	ПараметрыОткрытия.Вставить("Контрагент",        ПараметрыРегистрации.Контрагент);
	ПараметрыОткрытия.Вставить("Исправление",       ПараметрыРегистрации.ИсправлениеОшибок);
	ПараметрыОткрытия.Вставить("Корректировочный",  ПараметрыРегистрации.КорректировкаПоСогласованиюСторон);
	ПараметрыОткрытия.Вставить("РеализацияЧерезКомиссионера",
													ПараметрыРегистрации.РеализацияЧерезКомиссионера);

	Если ПараметрыРегистрации.ИсправлениеОшибок Тогда
		
		СчетаФактурыОснования = УчетНДСРФВызовСервера.ЗаполнитьСчетаФактурыОснования(ПараметрыОткрытия);
		Если СчетаФактурыОснования = Неопределено Тогда
			
			ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
			ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполнения.Форма);
			
		Иначе
			
			ТекстВопроса = НСтр("ru = 'По выбранным документам-основаниям необходимо выставить несколько исправленных счетов-фактур.';
								|en = 'Several adjusted tax invoices must be drawn by selected base documents.'") + Символы.ПС 
			+ НСтр("ru = 'Будет создано несколько исправленных счетов-фактур, в которых необходимо вручную заполнить сведения об исправлениях.';
					|en = 'Several corrected tax invoices will be created. Enter the information on corrections manually.'") + Символы.ПС 
			+ НСтр("ru = 'Создать отдельные документы?';
					|en = 'Do you want to create separate documents?'");
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СчетаФактурыОснования", СчетаФактурыОснования);
			ДополнительныеПараметры.Вставить("ДокументОснование", ДокументОснование);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиОтдельныеСчетаФактурыВыданныеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			
		КонецЕсли;
		
	Иначе
	
		ПараметрыФормы = Новый Структура("Основание, ДокументОснование",ПараметрыОткрытия, ДокументОснование);
		ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполнения.Форма);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсправлениеПрочегоНачисленияНДС(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
	
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ПараметрКоманды = МассивСсылок;
	Иначе
		ПараметрКоманды = МассивСсылок[0];
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
	
	ОткрытьФорму(
		"Документ.ЗаписьКнигиПродаж.Форма.ФормаДокумента",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

Процедура ТаможеннаяДекларацияЭкспортНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	//++ НЕ УТ
	ОткрытьФорму("Документ.ТаможеннаяДекларацияЭкспорт.Форма.ФормаДокумента",
		Новый Структура("Основание", МассивСсылок));
	//-- НЕ УТ
	
КонецПроцедуры

Процедура ЗаявлениеОВвозеТоваровПолученноеНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	//++ НЕ УТ
	ОткрытьФорму("Документ.ЗаявлениеОВвозеТоваровПолученное.Форма.ФормаДокумента",
		Новый Структура("Основание", МассивСсылок));
	//-- НЕ УТ
	
КонецПроцедуры

// Процедура на основании формы документа находит существующую или создает новую статистическую форму
// учета перемещения товаров.
//
// Параметры:
//  Форма                  - ФормаКлиентскогоПриложения - форма документа, на основании которого подается статформа.
//  НаправлениеПеремещения - Строка - направление перемещения товаров.
//                           Значения: "ЭК" - экспорт товаров в страны ЕАЭС, "ИМ" - импорт товаров из стран ЕАЭС.
//
Процедура СтатформаВФТС(Форма, НаправлениеПеремещения) Экспорт
	
	//++ НЕ УТ
	
	// ОтчетностьВФТС - ДокументСсылка.РегламентированныйОтчет - статформа.
	// Ссылка         - ДокументСсылка - документ, на основании которого подается статформа.
	// Дата           - Дата - дата документа, на основании которого подается статформа.
	//  Организация   - СправочникСсылка.Организации - организация, подающая статформу.
	
	Объект = Форма.Объект;
	ОтчетностьВФТС = Форма.ОтчетностьВФТС;
	
	Если НЕ ЗначениеЗаполнено(ОтчетностьВФТС) Тогда
		
		Если Объект.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Отчет ""Статистическая форма учета перемещения товаров"" нельзя создать на основании документа, помеченного на удаление.';
				|en = 'Отчет ""Статистическая форма учета перемещения товаров"" нельзя создать на основании документа, помеченного на удаление.'"));
			Возврат;
		КонецЕсли;
		
		Если Форма.Модифицированность Тогда
			Форма.Записать(); // ФормаКлиентскогоПриложения
		КонецЕсли;
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Ссылка", Объект.Ссылка);
		Реквизиты.Вставить("Дата", Объект.Дата);
		Реквизиты.Вставить("Организация", Объект.Организация);
		
		ОтчетностьВФТС = УчетНДСРФВызовСервера.ОпределитьСсылкуНаСуществующуюСтатформу(Реквизиты);
		ОткрытьСтатформу(НаправлениеПеремещения, Реквизиты, ОтчетностьВФТС);
		
	Иначе
		ПоказатьЗначение(, ОтчетностьВФТС);
	КонецЕсли;
	
	//-- НЕ УТ
	
КонецПроцедуры

// Открывает на основании реквизитов документа форму для заполнения отчета "Статистическая форма учета перемещения товаров".
//
// Параметры:
//  НаправлениеПеремещения            - Строка - направление перемещения товаров.
//                                               Значения: "ЭК" - экспорт товаров в страны ЕАЭС.
//                                                         "ИМ" - импорт товаров из стран ЕАЭС.
//  Реквизиты                         - Структура - содержит реквизиты документа для открытия статформы:
//   * Ссылка                         - ДокументСсылка - документ, на основании которого подается статформа.
//   * Дата                           - Дата - дата документа основания.
//   * Организация                    - СправочникСсылка.Организации - организация документа основания.
//  СсылкаНаСуществующуюСтатформу     - ДокументСсылка.РегламентированныйОтчет, Неопределено - ссылка на статформу.
//
Процедура ОткрытьСтатформу(НаправлениеПеремещения, Реквизиты, СсылкаНаСуществующуюСтатформу = Неопределено) Экспорт
	
	//++ НЕ УТ
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаСуществующуюСтатформу) Тогда
		
		Попытка
			
			ПараметрыФормы = ПараметрыСтатформы(НаправлениеПеремещения, Реквизиты);
			
			ОткрытьФорму("Отчет.РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС.Форма.ФормаАналогЛК",
				ПараметрыФормы);
			
		Исключение
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не удалось открыть форму отчета ""Статистическая форма учета перемещения товаров"".';
					|en = 'Cannot open the ""Statistical form of goods transfer accounting"" report form.'"));
			
			ИмяСобытия = НСтр("ru = 'Открытие формы отчета ""Статистическая форма учета перемещения товаров"".';
								|en = 'Открытие формы отчета ""Статистическая форма учета перемещения товаров"".'");
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
			
		КонецПопытки;
		
	Иначе
		
		ПоказатьЗначение(, СсылкаНаСуществующуюСтатформу);
		
	КонецЕсли;
	
	//-- НЕ УТ

КонецПроцедуры

// Определяет параметры формы для заполнения отчета "Статистическая форма учета перемещения товаров".
//
// Параметры:
//  НаправлениеПеремещения            - Строка - направление перемещения товаров.
//                                               Значения: "ЭК" - экспорт товаров в страны ЕАЭС.
//                                                         "ИМ" - импорт товаров из стран ЕАЭС.
//  Реквизиты                         - Структура - содержит реквизиты документа для открытия статформы:
//   * Ссылка                         - ДокументСсылка - документ, на основании которого подается статформа.
//   * Дата                           - Дата - дата документа основания.
//   * Организация                    - СправочникСсылка.Организации - организация документа основания.
//   * СсылкаНаСуществующуюСтатформу  - ДокументСсылка.РегламентированныйОтчет, Неопределено - ссылка на статформу.
//
// Возвращаемое значение:
//  Структура - параметры статформы:
//   * мДатаНачалаПериодаОтчета       - Дата - дата начала периода подачи статформы.
//   * мСохраненныйДок                - Неопределено - сохраняемый документ
//   * мСкопированаФорма              - Неопределено - скопированная форма.
//   * мДатаКонцаПериодаОтчета        - Дата - дата окончания периода подачи статформы.
//   * мПериодичность                 - ПеречислениеСсылка.Периодичность - периодичность отчета.
//   * Организация                    - СправочникСсылка.Организации - организация, подающая статформу.
//   * мВыбраннаяФорма                - Строка - имя формы отчета для статформы.
//   * Основание                      - ДокументСсылка - документ, на основании которого подается статформа.
//   * НаправлениеПеремещения         - Строка - направление перемещения товаров.
//                                               Значения: "ЭК" - экспорт товаров в страны ЕАЭС.
//                                                         "ИМ" - импорт товаров из стран ЕАЭС.
//
Функция ПараметрыСтатформы(НаправлениеПеремещения, Реквизиты) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", НачалоМесяца(Реквизиты.Дата));
	ПараметрыФормы.Вставить("мСохраненныйДок",          Неопределено);
	ПараметрыФормы.Вставить("мСкопированаФорма",        Неопределено);
	ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  КонецМесяца(Реквизиты.Дата));
	ПараметрыФормы.Вставить("мПериодичность",           ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	ПараметрыФормы.Вставить("Организация",              Реквизиты.Организация);
	ПараметрыФормы.Вставить("мВыбраннаяФорма",          "ФормаАналогЛК");
	ПараметрыФормы.Вставить("Основание",                Реквизиты.Ссылка);
	ПараметрыФормы.Вставить("НаправлениеПеремещения",   НаправлениеПеремещения);
	
	Возврат ПараметрыФормы;
	
КонецФункции

// Заполнение параметров отчета по реквизитам из номенклатуры
//
// Параметры:
//  СтандартнаяОбработка    - Булево - Истина, если в форме клиентсткого приложения идет стандартная обработка
//                                     событий выбора реквизита.
//  ОповещениеОЗакрытии     - ОписаниеОповещения - описания о повещения после закрытия формы выбора.
//  Владелец                - ФормаКлиентскогоПриложения - форма для которой переопределяется выбор значений номенклатуры.
//  ЗапрашиваемыеПоказатели - Строка - наименования показателей, разделенные запятыми.
//
Процедура ОткрытьФормуПодбораНоменклатуры(СтандартнаяОбработка, ОповещениеОЗакрытии, Владелец, ЗапрашиваемыеПоказатели) Экспорт
	
	//++ НЕ УТ
	
	Если Владелец.ИмяФормы = "Отчет.РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС.Форма.ФормаВводаТовараЛК" Тогда
		СтандартнаяОбработка = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Владелец", Владелец);
		ДополнительныеПараметры.Вставить("ОповещениеОЗакрытии", ОповещениеОЗакрытии);
		ДополнительныеПараметры.Вставить("ЗапрашиваемыеПоказатели", ЗапрашиваемыеПоказатели);
		
		// Выбор типа данных будет осуществляться с помощью метода списка значений
		// Для обработки выбора типа используется описание оповещения
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораТипаДанныхНоменклатуры", ЭтотОбъект, ДополнительныеПараметры);
		
		СписокТиповНоменклатуры = Новый СписокЗначений;
		
		УчетНДСУПВызовСервера.СписокВыбораТиповНоменклатурыСтатформыФТС(СписокТиповНоменклатуры);
		
		СписокТиповНоменклатуры.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выбор типа данных';
																		|en = 'Select data type'"));
		
	КонецЕсли;
	
	//-- НЕ УТ
	
КонецПроцедуры

Процедура ОбработкаВыбораТипаДанныхНоменклатуры(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	//++ НЕ УТ
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ИмяОткрываемойФормы = "";
		
		ТипНоменклатуры = ВыбранныйЭлемент.Значение;
		Если ТипНоменклатуры = Тип("Строка") Тогда
			ПередаваемыеПоказатели = Новый Структура("Наименование", "");
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗакрытии, ПередаваемыеПоказатели);
			Возврат;
		ИначеЕсли ТипНоменклатуры = Тип("СправочникСсылка.Номенклатура") Тогда
			ИмяОткрываемойФормы = "Справочник.Номенклатура.ФормаВыбора";
		ИначеЕсли ТипНоменклатуры = Тип("СправочникСсылка.НоменклатураКонтрагентов") Тогда
			ИмяОткрываемойФормы = "Справочник.НоменклатураКонтрагентов.ФормаВыбора";
		ИначеЕсли ТипНоменклатуры = Тип("СправочникСсылка.КлассификаторТНВЭД") Тогда
			ИмяОткрываемойФормы = "Справочник.КлассификаторТНВЭД.ФормаВыбора";
		ИначеЕсли ТипНоменклатуры = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
			ИмяОткрываемойФормы = "Справочник.ОбъектыЭксплуатации.ФормаВыбора";
		ИначеЕсли ТипНоменклатуры = Тип("СправочникСсылка.ДоговорыАренды") Тогда
			ИмяОткрываемойФормы = "Справочник.ДоговорыАренды.ФормаВыбора";
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуПодбораНоменклатурыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Если НЕ ЗначениеЗаполнено(ИмяОткрываемойФормы) Тогда
			
			ОчиститьСообщения();
			Текст = СтрШаблон(НСтр("ru = 'Не определена форма выбора для типа %1.';
									|en = 'Не определена форма выбора для типа %1.'"), ВыбранныйЭлемент.Значение);
		
			ОбщегоНазначенияКлиент.СообщитьПользователю(Текст, ДополнительныеПараметры.Владелец);
			Возврат;
			
		КонецЕсли;
		
		ОткрытьФорму(ИмяОткрываемойФормы, , ЭтотОбъект, , , , Оповещение);
		
	КонецЕсли;
	
	//-- НЕ УТ
	
КонецПроцедуры

// Процедура завершения выбора номенклатуры
Процедура ОткрытьФормуПодбораНоменклатурыЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемыеПоказатели = УчетНДСУПВызовСервера.ХарактеристикиТовараДляОтчетаСтатистикаФормаУчетаПеремещенияТоваровТС(
							РезультатВыбора);
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗакрытии, ПередаваемыеПоказатели);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти