
//++ Локализация
#Область ПрограммныйИнтерфейс

// Осуществляет разбор выписки банка
//
// Параметры:
// 	ЭлектроннаяВыпискаБанка - Ссылка - Электронная выписка
//
Процедура РазобратьВыпискуБанка(ЭлектроннаяВыпискаБанка) Экспорт
	
	ДенежныеСредстваСерверЛокализация.РазобратьВыпискуБанка(ЭлектроннаяВыпискаБанка);
	
КонецПроцедуры

//++ НЕ УТ

// Осуществляет установку константы КаталогВыгрузкиПодтверждающихДокументов
//
// Параметры:
// 	ЗначениеКонстанты - Строка - Путь к каталогу выгрузки подтверждающих документов
//
Процедура УстановитьЗначениеКонстантыКаталогВыгрузкиПодтверждающихДокументов(ЗначениеКонстанты) Экспорт
	
	Константы.КаталогВыгрузкиПодтверждающихДокументов.Установить(ЗначениеКонстанты);
	
КонецПроцедуры

// Определяет значения заполнения документа "Командировка" на основании "Заявки на командировку"
// 
// Параметры:
//    ДокументОснование - ДокументСсылка.ЗаявкаНаКомандировку - Заявка на командировку
//
// Возвращаемое значение:
//    Структура - Значения заполнения
//
Функция ЗначенияЗаполненияКомандировкиНаОснованииЗаявки(ДокументОснование) Экспорт
	
	РеквизитыОбъекта = Документы.ЗаявкаНаКомандировку.РеквизитыОбъекта(ДокументОснование);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", РеквизитыОбъекта.Организация);
	ЗначенияЗаполнения.Вставить("Сотрудник", СотрудникПоФизЛицу(РеквизитыОбъекта.Сотрудник, РеквизитыОбъекта.Организация));
	ЗначенияЗаполнения.Вставить("ДатаНачала", РеквизитыОбъекта.ДатаНачала);
	ЗначенияЗаполнения.Вставить("ДатаОкончания", РеквизитыОбъекта.ДатаОкончания);
	ЗначенияЗаполнения.Вставить("ЗаявкаСотрудника", ДокументОснование);
	ЗначенияЗаполнения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

// Определяет сотрудника по физическому лицу
// 
// Параметры:
//    ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - Физическое лицо
//    Организация - СправочникСсылка.Организации - Организация, в которой работает сотрудник
//
// Возвращаемое значение:
//    СправочникСсылка.Сотрудники, Неопределено - Сотрудник или Неопределено, если установить сотрудника не удалось
// 
Функция СотрудникПоФизЛицу(ФизическоеЛицо, Организация) Экспорт
	
	Результат = Неопределено;
	
	ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
		ФизическоеЛицо, Ложь, Организация, ТекущаяДатаСеанса());
	
	Если ОсновныеСотрудники <> Неопределено И ОсновныеСотрудники.Количество() Тогда
		Результат = ОсновныеСотрудники[0].Сотрудник;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует данные заполнения для коммандировки и возвращает признак корректного заполнения.
// 
// Параметры:
//  Заявка - ДокументСсылка.ЗаявкаНаКомандировку - документ, на основании которого создается командировка.
//  ДанныеЗаполнения - Неопределено - данные для заполнения командировки.
// 
// Возвращаемое значение:
//  Булево
Функция СформироватьДанныеЗаполненияКомандировки(Заявка, ДанныеЗаполнения) Экспорт

	ДанныеЗаполнения = ЗначенияЗаполненияКомандировкиНаОснованииЗаявки(Заявка);
	
	Отказ = Ложь;
	
	Если Не ДенежныеСредстваСерверЛокализация.ЭтоДействующийСотрудник(ДанныеЗаполнения) Тогда
		
		ТекстОшибки = НСтр("ru = 'В заявке введен не действующий сотрудник';
							|en = 'Inactive employee is specified in the request'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		
	КонецЕсли;
	
	Возврат Не Отказ;

КонецФункции

//-- НЕ УТ

// Возвращает номер банковского счета по уникальному идентификатору первичного документа.
// 
// Параметры:
//  ИдПервичногоДокумента - Строка - уникальный идентификатор объекта в информационной базе.
// 
// Возвращаемое значение:
// - Строка.
//
Функция БанковскийСчетПодтвержденияПоПервичномуДокументу(ИдПервичногоДокумента) Экспорт
	
	БанковскийСчет = "";
	
	ПервичныйДокумент = ДенежныеСредстваСерверЛокализация.ПервичныйДокументПоИдентификатору(ИдПервичногоДокумента);
			
	Если Не ПервичныйДокумент.Пустая() Тогда
		
		Если ПервичныйДокумент.Метаданные().Реквизиты.Найти("БанковскийСчет") <> Неопределено Тогда
			БанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервичныйДокумент, "БанковскийСчет.НомерСчета");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат БанковскийСчет;
	
КонецФункции

#Область СистемаБыстрыхПлатежей

// Возвращает заголовок надписи оплаты СБП.
// 
// Параметры:
//  Документ - ДокументСсылка - документ, по которому выполняется поиск наличия оплаты СБП
//  Входящий - Булево - признак направления платежной ссылки.
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока - Текст надписи оплаты СБП
Функция ТекстНадписиОплатыСБП(Документ, Входящий = Ложь) Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.ТекстНадписиОплатыСБП(Документ, Входящий);

КонецФункции

#КонецОбласти

// Возвращает список имен процедур, подключаемых для проверки наличия оплаты через сервисы.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ, для которого формируется список подключаемых проверок.
//  Контрагент - СправочникСсылка.Контрагенты - плательщик по документу.
// 
// Возвращаемое значение:
//  Неопределено, Массив из Строка - список имен процедур.
Функция ПроцедурыПроверкиОплатыЧерезСервис(ДокументСсылка, Контрагент) Экспорт

	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыПоТипуРасчетов(
		ДокументСсылка, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
		
	Если СтруктураПараметров = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(ДокументСсылка, СтруктураПараметров);
	
	Если СостояниеВзаиморасчетов.ПроцентОплат >= 100
		И СостояниеВзаиморасчетов.СуммаЗадолженности <= 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПроцедурыПроверки = Новый Массив;
	
	Если ОнлайнЗаказыУТ.ЕстьАктивнаяСсылкаНаОнлайнЗаказ(ДокументСсылка) Тогда
		ПроцедурыПроверки.Добавить("Подключаемый_ПроверкаОплатыОнлайнЗаказа");
	КонецЕсли;
	
	Если СистемаБыстрыхПлатежейУТ.ЕстьАктивнаяПлатежнаяСсылкаСБП(ДокументСсылка, Контрагент) Тогда
		ПроцедурыПроверки.Добавить("Подключаемый_ПроверкаОплатыСБП");
	КонецЕсли;
	
	Возврат ПроцедурыПроверки;

КонецФункции

// Выполняет поиск фоновых заданий и ожидает завершения всех фоновых заданий по загрузке оплат из сервиса,
// запущенных по регламентному заданию и вручную в рабочем месте "Безналичные платежи" ("Платежи") или в документе операции.
// 
// Параметры:
//  ПараметрыЗагрузки - см. ДенежныеСредстваКлиентЛокализация.НовыеПараметрыЗагрузкиИзСервиса.
//
Процедура ОжидатьЗавершенияАктивныхЗаданийСервиса(ПараметрыЗагрузки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыЗагрузки.ЭтоЗагрузкаИзСБП Тогда
		
		МетаданныеОбъект = Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОперацийПлатежныхСистем;
		НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка статусов операций СБП';
											|en = 'Import FPS transaction statuses'");
		
	ИначеЕсли ПараметрыЗагрузки.ЭтоЗагрузкаИзОнлайнЗаказов Тогда
		
		МетаданныеОбъект = Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОнлайнЗаказов;
		НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка статусов операций онлайн-заказов';
											|en = 'Import online order transaction statuses'");
		
	Иначе
		Возврат;
	КонецЕсли;
	
	СписокФоновыхЗаданий = Новый Массив;
	
	ОтборЗаданий = Новый Структура;
	ОтборЗаданий.Вставить("Метаданные", МетаданныеОбъект);
	ОтборЗаданий.Вставить("Использование", Истина);
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ОтборЗаданий);
	
	Если СписокЗаданий.Количество() > 0 Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		Задание = СписокЗаданий.Получить(0);
		
		Если ТипЗнч(СписокЗаданий) = Тип("Массив") Тогда
			Отбор.Вставить("РегламентноеЗадание", Задание);
		Иначе
			Отбор.Вставить("ИмяМетода", Задание.ИмяМетода);
		КонецЕсли;
		
		СписокФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Наименование", НаименованиеФоновогоЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокФоновыхЗаданий, ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор), Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если СписокФоновыхЗаданий.Количество() > 0 Тогда
		
		Для Каждого Задание Из СписокФоновыхЗаданий Цикл
			Задание.ОжидатьЗавершенияВыполнения();
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

//-- Локализация