#Область ПрограммныйИнтерфейс

//Пересчитывает все курсовые разницы за указанный период.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации- Перечень организаций по которым необходимо выполнить переоценку.
//	НачалоПериода - Дата - Начало периода пересчета курсовых разниц.
//	КонецПериода - Дата - Конец периода пересчета курсовых разниц.
//  Параметры - см. ПараметрыПереоценки
//
Процедура ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, Знач НачалоПериода, Знач КонецПериода, Параметры) Экспорт
	
	ИмяЗамера = "Взаиморасчеты.РасчетКурсовыхРазницПоСрокам" + ?(Параметры.ЭтоРасчетыСКлиентами,".Клиенты",".Поставщики");
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяЗамера);
	Параметры.Вставить("ВсегоОбработано", 0);
	ДокументыПереоценки = Документы.РасчетКурсовыхРазниц.ДокументыПереоценкиПоОрганизациям(
		МассивОрганизаций, НачалоПериода, КонецПериода, Параметры.ЭтоРасчетыСКлиентами);	
	Параметры.Вставить("ДокументыПереоценки", ДокументыПереоценки);	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Если Параметры.ЭтоРасчетыСКлиентами Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	КонецЕсли;
	Параметры.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Параметры.Вставить("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());
	
	НачалоПериода = НачалоМесяца(НачалоПериода);
	КонецПериода = КонецМесяца(НачалоПериода);
	//++ НЕ УТ

	//++ Локализация
	Параметры.Вставить("ИспользоватьРеглУчет", ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет"));
	Если НЕ Параметры.ПерезаполнениеРегистровНУ Тогда
		Для Каждого Документ Из ДокументыПереоценки Цикл
			ОчиститьРегистрыНУ(Документ.Ссылка, Параметры.ЭтоРасчетыСКлиентами);
		КонецЦикла;
		ЗаполнитьДвиженияНУзаПериод(МассивОрганизаций, НачалоПериода, Параметры.ЭтоРасчетыСКлиентами);
	КонецЕсли;
	//-- Локализация

	//-- НЕ УТ
	
	ДниПереоценки = ДниПереоценки(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры);
	Параметры.Вставить("ДниПереоценки", ДниПереоценки);
	УдалитьКурсовыеРазницыЗаПериод(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры);
	Для Каждого День Из ДниПереоценки Цикл
		Дата = День.Дата;
		Если КонецДня(День.Дата) = КонецМесяца(День.Дата) Тогда
			Дата = КонецДня(День.Дата);
		КонецЕсли;
		ВыполнитьПереоценкуНаДату(МассивОрганизаций, Дата, Параметры);
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, Параметры.ВсегоОбработано);
	
КонецПроцедуры

// Возвращает структуру параметров необходимых для регистрации документа к отложенному распределению расчетов.
// 
// Возвращаемое значение:
// 	Структура - Описание:
//  *ЭтоРасчетыСКлиентами - Булево - Истина если это расчеты с клиентами.
//  *ПереоценкаПоДням - Булево - Истина если необходимо переоценивать каждый день, иначе только по дням оплаты.
//  *ПерезаполнениеРегистровНУ - Булево - Истина если выполняется расчет курсовых по НУ.
//
Функция ПараметрыПереоценки(ЭтоРасчетыСКлиентами = Неопределено, ПереоценкаПоДням = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	
	Если ПереоценкаПоДням = Неопределено Тогда
		Результат.Вставить("ПереоценкаПоДням", Константы.ПереоцениватьВалютныеСредстваПоДням.Получить());
	Иначе
		Результат.Вставить("ПереоценкаПоДням", ПереоценкаПоДням);
	КонецЕсли;
	Результат.Вставить("ПерезаполнениеРегистровНУ", Ложь);

	Возврат Результат;
	
КонецФункции

//++ НЕ УТ

//++ Локализация
Процедура ПерезаполнитьОборотыНУ(Организация, Период, ЭтоРасчетыСКлиентами) Экспорт

	НачатьТранзакцию();
	Попытка
		
		НачалоВступленияВСилу67ФЗ = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
		ЗаполнитьДвиженияНУзаПериод(Организация, Период, ЭтоРасчетыСКлиентами, НачалоВступленияВСилу67ФЗ);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры
//-- Локализация

//-- НЕ УТ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Добавляет записи переоценки на одну дату.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации - Перечень организаций по которым необходимо выполнить переоценку.
//	Период - Дата - Дата, на конец которой необходимо выполнить переоценку.
//  Параметры - см. ПараметрыПереоценки 
//
Процедура ВыполнитьПереоценкуНаДату(МассивОрганизаций, Период, Параметры) Экспорт

	ЭтоРасчетыСКлиентами = Параметры.ЭтоРасчетыСКлиентами;
	ПереоценкаПоДням = Параметры.ПереоценкаПоДням;
	
	Запрос = Новый Запрос;
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикиУчетаПоПартнерам.КлючАналитики                              КАК АналитикаУчетаПоПартнерам,
	|	АналитикиУчетаПоПартнерам.Организация                                КАК Организация,
	|	АналитикиУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	&ВалютаУправленческогоУчета                                          КАК ВалютаУправленческогоУчета,
	|	АналитикиУчетаПоПартнерам.Договор                                    КАК Договор,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ПереоцениватьТоварыУслугиКОтчетуКомитенту, ЛОЖЬ) КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	НЕ ЕСТЬNULL(ДоговорыКонтрагентов.ПриПереоценкеЗадолженностиКлиентаНеПрименятьПоложения67ФЗ, ЛОЖЬ) КАК ПрименятьПоложения67ФЗ,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ТипДоговора, НЕОПРЕДЕЛЕНО)             КАК ТипДоговора,
	|	ЕСТЬNULL(
	|		ЕСТЬNULL(
	|			ДоговорыКонтрагентов.ВариантКурсаДоговора, 
	|			ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))         КАК ВариантКурсаДоговора
	|ПОМЕСТИТЬ ВтАналитикиУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АналитикиУчетаПоПартнерам.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
	|		ПО АналитикиУчетаПоПартнерам.Договор = ДоговорыМеждуОрганизациями.Ссылка
	|ГДЕ
	|	АналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ВалютаРегламентированногоУчета,
	|	ВалютаУправленческогоУчета,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения КАК ДатаВозникновения,
	|	Обороты.ДокументОплаты КАК ДокументОплаты,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОборотыПоДокументамОплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|		Расчеты.ДатаВозникновения КАК ДатаВозникновения,
	|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Расчеты.Долг
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРасход,
	|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Расчеты.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРеглРасход,
	|		Расчеты.ДокументРегистратор КАК ДокументОплаты,
	|		&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.АналитикаУчетаПоПартнерам
	|				И (Расчеты.Валюта <> Аналитика.ВалютаРегламентированногоУчета
	|					ИЛИ Расчеты.Валюта <> &ВалютаУправленческогоУчета)
	|		ГДЕ
	|			Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|			И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|			И Расчеты.Долг <> 0
	|			И Расчеты.ХозяйственнаяОперация <> &ЗачетАванса
	|	) КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения,
	|	Обороты.ДокументОплаты,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения КАК ДатаВозникновения,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОборотыЗаДень
	|ИЗ
	|	втОборотыПоДокументамОплаты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ДатаПлановогоПогашения,
	|	Обороты.ДатаВозникновения,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОборотыЗаДеньБезДат
	|ИЗ
	|	втОборотыПоДокументамОплаты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов               КАК ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта                       КАК Валюта,
	|	ОстаткиИОбороты.ВалютаРегл                   КАК ВалютаРегл,
	|	ОстаткиИОбороты.РасчетныйДокумент            КАК РасчетныйДокумент,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения       КАК ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения            КАК ДатаВозникновения,
	|	ОстаткиИОбороты.ВариантКурсаДоговора         КАК ВариантКурсаДоговора,
	|	СУММА(ОстаткиИОбороты.ПредоплатаОстаток)     КАК ПредоплатаОстаток,
	|	СУММА(ОстаткиИОбороты.ПредоплатаРеглОстаток) КАК ПредоплатаРеглОстаток,
	|	СУММА(ОстаткиИОбороты.ПредоплатаУпрОстаток)  КАК ПредоплатаУпрОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгОстаток)           КАК ДолгОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгРеглОстаток)       КАК ДолгРеглОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгУпрОстаток)        КАК ДолгУпрОстаток,
	|	ОстаткиИОбороты.ЭтоРасчетыСКлиентами         КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ втОстаткиНаКонецДня
	|ИЗ 
	|	(ВЫБРАТЬ
	|		РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокамОстатки.ОбъектРасчетов            КАК ОбъектРасчетов,
	|		РасчетыПоСрокамОстатки.Валюта                    КАК Валюта,
	|		АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета   КАК ВалютаРегл,
	|		РасчетыПоСрокамОстатки.РасчетныйДокумент         КАК РасчетныйДокумент,
	|		РасчетыПоСрокамОстатки.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокамОстатки.ДатаВозникновения         КАК ДатаВозникновения,
	|		АналитикиУчетаПоПартнерам.ВариантКурсаДоговора             КАК ВариантКурсаДоговора,
	|		РасчетыПоСрокамОстатки.ПредоплатаОстаток         КАК ПредоплатаОстаток,
	|		РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток     КАК ПредоплатаРеглОстаток,
	|		РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток      КАК ПредоплатаУпрОстаток,
	|		РасчетыПоСрокамОстатки.ДолгОстаток               КАК ДолгОстаток,
	|		РасчетыПоСрокамОстатки.ДолгРеглОстаток           КАК ДолгРеглОстаток,
	|		РасчетыПоСрокамОстатки.ДолгУпрОстаток            КАК ДолгУпрОстаток,
	|		&ЭтоРасчетыСКлиентами                            КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|				&НачалоПериода,
	|				НЕ (Валюта, Валюта) В (
	|					ВЫБРАТЬ 
	|						АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета,
	|						АналитикиУчетаПоПартнерам.ВалютаУправленческогоУчета
	|					ИЗ
	|						ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|					)
	|			) КАК РасчетыПоСрокамОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|				ПО РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РасчетыПоСрокамОбороты.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокамОбороты.ОбъектРасчетов                    КАК ОбъектРасчетов,
	|		РасчетыПоСрокамОбороты.Валюта                            КАК Валюта,
	|		АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета   КАК ВалютаРегл,
	|		РасчетыПоСрокамОбороты.РасчетныйДокумент                 КАК РасчетныйДокумент,
	|		РасчетыПоСрокамОбороты.ДатаПлановогоПогашения            КАК ДатаПлановогоПогашения,
	|		РасчетыПоСрокамОбороты.ДатаВозникновения                 КАК ДатаВозникновения,
	|		АналитикиУчетаПоПартнерам.ВариантКурсаДоговора             КАК ВариантКурсаДоговора,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.Предоплата
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.Предоплата
	|		КОНЕЦ                                                      КАК ПредоплатаОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ПредоплатаРегл
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ПредоплатаРегл
	|		КОНЕЦ                                                      КАК ПредоплатаРеглОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ПредоплатаУпр
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ПредоплатаУпр
	|		КОНЕЦ                                                      КАК ПредоплатаУпрОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.Долг
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.Долг
	|		КОНЕЦ                                                      КАК ДолгОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ДолгРегл
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ДолгРегл
	|		КОНЕЦ                                                      КАК ДолгРеглОстаток,
	|		ВЫБОР КОГДА РасчетыПоСрокамОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА РасчетыПоСрокамОбороты.ДолгУпр
	|			ИНАЧЕ -РасчетыПоСрокамОбороты.ДолгУпр
	|		КОНЕЦ                                                      КАК ДолгУпрОстаток,
	|		&ЭтоРасчетыСКлиентами                                      КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|				ПО РасчетыПоСрокамОбороты.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|				И (РасчетыПоСрокамОбороты.Валюта <> АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета
	|						ИЛИ РасчетыПоСрокамОбороты.Валюта <> АналитикиУчетаПоПартнерам.ВалютаУправленческогоУчета)
	|	ГДЕ
	|		РасчетыПоСрокамОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ТИПЗНАЧЕНИЯ(РасчетыПоСрокамОбороты.ДокументРегистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|) КАК ОстаткиИОбороты
	|		
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам ,
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.ВалютаРегл,
	|	ОстаткиИОбороты.РасчетныйДокумент,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения,
	|	ОстаткиИОбороты.ВариантКурсаДоговора,
	|	ОстаткиИОбороты.ЭтоРасчетыСКлиентами
	|	
	|ИМЕЮЩИЕ
	|	СУММА(ОстаткиИОбороты.ПредоплатаОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ПредоплатаРеглОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ПредоплатаУпрОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ДолгОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ДолгРеглОстаток) <> 0
	|	ИЛИ СУММА(ОстаткиИОбороты.ДолгУпрОстаток) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.БазоваяВалюта КАК БазоваяВалюта,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислитель,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыВалют
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ГраницаКонецДня) КАК КурсВалюты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютПоДоговорам.Договор КАК Договор,
	|	КурсыВалютПоДоговорам.КурсЧислитель КАК КурсЧислитель,
	|	КурсыВалютПоДоговорам.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыВалютПоДоговорам
	|ИЗ
	|	РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&ГраницаКонецДня) КАК КурсыВалютПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаКонецДня.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаКонецДня.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	ОстаткиНаКонецДня.Валюта                                         КАК Валюта,
	|	ОстаткиНаКонецДня.ВалютаРегл                                     КАК ВалютаРегл,
	|	ОстаткиНаКонецДня.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	ОстаткиНаКонецДня.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	ОстаткиНаКонецДня.ДатаВозникновения                              КАК ДатаВозникновения,
	|	АналитикиУчетаПоПартнерам.ВариантКурсаДоговора                   КАК ВариантКурсаДоговора,
	|	АналитикиУчетаПоПартнерам.ПереоцениватьТоварыУслугиКОтчетуКомитенту КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	АналитикиУчетаПоПартнерам.ПрименятьПоложения67ФЗ                 КАК ПрименятьПоложения67ФЗ,
	|	АналитикиУчетаПоПартнерам.ТипДоговора                            КАК ТипДоговора,
	|	ОстаткиНаКонецДня.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	ОстаткиНаКонецДня.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	ОстаткиНаКонецДня.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	ОстаткиНаКонецДня.ДолгОстаток                                    КАК ДолгОстаток,
	|	ОстаткиНаКонецДня.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ОстаткиНаКонецДня.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЧислитель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДокументам.КурсЧислительВалютыВзаиморасчетов,1)
	|		ИНАЧЕ 
	|			ЕСТЬNULL(КурсыВалют.КурсЧислитель,1)
	|	КОНЕЦ                                                                           КАК КурсЧислительРегл,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЗнаменатель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДокументам.КурсЗнаменательВалютыВзаиморасчетов,1)
	|		ИНАЧЕ
	|			ЕСТЬNULL(КурсыВалют.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                           КАК КурсЗнаменательРегл,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|					И ОстаткиНаКонецДня.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЧислитель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА 
	|				ЕСТЬNULL(КурсыВалютПоДокументам.КурсЧислительВалютыУправленческогоУчета,1)
	|		ИНАЧЕ
	|			ЕСТЬNULL(КурсВалютыУпр.КурсЧислитель,1)
	|	КОНЕЦ                                                                           КАК КурсЧислительУпр,
	|	ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|					И ОстаткиНаКонецДня.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЗнаменатель,1)
	|		КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|				И ОстаткиНаКонецДня.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|			ТОГДА 
	|				ЕСТЬNULL(КурсыВалютПоДокументам.КурсЗнаменательВалютыУправленческогоУчета,1)
	|		ИНАЧЕ 
	|			ЕСТЬNULL(КурсВалютыУпр.КурсЗнаменатель,1)
	|	КОНЕЦ                                                                           КАК КурсЗнаменательУпр,
	|	ОстаткиНаКонецДня.ЭтоРасчетыСКлиентами                                          КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ ВтОстаткиСКурсами
	|ИЗ
	|	втОстаткиНаКонецДня КАК ОстаткиНаКонецДня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|			ПО ОстаткиНаКонецДня.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсВалютыУпр
	|			ПО ОстаткиНаКонецДня.ВалютаРегл = КурсВалютыУпр.БазоваяВалюта
	|			И КурсВалютыУпр.Валюта = &ВалютаУправленческогоУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсыВалют
	|			ПО ОстаткиНаКонецДня.Валюта = КурсыВалют.Валюта
	|			И ОстаткиНаКонецДня.ВалютаРегл = КурсыВалют.БазоваяВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютПоДоговорам КАК КурсыВалютПоДоговорам
	|			ПО КурсыВалютПоДоговорам.Договор = АналитикиУчетаПоПартнерам.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыВалютПоДокументам
	|			ПО ОстаткиНаКонецДня.ОбъектРасчетов.Объект = КурсыВалютПоДокументам.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстаткиСКурсами.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	ВтОстаткиСКурсами.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	ВтОстаткиСКурсами.Валюта                                         КАК Валюта,
	|	ВтОстаткиСКурсами.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	ВтОстаткиСКурсами.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	ВтОстаткиСКурсами.ДатаВозникновения                              КАК ДатаВозникновения,
	|	ВтОстаткиСКурсами.ВариантКурсаДоговора                           КАК ВариантКурсаДоговора,
	|	ВтОстаткиСКурсами.ПереоцениватьТоварыУслугиКОтчетуКомитенту      КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	ВтОстаткиСКурсами.ПрименятьПоложения67ФЗ                         КАК ПрименятьПоложения67ФЗ,
	|	ВтОстаткиСКурсами.ТипДоговора                                    КАК ТипДоговора,
	|	ВтОстаткиСКурсами.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	ВтОстаткиСКурсами.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	ВтОстаткиСКурсами.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	ЕСТЬNULL(ОборотыЗаДень.ДолгРасход, 0)                            КАК ДолгРасход,
	|	ЕСТЬNULL(ОборотыЗаДень.ДолгРеглРасход, 0)                        КАК ДолгРеглРасход,
	|	ВтОстаткиСКурсами.ДолгОстаток                                    КАК ДолгОстаток,
	|	ВтОстаткиСКурсами.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ВтОстаткиСКурсами.КурсЧислительРегл 
	|		/ ВтОстаткиСКурсами.КурсЗнаменательРегл                      КАК КурсРегл,
	|	ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|		* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) КАК ДолгРеглОстатокРасчетный,
	|	ВтОстаткиСКурсами.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|		* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл
	|			/ ВтОстаткиСКурсами.КурсЧислительУпр * ВтОстаткиСКурсами.КурсЗнаменательУпр КАК ЧИСЛО(31,2)) КАК ДолгУпрОстатокРасчетный,
	|	ВтОстаткиСКурсами.ЭтоРасчетыСКлиентами                           КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ ВтКРасчету
	|ИЗ
	|	ВтОстаткиСКурсами КАК ВтОстаткиСКурсами
	|	ЛЕВОЕ СОЕДИНЕНИЕ втОборотыЗаДень КАК ОборотыЗаДень
	|		ПО ВтОстаткиСКурсами.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|			И ВтОстаткиСКурсами.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|			И ВтОстаткиСКурсами.Валюта = ОборотыЗаДень.Валюта
	|			И ВтОстаткиСКурсами.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|			И ВтОстаткиСКурсами.ДатаПлановогоПогашения = ОборотыЗаДень.ДатаПлановогоПогашения
	|			И ВтОстаткиСКурсами.ДатаВозникновения = ОборотыЗаДень.ДатаВозникновения
	|ГДЕ
	|	(НЕ ОборотыЗаДень.ОбъектРасчетов ЕСТЬ NULL
	|		ИЛИ &ДатаРасчета = КОНЕЦПЕРИОДА(&ДатаРасчета, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ВтОстаткиСКурсами.ДолгРеглОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) >= 0.01 
	|		ИЛИ ВтОстаткиСКурсами.ДолгРеглОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл КАК ЧИСЛО(31,2)) <= -0.01 
	|		ИЛИ ВтОстаткиСКурсами.ДолгУпрОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл
	|				/ ВтОстаткиСКурсами.КурсЧислительУпр * ВтОстаткиСКурсами.КурсЗнаменательУпр КАК ЧИСЛО(31,2)) >= 0.01
	|		ИЛИ ВтОстаткиСКурсами.ДолгУпрОстаток
	|			- ВЫРАЗИТЬ(ВтОстаткиСКурсами.ДолгОстаток 
	|			* ВтОстаткиСКурсами.КурсЧислительРегл / ВтОстаткиСКурсами.КурсЗнаменательРегл
	|				/ ВтОстаткиСКурсами.КурсЧислительУпр * ВтОстаткиСКурсами.КурсЗнаменательУпр КАК ЧИСЛО(31,2)) <= -0.01
	|		ИЛИ ВтОстаткиСКурсами.ПредоплатаОстаток = 0
	|			И (ВтОстаткиСКурсами.ПредоплатаРеглОстаток <> 0
	|				ИЛИ ВтОстаткиСКурсами.ПредоплатаУпрОстаток <> 0)
	|		ИЛИ ВтОстаткиСКурсами.ДолгОстаток = 0
	|			И (ВтОстаткиСКурсами.ДолгРеглОстаток <> 0
	|				ИЛИ ВтОстаткиСКурсами.ДолгУпрОстаток <> 0))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения
	|;
	//++ НЕ УТ

	//++ Локализация
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиСКурсом.АналитикаУчетаПоПартнерам                        КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиСКурсом.АналитикаУчетаПоПартнерам.Организация            КАК Организация,
	|	ОстаткиСКурсом.АналитикаУчетаПоПартнерам.Контрагент             КАК Контрагент,
	|	ОстаткиСКурсом.АналитикаУчетаПоПартнерам.Договор                КАК Договор,
	|	ОстаткиСКурсом.ОбъектРасчетов                                   КАК ОбъектРасчетов,
	|	ОстаткиСКурсом.ОбъектРасчетов.ГруппаФинансовогоУчета            КАК ГруппаФинансовогоУчета,
	|	ОстаткиСКурсом.Валюта                                           КАК Валюта,
	|	ОстаткиСКурсом.РасчетныйДокумент                                КАК РасчетныйДокумент,
	|	ОстаткиСКурсом.ВариантКурсаДоговора                             КАК ВариантКурсаДоговора,
	|	ОстаткиСКурсом.ПереоцениватьТоварыУслугиКОтчетуКомитенту        КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	ОстаткиСКурсом.ПрименятьПоложения67ФЗ                           КАК ПрименятьПоложения67ФЗ,
	|	ОстаткиСКурсом.ТипДоговора                                      КАК ТипДоговора,
	|	СУММА(ОстаткиСКурсом.ДолгОстаток)                               КАК ДолгОстаток,
	|	СУММА(ОстаткиСКурсом.ДолгРеглОстаток)                           КАК ДолгРеглОстаток,
	|	СУММА(ОстаткиСКурсом.СуммаНУОстаток)                            КАК СуммаНУОстаток,
	|	СУММА(ОстаткиСКурсом.ОтложенныйДоходОстаток)                    КАК ОтложенныйДоходОстаток,
	|	СУММА(ОстаткиСКурсом.ОтложенныйРасходОстаток)                   КАК ОтложенныйРасходОстаток,
	|	СУММА(ОстаткиСКурсом.ПредоплатаОстаток)                         КАК ПредоплатаОстаток,
	|	СУММА(ОстаткиСКурсом.ПредоплатаРеглОстаток)                     КАК ПредоплатаРеглОстаток,
	|	ОстаткиСКурсом.КурсЧислительРегл                                КАК КурсЧислительРегл,
	|	ОстаткиСКурсом.КурсЗнаменательРегл                              КАК КурсЗнаменательРегл,
	|	ВЫБОР КОГДА ОстаткиСКурсом.ЭтоРасчетыСКлиентами
	|		ТОГДА ВЫБОР КОГДА СУММА(ОстаткиСКурсом.ПредоплатаРеглОстаток) <> 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР КОГДА СУММА(ОстаткиСКурсом.ПредоплатаРеглОстаток) <> 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|			КОНЕЦ
	|	КОНЕЦ                                                           КАК ВидСчета,
	|	ОстаткиСКурсом.ЭтоРасчетыСКлиентами                             КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ ВтОстаткиНУСКурсом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтОстаткиСКурсами.АналитикаУчетаПоПартнерам                 КАК АналитикаУчетаПоПартнерам,
	|		ВтОстаткиСКурсами.ОбъектРасчетов                            КАК ОбъектРасчетов,
	|		ВтОстаткиСКурсами.Валюта                                    КАК Валюта,
	|		ВтОстаткиСКурсами.РасчетныйДокумент                         КАК РасчетныйДокумент,
	|		ВтОстаткиСКурсами.ВариантКурсаДоговора                      КАК ВариантКурсаДоговора,
	|		ВтОстаткиСКурсами.ПереоцениватьТоварыУслугиКОтчетуКомитенту КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|		ВтОстаткиСКурсами.ПрименятьПоложения67ФЗ                    КАК ПрименятьПоложения67ФЗ,
	|		ВтОстаткиСКурсами.ТипДоговора                               КАК ТипДоговора,
	|		ВтОстаткиСКурсами.ДолгОстаток                               КАК ДолгОстаток,
	|		ВтОстаткиСКурсами.ДолгРеглОстаток                           КАК ДолгРеглОстаток,
	|		0                                                           КАК СуммаНУОстаток,
	|		0                                                           КАК ОтложенныйДоходОстаток,
	|		0                                                           КАК ОтложенныйРасходОстаток,
	|		ВтОстаткиСКурсами.ПредоплатаОстаток                         КАК ПредоплатаОстаток,
	|		ВтОстаткиСКурсами.ПредоплатаРеглОстаток                     КАК ПредоплатаРеглОстаток,
	|		ВтОстаткиСКурсами.КурсЧислительРегл                         КАК КурсЧислительРегл,
	|		ВтОстаткиСКурсами.КурсЗнаменательРегл                       КАК КурсЗнаменательРегл,
	|		ВтОстаткиСКурсами.ЭтоРасчетыСКлиентами                      КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		ВтОстаткиСКурсами КАК ВтОстаткиСКурсами
	|	ГДЕ
	|		&ДатаРасчета >= ДАТАВРЕМЯ(2022,1,1)
	|		И ВтОстаткиСКурсами.Валюта <> ВтОстаткиСКурсами.ВалютаРегл
	|		И &ИспользоватьРеглУчет
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РасчетыНУОстатки.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
	|		РасчетыНУОстатки.ОбъектРасчетов                             КАК ОбъектРасчетов,
	|		РасчетыНУОстатки.Валюта                                     КАК Валюта,
	|		РасчетыНУОстатки.РасчетныйДокумент                          КАК РасчетныйДокумент,
	|		АналитикиУчетаПоПартнерам.ВариантКурсаДоговора              КАК ВариантКурсаДоговора,
	|		АналитикиУчетаПоПартнерам.ПереоцениватьТоварыУслугиКОтчетуКомитенту КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|		АналитикиУчетаПоПартнерам.ПрименятьПоложения67ФЗ            КАК ПрименятьПоложения67ФЗ,
	|		АналитикиУчетаПоПартнерам.ТипДоговора                       КАК ТипДоговора,
	|		0                                                           КАК ДолгОстаток,
	|		0                                                           КАК ДолгРеглОстаток,
	|		РасчетыНУОстатки.СуммаНУОстаток                             КАК СуммаНУОстаток,
	|		РасчетыНУОстатки.ОтложенныйДоходОстаток                     КАК ОтложенныйДоходОстаток,
	|		РасчетыНУОстатки.ОтложенныйРасходОстаток                    КАК ОтложенныйРасходОстаток,
	|		0                                                           КАК ПредоплатаОстаток,
	|		0                                                           КАК ПредоплатаРеглОстаток,
	|		ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|				ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЧислитель,1)
	|			КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|					И РасчетыНУОстатки.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|				ТОГДА 
	|					ЕСТЬNULL(КурсыВалютПоДокументам.КурсЧислительВалютыВзаиморасчетов,1)
	|			ИНАЧЕ ЕСТЬNULL(КурсыВалют.КурсЧислитель,1)
	|		КОНЕЦ                                                           КАК КурсЧислительРегл,
	|		ВЫБОР КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|				ТОГДА ЕСТЬNULL(КурсыВалютПоДоговорам.КурсЗнаменатель,1)
	|			КОГДА АналитикиУчетаПоПартнерам.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|					И РасчетыНУОстатки.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|				ТОГДА 
	|					ЕСТЬNULL(КурсыВалютПоДокументам.КурсЗнаменательВалютыВзаиморасчетов,1)
	|			ИНАЧЕ ЕСТЬNULL(КурсыВалют.КурсЗнаменатель,1)
	|		КОНЕЦ                                                       КАК КурсЗнаменательРегл,
	|		&ЭтоРасчетыСКлиентами                                       КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиНУ.Остатки(
	|				&ГраницаКонецДня,
	|				НЕ (АналитикаУчетаПоПартнерам, Валюта) В (
	|					ВЫБРАТЬ 
	|						АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам,
	|						АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета
	|					ИЗ
	|						ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|					)
	|			) КАК РасчетыНУОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|				ПО РасчетыНУОстатки.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|			ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалют КАК КурсыВалют
	|				ПО РасчетыНУОстатки.Валюта = КурсыВалют.Валюта
	|				И КурсыВалют.БазоваяВалюта = АналитикиУчетаПоПартнерам.ВалютаРегламентированногоУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ втКурсыВалютПоДоговорам КАК КурсыВалютПоДоговорам
	|				ПО КурсыВалютПоДоговорам.Договор = АналитикиУчетаПоПартнерам.Договор
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыВалютПоДокументам
	|				ПО РасчетыНУОстатки.ОбъектРасчетов.Объект = КурсыВалютПоДокументам.Документ
	|	ГДЕ
	|		&ДатаРасчета >= ДАТАВРЕМЯ(2022,1,1)
	|		И &ИспользоватьРеглУчет
	|	) КАК ОстаткиСКурсом
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиСКурсом.АналитикаУчетаПоПартнерам,
	|	ОстаткиСКурсом.ОбъектРасчетов,
	|	ОстаткиСКурсом.Валюта,
	|	ОстаткиСКурсом.РасчетныйДокумент,
	|	ОстаткиСКурсом.ВариантКурсаДоговора,
	|	ОстаткиСКурсом.ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	ОстаткиСКурсом.ПрименятьПоложения67ФЗ,
	|	ОстаткиСКурсом.ТипДоговора,
	|	ОстаткиСКурсом.КурсЧислительРегл,
	|	ОстаткиСКурсом.КурсЗнаменательРегл,
	|	ОстаткиСКурсом.ЭтоРасчетыСКлиентами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Обороты.ДокументОплаты КАК ДокументОплаты,
	|	СУММА(Обороты.ДолгРасход) КАК ДолгРасход,
	|	СУММА(Обороты.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	Обороты.ДокументОплаты.МоментВремени КАК МоментВремени
	|ИЗ
	|	втОборотыПоДокументамОплаты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.ВалютаРегламентированногоУчета,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ДокументОплаты,
	|	Обороты.ЭтоРасчетыСКлиентами
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Обороты.ДокументОплаты.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНУСКурсом.АналитикаУчетаПоПартнерам                КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНУСКурсом.Организация                              КАК Организация,
	|	ОстаткиНУСКурсом.Контрагент                               КАК Контрагент,
	|	ОстаткиНУСКурсом.Договор                                  КАК Договор,
	|	ОстаткиНУСКурсом.ОбъектРасчетов                           КАК ОбъектРасчетов,
	|	ОстаткиНУСКурсом.ГруппаФинансовогоУчета                   КАК ГруппаФинансовогоУчета,
	|	ОстаткиНУСКурсом.Валюта                                   КАК Валюта,
	|	ОстаткиНУСКурсом.РасчетныйДокумент                        КАК РасчетныйДокумент,
	|	ОстаткиНУСКурсом.ВариантКурсаДоговора                     КАК ВариантКурсаДоговора,
	|	ОстаткиНУСКурсом.ПереоцениватьТоварыУслугиКОтчетуКомитенту КАК ПереоцениватьТоварыУслугиКОтчетуКомитенту,
	|	ОстаткиНУСКурсом.ПрименятьПоложения67ФЗ                   КАК ПрименятьПоложения67ФЗ,
	|	ОстаткиНУСКурсом.ТипДоговора                              КАК ТипДоговора,
	|	ЕСТЬNULL(ОборотыЗаДень.ДолгРасход, 0)                     КАК ДолгРасход,
	|	ЕСТЬNULL(ОборотыЗаДень.ДолгРеглРасход, 0)                 КАК ДолгРеглРасход,
	|	ОстаткиНУСКурсом.ДолгОстаток                              КАК ДолгОстаток,
	|	ОстаткиНУСКурсом.ДолгРеглОстаток                          КАК ДолгРеглОстаток,
	|	ОстаткиНУСКурсом.СуммаНУОстаток                           КАК СуммаНУОстаток,
	|	ОстаткиНУСКурсом.ОтложенныйДоходОстаток                   КАК ОтложенныйДоходОстаток,
	|	ОстаткиНУСКурсом.ОтложенныйРасходОстаток                  КАК ОтложенныйРасходОстаток,
	|	ОстаткиНУСКурсом.ПредоплатаОстаток                        КАК ПредоплатаОстаток,
	|	ОстаткиНУСКурсом.ПредоплатаРеглОстаток                    КАК ПредоплатаРеглОстаток,
	|	ОстаткиНУСКурсом.КурсЧислительРегл                        КАК КурсЧислительРегл,
	|	ОстаткиНУСКурсом.КурсЗнаменательРегл                      КАК КурсЗнаменательРегл,
	|	ОстаткиНУСКурсом.ВидСчета                                 КАК ВидСчета,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета,
	|		ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))) КАК СчетУчета,
	|	ОстаткиНУСКурсом.ЭтоРасчетыСКлиентами                     КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	ВтОстаткиНУСКурсом КАК ОстаткиНУСКурсом
	|	ЛЕВОЕ СОЕДИНЕНИЕ втОборотыЗаДеньБезДат КАК ОборотыЗаДень
	|		ПО ОстаткиНУСКурсом.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНУСКурсом.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|			И ОстаткиНУСКурсом.Валюта = ОборотыЗаДень.Валюта
	|			И ОстаткиНУСКурсом.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета.СрезПоследних(&ГраницаКонецДня, НЕ Долгосрочный) КАК НастройкиПоОрганизации
	|		ПО НастройкиПоОрганизации.ВидСчета = ОстаткиНУСКурсом.ВидСчета
	|			И НастройкиПоОрганизации.Организация = ОстаткиНУСКурсом.Организация
	|			И НастройкиПоОрганизации.АналитикаУчета = ОстаткиНУСКурсом.ГруппаФинансовогоУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета.СрезПоследних(&ГраницаКонецДня, НЕ Долгосрочный
	|		И Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК НастройкиПоАналитике
	|		ПО НастройкиПоАналитике.ВидСчета = ОстаткиНУСКурсом.ВидСчета
	|			И НастройкиПоАналитике.АналитикаУчета = ОстаткиНУСКурсом.ГруппаФинансовогоУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(&НачалоПериода,) КАК НастройкиУчетаНалогаНаПрибыль
	|		ПО ОстаткиНУСКурсом.Организация = НастройкиУчетаНалогаНаПрибыль.Организация
	|;
	//-- Локализация

	//-- НЕ УТ
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиНаКонецДня.ОбъектРасчетов              КАК ОбъектРасчетов,
	|	ОстаткиНаКонецДня.АналитикаУчетаПоПартнерам   КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаКонецДня.Валюта                      КАК Валюта,
	|	ОстаткиНаКонецДня.ЭтоРасчетыСКлиентами        КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ втАналитикаОстатков
	|ИЗ 
	|	втОстаткиНаКонецДня КАК ОстаткиНаКонецДня
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка                      КАК Ссылка,
	|	РегистраторРасчетов.ОбъектРасчетов              КАК ОбъектРасчетов,
	|	РегистраторРасчетов.АналитикаУчетаПоПартнерам   КАК АналитикаУчетаПоПартнерам,
	|	РегистраторРасчетов.Валюта                      КАК Валюта,
	|	АналитикаОстатков.ЭтоРасчетыСКлиентами          КАК ЭтоРасчетыСКлиентами,
	|	КОЛИЧЕСТВО(ЕСТЬNULL(Таблица.НомерСтроки,0))     КАК ВсегоЗаписей
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАналитикаОстатков КАК АналитикаОстатков
	|			ПО АналитикаОстатков.ОбъектРасчетов = РегистраторРасчетов.ОбъектРасчетов
	|				И АналитикаОстатков.АналитикаУчетаПоПартнерам = РегистраторРасчетов.АналитикаУчетаПоПартнерам
	|				И АналитикаОстатков.Валюта = РегистраторРасчетов.Валюта
	|				И РегистраторРасчетов.ТипРасчетов = &ТипРасчетов
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ИмяТаблицы КАК Таблица
	|			ПО Таблица.Регистратор = РегистраторРасчетов.Ссылка
	|		
	|СГРУППИРОВАТЬ ПО
	|	РегистраторРасчетов.Ссылка,
	|	РегистраторРасчетов.ОбъектРасчетов,
	|	РегистраторРасчетов.АналитикаУчетаПоПартнерам,
	|	РегистраторРасчетов.Валюта,
	|	АналитикаОстатков.ЭтоРасчетыСКлиентами
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЕСТЬNULL(Таблица.НомерСтроки,0)) < &РазмерПорции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокамОбороты.Регистратор                       КАК Регистратор,
	|	&ЭтоРасчетыСКлиентами                                    КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|			ПО РасчетыПоСрокамОбороты.АналитикаУчетаПоПартнерам = АналитикиУчетаПоПартнерам.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	РасчетыПоСрокамОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоСрокамОбороты.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	Т.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	Т.Валюта                                         КАК Валюта,
	|	Т.ЭтоРасчетыСКлиентами                           КАК ЭтоРасчетыСКлиентами,
	|	Т.Организация                                    КАК Организация
	|ИЗ (
	|	ВЫБРАТЬ
	|		ВтКРасчету.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|		ВтКРасчету.ОбъектРасчетов                    КАК ОбъектРасчетов,
	|		ВтКРасчету.Валюта                            КАК Валюта,
	|		ВтКРасчету.ЭтоРасчетыСКлиентами              КАК ЭтоРасчетыСКлиентами,
	|		Аналитика.Организация                        КАК Организация
	|	ИЗ ВтКРасчету КАК ВтКРасчету
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ВтКРасчету.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	//++ НЕ УТ

	//++ Локализация
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВтКРасчетуНУ.АналитикаУчетаПоПартнерам       КАК АналитикаУчетаПоПартнерам,
	|		ВтКРасчетуНУ.ОбъектРасчетов                  КАК ОбъектРасчетов,
	|		ВтКРасчетуНУ.Валюта                          КАК Валюта,
	|		ВтКРасчетуНУ.ЭтоРасчетыСКлиентами            КАК ЭтоРасчетыСКлиентами,
	|		Аналитика.Организация                        КАК Организация
	|	ИЗ ВтОстаткиНУСКурсом КАК ВтКРасчетуНУ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВтКРасчетуНУ.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	//-- Локализация

	//-- НЕ УТ
	|) КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКРасчету.ЭтоРасчетыСКлиентами                  КАК ЭтоРасчетыСКлиентами,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов                        КАК ОбъектРасчетов,
	|	ВтКРасчету.Валюта                                КАК Валюта,
	|	ВтКРасчету.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	ВтКРасчету.ДатаПлановогоПогашения                КАК ДатаПлановогоПогашения,
	|	ВтКРасчету.ДатаВозникновения                     КАК ДатаВозникновения,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ВтКРасчету.ВариантКурсаДоговора                  КАК ВариантКурсаДоговора,
	|	ВтКРасчету.ДолгРеглОстаток                       КАК ДолгРеглОстаток,
	|	ВтКРасчету.ДолгРеглОстатокРасчетный              КАК ДолгРеглОстатокРасчетный,
	|	ВтКРасчету.ДолгУпрОстаток                        КАК ДолгУпрОстаток,
	|	ВтКРасчету.ДолгУпрОстатокРасчетный               КАК ДолгУпрОстатокРасчетный,
	|	ВтКРасчету.ПредоплатаОстаток                     КАК ПредоплатаОстаток,
	|	ВтКРасчету.ПредоплатаРеглОстаток                 КАК ПредоплатаРеглОстаток,
	|	ВтКРасчету.ПредоплатаУпрОстаток                  КАК ПредоплатаУпрОстаток,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыПоСрокам.ПорядокЗачета, """")) КАК ПорядокЗачета,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыПоСрокам.ВалютаДокумента, """")) КАК ВалютаДокумента
	|ИЗ ВтКРасчету КАК ВтКРасчету
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|		ПО ВтКРасчету.ЭтоРасчетыСКлиентами
	|			И ВтКРасчету.АналитикаУчетаПоПартнерам = РасчетыПоСрокам.АналитикаУчетаПоПартнерам
	|			И ВтКРасчету.ОбъектРасчетов = РасчетыПоСрокам.ОбъектРасчетов
	|			И ВтКРасчету.Валюта = РасчетыПоСрокам.Валюта
	|			И ВтКРасчету.РасчетныйДокумент = РасчетыПоСрокам.РасчетныйДокумент
	|			И ВтКРасчету.ДатаПлановогоПогашения = РасчетыПоСрокам.ДатаПлановогоПогашения
	|			И РасчетыПоСрокам.Активность
	|СГРУППИРОВАТЬ ПО
	|	ВтКРасчету.ЭтоРасчетыСКлиентами,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов,
	|	ВтКРасчету.Валюта,
	|	ВтКРасчету.РасчетныйДокумент,
	|	ВтКРасчету.ДатаПлановогоПогашения,
	|	ВтКРасчету.ДатаВозникновения,
	|	ВтКРасчету.ВариантКурсаДоговора,
	|	ВтКРасчету.ПредоплатаОстаток,
	|	ВтКРасчету.ПредоплатаРеглОстаток,
	|	ВтКРасчету.ПредоплатаУпрОстаток,
	|	ВтКРасчету.ДолгРеглОстаток,
	|	ВтКРасчету.ДолгРеглОстатокРасчетный,
	|	ВтКРасчету.ДолгУпрОстаток,
	|	ВтКРасчету.ДолгУпрОстатокРасчетный";
	#КонецОбласти

	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	Если ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы", Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя());
		Запрос.УстановитьПараметр("ЗачетАванса", Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента);
		Запрос.УстановитьПараметр("ТипРасчетов", Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы", Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
		Запрос.УстановитьПараметр("ЗачетАванса", Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику);
		Запрос.УстановитьПараметр("ТипРасчетов", Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
				Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
				Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
		//++ НЕ УТ
	
		//++ Локализация
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиНУ.ПолноеИмя(),
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиНУ.ПолноеИмя());
		//-- Локализация
		
		//-- НЕ УТ
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", Параметры.ВалютаУправленческогоУчета);
	//++ НЕ УТ
	
	//++ Локализация
	Запрос.УстановитьПараметр("ИспользоватьРеглУчет", Параметры.ИспользоватьРеглУчет);
	//-- Локализация
	
	//-- НЕ УТ
	
	ГраницаКонецДня = Новый Граница(КонецДня(Период),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Запрос.УстановитьПараметр("ГраницаКонецДня", ГраницаКонецДня);
	Запрос.УстановитьПараметр("ДатаРасчета", Период);
	Запрос.УстановитьПараметр("РазмерПорции", ОперативныеВзаиморасчетыСервер.РазмерПорцииЗаписи());
	Если ПереоценкаПоДням = Неопределено Тогда
		ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	КонецЕсли;
	Запрос.УстановитьПараметр("ПереоценкаПоДням", ПереоценкаПоДням);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = РезультатыЗапроса.ВГраница();
	ПоляПоиска = "ЭтоРасчетыСКлиентами, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта"; 
	//++ НЕ УТ

	//++ Локализация
	ТипЧисло31_2 = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(31, 2));
	ДокументыОплаты = РезультатыЗапроса[ПоследнийИндекс-6].Выгрузить(); // ТаблицаЗначений
	ДокументыОплаты.Колонки.Добавить("КурсоваяРазницаОплаты", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("ПризнаниеДохода", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("ПризнаниеРасхода", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("ДолгОстаток", ТипЧисло31_2);
	ДокументыОплаты.Колонки.Добавить("СуммаНУОстаток", ТипЧисло31_2);
	ДокументыОплаты.Индексы.Добавить(ПоляПоиска + ", РасчетныйДокумент");
	СтруктураПоискаОплаты = Новый Структура(ПоляПоиска + ", РасчетныйДокумент");
	ДетальныеЗаписиНУ = РезультатыЗапроса[ПоследнийИндекс-5].Выгрузить();
	ДетальныеЗаписиНУ.Индексы.Добавить(ПоляПоиска);
	НачалоПрименения67ФЗПоРасходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоРасходам();
	//-- Локализация

	//-- НЕ УТ
	ОбъектыКПереоценке = РезультатыЗапроса[ПоследнийИндекс-1].Выгрузить();
	Параметры.ВсегоОбработано = Параметры.ВсегоОбработано + ОбъектыКПереоценке.Количество();
	ДетальныеЗаписи    = РезультатыЗапроса[ПоследнийИндекс].Выгрузить();
	ДетальныеЗаписи.Индексы.Добавить(ПоляПоиска);
	КурсовыеРазницыКУдалению = РезультатыЗапроса[ПоследнийИндекс-2].Выгрузить();
	РегистраторыРасчетов = РезультатыЗапроса[ПоследнийИндекс-3].Выгрузить();
	РегистраторыРасчетов.Индексы.Добавить(ПоляПоиска);
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	
	Порядок = ОперативныеВзаиморасчетыСервер.Порядок(Период,"",Тип("ДокументСсылка.РасчетКурсовыхРазниц"),"9","99");
	РазмерПорцииЗаписи = ОперативныеВзаиморасчетыСервер.РазмерПорцииЗаписи();
	
	ТаблицаИзменений = Новый ТаблицаЗначений;
	ТаблицаИзменений.Колонки.Добавить("Регистратор", Документы.ТипВсеСсылки());
	//++ НЕ УТ
	ТаблицаИзменений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаИзменений.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	//++ Локализация
	РегистрыНУ = Новый Структура("ЗаписыватьОднимНабором", Ложь);
	Если Параметры.ДокументыПереоценки.Количество() = 1 И ЭтоРасчетыСКлиентами <> Неопределено Тогда
		РегистрыНУ.ЗаписыватьОднимНабором = Истина;
		Если ЭтоРасчетыСКлиентами Тогда
			РегистрыНУ.Вставить("НаборЗаписейНУ", РегистрыНакопления.РасчетыСКлиентамиНУ.СоздатьНаборЗаписей());
		Иначе
			РегистрыНУ.Вставить("НаборЗаписейНУ", РегистрыНакопления.РасчетыСПоставщикамиНУ.СоздатьНаборЗаписей());
		КонецЕсли;
		ДокументРегистратор = Параметры.ДокументыПереоценки[0].Ссылка; //ДокументСсылка
		РегистрыНУ.НаборЗаписейНУ.Отбор.Регистратор.Установить(ДокументРегистратор);
		
		РегистрыНУ.Вставить("РасчетПереоценкиНУ", РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей());
		РегистрыНУ.РасчетПереоценкиНУ.Отбор.Регистратор.Установить(ДокументРегистратор);
	КонецЕсли;
	//-- Локализация

	//-- НЕ УТ
	ДоговорСКомитентом = Перечисления.ТипыДоговоров.СКомитентом;
	Если ЭтоРасчетыСКлиентами Тогда
		ПереоценкаПоложительная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль;
		ПереоценкаОтрицательная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток;
		ПереоценкаПоложительнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыКлиентыПрибыль;
		ПереоценкаОтрицательнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыКлиентыУбыток;
		НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
	Иначе
		ПереоценкаПоложительная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток;
		ПереоценкаОтрицательная 	= Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль;
		ПереоценкаПоложительнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоставщикиУбыток;
		ПереоценкаОтрицательнаяСпр 	= Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоставщикиПрибыль;
		НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
	КонецЕсли;
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПроверятьИзмененияРегистра", Истина);
	Для Каждого СтрокаПереоценки Из ОбъектыКПереоценке Цикл
		//++ НЕ УТ

		//++ Локализация
		Если СтрокаПереоценки.ЭтоРасчетыСКлиентами Тогда
			Если НЕ РегистрыНУ.ЗаписыватьОднимНабором Тогда
				РегистрыНУ.Вставить("НаборЗаписейНУ", РегистрыНакопления.РасчетыСКлиентамиНУ.СоздатьНаборЗаписей());
			КонецЕсли;
		Иначе
			Если НЕ РегистрыНУ.ЗаписыватьОднимНабором Тогда
				РегистрыНУ.Вставить("НаборЗаписейНУ", РегистрыНакопления.РасчетыСПоставщикамиНУ.СоздатьНаборЗаписей());
			КонецЕсли;
		КонецЕсли;
		//-- Локализация

		//-- НЕ УТ
		
		Если Параметры.ДокументыПереоценки.Количество() = 1 Тогда
			ДокументРегистратор = Параметры.ДокументыПереоценки[0].Ссылка; //ДокументСсылка
		Иначе
			СтруктураПоискаДокумента = Новый Структура("Дата, Организация", НачалоМесяца(Период), СтрокаПереоценки.Организация);
			НайденныеДокументы = Параметры.ДокументыПереоценки.НайтиСтроки(СтруктураПоискаДокумента);// Массив из СтрокаТаблицыЗначений
			ДокументРегистратор = НайденныеДокументы[0].Ссылка; //ДокументСсылка
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПереоценки);
		СтрокиДетальныхЗаписей = ДетальныеЗаписи.НайтиСтроки(СтруктураПоиска);
		//++ НЕ УТ

		//++ Локализация
		СтрокиДетальныхЗаписейНУ = ДетальныеЗаписиНУ.НайтиСтроки(СтруктураПоиска);
		Если НЕ РегистрыНУ.ЗаписыватьОднимНабором Тогда
			РегистрыНУ.НаборЗаписейНУ.Отбор.Регистратор.Установить(ДокументРегистратор);
			РегистрыНУ.Вставить("РасчетПереоценкиНУ", РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей());
			РегистрыНУ.РасчетПереоценкиНУ.Отбор.Регистратор.Установить(ДокументРегистратор);
		КонецЕсли;
		//-- Локализация

		//-- НЕ УТ
		
		НовСтр = ТаблицаИзменений.Добавить();
		НовСтр.Регистратор = ДокументРегистратор;
		//++ НЕ УТ
		НовСтр.Период = НачалоДня(Период);
		НовСтр.АналитикаУчетаПоПартнерам = СтрокаПереоценки.АналитикаУчетаПоПартнерам;
		//-- НЕ УТ
		Если СтрокиДетальныхЗаписей.Количество() > 0 И НЕ Параметры.ПерезаполнениеРегистровНУ Тогда
			ТаблицаСвободныхРегистраторов = РегистраторыКурсовыхРазниц(СтрокаПереоценки, РегистраторыРасчетов, СтрокиДетальныхЗаписей.Количество() * 4);
			счРегистратор = 0;
			счСтрок = 0;
			
			РегистраторРасчетов = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
			НаборЗаписей.Отбор.Регистратор.Установить(РегистраторРасчетов);
			НаборЗаписей.Прочитать();
			УдалитьКурсовыеРазницыЗаДень(Период, НаборЗаписей);
			СтрокаКУдалению = КурсовыеРазницыКУдалению.Найти(РегистраторРасчетов,"Регистратор");
			Если СтрокаКУдалению <> Неопределено Тогда
				КурсовыеРазницыКУдалению.Удалить(СтрокаКУдалению);
			КонецЕсли;
			
			Для Каждого СтрокаДетальныхЗаписей Из СтрокиДетальныхЗаписей Цикл
				
				#Область ПоложительнаяКурсоваяРазница
				Если СтрокаДетальныхЗаписей.ДолгРеглОстаток < СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный 
					ИЛИ СтрокаДетальныхЗаписей.ДолгУпрОстаток < СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Приход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаПоложительная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаПоложительнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;

					Если СтрокаДетальныхЗаписей.ДолгРеглОстаток < СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный Тогда
						НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный - СтрокаДетальныхЗаписей.ДолгРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ДолгУпрОстаток < СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
						НовСтр.ДолгУпр = СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный - СтрокаДетальныхЗаписей.ДолгУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				#КонецОбласти
				
				#Область ОтрицательнаяКурсоваяРазница
				Если СтрокаДетальныхЗаписей.ДолгРеглОстаток > СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный 
					ИЛИ СтрокаДетальныхЗаписей.ДолгУпрОстаток > СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Расход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаОтрицательная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаОтрицательнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;

					Если СтрокаДетальныхЗаписей.ДолгРеглОстаток > СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный Тогда
						НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРеглОстаток - СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ДолгУпрОстаток > СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
						НовСтр.ДолгУпр = СтрокаДетальныхЗаписей.ДолгУпрОстаток - СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				#КонецОбласти
				
				#Область КорректировкаПредоплатыВНоль
				Если СтрокаДетальныхЗаписей.ПредоплатаОстаток = 0
					И (СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток > 0
						ИЛИ СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток > 0) Тогда
					
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Расход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаПоложительная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаПоложительнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;

					Если СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток > 0 Тогда
						НовСтр.ПредоплатаРегл = СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток > 0 Тогда
						НовСтр.ПредоплатаУпр = СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДетальныхЗаписей.ПредоплатаОстаток = 0
					И (СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток < 0
						ИЛИ СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток < 0) Тогда
					
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = НачалоДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ПорядокЗачета         = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Приход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаОтрицательная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.Валюта;
					НовСтр.НастройкаХозяйственнойОперации 	= ПереоценкаОтрицательнаяСпр;
					НовСтр.ИдентификаторФинЗаписи			= Строка(Новый УникальныйИдентификатор);
					НовСтр.ТипЗаписиВзаиморасчетов			= Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
					
					Если СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток < 0 Тогда
						НовСтр.ПредоплатаРегл = -СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток < 0 Тогда
						НовСтр.ПредоплатаУпр = -СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				#КонецОбласти
				
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
		//++ НЕ УТ

		//++ Локализация
		#Область РасчетКурсовыхРазницНУ
		Для Каждого ЗаписьНУ Из СтрокиДетальныхЗаписейНУ Цикл
			
			РасчетыПоВознаграждению = ЗаписьНУ.ТипДоговора = ДоговорСКомитентом
										И ЭтоРасчетыСКлиентами;
			ПереоценкаПо67ФЗ = ЗаписьНУ.ПрименятьПоложения67ФЗ
				И (НЕ ЗаписьНУ.ПереоцениватьТоварыУслугиКОтчетуКомитенту
					ИЛИ РасчетыПоВознаграждению);
			
			КурсНаДату = ЗаписьНУ.КурсЧислительРегл/ЗаписьНУ.КурсЗнаменательРегл;
			АналитикаНУ = АналитикаКурсовыхНУ(ЗаписьНУ);
			АналитикаНУ.Период = КонецДня(Период);
			АналитикаНУ.ДокументРегистратор = ДокументРегистратор;
			АналитикаНУ.НачалоПрименения67ФЗПоРасходам = НачалоПрименения67ФЗПоРасходам;
			
			СуммыНУ = РассчитатьСуммыНУ(Период, КурсНаДату, ЗаписьНУ);
			
			Если Период = КонецМесяца(Период) Тогда
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "СуммаНУ", СуммыНУ.КурсоваяРазницаОплаты);
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "СуммаНУ", СуммыНУ.КурсоваяРазницаОстатка);
			Иначе
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "СуммаНУ", СуммыНУ.КурсоваяРазницаНУ);
			КонецЕсли;
			Если ПереоценкаПо67ФЗ Тогда
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "ОтложенныйДоход", СуммыНУ.ОтложенныйДоходОплата);
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "ОтложенныйРасход", СуммыНУ.ОтложенныйРасходОплата);
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "ОтложенныйДоход", СуммыНУ.ОтложенныйДоходОстаток);
				ДобавитьОборотНУ(РегистрыНУ.НаборЗаписейНУ, АналитикаНУ, "ОтложенныйРасход", СуммыНУ.ОтложенныйРасходОстаток);
			КонецЕсли;
			
			//РасчетПереоценкиНУ
			Знак = ?(ЗаписьНУ.ЭтоРасчетыСКлиентами, 1, -1);
			Если Период = КонецМесяца(Период) И Окр(СуммыНУ.КурсоваяРазницаОстатка,2) <> 0 
				И ПереоценкаПо67ФЗ Тогда
				НовСтр = РегистрыНУ.РасчетПереоценкиНУ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, АналитикаНУ);
				НовСтр.Аналитика1 = АналитикаНУ.Контрагент; 
				НовСтр.Аналитика2 = АналитикаНУ.Договор; 
				НовСтр.Аналитика3 = АналитикаНУ.РасчетныйДокумент;
				
				НовСтр.ОстатокВВалюте = ЗаписьНУ.ДолгОстаток;
				НовСтр.ОстатокВРубляхНУ = ЗаписьНУ.СуммаНУОстаток + СуммыНУ.КурсоваяРазницаОплаты;
				НовСтр.ОстатокПоКурсуПереоценки = КурсНаДату * ЗаписьНУ.ДолгОстаток;
				НовСтр.СуммаПереоценкиНУ = Знак * СуммыНУ.КурсоваяРазницаОстатка;
				Если ЗаписьНУ.ЭтоРасчетыСКлиентами Тогда
					Если СуммыНУ.КурсоваяРазницаОстатка > 0 Тогда
						НовСтр.ОтложенныйДоход = СуммыНУ.КурсоваяРазницаОстатка;
					ИначеЕсли Период >= НачалоПрименения67ФЗПоРасходам Тогда
						НовСтр.ОтложенныйРасход = -СуммыНУ.КурсоваяРазницаОстатка;
					КонецЕсли;
				Иначе
					Если СуммыНУ.КурсоваяРазницаОстатка < 0 Тогда
						НовСтр.ОтложенныйДоход = -СуммыНУ.КурсоваяРазницаОстатка;
					ИначеЕсли Период >= НачалоПрименения67ФЗПоРасходам Тогда
						НовСтр.ОтложенныйРасход = СуммыНУ.КурсоваяРазницаОстатка;
					КонецЕсли;
				КонецЕсли;
				
				НовСтр.ОстатокОД = ЗаписьНУ.ОтложенныйДоходОстаток;
				Если Период >= НачалоПрименения67ФЗПоРасходам Тогда
					НовСтр.ОстатокОР = ЗаписьНУ.ОтложенныйРасходОстаток;
				КонецЕсли;
				
				НовСтр.ЭтоТребование = Истина;
				НовСтр.Курс = ЗаписьНУ.КурсЧислительРегл;
				НовСтр.Кратность = ЗаписьНУ.КурсЗнаменательРегл;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураПоискаОплаты, ЗаписьНУ);
			СтрокиОплаты = ДокументыОплаты.Скопировать(СтруктураПоискаОплаты);
			Если СтрокиОплаты.Количество() > 0 И ПереоценкаПо67ФЗ Тогда
				
				ОстаткиНУ = Новый Структура;
				ОстаткиНУ.Вставить("ЭтоРасчетыСКлиентами", ЗаписьНУ.ЭтоРасчетыСКлиентами);
				ОстаткиНУ.Вставить("ДолгОстаток", ЗаписьНУ.ДолгОстаток);
				ОстаткиНУ.Вставить("СуммаНУОстаток", ЗаписьНУ.СуммаНУОстаток + СуммыНУ.КурсоваяРазницаОплаты);
				
				ВсегоОплатаЗаДень = СтрокиОплаты.Итог("ДолгРасход");
				ВсегоПризнаноДохода = -СуммыНУ.ПризнаниеДохода;
				ВсегоПризнаноРасхода = -СуммыНУ.ПризнаниеРасхода;
				КурсоваяРазницаОплаты = Макс(СуммыНУ.КурсоваяРазницаОплаты, -СуммыНУ.КурсоваяРазницаОплаты);
				ВсегоКурсоваяРазницаОплаты = КурсоваяРазницаОплаты;
				ЗнакКурсовой = 1;
				Если СуммыНУ.КурсоваяРазницаОплаты <> 0 Тогда
					ЗнакКурсовой = СуммыНУ.КурсоваяРазницаОплаты/КурсоваяРазницаОплаты;
				КонецЕсли;
				Для Индекс = 0 По СтрокиОплаты.Количество()-1 Цикл
					ПоследняяСтрока = Индекс = СтрокиОплаты.Количество()-1;
					Оплата = СтрокиОплаты[Индекс];
					
					Если ВсегоОплатаЗаДень <> 0 Тогда
						ДоляКурсовойРазницаОплаты = Окр(Оплата.ДолгРасход/ВсегоОплатаЗаДень * КурсоваяРазницаОплаты, 2);
						Оплата.КурсоваяРазницаОплаты = ЗнакКурсовой * ВзаиморасчетыСервер.СписатьСумму(ВсегоКурсоваяРазницаОплаты, ДоляКурсовойРазницаОплаты, ПоследняяСтрока);
						
						ПризнаниеДохода = Окр(Оплата.ДолгРасход/ВсегоОплатаЗаДень * (-СуммыНУ.ПризнаниеДохода), 2);
						Оплата.ПризнаниеДохода = -ВзаиморасчетыСервер.СписатьСумму(ВсегоПризнаноДохода, ПризнаниеДохода, ПоследняяСтрока);
						
						ПризнаниеРасхода = Окр(Оплата.ДолгРасход/ВсегоОплатаЗаДень * (-СуммыНУ.ПризнаниеРасхода),2);
						Оплата.ПризнаниеРасхода = -ВзаиморасчетыСервер.СписатьСумму(ВсегоПризнаноРасхода, ПризнаниеРасхода, ПоследняяСтрока);
					КонецЕсли;
					
					Оплата.ДолгОстаток = ОстаткиНУ.ДолгОстаток + Оплата.ДолгРасход;
					Оплата.СуммаНУОстаток = ОстаткиНУ.СуммаНУОстаток + Оплата.ДолгРеглРасход - Оплата.КурсоваяРазницаОплаты;
					ОстаткиНУ.ДолгОстаток = Оплата.ДолгОстаток;
					ОстаткиНУ.СуммаНУОстаток = Оплата.СуммаНУОстаток;
					
				КонецЦикла; //по документам оплаты
				
				СтрокиОплаты.Сортировать("МоментВремени");
				
				Для Каждого Оплата Из СтрокиОплаты Цикл
					
					Если Окр(Оплата.КурсоваяРазницаОплаты,2) = 0
						И Окр(Оплата.ПризнаниеДохода,2) = 0
						И Окр(Оплата.ПризнаниеРасхода,2) = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					НовСтр = РегистрыНУ.РасчетПереоценкиНУ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, АналитикаНУ);
					НовСтр.Аналитика1 = АналитикаНУ.Контрагент; 
					НовСтр.Аналитика2 = АналитикаНУ.Договор; 
					НовСтр.Аналитика3 = АналитикаНУ.РасчетныйДокумент;
					НовСтр.ДокументОплаты = Оплата.ДокументОплаты;
					
					НовСтр.ОстатокВВалюте = Оплата.ДолгОстаток;
					НовСтр.ОстатокВРубляхНУ = Оплата.СуммаНУОстаток;
					НовСтр.ОстатокПоКурсуПереоценки = Окр(Оплата.ДолгРеглРасход/Оплата.ДолгРасход * Оплата.ДолгОстаток, 2);
					Если ЗаписьНУ.ЭтоРасчетыСКлиентами Тогда
						НовСтр.СуммаПереоценкиНУ = Оплата.КурсоваяРазницаОплаты;
					Иначе
						НовСтр.СуммаПереоценкиНУ = -Оплата.КурсоваяРазницаОплаты;
					КонецЕсли;
					
					НовСтр.ПогашениеВВалюте = Оплата.ДолгРасход;
					НовСтр.ОстатокОД = ЗаписьНУ.ОтложенныйДоходОстаток;
					НовСтр.ОтложенныйДоход = Оплата.ПризнаниеДохода;
					Если Период >= НачалоПрименения67ФЗПоРасходам Тогда
						НовСтр.ОстатокОР = ЗаписьНУ.ОтложенныйРасходОстаток;
						НовСтр.ОтложенныйРасход = Оплата.ПризнаниеРасхода;
					КонецЕсли;
					
					НовСтр.ЭтоТребование = Истина;
					НовСтр.Курс = ЗаписьНУ.КурсЧислительРегл;
					НовСтр.Кратность = ЗаписьНУ.КурсЗнаменательРегл;
					
				КонецЦикла; //по документам оплаты
			
			ИначеЕсли ЗаписьНУ.ДолгОстаток = 0 И Окр(СуммыНУ.КурсоваяРазницаОплаты,2) <> 0 
					И ПереоценкаПо67ФЗ Тогда
				
				НовСтр = РегистрыНУ.РасчетПереоценкиНУ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, АналитикаНУ);
				НовСтр.Аналитика1 = АналитикаНУ.Контрагент; 
				НовСтр.Аналитика2 = АналитикаНУ.Договор; 
				НовСтр.Аналитика3 = АналитикаНУ.РасчетныйДокумент;
				НовСтр.ДокументОплаты = АналитикаНУ.ДокументРегистратор;
				
				НовСтр.ОстатокВВалюте = ЗаписьНУ.ДолгОстаток;
				НовСтр.ОстатокВРубляхНУ = ЗаписьНУ.СуммаНУОстаток;
				Если ЗаписьНУ.ЭтоРасчетыСКлиентами Тогда
					НовСтр.СуммаПереоценкиНУ = СуммыНУ.КурсоваяРазницаОплаты;
				Иначе
					НовСтр.СуммаПереоценкиНУ = -СуммыНУ.КурсоваяРазницаОплаты;
				КонецЕсли;
				НовСтр.ПогашениеВВалюте = ЗаписьНУ.ДолгРасход;
				
				НовСтр.ЭтоТребование = Истина;
				НовСтр.Курс = ЗаписьНУ.КурсЧислительРегл;
				НовСтр.Кратность = ЗаписьНУ.КурсЗнаменательРегл;
				
			КонецЕсли; //есть оплаты
		КонецЦикла;
		Если НЕ РегистрыНУ.ЗаписыватьОднимНабором Тогда
			Если РегистрыНУ.НаборЗаписейНУ.Количество() > 0 Тогда
				Если РегистрыНУ.НаборЗаписейНУ.Количество() > 1 Тогда
					Таблица = РегистрыНУ.НаборЗаписейНУ.Выгрузить();
					Таблица.Свернуть("ВидДвижения,Период,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта,РасчетныйДокумент,ДокументРегистратор","СуммаНУ,ОтложенныйДоход,ОтложенныйРасход");
					РегистрыНУ.НаборЗаписейНУ.Загрузить(Таблица);
				КонецЕсли;
				РегистрыНУ.НаборЗаписейНУ.Записать(Ложь);
			КонецЕсли;
			Если РегистрыНУ.РасчетПереоценкиНУ.Количество() > 0 Тогда
				РегистрыНУ.РасчетПереоценкиНУ.Записать(Ложь);
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
		//-- Локализация

		//-- НЕ УТ
		
	КонецЦикла; //по объектам переоценки
	
	//++ НЕ УТ

	//++ Локализация
	Если РегистрыНУ.ЗаписыватьОднимНабором Тогда
		Если РегистрыНУ.НаборЗаписейНУ.Количество() > 0 Тогда
			Если РегистрыНУ.НаборЗаписейНУ.Количество() > 1 Тогда
				ОбщегоНазначенияУТ.СвернутьНаборЗаписей(РегистрыНУ.НаборЗаписейНУ);
			КонецЕсли;
			РегистрыНУ.НаборЗаписейНУ.Записать(Ложь);
		КонецЕсли;
		Если РегистрыНУ.РасчетПереоценкиНУ.Количество() > 0 Тогда
			ОбщегоНазначенияУТ.СвернутьНаборЗаписей(РегистрыНУ.РасчетПереоценкиНУ);
			РегистрыНУ.РасчетПереоценкиНУ.Записать(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Параметры.ПерезаполнениеРегистровНУ Тогда
	//-- Локализация

	//-- НЕ УТ
	Для Каждого СтрокаКУдалению Из КурсовыеРазницыКУдалению Цикл
		
		Если СтрокаКУдалению.ЭтоРасчетыСКлиентами Тогда
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПроверятьИзмененияРегистра", Истина);
		
		НаборЗаписей.Отбор.Регистратор.Установить(СтрокаКУдалению.Регистратор);
		НаборЗаписей.Прочитать();
		Если УдалитьКурсовыеРазницыЗаДень(Период, НаборЗаписей) Тогда
			НаборЗаписей.Записать(); //удалим старые курсовые разницы
		КонецЕсли;
	КонецЦикла;
	//++ НЕ УТ

	//++ Локализация
	КонецЕсли;
	//-- Локализация

	//-- НЕ УТ
	
	ПоляСворачивания = "Регистратор";
	//++ НЕ УТ
	ПоляСворачивания = "Регистратор, Период, АналитикаУчетаПоПартнерам";
	//-- НЕ УТ
	ТаблицаИзменений.Свернуть(ПоляСворачивания);
	//++ НЕ УТ

	//++ Локализация
	Если НЕ Параметры.ПерезаполнениеРегистровНУ Тогда
	//-- Локализация
	РеглУчетСервер.ЗарегистрироватьДокументыРасчетовСПартнерамиКОтражениюВРеглУчете(ТаблицаИзменений);
	//++ НЕ УТКА
	МеждународныйУчетПроведениеСервер.ЗарегистрироватьДокументыРасчетовСПартнерамиКОтражениюВМеждународномУчете(ТаблицаИзменений);
	//-- НЕ УТКА

	//++ Локализация
	КонецЕсли;
	//-- Локализация

	//-- НЕ УТ
	
	Если ЭтоРасчетыСКлиентами <> Неопределено Тогда
		Для Каждого Организация Из МассивОрганизаций Цикл
			
			ДокументыРасчетаКурсовыхРазниц = Документы.РасчетКурсовыхРазниц.ДокументыПереоценки(Организация,
				Период, Период,
				ЭтоРасчетыСКлиентами);
			ДокументРегистратор = ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
			
			Если ЭтоРасчетыСКлиентами Тогда
				НаборДвиженийПоДокументам = РегистрыНакопления.РасчетыСКлиентамиПоДокументам.СоздатьНаборЗаписей();
			Иначе
				НаборДвиженийПоДокументам = РегистрыНакопления.РасчетыСПоставщикамиПоДокументам.СоздатьНаборЗаписей();
			КонецЕсли;
			
			НаборДвиженийПоДокументам.Отбор.Регистратор.Установить(ДокументРегистратор);
			НаборДвиженийПоДокументам.Прочитать();
			Если НаборДвиженийПоДокументам.Количество() > 0 Тогда
				НаборДвиженийПоДокументам.Очистить();
				НаборДвиженийПоДокументам.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция УдалитьКурсовыеРазницыЗаДень(Период, НаборЗаписей)
	
	Индекс = 0;
	БылоУдаление = Ложь;
	Пока Индекс < НаборЗаписей.Количество() Цикл
		Запись = НаборЗаписей[Индекс];
		
		Если НачалоДня(Запись.Период) = НачалоДня(Период)
			И ТипЗнч(Запись.ДокументРегистратор) = Тип("ДокументСсылка.РасчетКурсовыхРазниц") Тогда
			НаборЗаписей.Удалить(Запись);
			БылоУдаление = Истина;
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат БылоУдаление;
	
КонецФункции

// Удаляет движения курсовых разниц за период только по тем дням,
// по которым в текущем периоде больше не будет переоценки.
// Например оплата пренесена на другой дату и на текущую дату больше нет объектов для переоценки
// или был режим переоценки по дням, а стал режим переоценки на дату оплаты и конец месяца.
// 
Процедура УдалитьКурсовыеРазницыЗаПериод(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры)
	
	Если Параметры.ЭтоРасчетыСКлиентами = Неопределено Тогда
		ИмяЗамера = "Взаиморасчеты.РасчетКурсовыхРазницПоСрокам.Удаление";
	Иначе
		ИмяЗамера = "Взаиморасчеты.РасчетКурсовыхРазницПоСрокам" + ?(Параметры.ЭтоРасчетыСКлиентами,".Клиенты",".Поставщики")+".Удаление";
	КонецЕсли;
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяЗамера);
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДниПереоценки.Дата КАК Дата
	|ПОМЕСТИТЬ втДниПереоценки
	|ИЗ
	|	&ДниПереоценки КАК ДниПереоценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Дни осутствия курсовых разниц - дни в которых при новом расчете движений курсовых разниц не будет
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	СУММА(ВложенныйЗапрос.ПредыдущаяПереоценка) КАК ПредыдущаяПереоценка
	|ПОМЕСТИТЬ втПредыдущаяПереоценка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДниПереоценки.Дата КАК Дата,
	|		1 КАК ПредыдущаяПереоценка
	|	ИЗ
	|		втДниПереоценки КАК ДниПереоценки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) КАК Дата,
	|		-1 КАК ПредыдущаяПереоценка
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО (КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка)
	|	ГДЕ
	|		Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Организации.Ссылка В(&Организации)
	|		И Расчеты.ДокументРегистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Дата
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.ПредыдущаяПереоценка) = -1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Регистраторы расчетов за указанные период, у которых есть движений курсовых разниц
	// при условии, что есть даты отсутствия курсовых разниц
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПоСрокам.Регистратор КАК РегистраторРасчетов,
	|	КОЛИЧЕСТВО(Переоценка.Дата) КАК ДатыОтсутствияКурсовыхРазниц
	|ПОМЕСТИТЬ втРегистраторыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|	ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = КлючиАналитики.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценка КАК Переоценка
	|	ПО ИСТИНА
	|ГДЕ
	|	РасчетыПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитики.Организация В (&Организации)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоСрокам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.Регистратор
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Переоценка.Дата) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Все движения регистраторов расчета, кроме движений курсовых разниц в дни отсутствия
	|ВЫБРАТЬ
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	*
	|ПОМЕСТИТЬ втДвиженияРегистраторов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторыРасчетов КАК РегистраторыРасчетов
	|		ПО РасчетыСПоСрокам.Регистратор = РегистраторыРасчетов.РегистраторРасчетов
	|ГДЕ
	|	НЕ (ТИПЗНАЧЕНИЯ(РасчетыСПоСрокам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		И НАЧАЛОПЕРИОДА(РасчетыСПоСрокам.Период, ДЕНЬ) В (ВЫБРАТЬ Дата ИЗ втПредыдущаяПереоценка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Регистраторы расчетов которые остались без движений
	|ВЫБРАТЬ
	|	РегистраторыРасчетов.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РегистраторыРасчетов.РегистраторРасчетов КАК Регистратор
	|ИЗ
	|	втРегистраторыРасчетов КАК РегистраторыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДвиженияРегистраторов КАК ДвиженияРегистраторов
	|		ПО РегистраторыРасчетов.РегистраторРасчетов = ДвиженияРегистраторов.Регистратор
	|ГДЕ
	|	ДвиженияРегистраторов.Регистратор ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	втДвиженияРегистраторов КАК ДвиженияРегистраторов
	|
	|ИТОГИ
	|	МАКСИМУМ(ЭтоРасчетыСКлиентами)
	|ПО
	|	Регистратор";
	#КонецОбласти
	
	Если НЕ Параметры.ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
				Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
				Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДниПереоценки", Параметры.ДниПереоценки);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", Параметры.ЭтоРасчетыСКлиентами);
	РезультатПакета = Запрос.ВыполнитьПакет();
	ПоследнийПакет = РезультатПакета.ВГраница();
	
	Выборка = РезультатПакета[ПоследнийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВсегоОбработано = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоРасчетыСКлиентами Тогда
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Движения = Выборка.Выбрать();
		Пока Движения.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Движения);
		КонецЦикла;
		НаборЗаписей.Записать();
 		ВсегоОбработано = ВсегоОбработано + 1;
	КонецЦикла;
	
	// Регистраторы которые остались без движений
	Выборка = РезультатПакета[ПоследнийПакет-1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоРасчетыСКлиентами Тогда
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Записать();
		ВсегоОбработано = ВсегоОбработано + 1;
	КонецЦикла;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ВсегоОбработано);
	
КонецПроцедуры

Функция ДниПереоценки(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры)
	
	#Область ТекстЗапроса
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Валюта КАК Валюта,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) КАК Период
	|ПОМЕСТИТЬ втОборотыВалюты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|		ПО Расчеты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Организации.Ссылка В (&Организации)
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> Организации.ВалютаРегламентированногоУчета)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.Долг <> 0
	|;";
	Если НЕ Параметры.ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
				Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
				Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втОборотыВалюты.Период КАК Дата
	|ИЗ
	|	втОборотыВалюты КАК втОборотыВалюты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КурсыВалют.Период
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ПереоценкаПоДням
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организации",   МассивОрганизаций);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",  Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ПереоценкаПоДням",  Параметры.ПереоценкаПоДням);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
	
КонецФункции

Функция РегистраторыКурсовыхРазниц(ТекущиеПараметры, РегистраторыРасчетов, КоличествоЗаписей)
	
	Если КоличествоЗаписей = 0 Тогда
		КоличествоРегистраторов = 0;
	Иначе
		КоличествоРегистраторов = Цел(КоличествоЗаписей/ОперативныеВзаиморасчетыСервер.РазмерПорцииЗаписи()) + 1;
	КонецЕсли;
	
	Отбор = Новый Структура("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ЭтоРасчетыСКлиентами");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеПараметры);
	
	ТипРасчетов = ?(ТекущиеПараметры.ЭтоРасчетыСКлиентами, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	ТаблицаДокументов = РегистраторыРасчетов.Скопировать(Отбор); // см.СвободныеРегистраторыРасчетов
	
	Пока ТаблицаДокументов.Количество() < КоличествоРегистраторов Цикл
		ДокументОбъект = Документы.РегистраторРасчетов.СоздатьДокумент();
		ДокументОбъект.Валюта = ТекущиеПараметры.Валюта;
		ДокументОбъект.АналитикаУчетаПоПартнерам = ТекущиеПараметры.АналитикаУчетаПоПартнерам;
		ДокументОбъект.Организация = ТекущиеПараметры.Организация;
		ДокументОбъект.ОбъектРасчетов = ТекущиеПараметры.ОбъектРасчетов;
		ДокументОбъект.ТипРасчетов = ТипРасчетов;
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НовСтр = ТаблицаДокументов.Добавить();
		НовСтр.Ссылка = ДокументОбъект.Ссылка;
	КонецЦикла;
	
	Возврат ТаблицаДокументов;
	
КонецФункции

//++ НЕ УТ

//++ Локализация
Процедура ЗаполнитьДвиженияНУзаПериод(Организация, Период, ЭтоРасчетыСКлиентами, ДатаНачалаПересчета = Неопределено)
	
	НачалоВступленияВСилу67ФЗ = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
	ИспользоватьРеглУчет = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет");
	Если НачалоМесяца(Период) < НачалоВступленияВСилу67ФЗ ИЛИ НЕ ИспользоватьРеглУчет Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Организация) = Тип("Массив") Тогда
		МассивОрганизаций = Организация;
		Если МассивОрганизаций.Количество() = 1 Тогда
			НачалоПрименения67ФЗПоДоходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоДоходам(МассивОрганизаций[0]);
		Иначе
			НачалоПрименения67ФЗПоДоходам = НачалоВступленияВСилу67ФЗ;
		КонецЕсли;
	Иначе
		МассивОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
		НачалоПрименения67ФЗПоДоходам = РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоПрименения67ФЗПоДоходам(Организация);
	КонецЕсли;

	НачалоПериода = НачалоМесяца(Период);
	Если ДатаНачалаПересчета <> Неопределено Тогда
		НачалоПериода = НачалоМесяца(ДатаНачалаПересчета);
	ИначеЕсли НачалоМесяца(Период) = НачалоПрименения67ФЗПоДоходам Тогда //это месяц перехода
		НачалоПериода = НачалоГода(НачалоПрименения67ФЗПоДоходам);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикиУчетаПоПартнерам.Ссылка КАК Ссылка,
	|	АналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	АналитикиУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ПОМЕСТИТЬ ВтАналитикиУчетаПоПартнерам
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикиУчетаПоПартнерам
	|ГДЕ
	|	АналитикиУчетаПоПартнерам.Организация В(&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РасчетыКР.Дата, МЕСЯЦ) КАК Период,
	|	РасчетыКР.Ссылка КАК Ссылка,
	|	РасчетыКР.Организация КАК Организация,
	|	РасчетыКР.ПереоценкаПоДням КАК ПереоценкаПоДням,
	|	РасчетыКР.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами) КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ втРегистраторыКурсовыхРазниц
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК РасчетыКР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|		ПО РасчетыКР.Организация = Аналитика.Организация
	|ГДЕ
	|	РасчетыКР.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (&ЭтоРасчетыСКлиентами И РасчетыКР.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|		ИЛИ НЕ &ЭтоРасчетыСКлиентами И РасчетыКР.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками))
	|	И РасчетыКР.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.Месяц КАК Месяц,
	|	Обороты.Период КАК Период,
	|	Обороты.ВидДвижения КАК ВидДвижения,
	|	Обороты.ДокументРегистратор КАК ДокументРегистратор,
	|	Обороты.Организация КАК Организация,
	|	Обороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Обороты.Валюта КАК Валюта,
	|	Обороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(Обороты.Долг) КАК Долг,
	|	СУММА(Обороты.ДолгРегл) КАК ДолгРегл,
	|	Обороты.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|
	|ПОМЕСТИТЬ втОстаткиИОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоВступленияВСилу67ФЗ КАК Месяц,
	|		&ДатаВводаОстатковНУ КАК Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРегистратор,
	|		Аналитика.Организация КАК Организация,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Расчеты.ДолгОстаток КАК Долг,
	|		Расчеты.ДолгРеглОстаток КАК ДолгРегл,
	|		&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&НачалоВступленияВСилу67ФЗ,
	|			(АналитикаУчетаПоПартнерам) В 
	|				(ВЫБРАТЬ 
	|					Аналитика.Ссылка
	|				ИЗ
	|					ВтАналитикиУчетаПоПартнерам КАК Аналитика)
	|			И НЕ (Валюта) В (
	|				ВЫБРАТЬ
	|					Аналитика.ВалютаРегламентированногоУчета
	|				ИЗ
	|					ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|				)
	|		) КАК Расчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|	ГДЕ
	|		&НачалоПериода = &НачалоВступленияВСилу67ФЗ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&НачалоВступленияВСилу67ФЗ КАК Месяц,
	|		&ДатаВводаОстатковНУ КАК Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		НЕОПРЕДЕЛЕНО КАК ДокументРегистратор,
	|		Аналитика.Организация КАК Организация,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		0 КАК Долг,
	|		-Расчеты.СуммаНУОстаток КАК ДолгРегл,
	|		&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиНУ.Остатки(
	|			&НачалоВступленияВСилу67ФЗ,
	|			(АналитикаУчетаПоПартнерам) В 
	|				(ВЫБРАТЬ 
	|					Аналитика.Ссылка
	|				ИЗ
	|					ВтАналитикиУчетаПоПартнерам КАК Аналитика)
	|			И НЕ (Валюта) В (
	|				ВЫБРАТЬ 
	|					Аналитика.ВалютаРегламентированногоУчета
	|				ИЗ
	|					ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|				)
	|		) КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|	ГДЕ
	|		&НачалоПериода = &НачалоВступленияВСилу67ФЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Расчеты.Период, МЕСЯЦ) КАК Месяц,
	|		Расчеты.Период КАК Период,
	|		Расчеты.ВидДвижения КАК ВидДвижения,
	|		Расчеты.ДокументРегистратор КАК ДокументРегистратор,
	|		Аналитика.Организация КАК Организация,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	|		Расчеты.Долг КАК Долг,
	|		Расчеты.ДолгРегл КАК ДолгРегл,
	|		&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|	ГДЕ
	|		Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Расчеты.Валюта <> Аналитика.ВалютаРегламентированногоУчета
	|		И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.РасчетКурсовыхРазниц)
	|		И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|		И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.ВводОстатков)
	|		И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.КорректировкаГрафикаВзаиморасчетов)
	|
	|) КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Период,
	|	Обороты.Месяц,
	|	Обороты.ВидДвижения,
	|	Обороты.ДокументРегистратор,
	|	Обороты.Организация,
	|	Обороты.АналитикаУчетаПоПартнерам,
	|	Обороты.ОбъектРасчетов,
	|	Обороты.Валюта,
	|	Обороты.РасчетныйДокумент,
	|	Обороты.ЭтоРасчетыСКлиентами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиНУ КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикиУчетаПоПартнерам КАК Аналитика
	|		ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.ВводОстатков)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) <> ТИП(Документ.РегламентнаяОперация)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) <> ТИП(Документ.КорректировкаГрафикаВзаиморасчетов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторыКурсовыхРазниц.Период КАК Месяц,
	|	ОстаткиИОбороты.Период КАК Период,
	|	ОстаткиИОбороты.ВидДвижения КАК ВидДвижения,
	|	ЕСТЬNULL(ОстаткиИОбороты.ДокументРегистратор, НЕОПРЕДЕЛЕНО) КАК ДокументРегистратор,
	|	РегистраторыКурсовыхРазниц.Организация КАК Организация,
	|	РегистраторыКурсовыхРазниц.Ссылка КАК Регистратор,
	|	РегистраторыКурсовыхРазниц.ПереоценкаПоДням КАК ПереоценкаПоДням,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиИОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЕСТЬNULL(ОстаткиИОбороты.Долг, 0)КАК Долг,
	|	ЕСТЬNULL(ОстаткиИОбороты.ДолгРегл, 0) КАК ДолгРегл,
	|	РегистраторыКурсовыхРазниц.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	втРегистраторыКурсовыхРазниц КАК РегистраторыКурсовыхРазниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиИОбороты КАК ОстаткиИОбороты
	|		ПО ОстаткиИОбороты.Месяц = РегистраторыКурсовыхРазниц.Период
	|			И ОстаткиИОбороты.Организация = РегистраторыКурсовыхРазниц.Организация
	|			И ОстаткиИОбороты.ЭтоРасчетыСКлиентами = РегистраторыКурсовыхРазниц.ЭтоРасчетыСКлиентами
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц
	|
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(ЭтоРасчетыСКлиентами),
	|	МАКСИМУМ(ПереоценкаПоДням)
	|ПО
	|	Месяц,
	|	Регистратор";
	#КонецОбласти
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
					Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя(),
					Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиНУ.ПолноеИмя(),
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиНУ.ПолноеИмя());
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("НачалоВступленияВСилу67ФЗ", НачалоВступленияВСилу67ФЗ);
	Запрос.УстановитьПараметр("ДатаВводаОстатковНУ", НачалоВступленияВСилу67ФЗ-1);
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));

	ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	Если ЭтоРасчетыСКлиентами Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	Иначе
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	КонецЕсли;

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = РезультатЗапроса.ВГраница();
	Выборка = РезультатЗапроса[ПоследнийИндекс-1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОчиститьРегистрыНУ(Выборка.Регистратор, Выборка.ЭтоРасчетыСКлиентами);
	КонецЦикла;

	ПараметрыПереоценки = ПараметрыПереоценки(ЭтоРасчетыСКлиентами);
	ПараметрыПереоценки.ПерезаполнениеРегистровНУ = Истина;

	Месяцы = РезультатЗапроса[ПоследнийИндекс].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Месяцы.Следующий() Цикл
		Регистраторы = Месяцы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Регистраторы.Следующий() Цикл
			Если Регистраторы.ЭтоРасчетыСКлиентами Тогда
				НаборЗаписейНУ = РегистрыНакопления.РасчетыСКлиентамиНУ.СоздатьНаборЗаписей();
			Иначе
				НаборЗаписейНУ = РегистрыНакопления.РасчетыСПоставщикамиНУ.СоздатьНаборЗаписей();
			КонецЕсли;
			ДокументРасчетаКР = Регистраторы.Регистратор;
			Если ДокументРасчетаКР = Неопределено Тогда
				ОбъектДокумента = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
				ОбъектДокумента.Дата = КонецМесяца(Месяцы.Месяц);
				ОбъектДокумента.Организация = Регистраторы.Организация;
				ОбъектДокумента.ХозяйственнаяОперация = ХозяйственнаяОперация;
				ОбъектДокумента.ПереоценкаПоДням = ПереоценкаПоДням;
				ОбъектДокумента.Проведен = Истина;
				ОбъектДокумента.Записать();
				ДокументРасчетаКР = ОбъектДокумента.Ссылка;
			КонецЕсли;
			НаборЗаписейНУ.Отбор.Регистратор.Установить(ДокументРасчетаКР);
			Движения = Регистраторы.Выбрать();
			Пока Движения.Следующий() Цикл
				Если Движения.ДолгРегл > 0 Тогда
					НовоеДвижение = НаборЗаписейНУ.Добавить();
					ЗаполнитьЗначенияСвойств(НовоеДвижение, Движения);
					НовоеДвижение.СуммаНУ = Движения.ДолгРегл;
					Если НовоеДвижение.ДокументРегистратор = Неопределено Тогда
						НовоеДвижение.ДокументРегистратор = ДокументРасчетаКР;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			НаборЗаписейНУ.Записать();
			Если НачалоМесяца(Месяцы.Месяц) <> НачалоМесяца(Период) Тогда
				ПараметрыПереоценки.ПереоценкаПоДням = Регистраторы.ПереоценкаПоДням;
				ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, Месяцы.Месяц, Месяцы.Месяц, ПараметрыПереоценки);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция АналитикаКурсовыхНУ(Данные = Неопределено)
	
	Аналитика = Новый Структура;
	Аналитика.Вставить("Период");
	Аналитика.Вставить("АналитикаУчетаПоПартнерам");
	Аналитика.Вставить("ОбъектРасчетов");
	Аналитика.Вставить("РасчетныйДокумент");
	Аналитика.Вставить("Валюта");
	Аналитика.Вставить("ТипСуммы");
	Аналитика.Вставить("Счет");
	Аналитика.Вставить("Организация");
	Аналитика.Вставить("Контрагент");
	Аналитика.Вставить("Договор");
	Аналитика.Вставить("ДокументОплаты");
	Аналитика.Вставить("ДокументРегистратор");
	Аналитика.Вставить("НачалоПрименения67ФЗПоРасходам");
	
	Если Данные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Аналитика, Данные);
		Аналитика.Валюта = Данные.Валюта;
		Аналитика.Счет = Данные.СчетУчета;
	КонецЕсли;
	
	Возврат Аналитика;
	
КонецФункции

Процедура ДобавитьОборотНУ(НаборЗаписейНУ, Аналитика, ИмяРесурса, СуммаНУ)
	
	ЗаписьРазрешена = ИмяРесурса <> "ОтложенныйРасход" 
						ИЛИ ИмяРесурса = "ОтложенныйРасход" 
							И Аналитика.Период >= Аналитика.НачалоПрименения67ФЗПоРасходам;
	
	Если Окр(СуммаНУ,2) <> 0 И ЗаписьРазрешена Тогда
		НовСтр = НаборЗаписейНУ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Аналитика);
		НовСтр[ИмяРесурса] = СуммаНУ;
		Если НовСтр[ИмяРесурса] < 0 Тогда
			НовСтр[ИмяРесурса] = -НовСтр[ИмяРесурса];
			НовСтр.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьСуммыНУ(Период, КурсНаДату, ЗаписьНУ, Оплата = Неопределено)
	
	Если Оплата = Неопределено Тогда
		Оплата = Новый Структура("ДолгРасход,ДолгРеглРасход");
		ЗаполнитьЗначенияСвойств(Оплата, ЗаписьНУ);
	КонецЕсли;

	НачальныйОстатокДолга = ЗаписьНУ.ДолгОстаток + Оплата.ДолгРасход;
	НачальныйОстатокДолгаНУ = ЗаписьНУ.СуммаНУОстаток + Оплата.ДолгРеглРасход;//в регистр еще не записана курсовая разница

	КурсоваяРазницаОплаты = 0;
	КурсоваяРазницаОстатка = 0;
	КурсоваяРазницаНУ = 0;
	ПризнаниеДохода = 0;
	ПризнаниеРасхода = 0;
	Если НачальныйОстатокДолга <> 0 Тогда
		КурсОстаткаНУ = НачальныйОстатокДолгаНУ/НачальныйОстатокДолга;
		Если Оплата.ДолгРасход <> 0 Тогда
			КурсОплаты = Оплата.ДолгРеглРасход/Оплата.ДолгРасход;
			КурсоваяРазницаОплаты = Окр(-Оплата.ДолгРасход * (КурсОстаткаНУ - КурсОплаты), 2);
		КонецЕсли;
		КурсоваяРазницаОстатка = Окр(Окр(КурсНаДату * ЗаписьНУ.ДолгОстаток,2) - (НачальныйОстатокДолгаНУ +(-Оплата.ДолгРасход * КурсОстаткаНУ)), 2);

		КурсоваяРазницаНУ = КурсоваяРазницаОплаты + ?(Период = КонецМесяца(Период), КурсоваяРазницаОстатка, 0);
		ПризнаниеДохода = Окр(-Оплата.ДолгРасход / НачальныйОстатокДолга * ЗаписьНУ.ОтложенныйДоходОстаток, 2);
		ПризнаниеРасхода = Окр(-Оплата.ДолгРасход / НачальныйОстатокДолга * ЗаписьНУ.ОтложенныйРасходОстаток, 2);
	КонецЕсли;

	ОтложенныйДоходОплата = 0; // реализованная
	ОтложенныйРасходОплата = 0;
	ОтложенныйДоходОстаток = 0; // не реализованная
	ОтложенныйРасходОстаток = 0;
	Если ЗаписьНУ.ДолгОстаток = 0 И Период = КонецМесяца(Период) Тогда
		КурсоваяРазницаНУ = -ЗаписьНУ.СуммаНУОстаток;
		КурсоваяРазницаОплаты = -ЗаписьНУ.СуммаНУОстаток;
		ОтложенныйДоходОплата = -ЗаписьНУ.ОтложенныйДоходОстаток;
		ОтложенныйРасходОплата = -ЗаписьНУ.ОтложенныйРасходОстаток;
	ИначеЕсли ЗаписьНУ.ЭтоРасчетыСКлиентами Тогда
		ОтложенныйДоходОплата = ПризнаниеДохода;
		ОтложенныйРасходОплата = ПризнаниеРасхода;
		ОтложенныйДоходОстаток = ?(Период = КонецМесяца(Период) И КурсоваяРазницаОстатка > 0, КурсоваяРазницаОстатка, 0);
		ОтложенныйРасходОстаток = ?(Период = КонецМесяца(Период) И КурсоваяРазницаОстатка < 0, -КурсоваяРазницаОстатка, 0);
	Иначе // это поставщик
		ОтложенныйДоходОплата = ПризнаниеДохода;
		ОтложенныйРасходОплата = ПризнаниеРасхода;
		ОтложенныйДоходОстаток = ?(Период = КонецМесяца(Период) И КурсоваяРазницаОстатка < 0, -КурсоваяРазницаОстатка, 0);
		ОтложенныйРасходОстаток = ?(Период = КонецМесяца(Период) И КурсоваяРазницаОстатка > 0, КурсоваяРазницаОстатка, 0);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("КурсоваяРазницаОплаты", КурсоваяРазницаОплаты);
	Результат.Вставить("КурсоваяРазницаОстатка", КурсоваяРазницаОстатка);
	Результат.Вставить("КурсоваяРазницаНУ", КурсоваяРазницаНУ);
	Результат.Вставить("ПризнаниеДохода", ПризнаниеДохода);
	Результат.Вставить("ПризнаниеРасхода", ПризнаниеРасхода);
	Результат.Вставить("ОтложенныйДоходОплата", ОтложенныйДоходОплата);
	Результат.Вставить("ОтложенныйРасходОплата", ОтложенныйРасходОплата);
	Результат.Вставить("ОтложенныйДоходОстаток", ОтложенныйДоходОстаток);
	Результат.Вставить("ОтложенныйРасходОстаток", ОтложенныйРасходОстаток);

	Возврат Результат;
	
КонецФункции

Процедура ОчиститьРегистрыНУ(Регистратор, ЭтоРасчетыСКлиентами)
	
	Если ЭтоРасчетыСКлиентами Тогда
		НаборЗаписейНУ = РегистрыНакопления.РасчетыСКлиентамиНУ.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписейНУ = РегистрыНакопления.РасчетыСПоставщикамиНУ.СоздатьНаборЗаписей();
	КонецЕсли;
	НаборЗаписейНУ.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписейНУ.Записать();
	
	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.Сторно") Тогда
		РасшифровкаРасчета = РегистрыСведений.РасчетПереоценкиВалютныхСредствНУ.СоздатьНаборЗаписей();
		РасшифровкаРасчета.Отбор.Регистратор.Установить(Регистратор);
		РасшифровкаРасчета.Записать();
	КонецЕсли;
	
КонецПроцедуры
//-- Локализация

//-- НЕ УТ

#КонецОбласти

