
//&Перед("ДобавитьКомандыПечати")
//Процедура Разр_ДобавитьКомандыПечати(КомандыПечати)
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "НарядНаСборкуКомплекта";
//	КомандаПечати.Представление = НСтр("ru = 'Наряд на сборку комплекта, ред.'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.МенеджерПечати = "Документ.ПроизводственнаяОперация2_2";
//КонецПроцедуры

//&Перед("Печать")
//Процедура Разр_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
//	#Если Сервер Тогда

//	Если УправлениеПечатью.НужноПечататьМакет(
//		КоллекцияПечатныхФорм,
//		"НарядНаСборкуКомплекта") Тогда

//		ТабличныйДокумент = Разр_СформироватьПечатнуюФормуПроизводственнаяОперация(
//			МассивОбъектов,
//			ОбъектыПечати);

//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//			КоллекцияПечатныхФорм,
//			"НарядНаСборкуКомплекта",
//			НСтр("ru = 'Наряд на сборку комплекта'"),
//			ТабличныйДокумент,
//			,
//			"Документ.ПроизводственнаяОперация2_2.Разр_ПФ_MXL_НарядНаСборкуКомплекта");

//	КонецЕсли;

//	#КонецЕсли
//КонецПроцедуры

//Функция Разр_СформироватьПечатнуюФормуПроизводственнаяОперация(
//	МассивОбъектов,
//	ОбъектыПечати)

//	#Если Сервер Тогда

//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.АвтоМасштаб = Истина;

//	Макет = УправлениеПечатью.МакетПечатнойФормы(
//		"Документ.ПроизводственнаяОперация2_2.Разр_ПФ_MXL_НарядНаСборкуКомплекта");

//	// Тут получаешь данные документа запросом или копируешь логику из типовой печати.

//	Область = Макет.ПолучитьОбласть("Заголовок");

//	// Заполняешь параметры области.
//	// Область.Параметры.Заполнить(...);

//	// Вот это и есть программный вывод штрихкода.
//	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
//		ТабличныйДокумент,
//		Макет,
//		Область,
//		МассивОбъектов[0]);

//	ТабличныйДокумент.Вывести(Область);

//	Возврат ТабличныйДокумент;

//	#КонецЕсли

//КонецФункции
