#Область ПрограммныйИнтерфейс

#Область КартыИсследованияТоваров

// Устанавливает новый статус для КартИсследованияТоваров
//
// Параметры:
//	НовыйСтатус				- ПеречислениеСсылка.СтатусыКартыИсследованияТоваров - новый статус
//	ПредставлениеСтатуса	- Строка - представление нового статуса
//  МассивКартИсследованияТоваров		- Массив из СправочникСсылка.КартыИсследованияТоваров - список КартИсследованияТоваров.
//
Процедура УстановитьСтатусКартИсследованияТоваров(НовыйСтатус, ПредставлениеСтатуса, МассивКартИсследованияТоваров) Экспорт
	
	Если МассивКартИсследованияТоваров.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗначениеСтатуса",      НовыйСтатус);
	ДополнительныеПараметры.Вставить("ПредставлениеСтатуса", ПредставлениеСтатуса);
	ДополнительныеПараметры.Вставить("ВыделенныеСсылки",     МассивКартИсследованияТоваров);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСтатусКартИсследованияТоваровЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Выбранным картам исследования товаров будет установлен статус ""%1"". Продолжить?';
						|en = 'The ""%1"" status will be set for the selected goods research sheets. Continue?'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ПредставлениеСтатуса);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатусКартИсследованияТоваровЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	КоличествоОбработанных = ИсследованиеТоваровВызовСервера.УстановитьСтатусКартИсследованияТоваров(
										ДополнительныеПараметры.ВыделенныеСсылки, 
										ДополнительныеПараметры.ЗначениеСтатуса);
										
	ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(
			Неопределено,
			КоличествоОбработанных, 
			ДополнительныеПараметры.ВыделенныеСсылки.Количество(), 
			ДополнительныеПараметры.ПредставлениеСтатуса);
			
	Оповестить("Запись_КартыИсследованияТоваров");
	ОповеститьОбИзменении(Тип("СправочникСсылка.КартыИсследованияТоваров"));
	
КонецПроцедуры

#Область ОтборПоСвойствам

Процедура ОбновитьНастройкиОтбораПоСвойствамПоКлючу(Таблица, Настройка, КлючСвязи) Экспорт
	
	СтруктураПоиска = Новый Структура("КлючСвязи", КлючСвязи);
	СписокСтрок = Таблица.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаУсловие Из СписокСтрок Цикл
		Таблица.Удалить(СтрокаУсловие);
	КонецЦикла;
	
	Для каждого Условие Из Настройка Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Условие);
		НоваяСтрока.КлючСвязи = КлючСвязи;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьТабличнуюЧасть(Таблица, Настройка) Экспорт
	
	Таблица.Очистить();
	
	Для каждого Строка Из Настройка Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

// Преобразует настройки из таблицы в массив структур по указанной строке.
//
// Параметры:
//   ДанныеСтроки - Структура - Данные строки для поиска в таблице настроек
//   ТаблицаНастроек - ТаблицаЗначений - Таблица, содержащая настройки
//   СписокРеквизитов - Строка - Список реквизитов, которые необходимо включить в результирующую структуру
//
// Возвращаемое значение:
// 	Массив Из Структура:
//   * Поля - Произвольный - Массив структур с реквизитами настроек
Функция РеквизитыНастроекПоСтрокеВМассивСтруктур(ДанныеСтроки, ТаблицаНастроек, СписокРеквизитов) Экспорт
	
	Результат = Новый Массив;
	
	СтруктураПоиска = Новый Структура("КлючСвязи", ДанныеСтроки.КлючСвязи);
	
	СписокСтрок = ТаблицаНастроек.НайтиСтроки(СтруктураПоиска);
	Для каждого Строка Из СписокСтрок Цикл
		СтруктураДанныхСтроки = Новый Структура(СписокРеквизитов);
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, Строка);
		Результат.Добавить(СтруктураДанныхСтроки);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//   ТаблицаЗначений - ТаблицаЗначений - таблица значений для преобразования
// Возвращаемое значение:
// 	Массив Из Структура:
//   * Поля - Произвольный - поля соответствуют колонкам переданным в ТаблицеЗначений.
Функция ТаблицаВМассивСтруктур(Знач ТаблицаЗначений) Экспорт
	
	Результат = Новый Массив;
	
	ИменаКолонок = "";
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ИменаКолонок = ИменаКолонок + "," + Колонка.Имя;
	КонецЦикла;
	ИменаКолонок = Сред(ИменаКолонок, 2);
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		СтруктураСтроки = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает таблицу значений в массив структур
// 
// Параметры:
// 	ТаблицаЗначений - ТаблицаЗначений - таблица значений для преобразования
// 	СписокРеквизитов - Структура - Список реквизитов
// Возвращаемое значение:
// 	Массив Из Структура:
//   * Поля - Произвольный - поля соответствуют колонкам переданным в СписокРеквизитов.
Функция РеквизитыТаблицыВМассивСтруктур(Знач ТаблицаЗначений, СписокРеквизитов) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		СтруктураСтроки = Новый Структура(СписокРеквизитов);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ОтборПоСвойствамПередНачаломИзменения(
	Форма,
	ТекущиеДанные,
	ТаблицаДоступныхСвойств,
	СтруктураУсловий) Экспорт
	
	СтрокиТаблицыСвойств = 
		ТаблицаДоступныхСвойств.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
		
	Если НЕ ЗначениеЗаполнено(СтрокиТаблицыСвойств) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоСвойствамУстановитьОграничениеТиповДляЗначения(Форма, ТекущиеДанные, СтруктураУсловий, СтрокиТаблицыСвойств[0].ТипЗначения);
	
КонецПроцедуры

Процедура ОтборПоСвойствамСвойствоПриИзменении(
	Форма,
	ТекущиеДанные,
	ТаблицаДоступныхСвойств,
	СтруктураУсловий) Экспорт
	
	СтрокиТаблицыСвойств = 
		ТаблицаДоступныхСвойств.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
		
	Если НЕ ЗначениеЗаполнено(СтрокиТаблицыСвойств) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Условие  = "Равно";
	
	ТипЗначенияПриведенный = 
		ОтборПоСвойствамУстановитьОграничениеТиповДляЗначения(Форма, ТекущиеДанные, СтруктураУсловий, СтрокиТаблицыСвойств[0].ТипЗначения);
	
	ТекущиеДанные.Значение = ТипЗначенияПриведенный.ПривестиЗначение(Неопределено);
	
КонецПроцедуры

Процедура ОтборПоСвойствамУсловиеПриИзменении(
	Форма,
	ТекущиеДанные,
	ТаблицаДоступныхСвойств,
	СтруктураУсловий) Экспорт
	
	СтрокиТаблицыСвойств = 
		ТаблицаДоступныхСвойств.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
		
	Если НЕ ЗначениеЗаполнено(СтрокиТаблицыСвойств) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееУсловие = СтруктураУсловий[ТекущиеДанные.Условие];
	
	ТипЗначенияПриведенный = 
		ОтборПоСвойствамУстановитьОграничениеТиповДляЗначения(Форма, ТекущиеДанные, СтруктураУсловий, СтрокиТаблицыСвойств[0].ТипЗначения);
	
	Если ТекущееУсловие.Список Тогда
		
		ТекущиеДанные.Значение = Новый СписокЗначений;
		ТекущиеДанные.Значение.ТипЗначения = ТипЗначенияПриведенный;
		
	Иначе
		
		Если ТекущееУсловие.Интервал ИЛИ ТекущееУсловие.Заполненность Тогда
			ТекущиеДанные.Значение = Неопределено;
		КонецЕсли;
		
		ТекущиеДанные.Значение = ТипЗначенияПриведенный.ПривестиЗначение(ТекущиеДанные.Значение);
		
	КонецЕсли;
	
	Для Индекс = 1 По 2 Цикл
		ТекущиеДанные["Значение"+Индекс] = ТипЗначенияПриведенный.ПривестиЗначение(Неопределено);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик начала выбора условия при отборе по свойствам
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения- форма
// 	ТекущиеДанные - ДанныеФормыЭлементКоллекции - строка таблицы формы
// 	ТаблицаДоступныхСвойств - ТаблицаЗначений - доступные свойства
// 	СтруктураУсловий - Структура - условия
Процедура ОтборПоСвойствамУсловиеНачалоВыбора(
	Форма,
	ТекущиеДанные,
	ТаблицаДоступныхСвойств,
	СтруктураУсловий) Экспорт
	
	СписокВыбора = Форма.Элементы.Условие.СписокВыбора;
	СписокВыбора.Очистить();
	
	СтрокиТаблицыСвойств = 
		ТаблицаДоступныхСвойств.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
		
	Если НЕ ЗначениеЗаполнено(СтрокиТаблицыСвойств) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого КлючИЗначение Из СтруктураУсловий Цикл
		Условие = КлючИЗначение.Значение; // см. ИсследованиеТоваровКлиентСервер.СтруктураУсловияОтбораПоСвойствамНоменклатуры
		Если Условие.Сравнение 
			И НЕ СтрокиТаблицыСвойств[0].ТипЗначения.СодержитТип(Тип("Число"))
			И НЕ СтрокиТаблицыСвойств[0].ТипЗначения.СодержитТип(Тип("Дата"))
		Тогда
			Продолжить;
		КонецЕсли;
		СписокВыбора.Добавить(Условие.Идентификатор, Условие.Представление);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтборПоСвойствамЗначениеИнтервалПриИзменении(ТекущиеДанные, ИмяРеквизита) Экспорт

	ТипЗначенияОтбора = Новый ОписаниеТипов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ТекущиеДанные[ИмяРеквизита])));
	
	Для Индекс = 1 По 2 Цикл
		ТекущиеДанные["Значение"+Индекс] = ТипЗначенияОтбора.ПривестиЗначение(ТекущиеДанные["Значение"+Индекс]);
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает ограничение типа для элемента отбора по свойствам
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения- форма
// 	ТекущиеДанные - ДанныеФормыЭлементКоллекции - строка таблицы формы - из:
// 		* Условие - Строка - идентификатор условия
// 	СтруктураУсловий - Структура - условия
// 	ТипЗначения - ОписаниеТипов - тип значения исходный
// Возвращаемое значение:
// 	ОписаниеТипов - тип значения приведенный
Функция ОтборПоСвойствамУстановитьОграничениеТиповДляЗначения(
	Форма,
	ТекущиеДанные,
	СтруктураУсловий,
	ТипЗначения) Экспорт
	
	ТекущееУсловие = СтруктураУсловий[ТекущиеДанные.Условие]; // см. ИсследованиеТоваровКлиентСервер.СтруктураУсловияОтбораПоСвойствамНоменклатуры
	
	Если ТекущееУсловие.Сравнение Тогда
		ВычитаемыеТипы = Новый Массив;
		Для каждого Тип Из ТипЗначения.Типы() Цикл
			Если НЕ Тип = Тип("Дата") И НЕ Тип = Тип("Число") Тогда
				ВычитаемыеТипы.Добавить(Тип);
			КонецЕсли;
		КонецЦикла;
		ТипЗначенияПриведенный = Новый ОписаниеТипов(ТипЗначения,,ВычитаемыеТипы);
	Иначе
		ТипЗначенияПриведенный = ТипЗначения;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Массив;
	Если ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ТекущиеДанные.Свойство));
	КонецЕсли;
	
	Форма.Элементы.Значение.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	Если ТекущееУсловие.Список Тогда
		Форма.Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
	ИначеЕсли ТекущееУсловие.Интервал Тогда
		Форма.Элементы.Значение1.ОграничениеТипа = ТипЗначенияПриведенный;
		Форма.Элементы.Значение2.ОграничениеТипа = ТипЗначенияПриведенный;
	Иначе
		Форма.Элементы.Значение.ОграничениеТипа  = ТипЗначенияПриведенный;
	КонецЕсли;
	
	Возврат ТипЗначенияПриведенный;
	
КонецФункции

// Производит контроль правильности настройки отбора по свойствам
// 
// Параметры:
// 	ОтборПоСвойствам - ДанныеФормыКоллекция - таблица заданных отборов
// 	ТаблицаДоступныхСвойств - ДанныеФормыКоллекция - таблица свойств
// 	ЕстьОшибки - Булево - признак наличия ошибок
// Возвращаемое значение:
// 	Массив - массив элементов настройки
//
Функция ОтборПоСвойствамПроизвестиКонтрольСформироватьРезультатНастройки(
	ОтборПоСвойствам,
	ТаблицаДоступныхСвойств,
	ЕстьОшибки) Экспорт
	
	ШаблонПолеНеЗаполнено  = НСтр("ru = 'Ошибка заполнения настройки в строке %1.';
									|en = 'An error occurred when filling in settings in line %1.'");
	ШаблонНеверноеСвойство = НСтр("ru = 'Указано неверное свойство в строке %1.';
									|en = 'Incorrect property is specified in line %1.'");
	ШаблонНеверноеУсловие  = НСтр("ru = 'Ошибка заполнения настройки в строке %1. Левое значение не может быть больше правого.';
									|en = 'An error occurred when filling in settings in line %1. The left value cannot be greater than the right one.'");
	ШаблонПутьКДанным      = "ОтборПоСвойствам[%1].%2";
	
	Реквизиты        = РеквизитыНастройкаОтбораПоСвойствам();
	СтруктураУсловий = ИсследованиеТоваровКлиентСервер.СтруктураУсловийОтбораПоСвойствамНоменклатуры();
	
	Результат = Новый Массив;
	
	Для каждого СтрокаОтбора Из ОтборПоСвойствам Цикл
		
		Если ПустаяСтрока(СтрокаОтбора.Условие) Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСтроки = ОтборПоСвойствам.Индекс(СтрокаОтбора);
		
		ТекущееУсловие = СтруктураУсловий[СтрокаОтбора.Условие]; // см. ИсследованиеТоваровКлиентСервер.СтруктураУсловияОтбораПоСвойствамНоменклатуры
		
		Если ТекущееУсловие.Интервал Тогда
			Если СтрокаОтбора.Значение1 <> Неопределено
				И СтрокаОтбора.Значение2 <> Неопределено
				И СтрокаОтбора.Значение1 > СтрокаОтбора.Значение2 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					СтрШаблон(ШаблонНеверноеУсловие,ИндексСтроки+1),,
					СтрШаблон(ШаблонПутьКДанным, ИндексСтроки, "Значение1"),,
					ЕстьОшибки);
				Продолжить;
			КонецЕсли;
			ПоляПроверки = СтрРазделить(СтрЗаменить(Реквизиты,"Значение","Значение1,Значение2"), ",");
		Иначе
			ПоляПроверки = СтрРазделить(Реквизиты, ",");
		КонецЕсли;
		
		Для каждого Поле Из ПоляПроверки Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаОтбора[Поле])
				И НЕ СтрокаОтбора[Поле] = 0 
				И НЕ ТекущееУсловие.Заполненность Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					СтрШаблон(ШаблонПолеНеЗаполнено,ИндексСтроки+1),,
					СтрШаблон(ШаблонПутьКДанным, ИндексСтроки, Поле),,
					ЕстьОшибки);
			ИначеЕсли Поле = "Свойство" 
					И ТаблицаДоступныхСвойств.НайтиСтроки(Новый Структура("Свойство", СтрокаОтбора[Поле])).Количество() = 0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					СтрШаблон(ШаблонНеверноеСвойство,ИндексСтроки+1),,
					СтрШаблон(ШаблонПутьКДанным, ИндексСтроки, Поле),,
					ЕстьОшибки);
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущееУсловие.Список Тогда
			Для каждого ЭлементСписка Из СтрокаОтбора.Значение Цикл
				ЭлементНастройкиУсловия = Новый Структура(Реквизиты);
				ЗаполнитьЗначенияСвойств(ЭлементНастройкиУсловия, СтрокаОтбора);
				ЭлементНастройкиУсловия.Значение = ЭлементСписка.Значение;
				Результат.Добавить(ЭлементНастройкиУсловия);
			КонецЦикла;
		ИначеЕсли ТекущееУсловие.Интервал Тогда
			ЭлементНастройкиУсловия = Новый Структура(Реквизиты);
			ЭлементНастройкиУсловия.Свойство = СтрокаОтбора.Свойство;
			ЭлементНастройкиУсловия.Условие  = ?(ТекущееУсловие.Идентификатор = "ВИнтервале", "Больше", "БольшеИлиРавно");
			ЭлементНастройкиУсловия.Значение = СтрокаОтбора.Значение1;
			Результат.Добавить(ЭлементНастройкиУсловия);
			
			ЭлементНастройкиУсловия = Новый Структура(Реквизиты);
			ЭлементНастройкиУсловия.Свойство = СтрокаОтбора.Свойство;
			ЭлементНастройкиУсловия.Условие  = ?(ТекущееУсловие.Идентификатор = "ВИнтервале", "Меньше", "МеньшеИлиРавно");
			ЭлементНастройкиУсловия.Значение = СтрокаОтбора.Значение2;
			Результат.Добавить(ЭлементНастройкиУсловия);
		Иначе
			ЭлементНастройкиУсловия = Новый Структура(Реквизиты);
			ЗаполнитьЗначенияСвойств(ЭлементНастройкиУсловия, СтрокаОтбора);
			Результат.Добавить(ЭлементНастройкиУсловия);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает реквизиты, используемые для настройки отбора по свойствам.
//
// Возвращаемое значение:
//   Строка - список реквизитов для настройки отбора по свойствам, разделенных запятой
Функция РеквизитыНастройкаОтбораПоСвойствам() Экспорт
	
	Возврат "Свойство,Условие,Значение";
	
КонецФункции

// Возвращает список реквизитов, используемых для отбора по свойствам.
//
// Возвращаемое значение:
//   Строка - список реквизитов, разделенных запятыми
Функция РеквизитыОтбораПоСвойствам() Экспорт
	
	Возврат "КлючСвязи,Свойство,Условие,Значение";
	
КонецФункции

// Возвращает список реквизитов, используемых для назначения исследований.
//
// Возвращаемое значение:
//   Строка - список реквизитов, разделенных запятыми
Функция РеквизитыСтрокиТоваровЗаявкиНаКонтрольКачества() Экспорт
	
	Возврат "НомерСтроки,Номенклатура,Характеристика,ВидНоменклатуры,ЕдиницаИзмерения,Склад,Назначение,Серия,Упаковка,Количество,КоличествоУпаковок,КонтролируемаяПартия";
	
КонецФункции

#КонецОбласти

#Область СписокНоменклатуры

// Возвращает список реквизитов, используемых при настройки списка номенклатуры.
//
// Возвращаемое значение:
//   Строка - список реквизитов, разделенных запятыми
Функция РеквизитыНастройкаСписокНоменклатуры() Экспорт
	
	Возврат "Номенклатура,Характеристика,ВидНоменклатуры";
	
КонецФункции

#КонецОбласти

#КонецОбласти
