
&После("Печать")
Процедура Разр_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если МассивОбъектов = Неопределено
		Или МассивОбъектов.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;

	СсылкаДокумента = МассивОбъектов[0];

	Если ТипЗнч(СсылкаДокумента) <> Тип("ДокументСсылка.ПроизводственнаяОперация2_2") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл

		Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		// Только пользовательские макеты конструктора вида ПФ_<uuid>.
		// Обычные макеты документа уже обрабатываются кодом менеджера документа.
		Если Не ЗначениеЗаполнено(ПечатнаяФорма.ПолныйПутьКМакету)
			Или Не СтрНачинаетсяС(ПечатнаяФорма.ПолныйПутьКМакету, "ПФ_") Тогда
			Продолжить;
		КонецЕсли;

		Разр_ЗаполнитьШтрихкодВТабличномДокументе(
			ПечатнаяФорма.ТабличныйДокумент,
			СсылкаДокумента);

	КонецЦикла;
КонецПроцедуры

Процедура Разр_ЗаполнитьШтрихкодВТабличномДокументе(ТабличныйДокумент, СсылкаДокумента)

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШтрихкодированиеПечатныхФормОбъектов") Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	РисунокКвадрат = Эталон.Рисунки.Квадрат100Пикселей;
	КоличествоМиллиметровВПикселе = РисунокКвадрат.Высота / 100;

	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл

		Если Рисунок.Имя <> "КартинкаШтрихкода" Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
		ПараметрыШтрихкода.Ширина           = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШтрихкода.Высота           = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе);
		ПараметрыШтрихкода.Штрихкод         = СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(СсылкаДокумента));
		ПараметрыШтрихкода.ТипВходныхДанных = 0; // Строка
		ПараметрыШтрихкода.ТипКода          = 4; // Code128
		ПараметрыШтрихкода.ОтображатьТекст  = Ложь;
		ПараметрыШтрихкода.РазмерШрифта     = 6;
		ПараметрыШтрихкода.Масштабировать   = Истина;

		Рисунок.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;

	КонецЦикла;

КонецПроцедуры
