#Область ПрограммныйИнтерфейс

// Рассчитать детализацию продукции.
// 
// Параметры:
//  ПараметрыЗапуска - Структура - Параметры запуска:
// * НачалоПериода - Дата - 
// * МассивОрганизаций - Массив из СправочникСсылка.Организации - 
// * МестоВызоваРасчета - Строка - 
// * ВыполняетсяЗакрытиеМесяца - Булево - 
// * АвтоматическоеТестирование - Булево -
// * РежимЗакрытияМесяца - ПеречислениеСсылка.РежимыЗакрытияМесяца - 
// * ИдентификаторРасчета - УникальныйИдентификатор - 
// * ТолькоОднаОрганизация - Булево -
// 
Процедура РассчитатьДетализациюПродукции(ПараметрыЗапуска) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапуска.МассивОрганизаций) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = ИнициализироватьПараметрыРасчета(ПараметрыЗапуска);
	
	Запрос = Новый Запрос;
	ИнициализироватьПараметрыЗапроса(ПараметрыРасчета, Запрос);
	
	#Область ОстаткиНЗП_НачальныеПартииКРасчету
	
	// Временные таблицы:
	// ВТОрганизацииПрошлыхПериодов
	// ВТОстаткиПартийНЗП
	// ВТПартииКРасчетуПредварительная - информация о проданных, выпущенных, использованных в производстве ПФ и ГП
	// ВТПартииКРасчету - свернутая ВТПартииКРасчетуПредварительная с признаком БезДетализации (отсутствуют записи в регистре детализаций в прошлых периодах)
	// ВТОтборПартии
	// ВТПартииПолуфабрикатовПрошлыхПериодов
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Организация
	|ПОМЕСТИТЬ ВТОрганизацииПрошлыхПериодов
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК Т
	|ГДЕ
	|	Т.Организация В (&МассивОрганизаций)
	|	И Т.ПериодРегистрации < &НачалоПериода
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Партия КАК Партия,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.АналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости) КАК НДСВключенВСтоимость,
	|	Т.СтоимостьУпрОстаток + Т.ПостатейныеПостоянныеУпрОстаток + Т.ПостатейныеПеременныеУпрОстаток КАК СтоимостьУпр,
	|	Т.СтоимостьРеглОстаток + Т.ПостатейныеПостоянныеРеглОстаток + Т.ПостатейныеПеременныеРеглОстаток КАК СтоимостьРегл,
	|	Т.ПостояннаяРазницаОстаток КАК ПостояннаяРазница,
	|	Т.ВременнаяРазницаОстаток КАК ВременнаяРазница,
	|	Т.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПартийНЗП
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаКонецПредыдущегоПериода,
	|		РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|		И ТИПЗНАЧЕНИЯ(Партия) = ТИП(Справочник.ПартииПроизводства)
	|		И Организация В(&МассивОрганизаций)
	|		И НЕ (Организация В (ВЫБРАТЬ Отбор.Организация ИЗ ВТОрганизацииПрошлыхПериодов КАК Отбор))) КАК Т
	|ГДЕ
	|	Т.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Продажа ПФ и ГП
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаУчетаПоПартнерам.Организация КАК Организация
	// Шаг 1.1
	|ПОМЕСТИТЬ ВТПартииКРасчетуПредварительная
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.АналитикаУчетаПоПартнерам.Организация В(&МассивОрганизаций)
	|	И ТИПЗНАЧЕНИЯ(Т.Партия) В (&ТипыДокументовПартии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Выпуск ПФ и ГП
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация
	// Шаг 1.2
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Т.Регистратор = Т.Партия
	|	И ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовПартии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Потребление ПФ на выпуск
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Т.Партия) В (&ТипыДокументовПартии)
	|	И ТИПЗНАЧЕНИЯ(Т.КорПартия) = ТИП(Справочник.ПартииПроизводства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация,
	|	МАКСИМУМ((ПрошлыеПартии.Партия ЕСТЬ NULL)) КАК БезДетализации,
	|	МАКСИМУМ((ЕСТЬNULL(ПрошлыеПартии.НДСРегл, 0) <> 0 ИЛИ ЕСТЬNULL(ПрошлыеПартии.НДСУпр, 0) <> 0)) КАК ЕстьНДС
	// Шаг 1.3
	|ПОМЕСТИТЬ ВТПартииКРасчету
	|ИЗ
	|	ВТПартииКРасчетуПредварительная КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК ПрошлыеПартии
	|		ПО Т.Партия = ПрошлыеПартии.Партия
	|			И Т.АналитикаУчетаПартий = ПрошлыеПартии.АналитикаУчетаПартий
	|			И Т.Организация = ПрошлыеПартии.Организация
	|			И ПрошлыеПартии.ПериодРегистрации < &НачалоПериода
	|			И ПрошлыеПартии.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|ГДЕ
	|	Т.Партия <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Т.Партия КАК Партия
	|ПОМЕСТИТЬ ВТОтборПартии
	|ИЗ
	|	ВТПартииКРасчету КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация,
	|	ЛОЖЬ КАК БезДетализации,
	|	ЛОЖЬ КАК ЕстьНДС
	|ПОМЕСТИТЬ ВТПартииПолуфабрикатовПрошлыхПериодов
	|ИЗ
	|	ВТПартииКРасчету КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
		"ВТОрганизацииПрошлыхПериодов, ВТПартииКРасчетуПредварительная");
	
	#КонецОбласти
	
	#Область РекурсивныйРасчетПартииПолуфабрикатовПрошлыхПериодов

	// Временные таблицы:
	// ВТПартииПроизводстваПрошлыхПериодов
	// ВТПартииПолуфабрикатовПрошлыхПериодовПредварительная
	// ВТНовыеПартииПолуфабрикатовПрошлыхПериодов
	// ВТПартииПолуфабрикатовПрошлыхПериодов (добавление)
	// ВТОтборПартии
	
	Запрос.УстановитьПараметр("ПерваяИтерация", Истина);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Отбор.ЭтоОстаток,
	|	Т.Партия КАК Партия
	// Шаг 2.1
	|ПОМЕСТИТЬ ВТПартииПроизводстваПрошлыхПериодов
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартии КАК Отбор
	|		ПО Т.Регистратор = Отбор.Партия
	|ГДЕ
	|	Т.Период < &НачалоПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Т.Партия) = ТИП(Справочник.ПартииПроизводства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ЭтоОстаток,
	|	Т.Партия КАК Партия
	|ИЗ
	|	ВТОстаткиПартийНЗП КАК Т
	|ГДЕ
	|	&ПерваяИтерация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Отбор.ЭтоОстаток,
	|	Т.КорПартия КАК Партия,
	|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация
	// Шаг 2.2
	|ПОМЕСТИТЬ ВТПартииПолуфабрикатовПрошлыхПериодовПредварительная
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииПроизводстваПрошлыхПериодов КАК Отбор
	|		ПО Т.Партия = Отбор.Партия
	|ГДЕ
	|	Т.Период < &НачалоПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Т.КорПартия) В (&ТипыДокументовПартии)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация,
	|	МАКСИМУМ((ПрошлыеПартии.Партия ЕСТЬ NULL)) КАК БезДетализации,
	|	МАКСИМУМ((ЕСТЬNULL(ПрошлыеПартии.НДСРегл, 0) <> 0 ИЛИ ЕСТЬNULL(ПрошлыеПартии.НДСУпр, 0) <> 0)) КАК ЕстьНДС
	// Шаг 2.3
	|ПОМЕСТИТЬ ВТНовыеПартииПолуфабрикатовПрошлыхПериодов
	|ИЗ
	|	ВТПартииПолуфабрикатовПрошлыхПериодовПредварительная КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК ПрошлыеПартии
	|		ПО Т.Партия = ПрошлыеПартии.Партия
	|			И Т.АналитикаУчетаПартий = ПрошлыеПартии.АналитикаУчетаПартий
	|			И Т.Организация = ПрошлыеПартии.Организация
	|			И ПрошлыеПартии.ПериодРегистрации < &НачалоПериода
	|			И ПрошлыеПартии.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииПолуфабрикатовПрошлыхПериодов КАК ПартииПолуфабрикатов
	|		ПО Т.Партия = ПартииПолуфабрикатов.Партия
	|			И Т.АналитикаУчетаПартий = ПартииПолуфабрикатов.АналитикаУчетаПартий
	|			И Т.Организация = ПартииПолуфабрикатов.Организация
	|			И Т.ЭтоОстаток = ПартииПолуфабрикатов.ЭтоОстаток
	|ГДЕ
	|	ПартииПолуфабрикатов.Партия ЕСТЬ NULL
	|	И Т.Партия <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток КАК ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.БезДетализации КАК БезДетализации,
	|	Т.ЕстьНДС КАК ЕстьНДС
	|ДОБАВИТЬ ВТПартииПолуфабрикатовПрошлыхПериодов
	|ИЗ
	|	ВТНовыеПартииПолуфабрикатовПрошлыхПериодов КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтборПартии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Отбор.ЭтоОстаток,
	|	Т.Партия КАК Партия
	|ПОМЕСТИТЬ ВТОтборПартии
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНовыеПартииПолуфабрикатовПрошлыхПериодов КАК Отбор
	|		ПО Т.Регистратор = Отбор.Партия
	|ГДЕ
	|	Т.Период < &НачалоПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовПартии)
	|	И ТИПЗНАЧЕНИЯ(Т.Партия) В (&ТипыДокументовПартии)
	|	И ТИПЗНАЧЕНИЯ(Т.КорПартия) = ТИП(Справочник.ПартииПроизводства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ИЗ
	|	ВТОтборПартии КАК Т
	|";
	
	ВыбиратьПартииПрошлыхПериодов = Истина;
	
	// Шаг 2.4
	Пока ВыбиратьПартииПрошлыхПериодов Цикл
		
		ПараметрыРасчета.ИтерацийПартииПрошлыхПериодов = ПараметрыРасчета.ИтерацийПартииПрошлыхПериодов + 1;
		Пояснение = НСтр("ru = 'Итерация поиска партий прошлых периодов';
						|en = 'Итерация поиска партий прошлых периодов'", ОбщегоНазначения.КодОсновногоЯзыка()) + ":"
			+ СокрЛП(ПараметрыРасчета.ИтерацийПартииПрошлыхПериодов);
			
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина, Пояснение);
		ВыбиратьПартииПрошлыхПериодов = НЕ РезультатЗапроса.Пустой();
		
		Запрос.УстановитьПараметр("ПерваяИтерация", Ложь);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
			"ВТПартииПроизводстваПрошлыхПериодов, ВТПартииПолуфабрикатовПрошлыхПериодовПредварительная,
			|ВТНовыеПартииПолуфабрикатовПрошлыхПериодов" + ?(ВыбиратьПартииПрошлыхПериодов, "", "," + "ВТОтборПартии"));
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ПартииКРасчету_НачальныеИзменениеВидаДеятельностиНДС
	
	// Временные таблицы:
	// ВТПартииКРасчетуДополненная
	// ВТПартииКРасчету
	// ВТИзменениеВидаДеятельностиНДС
	// ВТНовыеПартииНДС

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.БезДетализации,
	|	Т.ЕстьНДС
	// Шаг 2.5
	|ПОМЕСТИТЬ ВТПартииКРасчетуДополненная
	|ИЗ
	|	ВТПартииКРасчету КАК Т
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.БезДетализации,
	|	Т.ЕстьНДС
	|ИЗ
	|	ВТПартииПолуфабрикатовПрошлыхПериодов КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПартииКРасчету
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Себестоимость.ВидЗапасов КАК ВидЗапасов,
	|	Т.БезДетализации,
	|	Т.ЕстьНДС,
	|	МАКСИМУМ(Себестоимость.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)) КАК НДСВключенВСтоимость,
	|	СУММА(Себестоимость.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТПартииКРасчету
	|ИЗ
	|	ВТПартииКРасчетуДополненная КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|		ПО Т.Партия = Себестоимость.Регистратор
	|		 И Т.Партия = Себестоимость.Партия
	|		 И Т.АналитикаУчетаПартий = Себестоимость.АналитикаУчетаПартий
	|		 И Т.Организация = Себестоимость.Организация
	|		 И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		 И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|		 И Себестоимость.Количество <> 0
	|		 И Себестоимость.Период <= &КонецПериода
	|		 И (НЕ Т.ЭтоОстаток
	|			ИЛИ Себестоимость.Период < &НачалоПериода)
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика,
	|	Себестоимость.ВидЗапасов,
	|	Т.БезДетализации,
	|	Т.ЕстьНДС
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Продажа ПФ и ГП
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ПартииКРасчету.БезДетализации, // нет записей в регистрах детализации продукции
	|	ПартииКРасчету.ЕстьНДС, // есть записи с суммами НДС в регистрах детализации продукции; если БезДетализации = Истина, то ЕстьНДС всегда Ложь
	|	ИСТИНА КАК ЕстьИзменениеВидаДеятельностиНДС // есть разные виды деятельности НДС и нет записей с суммами НДС в регистрах детализации продукции 
	// Шаг 1.1
	|ПОМЕСТИТЬ ВТИзменениеВидаДеятельностиНДС
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК ПартииКРасчету
	|		ПО Т.Партия = ПартииКРасчету.Партия
	|		 И Т.АналитикаУчетаПартий = ПартииКРасчету.АналитикаУчетаПартий
	|		 И НЕ ПартииКРасчету.ЭтоОстаток
	|ГДЕ
	|	Т.Период <= &КонецПериода
	|	И Т.АналитикаУчетаПоПартнерам.Организация В(&МассивОрганизаций)
	|	И ПартииКРасчету.НДСВключенВСтоимость <> (Т.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости))
	|
	|ОБЪЕДИНИТЬ
	|
	// Потребление ПФ на выпуск
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	ПартииКРасчету.БезДетализации, // нет записей в регистрах детализации продукции
	|	ПартииКРасчету.ЕстьНДС, // есть записи с суммами НДС в регистрах детализации продукции; если БезДетализации = Истина, то ЕстьНДС всегда Ложь
	|	ИСТИНА КАК ЕстьИзменениеВидаДеятельностиНДС // есть разные виды деятельности НДС и нет записей с суммами НДС в регистрах детализации продукции 
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК ПартииКРасчету
	|		ПО Т.Партия = ПартииКРасчету.Партия
	|		 И Т.АналитикаУчетаПартий = ПартииКРасчету.АналитикаУчетаПартий
	|		 И НЕ ПартииКРасчету.ЭтоОстаток
	|ГДЕ
	|	Т.Период <= &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Т.КорПартия) = ТИП(Справочник.ПартииПроизводства)
	|	И ПартииКРасчету.НДСВключенВСтоимость <> (Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости))
	|
	|ОБЪЕДИНИТЬ
	|
	// Остатки в НЗП
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.БезДетализации, // нет записей в регистрах детализации продукции
	|	Т.ЕстьНДС, // есть записи с суммами НДС в регистрах детализации продукции; если БезДетализации = Истина, то ЕстьНДС всегда Ложь
	|	ИСТИНА КАК ЕстьИзменениеВидаДеятельностиНДС // есть разные виды деятельности НДС и нет записей с суммами НДС в регистрах детализации продукции 
	|ИЗ
	|	ВТПартииКРасчету КАК Т
	|ГДЕ
	|	Т.ЭтоОстаток
	|
	|ОБЪЕДИНИТЬ
	|
	// Остатки в НЗП, партии производства
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ЭтоОстаток,
	|	Т.Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	ИСТИНА КАК БезДетализации, // нет записей в регистрах детализации продукции
	|	ЛОЖЬ КАК ЕстьНДС, // есть записи с суммами НДС в регистрах детализации продукции; если БезДетализации = Истина, то ЕстьНДС всегда Ложь
	|	ИСТИНА КАК ЕстьИзменениеВидаДеятельностиНДС // есть разные виды деятельности НДС и нет записей с суммами НДС в регистрах детализации продукции 
	|ИЗ
	|	ВТОстаткиПартийНЗП КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.БезДетализации КАК БезДетализации,
	|	Т.ЕстьНДС КАК ЕстьНДС
	|ПОМЕСТИТЬ ВТНовыеПартииНДС
	|ИЗ
	|	ВТИзменениеВидаДеятельностиНДС КАК Т
	|ГДЕ
	|	НЕ Т.ЭтоОстаток
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
		"ВТПартииПолуфабрикатовПрошлыхПериодов, ВТПартииКРасчетуДополненная");
	
	#КонецОбласти

	#Область РекурсивныйРасчетИзменениеВидаДеятельностиНДС
	
	// Временные таблицы:
	// ВТНовыеПартииНДСПредварительная
	// ВТНовыеПартииНДС
	// ВТИзменениеВидаДеятельностиНДС (добавление)
	
	Запрос.УстановитьПараметр("ПерваяИтерация", Истина);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартииЗатрат.Партия КАК Партия,
	|	ПартииЗатрат.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ПартииЗатрат.Организация
	|ПОМЕСТИТЬ ВТНовыеПартииНДСПредварительная
	|ИЗ
	|	ВТНовыеПартииНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ЗатратыНаВыпуск
	|		ПО Т.Партия = ЗатратыНаВыпуск.Регистратор
	|		 И Т.Партия = ЗатратыНаВыпуск.КорПартия
	|		 И Т.АналитикаУчетаПартий = ЗатратыНаВыпуск.КорАналитикаУчетаПартий
	|		 И Т.Организация = ЗатратыНаВыпуск.Организация
	|		 И ТИПЗНАЧЕНИЯ(ЗатратыНаВыпуск.Партия) = ТИП(Справочник.ПартииПроизводства)
	|		 И ЗатратыНаВыпуск.Период <= &КонецПериода
	|		 И ЗатратыНаВыпуск.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		 И ЗатратыНаВыпуск.Количество <> 0
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ПартииЗатрат
	|		ПО ПартииЗатрат.Регистратор = ЗатратыНаВыпуск.Регистратор
	|		 И ПартииЗатрат.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатрат.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатрат.КорАналитикаУчетаНоменклатуры = ЗатратыНаВыпуск.АналитикаУчетаНоменклатуры
	|		 И ПартииЗатрат.КорВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ТИПЗНАЧЕНИЯ(ПартииЗатрат.Партия) В (&ТипыДокументовПартии)
	|		 И ПартииЗатрат.Период <= &КонецПериода
	|		 И ПартииЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		 И ПартииЗатрат.Количество <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНовыеПартииНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	ПартииКРасчету.БезДетализации КАК БезДетализации,
	|	ПартииКРасчету.ЕстьНДС КАК ЕстьНДС
	|ПОМЕСТИТЬ ВТНовыеПартииНДС
	|ИЗ
	|	ВТНовыеПартииНДСПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК ПартииНДС
	|		ПО Т.Партия = ПартииНДС.Партия
	|		И Т.АналитикаУчетаПартий = ПартииНДС.АналитикаУчетаПартий
	|		И Т.Организация = ПартииНДС.Организация
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК ПартииКРасчету
	|		ПО Т.Партия = ПартииКРасчету.Партия
	|		И Т.АналитикаУчетаПартий = ПартииКРасчету.АналитикаУчетаПартий
	|		И Т.Организация = ПартииКРасчету.Организация
	|ГДЕ
	|	ПартииНДС.Партия ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.БезДетализации КАК БезДетализации,
	|	Т.ЕстьНДС КАК ЕстьНДС,
	|	ЛОЖЬ КАК ЕстьИзменениеВидаДеятельностиНДС
	|ДОБАВИТЬ ВТИзменениеВидаДеятельностиНДС
	|ИЗ
	|	ВТНовыеПартииНДС КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ИЗ
	|	ВТНовыеПартииНДС КАК Т
	|";
	
	ВыбиратьПартииПолуфабрикатов = Истина;
	
	// Шаг 2.4
	Пока ВыбиратьПартииПолуфабрикатов Цикл
		
		ПараметрыРасчета.ИтерацийИзменениеВидаДеятельностиНДС = ПараметрыРасчета.ИтерацийИзменениеВидаДеятельностиНДС + 1;
		Пояснение = НСтр("ru = 'Итерация поиска изменения вида деятельности НДС';
						|en = 'Итерация поиска изменения вида деятельности НДС'", ОбщегоНазначения.КодОсновногоЯзыка()) + ":"
			+ СокрЛП(ПараметрыРасчета.ИтерацийИзменениеВидаДеятельностиНДС);
		
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина, Пояснение);
		ВыбиратьПартииПолуфабрикатов = НЕ РезультатЗапроса.Пустой();
		
		Запрос.УстановитьПараметр("ПерваяИтерация", Ложь);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
			"ВТНовыеПартииНДСПредварительная" + ?(ВыбиратьПартииПолуфабрикатов, "", "," + "ВТНовыеПартииНДС"));
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ДетализацияНЗП_ЗатратыНаВыпуск_ПартииЗатрат_НачальныеПартииДетализация
	
	// Временные таблицы:
	// ВТОтборПартииНЗП
	// ВТДетализацияНЗППредварительная
	// ВТДетализацияНЗП
	// ВТЗатратыНаВыпускПредварительная
	// ВТЗатратыНаВыпуск
	// ВТПартииПроизводстваИзЗатратНаВыпускПредварительная
	// ВТПартииПроизводстваИзЗатратНаВыпуск
	// ВТОтборЗатратыНаВыпуск
	// ВТПартииЗатратПредварительная
	// ВТПартииЗатратБезНДС
	// ВТПартииЗатратИтоги
	// ВТПартииЗатратДляНДС
	// ВТПартииЗатратЦеныНДС
	// ВТПартииЗатрат
	// ВТПартииЗатратПрошлыхПериодов
	// ВТВсеПартииПроизводства
	// ВТПартииЗатратСводно
	// ВТЗатратыНаВыпускСводно
	// ВТПартииДетализация (результат расчета)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий,
	|	(НЕ ИзменениеВидаДеятельностиНДС.Партия ЕСТЬ NULL) КАК ВыбиратьСуммыНДС
	|ПОМЕСТИТЬ ВТОтборПартииНЗП
	|ИЗ
	|	ВТПартииКРасчету КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК ИзменениеВидаДеятельностиНДС
	|		ПО Т.Партия = ИзменениеВидаДеятельностиНДС.Партия
	|		И Т.АналитикаУчетаПартий = ИзменениеВидаДеятельностиНДС.АналитикаУчетаПартий
	|		И Т.Организация = ИзменениеВидаДеятельностиНДС.Организация
	|		И Т.ЭтоОстаток = ИзменениеВидаДеятельностиНДС.ЭтоОстаток
	|ГДЕ
	|	Т.БезДетализации И НЕ Т.ЕстьНДС
	|	ИЛИ НЕ ИзменениеВидаДеятельностиНДС.Партия ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Трудозатраты.Регистратор КАК Регистратор,
	|	Трудозатраты.ПартияПроизводства КАК Партия,
	|	Трудозатраты.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Трудозатраты.Организация КАК Организация,
	|	Трудозатраты.КорАналитикаУчетаПродукции.Номенклатура КАК Номенклатура,
	|	Трудозатраты.КорАналитикаУчетаПродукции.Характеристика КАК Характеристика,
	|	Трудозатраты.КорВидЗапасовПродукции КАК ВидЗапасов,
	|	Трудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	ЛОЖЬ КАК ВыбиратьСуммыНДС,
	|	Трудозатраты.Стоимость КАК СтоимостьУпр,
	|	Трудозатраты.СтоимостьРегл КАК СтоимостьРегл,
	|	Трудозатраты.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Трудозатраты.ВременнаяРазница КАК ВременнаяРазница
	// Шаг 4
	|ПОМЕСТИТЬ ВТДетализацияНЗППредварительная
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК Трудозатраты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартииНЗП КАК Т
	|		ПО Т.Партия = Трудозатраты.Регистратор
	|		И Т.АналитикаУчетаПартий = Трудозатраты.КорАналитикаУчетаПартий
	|ГДЕ
	|	Трудозатраты.Организация В(&МассивОрганизаций)
	|	И Трудозатраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ Трудозатраты.Сторно
	|	И Трудозатраты.Период <= &КонецПериода
	|	И (НЕ Т.ЭтоОстаток
	|		ИЛИ Трудозатраты.Период < &НачалоПериода)
	|	И (Трудозатраты.Стоимость <> 0
	|		ИЛИ Трудозатраты.СтоимостьРегл <> 0
	|		ИЛИ Трудозатраты.ПостояннаяРазница <> 0
	|		ИЛИ Трудозатраты.ВременнаяРазница <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	ПрочиеРасходы.Регистратор КАК Регистратор,
	|	ПрочиеРасходы.ПартияПроизводства КАК Партия,
	|	ПрочиеРасходы.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаУчетаПродукции.Номенклатура КАК Номенклатура,
	|	ПрочиеРасходы.АналитикаУчетаПродукции.Характеристика КАК Характеристика,
	|	ПрочиеРасходы.ВидЗапасов КАК ВидЗапасов,
	|	ПрочиеРасходы.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.ВыбиратьСуммыНДС,
	|	СУММА(ПрочиеРасходы.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ПрочиеРасходы.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ПрочиеРасходы.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ПрочиеРасходы.ВременнаяРазница) КАК ВременнаяРазница
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартииНЗП КАК Т
	|		ПО Т.Партия = ПрочиеРасходы.Регистратор
	|		И Т.АналитикаУчетаПартий = ПрочиеРасходы.КорАналитикаУчетаПартий
	|ГДЕ
	|	ПрочиеРасходы.Организация В(&МассивОрганизаций)
	|	И ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ ПрочиеРасходы.Сторно
	|	И ПрочиеРасходы.Период <= &КонецПериода
	|	И (НЕ Т.ЭтоОстаток
	|		ИЛИ ПрочиеРасходы.Период < &НачалоПериода)
	|	И (ПрочиеРасходы.СтоимостьУпр <> 0
	|		ИЛИ ПрочиеРасходы.СтоимостьРегл <> 0
	|		ИЛИ ПрочиеРасходы.ПостояннаяРазница <> 0
	|		ИЛИ ПрочиеРасходы.ВременнаяРазница <> 0)
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	ПрочиеРасходы.Регистратор,
	|	ПрочиеРасходы.ПартияПроизводства,
	|	ПрочиеРасходы.КорАналитикаУчетаПартий,
	|	ПрочиеРасходы.Организация,
	|	ПрочиеРасходы.АналитикаУчетаПродукции.Номенклатура,
	|	ПрочиеРасходы.АналитикаУчетаПродукции.Характеристика,
	|	ПрочиеРасходы.ВидЗапасов,
	|	ПрочиеРасходы.СтатьяКалькуляции,
	|	ПрочиеРасходы.СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов,
	|	Т.ВыбиратьСуммыНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.Регистратор КАК ПартияВыпуска,
	|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартийВыпуска,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр
	|ПОМЕСТИТЬ ВТДетализацияНЗП
	|ИЗ
	|	ВТДетализацияНЗППредварительная КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.Регистратор,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.Регистратор КАК ПартияВыпуска,
	|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартийВыпуска,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	ПартииНДС.ДокументПоступления,
	|	0 КАК СтоимостьУпр,
	|	0 КАК СтоимостьРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(ПартииНДС.НДС) КАК НДСРегл,
	|	СУММА(ПартииНДС.НДСУпр) КАК НДСУпр
	|ИЗ
	|	ВТДетализацияНЗППредварительная КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП КАК ПартииНДС
	|		ПО Т.Регистратор = ПартииНДС.ДокументДвижения
	|		И Т.СтатьяРасходов = ПартииНДС.СтатьяРасходов
	|		И Т.АналитикаРасходов = ПартииНДС.АналитикаРасходов
	|		И Т.Организация = ПартииНДС.Организация
	|		И Т.Партия = ПартииНДС.Партия
	|		И Т.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|		И Т.ВыбиратьСуммыНДС
	|		И ПартииНДС.Период <= &КонецПериода
	|		И (НЕ Т.ЭтоОстаток
	|			ИЛИ ПартииНДС.Период < &НачалоПериода)
	|		И (ПартииНДС.НДС <> 0
	|			ИЛИ ПартииНДС.НДСУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.Регистратор,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	ПартииНДС.ДокументПоступления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Себестоимость.Партия КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Себестоимость.Организация КАК Организация,
	|	Себестоимость.ВидЗапасов КАК ВидЗапасов,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Себестоимость.КорПартия КАК КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры.Номенклатура КАК КорНоменклатура,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры.Характеристика КАК КорХарактеристика,
	|	Себестоимость.КорВидЗапасов КАК КорВидЗапасов,
	|	Себестоимость.АналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	МАКСИМУМ(Себестоимость.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)) КАК НДСВключенВСтоимость,
	|	СУММА(Себестоимость.СтоимостьУпр + Себестоимость.ПостатейныеПостоянныеУпр + Себестоимость.ПостатейныеПеременныеУпр) КАК СтоимостьУпр,
	|	СУММА(Себестоимость.СтоимостьРегл + Себестоимость.ПостатейныеПостоянныеРегл + Себестоимость.ПостатейныеПеременныеРегл) КАК СтоимостьРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Себестоимость.Количество) КАК Количество,
	|	Т.Количество КАК КоличествоВыпуск
	// Шаг 5
	|ПОМЕСТИТЬ ВТЗатратыНаВыпускПредварительная
	|ИЗ
	|	ВТПартииКРасчету КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|		ПО Т.Партия = Себестоимость.Регистратор
	|		 И Т.Партия = Себестоимость.КорПартия
	|	  	 И Т.АналитикаУчетаПартий = Себестоимость.КорАналитикаУчетаПартий
	|	  	 И Т.Номенклатура = Себестоимость.КорАналитикаУчетаНоменклатуры.Номенклатура
	|	  	 И Т.Характеристика = Себестоимость.КорАналитикаУчетаНоменклатуры.Характеристика
	|	  	 И Т.ВидЗапасов = Себестоимость.КорВидЗапасов
	|ГДЕ
	|	Себестоимость.Организация В(&МассивОрганизаций)
	|	И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Себестоимость.Партия) = ТИП(Справочник.ПартииПроизводства)
	|	И Себестоимость.Период <= &КонецПериода
	|	И (НЕ Т.ЭтоОстаток
	|		ИЛИ Себестоимость.Период < &НачалоПериода)
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий,
	|	Себестоимость.Организация,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика,
	|	Себестоимость.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры.Номенклатура,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры.Характеристика,
	|	Себестоимость.КорВидЗапасов,
	|	Т.Количество
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗатратыНаВыпуск,
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.КорПартия КАК КорПартия,
	|	Т.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура КАК КорНоменклатура,
	|	Т.КорХарактеристика КАК КорХарактеристика,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.Количество,
	|	Т.КоличествоВыпуск
	|ПОМЕСТИТЬ ВТЗатратыНаВыпуск
	|ИЗ
	|(ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.КорПартия КАК КорПартия,
	|	Т.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура КАК КорНоменклатура,
	|	Т.КорХарактеристика КАК КорХарактеристика,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.Количество,
	|	Т.КоличествоВыпуск
	|ИЗ
	|	ВТЗатратыНаВыпускПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПартийНЗП КАК Остатки
	|		ПО Т.Партия = Остатки.Партия
	|		 И Т.Номенклатура = Остатки.Номенклатура
	|	  	 И Т.Характеристика = Остатки.Характеристика
	|	  	 И Т.ВидЗапасов = Остатки.ВидЗапасов
	|	  	 И Т.Организация = Остатки.Организация
	|	  	 И Т.СтатьяКалькуляции = Остатки.СтатьяКалькуляции
	|		 И Т.ЭтоОстаток
	|ГДЕ
	|	Остатки.Партия ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Партия КАК КорПартия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
	|	Т.Номенклатура КАК КорНоменклатура,
	|	Т.Характеристика КАК КорХарактеристика,
	|	Т.ВидЗапасов КАК КорВидЗапасов,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.Количество,
	|	Т.Количество КАК КоличествоВыпуск
	|ИЗ
	|	ВТОстаткиПартийНЗП КАК Т
	|) КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия, // партия производства
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура,
	|	Т.КорХарактеристика,
	|	Т.КорВидЗапасов,
	|	МАКСИМУМ(Т.НДСВключенВСтоимость) КАК НДСВключенВСтоимость,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТПартииПроизводстваИзЗатратНаВыпускПредварительная
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия, // партия производства
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура,
	|	Т.КорХарактеристика,
	|	Т.КорВидЗапасов
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия, // партия производства
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура,
	|	Т.КорХарактеристика,
	|	Т.КорВидЗапасов,
	|	Т.НДСВключенВСтоимость,
	|	МАКСИМУМ((ПрошлыеПартии.Партия ЕСТЬ NULL)) КАК БезДетализации,
	|	МАКСИМУМ((ЕСТЬNULL(ПрошлыеПартии.НДСРегл, 0) <> 0 ИЛИ ЕСТЬNULL(ПрошлыеПартии.НДСУпр, 0) <> 0)) КАК ЕстьНДС,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТПартииПроизводстваИзЗатратНаВыпуск
	|ИЗ
	|	ВТПартииПроизводстваИзЗатратНаВыпускПредварительная КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК ПрошлыеПартии
	|		ПО Т.Партия = ПрошлыеПартии.Партия
	|			И Т.Организация = ПрошлыеПартии.Организация
	|			И ПрошлыеПартии.Количество <> 0
	|			И ПрошлыеПартии.ПериодРегистрации < &НачалоПериода
	|			И ПрошлыеПартии.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия, // партия производства
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура,
	|	Т.КорХарактеристика,
	|	Т.КорВидЗапасов,
	|	Т.НДСВключенВСтоимость,
	|	Т.Количество
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия
	|ПОМЕСТИТЬ ВТОтборЗатратыНаВыпуск
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Себестоимость.Период, МЕСЯЦ) КАК Период,
	|	Т.ЭтоОстаток,
	|	Себестоимость.Партия КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Себестоимость.Организация КАК Организация,
	|	Себестоимость.ВидЗапасов КАК ВидЗапасов,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Себестоимость.КорПартия КАК КорПартия,
	|	(Себестоимость.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)) КАК НДСВключенВСтоимость,
	// Доп. поля для получения партий НДС
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.СтоимостьУпр + Себестоимость.ПостатейныеПостоянныеУпр + Себестоимость.ПостатейныеПеременныеУпр) КАК СтоимостьУпр,
	|	СУММА(Себестоимость.СтоимостьРегл + Себестоимость.ПостатейныеПостоянныеРегл + Себестоимость.ПостатейныеПеременныеРегл) КАК СтоимостьРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Себестоимость.Количество) КАК Количество
	// Шаг 6
	|ПОМЕСТИТЬ ВТПартииЗатратПредварительная
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборЗатратыНаВыпуск КАК Т
	|		ПО Т.Партия = Себестоимость.КорПартия
	|ГДЕ
	|	Себестоимость.Организация В(&МассивОрганизаций)
	|	И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Себестоимость.Период <= &КонецПериода
	|	И (НЕ Т.ЭтоОстаток
	|		ИЛИ Себестоимость.Период < &НачалоПериода)
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Себестоимость.Период, МЕСЯЦ),
	|	Т.ЭтоОстаток,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.Организация,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Себестоимость.АналитикаУчетаНоменклатуры.Характеристика,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры.СтатьяКалькуляции,
	|	Себестоимость.КорПартия,
	|	(Себестоимость.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)),
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	КорПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Т.НДСВключенВСтоимость,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТПартииЗатратБезНДС
	|ИЗ
	|	ВТПартииЗатратПредварительная КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Т.НДСВключенВСтоимость
	|ИМЕЮЩИЕ
	|	СУММА(Т.Количество) <> 0
	|	И (СУММА(Т.СтоимостьУпр) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРегл) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазница) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазница) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия КАК КорПартия,
	|	СУММА(Т.Количество) КАК Количество,
	|	СУММА(Остатки.Количество) КАК КоличествоОстаток,
	|	ВЫБОР КОГДА СУММА(Остатки.Количество) = 0
	|		ТОГДА 0
	|		ИНАЧЕ СУММА(Остатки.Количество) / СУММА(Т.Количество)
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ВТПартииЗатратИтоги
	|ИЗ
	|	ВТПартииЗатратБезНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиПартийНЗП КАК Остатки
	|		ПО Т.КорПартия = Остатки.Партия
	|		 И Т.Номенклатура = Остатки.Номенклатура
	|	  	 И Т.Характеристика = Остатки.Характеристика
	|	  	 И Т.ВидЗапасов = Остатки.ВидЗапасов
	|	  	 И Т.Организация = Остатки.Организация
	|	  	 И Т.СтатьяКалькуляции = Остатки.СтатьяКалькуляции
	|		 И Т.ЭтоОстаток
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.Количество) <> 0
	|	И СУММА(Остатки.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КорПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартииЗатрат.ЭтоОстаток,
	|	ПартииЗатрат.Период,
	|	ПартииЗатрат.Партия КАК Партия,
	|	ПартииЗатрат.АналитикаУчетаПартий,
	|	ПартииЗатрат.Организация,
	|	ПартииЗатрат.ВидЗапасов,
	|	ПартииЗатрат.Номенклатура,
	|	ПартииЗатрат.Характеристика,
	|	ПартииЗатрат.СтатьяКалькуляции,
	|	ПартииЗатрат.КорПартия,
	|	ПартииЗатрат.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ПартииЗатрат.РазделУчета,
	|	ПартииЗатрат.АналитикаФинансовогоУчета,
	|	ПартииЗатрат.ВидДеятельностиНДС,
	|	ПартииЗатрат.Количество
	|ПОМЕСТИТЬ ВТПартииЗатратДляНДС
	|ИЗ
	|	ВТПартииЗатратПредварительная КАК ПартииЗатрат
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
	|		ПО ПартииЗатрат.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатрат.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатрат.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатрат.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатрат.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК ПартииНДС
	|		ПО ЗатратыНаВыпуск.КорПартия = ПартииНДС.Партия
	|		 И ЗатратыНаВыпуск.КорАналитикаУчетаПартий = ПартииНДС.АналитикаУчетаПартий
	|		 И ЗатратыНаВыпуск.Организация = ПартииНДС.Организация
	|		 И ЗатратыНаВыпуск.ЭтоОстаток = ПартииНДС.ЭтоОстаток
	|ГДЕ
	|	НЕ ТИПЗНАЧЕНИЯ(ПартииЗатрат.Партия) В (&ТипыДокументовПартии)
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|	((Партия),
	|	 (АналитикаУчетаНоменклатуры))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Цены.ДокументПоступления,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	Цены.НДСРегл,
	|	Цены.НДСУпр
	|ПОМЕСТИТЬ ВТПартииЗатратЦеныНДС
	|ИЗ
	|	ВТПартииЗатратДляНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Цены
	|		ПО Т.Партия = Цены.Партия
	|		И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартий
	|		И Т.Организация = Цены.Организация
	|		И Т.ВидЗапасов = Цены.ВидЗапасов
	|		И Т.Номенклатура = Цены.Номенклатура
	|		И Т.Характеристика = Цены.Характеристика
	|		И Цены.ПериодРегистрации <= &НачалоПериода
	|		И (Цены.НДСРегл <> 0
	|			ИЛИ Цены.НДСУпр <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Цены.ДокументПоступления,
	|	Цены.СтатьяРасходов КАК СтатьяРасходов,
	|	Цены.НДСРегл,
	|	Цены.НДСУпр
	|ИЗ
	|	ВТПартииЗатратДляНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Цены
	|		ПО Т.Партия = Цены.Партия
	|		И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартий
	|		И Т.Организация = Цены.Организация
	|		И Т.ВидЗапасов = Цены.ВидЗапасов
	|		И Т.Номенклатура = Цены.Номенклатура
	|		И Т.Характеристика = Цены.Характеристика
	|		И Цены.ПериодРегистрации <= &НачалоПериода
	|		И (Цены.НДСРегл <> 0
	|			ИЛИ Цены.НДСУпр <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Цены.ДокументПоступления,
	|	Цены.СтатьяРасходов КАК СтатьяРасходов,
	|	Цены.НДСРегл,
	|	Цены.НДСУпр
	|ИЗ
	|	ВТПартииЗатратДляНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Цены
	|		ПО Т.АналитикаУчетаНоменклатуры = Цены.АналитикаУчетаНоменклатуры
	|		И Т.Организация = Цены.Организация
	|		И Т.Партия = Цены.Партия
	|		И Т.ВидЗапасов = Цены.ВидЗапасов
	|		И Т.РазделУчета = Цены.РазделУчета
	|		И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартий
	|		И Т.АналитикаФинансовогоУчета = Цены.АналитикаФинансовогоУчета
	|		И Т.ВидДеятельностиНДС = Цены.ВидДеятельностиНДС
	|		И Т.Период = Цены.Период
	|		И (Цены.НДСРегл <> 0
	|			ИЛИ Цены.НДСУпр <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|	((Партия),
	|	 (КорПартия),
	|	 (СтатьяРасходов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	ИСТИНА КАК ЭтоДетализацияНДС,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.КорПартия КАК КорПартия,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	ПартииЗатрат.НДСВключенВСтоимость,
	|	0 КАК СтоимостьУпр,
	|	0 КАК СтоимостьРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(ВЫРАЗИТЬ(ПартииЗатрат.Количество * ЕСТЬNULL(ПартииЗатратИтоги.Коэффициент, 1) * Т.НДСРегл КАК ЧИСЛО (31,2))) КАК НДСРегл,
	|	СУММА(ВЫРАЗИТЬ(ПартииЗатрат.Количество * ЕСТЬNULL(ПартииЗатратИтоги.Коэффициент, 1) * Т.НДСУпр КАК ЧИСЛО (31,2))) КАК НДСУпр,
	|	ПартииЗатрат.Количество КАК Количество
	|ПОМЕСТИТЬ ВТПартииЗатрат
	|ИЗ
	|	ВТПартииЗатратЦеныНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатратБезНДС КАК ПартииЗатрат
	|		ПО Т.Партия = ПартииЗатрат.Партия
	|		И Т.АналитикаУчетаПартий = ПартииЗатрат.АналитикаУчетаПартий
	|		И Т.Организация = ПартииЗатрат.Организация
	|		И Т.ВидЗапасов = ПартииЗатрат.ВидЗапасов
	|		И Т.Номенклатура = ПартииЗатрат.Номенклатура
	|		И Т.Характеристика = ПартииЗатрат.Характеристика
	|		И Т.СтатьяКалькуляции = ПартииЗатрат.СтатьяКалькуляции
	|		И Т.КорПартия = ПартииЗатрат.КорПартия
	|		И Т.ЭтоОстаток = ПартииЗатрат.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииЗатратИтоги КАК ПартииЗатратИтоги
	|		ПО Т.КорПартия = ПартииЗатратИтоги.КорПартия
	|		И Т.Организация = ПартииЗатратИтоги.Организация
	|		И Т.ВидЗапасов = ПартииЗатратИтоги.ВидЗапасов
	|		И Т.Номенклатура = ПартииЗатратИтоги.Номенклатура
	|		И Т.Характеристика = ПартииЗатратИтоги.Характеристика
	|		И Т.СтатьяКалькуляции = ПартииЗатратИтоги.СтатьяКалькуляции
	|		И Т.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО Статья.Ссылка = Т.СтатьяРасходов
	|		И (Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ИЛИ Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|ГДЕ
	|	Статья.Ссылка ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Т.ДокументПоступления,
	|	ПартииЗатрат.НДСВключенВСтоимость,
	|	ПартииЗатрат.Количество
	|ИМЕЮЩИЕ
	|	СУММА(ВЫРАЗИТЬ(ПартииЗатрат.Количество * ЕСТЬNULL(ПартииЗатратИтоги.Коэффициент, 1) * Т.НДСРегл КАК ЧИСЛО (31,2))) <> 0
	|		ИЛИ СУММА(ВЫРАЗИТЬ(ПартииЗатрат.Количество * ЕСТЬNULL(ПартииЗатратИтоги.Коэффициент, 1) * Т.НДСУпр КАК ЧИСЛО (31,2))) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	ЛОЖЬ КАК ЭтоДетализацияНДС,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	Т.Количество
	|ИЗ
	|	ВТПартииЗатратБезНДС КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|	((Партия),
	|	 (КорПартия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаток,
	|	Детализация.Партия КАК Партия,
	|	Детализация.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Детализация.Организация КАК Организация,
	|	Детализация.ВидЗапасов КАК ВидЗапасов,
	|	Детализация.Номенклатура КАК Номенклатура,
	|	Детализация.Характеристика КАК Характеристика,
	|	Детализация.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Детализация.ДокументПоступления КАК ДокументПоступления,
	|	МАКСИМУМ(ПартииКРасчету.ЕстьНДС) КАК ЕстьНДС,
	|	СУММА(Детализация.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Детализация.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Детализация.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Детализация.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Детализация.НДСРегл) КАК НДСРегл,
	|	СУММА(Детализация.НДСУпр) КАК НДСУпр,
	|	СУММА(Детализация.Количество) КАК Количество
	// Шаг 7
	|ПОМЕСТИТЬ ВТПартииЗатратПрошлыхПериодов
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК Детализация
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК ПартииКРасчету
	|		ПО Детализация.Партия = ПартииКРасчету.Партия
	|		И Детализация.АналитикаУчетаПартий = ПартииКРасчету.АналитикаУчетаПартий
	|		И Детализация.Организация = ПартииКРасчету.Организация
	|		И НЕ ПартииКРасчету.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК ИзменениеВидаДеятельностиНДС
	|		ПО Детализация.Партия = ИзменениеВидаДеятельностиНДС.Партия
	|		И Детализация.АналитикаУчетаПартий = ИзменениеВидаДеятельностиНДС.АналитикаУчетаПартий
	|		И Детализация.Организация = ИзменениеВидаДеятельностиНДС.Организация
	|		И НЕ ИзменениеВидаДеятельностиНДС.ЭтоОстаток
	|ГДЕ
	|	Детализация.ПериодРегистрации < &НачалоПериода
	|	И Детализация.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|	И ИзменениеВидаДеятельностиНДС.Партия ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	Детализация.Партия,
	|	Детализация.АналитикаУчетаПартий,
	|	Детализация.Организация,
	|	Детализация.ВидЗапасов,
	|	Детализация.Номенклатура,
	|	Детализация.Характеристика,
	|	Детализация.СтатьяКалькуляции,
	|	Детализация.ДокументПоступления
	|ИМЕЮЩИЕ
	|	СУММА(Детализация.Количество) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЭтоОстаток,
	|	Т.КорПартия КАК ПартияВыпуска,
	|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.КорНоменклатура КАК Номенклатура,
	|	Т.КорХарактеристика КАК Характеристика,
	|	Т.КорВидЗапасов КАК ВидЗапасов,
	|	Т.Партия КАК ПартияПроизводства,
	|	Т.НДСВключенВСтоимость,
	|	ЕСТЬNULL(Выпуск.Количество, 1) КАК Количество
	|ПОМЕСТИТЬ ВТВсеПартииПроизводства
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК Выпуск
	|		ПО Т.КорПартия = Выпуск.Партия
	|		 И Т.КорАналитикаУчетаПартий = Выпуск.АналитикаУчетаПартий
	|		 И Т.Организация = Выпуск.Организация
	|		 И Т.КорНоменклатура = Выпуск.Номенклатура
	|		 И Т.КорХарактеристика = Выпуск.Характеристика
	|		 И Т.КорВидЗапасов = Выпуск.ВидЗапасов
	|		 И Т.ЭтоОстаток = Выпуск.ЭтоОстаток
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияВыпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТПартииЗатратСводно
	|ИЗ
	|	ВТПартииЗатрат КАК Т
	|ГДЕ
	|	НЕ Т.ЭтоДетализацияНДС
	|	
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия
	|ИНДЕКСИРОВАТЬ ПО
	|	КорПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.Партия,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТЗатратыНаВыпускСводно
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.Партия
	|ИМЕЮЩИЕ
	|	СУММА(Т.Количество) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Партии выпуска по материалам
	|ВЫБРАТЬ
	|	ЗатратыНаВыпуск.ЭтоОстаток КАК ЭтоОстаток,
	|	ЛОЖЬ КАК ЭтоПартияПроизводства,
	|	ЗатратыНаВыпуск.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
	|	ЗатратыНаВыпуск.КорПартия КАК Партия,
	|	ЗатратыНаВыпуск.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ЗатратыНаВыпуск.Партия КАК ПартияПроизводства,
	|	ПартииЗатрат.Организация КАК Организация,
	|	ПартииЗатрат.ВидЗапасов КАК ВидЗапасов,
	|	ПартииЗатрат.Номенклатура КАК Номенклатура,
	|	ПартииЗатрат.Характеристика КАК Характеристика,
	|	ЗатратыНаВыпуск.КорВидЗапасов КАК ВидЗапасовПродукции,
	|	ЗатратыНаВыпуск.КорНоменклатура КАК НоменклатураПродукции,
	|	ЗатратыНаВыпуск.КорХарактеристика КАК ХарактеристикаПродукции,
	|	ПартииЗатрат.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА ПартииЗатрат.ДокументПоступления ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК ДокументПоступления,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.СтоимостьУпр * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.СтоимостьРегл * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.ПостояннаяРазница * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.ВременнаяРазница * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА НЕ ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ПартииЗатрат.НДСРегл * (ЗатратыНаВыпуск.Количество / ЗатратыНаВыпускСводно.Количество) КАК ЧИСЛО(31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА НЕ ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ПартииЗатрат.НДСУпр * (ЗатратыНаВыпуск.Количество / ЗатратыНаВыпускСводно.Количество) КАК ЧИСЛО(31,2)) КАК НДСУпр
	// Шаг 8
	|ПОМЕСТИТЬ ВТПартииДетализация
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпускСводно КАК ЗатратыНаВыпускСводно
	|		ПО ЗатратыНаВыпускСводно.Партия = ЗатратыНаВыпуск.Партия
	|		 И ЗатратыНаВыпускСводно.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ЗатратыНаВыпускСводно.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ЗатратыНаВыпускСводно.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ЗатратыНаВыпускСводно.Организация = ЗатратыНаВыпуск.Организация
	|		 И ЗатратыНаВыпускСводно.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ЗатратыНаВыпускСводно.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатрат КАК ПартииЗатрат
	|		ПО ПартииЗатрат.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатрат.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатрат.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатрат.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатрат.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатратСводно КАК ПартииЗатратСводно
	|		ПО ПартииЗатратСводно.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатратСводно.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатратСводно.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатратСводно.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатратСводно.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатратСводно.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатратСводно.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|ГДЕ
	|	НЕ (ТИПЗНАЧЕНИЯ(ПартииЗатрат.Партия) В (&ТипыДокументовПартии))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Партии производства по материалам
	|ВЫБРАТЬ
	|	ЗатратыНаВыпуск.ЭтоОстаток КАК ЭтоОстаток,
	|	ИСТИНА КАК ЭтоПартияПроизводства,
	|	ЗатратыНаВыпуск.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
	|	ЗатратыНаВыпуск.КорПартия КАК Партия,
	|	ЗатратыНаВыпуск.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ЗатратыНаВыпуск.Партия КАК ПартияПроизводства,
	|	ПартииЗатрат.Организация КАК Организация,
	|	ПартииЗатрат.ВидЗапасов КАК ВидЗапасов,
	|	ПартииЗатрат.Номенклатура КАК Номенклатура,
	|	ПартииЗатрат.Характеристика КАК Характеристика,
	|	ЗатратыНаВыпуск.КорВидЗапасов КАК ВидЗапасовПродукции,
	|	ЗатратыНаВыпуск.КорНоменклатура КАК НоменклатураПродукции,
	|	ЗатратыНаВыпуск.КорХарактеристика КАК ХарактеристикаПродукции,
	|	ПартииЗатрат.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА ПартииЗатрат.ДокументПоступления ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК ДокументПоступления,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.СтоимостьУпр * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.СтоимостьРегл * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.ПостояннаяРазница * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ЗатратыНаВыпуск.ВременнаяРазница * (ПартииЗатрат.Количество / ПартииЗатратСводно.Количество) КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА НЕ ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ПартииЗатрат.НДСРегл * (ЗатратыНаВыпуск.Количество / ЗатратыНаВыпускСводно.Количество) КАК ЧИСЛО(31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА НЕ ПартииЗатрат.ЭтоДетализацияНДС ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|		* ПартииЗатрат.НДСУпр * (ЗатратыНаВыпуск.Количество / ЗатратыНаВыпускСводно.Количество) КАК ЧИСЛО(31,2)) КАК НДСУпр
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпускСводно КАК ЗатратыНаВыпускСводно
	|		ПО ЗатратыНаВыпускСводно.Партия = ЗатратыНаВыпуск.Партия
	|		 И ЗатратыНаВыпускСводно.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ЗатратыНаВыпускСводно.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ЗатратыНаВыпускСводно.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ЗатратыНаВыпускСводно.Организация = ЗатратыНаВыпуск.Организация
	|		 И ЗатратыНаВыпускСводно.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ЗатратыНаВыпускСводно.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатрат КАК ПартииЗатрат
	|		ПО ПартииЗатрат.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатрат.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатрат.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатрат.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатрат.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатратСводно КАК ПартииЗатратСводно
	|		ПО ПартииЗатратСводно.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатратСводно.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатратСводно.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатратСводно.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатратСводно.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатратСводно.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатратСводно.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|ГДЕ
	|	НЕ (ТИПЗНАЧЕНИЯ(ПартииЗатрат.Партия) В (&ТипыДокументовПартии))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Прочие расходы и трудозатраты НЗП
	|ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	ЛОЖЬ КАК ЭтоПартияПроизводства,
	|	-1 КАК НомерЗатратыНаВыпуск,
	|	Т.ПартияВыпуска КАК Партия,
	|	Т.АналитикаУчетаПартийВыпуска КАК АналитикаУчетаПартий,
	|	Т.Партия КАК ПартияПроизводства,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.ВидЗапасов КАК ВидЗапасовПродукции,
	|	Т.Номенклатура КАК НоменклатураПродукции,
	|	Т.Характеристика КАК ХарактеристикаПродукции,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ИЗ
	|	ВТДетализацияНЗП КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК Выпуск
	|		ПО Т.ПартияВыпуска = Выпуск.Партия
	|		 И Т.АналитикаУчетаПартийВыпуска = Выпуск.АналитикаУчетаПартий
	|		 И Т.Организация = Выпуск.Организация
	|		 И Т.ЭтоОстаток = Выпуск.ЭтоОстаток
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.ПартияВыпуска,
	|	Т.АналитикаУчетаПартийВыпуска,
	|	Т.Партия,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.ДокументПоступления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Полуфабрикаты прошлых периодов
	|ВЫБРАТЬ
	|	ЗатратыНаВыпуск.ЭтоОстаток,
	|	ЛОЖЬ КАК ЭтоПартияПроизводства,
	|	ЗатратыНаВыпуск.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
	|	ЗатратыНаВыпуск.КорПартия КАК Партия,
	|	ЗатратыНаВыпуск.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ЗатратыНаВыпуск.Партия КАК ПартияПроизводства,
	|	ЗатратыНаВыпуск.Организация КАК Организация,
	|	ЗатратыНаВыпуск.ВидЗапасов КАК ВидЗапасов,
	|	ЗатратыНаВыпуск.Номенклатура КАК Номенклатура,
	|	ЗатратыНаВыпуск.Характеристика КАК Характеристика,
	|	ЗатратыНаВыпуск.КорВидЗапасов КАК ВидЗапасовПродукции,
	|	ЗатратыНаВыпуск.КорНоменклатура КАК НоменклатураПродукции,
	|	ЗатратыНаВыпуск.КорХарактеристика КАК ХарактеристикаПродукции,
	|	ПартииЗатратПрошлыхПериодов.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ПартииЗатратПрошлыхПериодов.ДокументПоступления КАК ДокументПоступления,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.СтоимостьУпр * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.СтоимостьРегл * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.ПостояннаяРазница * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.ВременнаяРазница * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.НДСРегл * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.НДСУпр * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК НДСУпр
	|ИЗ
	|	ВТПартииЗатрат КАК ПартииЗатрат
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
	|		ПО ПартииЗатрат.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатрат.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатрат.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатрат.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатрат.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|		 И НЕ ПартииЗатрат.ЭтоДетализацияНДС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатратПрошлыхПериодов КАК ПартииЗатратПрошлыхПериодов
	|		ПО ПартииЗатрат.Партия = ПартииЗатратПрошлыхПериодов.Партия
	|		 И ПартииЗатрат.АналитикаУчетаПартий = ПартииЗатратПрошлыхПериодов.АналитикаУчетаПартий
	|		 И ПартииЗатрат.Организация = ПартииЗатратПрошлыхПериодов.Организация
	|		 И ПартииЗатрат.Номенклатура = ПартииЗатратПрошлыхПериодов.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ПартииЗатратПрошлыхПериодов.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ПартииЗатратПрошлыхПериодов.ВидЗапасов
	|		 И ПартииЗатрат.ЭтоОстаток = ПартииЗатратПрошлыхПериодов.ЭтоОстаток
	|		 И НЕ ПартииЗатрат.ЭтоДетализацияНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Партии производства по полуфабрикатам прошлых периодов
	|ВЫБРАТЬ
	|	ЗатратыНаВыпуск.ЭтоОстаток,
	|	ИСТИНА КАК ЭтоПартияПроизводства,
	|	ЗатратыНаВыпуск.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
	|	ЗатратыНаВыпуск.КорПартия КАК Партия,
	|	ЗатратыНаВыпуск.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ЗатратыНаВыпуск.Партия КАК ПартияПроизводства,
	|	ЗатратыНаВыпуск.Организация КАК Организация,
	|	ЗатратыНаВыпуск.ВидЗапасов КАК ВидЗапасов,
	|	ЗатратыНаВыпуск.Номенклатура КАК Номенклатура,
	|	ЗатратыНаВыпуск.Характеристика КАК Характеристика,
	|	ЗатратыНаВыпуск.КорВидЗапасов КАК ВидЗапасовПродукции,
	|	ЗатратыНаВыпуск.КорНоменклатура КАК НоменклатураПродукции,
	|	ЗатратыНаВыпуск.КорХарактеристика КАК ХарактеристикаПродукции,
	|	ПартииЗатратПрошлыхПериодов.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ПартииЗатратПрошлыхПериодов.ДокументПоступления КАК ДокументПоступления,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.СтоимостьУпр * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.СтоимостьРегл * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.ПостояннаяРазница * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.ВременнаяРазница * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.НДСРегл * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(ПартииЗатратПрошлыхПериодов.НДСУпр * (ПартииЗатрат.Количество / ПартииЗатратПрошлыхПериодов.Количество) * (ЗатратыНаВыпуск.Количество / ПартииЗатрат.Количество) КАК ЧИСЛО(31,2)) КАК НДСУпр
	|ИЗ
	|	ВТПартииЗатрат КАК ПартииЗатрат
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
	|		ПО ПартииЗатрат.КорПартия = ЗатратыНаВыпуск.Партия
	|		 И ПартииЗатрат.Номенклатура = ЗатратыНаВыпуск.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ЗатратыНаВыпуск.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ЗатратыНаВыпуск.ВидЗапасов
	|		 И ПартииЗатрат.Организация = ЗатратыНаВыпуск.Организация
	|		 И ПартииЗатрат.СтатьяКалькуляции = ЗатратыНаВыпуск.СтатьяКалькуляции
	|		 И ПартииЗатрат.ЭтоОстаток = ЗатратыНаВыпуск.ЭтоОстаток
	|		 И НЕ ПартииЗатрат.ЭтоДетализацияНДС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииЗатратПрошлыхПериодов КАК ПартииЗатратПрошлыхПериодов
	|		ПО ПартииЗатрат.Партия = ПартииЗатратПрошлыхПериодов.Партия
	|		 И ПартииЗатрат.АналитикаУчетаПартий = ПартииЗатратПрошлыхПериодов.АналитикаУчетаПартий
	|		 И ПартииЗатрат.Организация = ПартииЗатратПрошлыхПериодов.Организация
	|		 И ПартииЗатрат.Номенклатура = ПартииЗатратПрошлыхПериодов.Номенклатура
	|		 И ПартииЗатрат.Характеристика = ПартииЗатратПрошлыхПериодов.Характеристика
	|		 И ПартииЗатрат.ВидЗапасов = ПартииЗатратПрошлыхПериодов.ВидЗапасов
	|		 И ПартииЗатрат.ЭтоОстаток = ПартииЗатратПрошлыхПериодов.ЭтоОстаток
	|		 И НЕ ПартииЗатрат.ЭтоДетализацияНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
		"ВТОстаткиПартийНЗП, ВТОтборПартииНЗП, ВТДетализацияНЗППредварительная, ВТДетализацияНЗП,
		|ВТЗатратыНаВыпускПредварительная, ВТПартииПроизводстваИзЗатратНаВыпускПредварительная, ВТОтборЗатратыНаВыпуск,
		|ВТПартииЗатратПредварительная, ВТПартииЗатратБезНДС, ВТПартииЗатратИтоги, ВТПартииЗатратИтоги,
		|ВТПартииЗатратЦеныНДС, ВТПартииЗатратЦеныНДС, ВТПартииЗатратСводно, ВТЗатратыНаВыпускСводно");
	
	#КонецОбласти

	#Область ОставшиесяЗатратыНаВыпуск_ОставшиесяПартииЗатрат_ОставшиесяПолуфабрикатыКРасчету
	
	// Временные таблицы:
	// ВТПартииЗатратПромежуточная
	// ВТПартииЗатрат
	// ВТУчтенныеНомераЗатрат
	// ВТЗатратыНаВыпускПромежуточная
	// ВТЗатратыНаВыпуск
	// ВТПартииПроизводства
	// ВТПолуфабрикатыКРасчету
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Т.ДокументПоступления,
	|	Т.НДСВключенВСтоимость,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.НДСУпр) КАК НДСУпр,
	|	СУММА(Т.Количество) КАК Количество
	// Шаг 9
	|ПОМЕСТИТЬ ВТПартииЗатратПромежуточная
	|ИЗ
	|	ВТПартииЗатрат КАК Т
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.Партия) В (&ТипыДокументовПартии)
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Т.ДокументПоступления,
	|	Т.НДСВключенВСтоимость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПартииЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗатраты,
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.КорПартия,
	|	Т.ДокументПоступления,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.НДСРегл,
	|	Т.НДСУпр,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТПартииЗатрат
	|ИЗ
	|	ВТПартииЗатратПромежуточная КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.НомерЗатратыНаВыпуск
	|ПОМЕСТИТЬ ВТУчтенныеНомераЗатрат
	|ИЗ
	|	ВТПартииДетализация КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗатратыНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Отбор1.НомерЗатраты, -1) КАК НомерЗатраты,
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура,
	|	Т.КорХарактеристика,
	|	Т.КорВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.КоличествоВыпуск,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТЗатратыНаВыпускПромежуточная
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииЗатрат КАК Отбор1
	|		ПО Т.Партия = Отбор1.КорПартия
	|		И Т.Номенклатура = Отбор1.Номенклатура
	|		И Т.Характеристика = Отбор1.Характеристика
	|		И Т.ВидЗапасов = Отбор1.ВидЗапасов
	|		И Т.Организация = Отбор1.Организация
	|		И Т.СтатьяКалькуляции = Отбор1.СтатьяКалькуляции
	|		И Т.ЭтоОстаток = Отбор1.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчтенныеНомераЗатрат КАК Отбор2
	|		ПО Т.НомерЗатратыНаВыпуск = Отбор2.НомерЗатратыНаВыпуск
	|ГДЕ
	|	Отбор2.НомерЗатратыНаВыпуск ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТЗатратыНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗатраты,
	|	Т.ЭтоОстаток,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНоменклатура,
	|	Т.КорХарактеристика,
	|	Т.КорВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.НДСВключенВСтоимость,
	|	Т.СтоимостьУпр,
	|	Т.СтоимостьРегл,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.КоличествоВыпуск,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТЗатратыНаВыпуск
	|ИЗ
	|	ВТЗатратыНаВыпускПромежуточная КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЭтоОстаток,
	|	Т.КорПартия КАК ПартияВыпуска,
	|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.КорНоменклатура КАК Номенклатура,
	|	Т.КорХарактеристика КАК Характеристика,
	|	Т.КорВидЗапасов КАК ВидЗапасов,
	|	Т.Партия КАК ПартияПроизводства,
	|	ЕСТЬNULL(Выпуск.Количество, 1) КАК Количество,
	|	Т.НДСВключенВСтоимость,
	|	ВЫБОР КОГДА Выпуск.Количество ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ЕстьВыпуск
	|ПОМЕСТИТЬ ВТПартииПроизводства
	|ИЗ
	|	ВТЗатратыНаВыпуск КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК Выпуск
	|		ПО Т.КорПартия = Выпуск.Партия
	|		 И Т.КорАналитикаУчетаПартий = Выпуск.АналитикаУчетаПартий
	|		 И Т.Организация = Выпуск.Организация
	|		 И Т.КорНоменклатура = Выпуск.Номенклатура
	|		 И Т.КорХарактеристика = Выпуск.Характеристика
	|		 И Т.КорВидЗапасов = Выпуск.ВидЗапасов
	|		 И Т.ЭтоОстаток = Выпуск.ЭтоОстаток
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ЭтоОстаток,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация
	// Шаг 10
	|ПОМЕСТИТЬ ВТПолуфабрикатыКРасчету
	|ИЗ
	|	ВТПартииЗатрат КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК Отбор
	|		ПО Т.Партия = Отбор.КорПартия
	|		И Т.АналитикаУчетаПартий = Отбор.КорАналитикаУчетаПартий
	|		И Т.Номенклатура = Отбор.КорНоменклатура
	|		И Т.Характеристика = Отбор.КорХарактеристика
	|		И Т.ВидЗапасов = Отбор.КорВидЗапасов
	|		И Т.Организация = Отбор.Организация
	|		И Т.ЭтоОстаток = Отбор.ЭтоОстаток
	|ГДЕ
	|	Отбор.КорПартия ЕСТЬ NULL
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
		"ВТПартииЗатратПромежуточная, ВТУчтенныеНомераЗатрат, ВТУчтенныеНомераЗатрат, ВТЗатратыНаВыпускПромежуточная");
	
	#КонецОбласти
	
	#Область РекурсивныйРасчетПартииДетализация
	
	ПродолжатьРасчет = Истина;
	Запрос.УстановитьПараметр("ПерваяИтерация", Истина);
	
	Пока ПродолжатьРасчет Цикл
		
		ПараметрыРасчета.ИтерацийПартииДетализация = ПараметрыРасчета.ИтерацийПартииДетализация + 1;
		Пояснение = НСтр("ru = 'Итерация заполнения партий детализации';
						|en = 'Итерация заполнения партий детализации'", ОбщегоНазначения.КодОсновногоЯзыка()) + ":"
			+ СокрЛП(ПараметрыРасчета.ИтерацийПартииДетализация);
		
		#Область ДетализацияДобавление
		
		// Временные таблицы:
		// ВТДетализацияДобавление
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	-2 КАК НомерЗатратыНаВыпуск,
		|	Т.ЭтоОстаток,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ПартияПроизводства,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.ВидЗапасовПродукции,
		|	Т.НоменклатураПродукции,
		|	Т.ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции,
		|	Т.ДокументПоступления,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	Т.НДСРегл,
		|	Т.НДСУпр
		// Шаг 11.1
		|ПОМЕСТИТЬ ВТДетализацияДобавление
		|ИЗ
		|	ВТПартииДетализация КАК Т
		|ГДЕ
		|	(Т.Партия, Т.АналитикаУчетаПартий) В
		|		(ВЫБРАТЬ Отбор.Партия, Отбор.АналитикаУчетаПартий ИЗ ВТПолуфабрикатыКРасчету КАК Отбор)
		|	И НЕ Т.ЭтоПартияПроизводства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Затраты на выпуск, для которых нет партий затрат (например, побочный выпуск)
		|ВЫБРАТЬ
		|	-3 КАК НомерЗатратыНаВыпуск,
		|	Т.ЭтоОстаток,
		|	Т.КорПартия КАК Партия,
		|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.Партия КАК ПартияПроизводства,
		|	Т.Организация КАК Организация,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	Т.КорВидЗапасов КАК ВидЗапасовПродукции,
		|	Т.КорНоменклатура КАК НоменклатураПродукции,
		|	Т.КорХарактеристика КАК ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр
		|ИЗ
		|	ВТЗатратыНаВыпуск КАК Т
		|ГДЕ
		|	&ПерваяИтерация
		|	И Т.НомерЗатраты = -1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	ВТДетализацияДобавление КАК Т
		|";
		
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина, Пояснение);
		ПродолжатьРасчет = НЕ РезультатЗапроса.Пустой();
		
		Запрос.УстановитьПараметр("ПерваяИтерация", Ложь);
		
		#КонецОбласти
		
		#Область НетДанныхДляПродолженияРасчета_ДобавлениеПартииДетализация
	
		Если НЕ ПродолжатьРасчет Тогда
			
			// Временные таблицы:
			// ВТПартииДетализация (добавление)
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Т.ЭтоОстаток,
			|	Т.ЭтоПартияПроизводства,
			|	Т.НомерЗатратыНаВыпуск,
			|	Т.Партия,
			|	Т.АналитикаУчетаПартий,
			|	Т.ПартияПроизводства,
			|	Т.Организация,
			|	Т.ВидЗапасов,
			|	Т.Номенклатура,
			|	Т.Характеристика,
			|	Т.ВидЗапасовПродукции,
			|	Т.НоменклатураПродукции,
			|	Т.ХарактеристикаПродукции,
			|	Т.СтатьяКалькуляции,
			|	Т.ДокументПоступления,
			|	Т.СтоимостьУпр,
			|	Т.СтоимостьРегл,
			|	Т.ПостояннаяРазница,
			|	Т.ВременнаяРазница,
			|	Т.НДСРегл,
			|	Т.НДСУпр
			|ПОМЕСТИТЬ ВТПартииДетализацияБезГруппировки
			|ИЗ
			|	ВТПартииДетализация КАК Т
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Т.ЭтоОстаток,
			|	ЛОЖЬ КАК ЭтоПартияПроизводства,
			|	-4 КАК НомерЗатратыНаВыпуск,
			|	Т.КорПартия КАК Партия,
			|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
			|	Т.Партия КАК ПартияПроизводства,
			|	Т.Организация КАК Организация,
			|	Т.ВидЗапасов КАК ВидЗапасов,
			|	Т.Номенклатура КАК Номенклатура,
			|	Т.Характеристика КАК Характеристика,
			|	Т.КорВидЗапасов КАК ВидЗапасовПродукции,
			|	Т.КорНоменклатура КАК НоменклатураПродукции,
			|	Т.КорХарактеристика КАК ХарактеристикаПродукции,
			|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
			|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
			|	Т.СтоимостьУпр КАК СтоимостьУпр,
			|	Т.СтоимостьРегл КАК СтоимостьРегл,
			|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
			|	Т.ВременнаяРазница КАК ВременнаяРазница,
			|	0 КАК НДСРегл,
			|	0 КАК НДСУпр
			|ИЗ
			|	ВТЗатратыНаВыпуск КАК Т
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			// Партии производства
			|ВЫБРАТЬ
			|	Т.ЭтоОстаток,
			|	ИСТИНА КАК ЭтоПартияПроизводства,
			|	-4 КАК НомерЗатратыНаВыпуск,
			|	Т.КорПартия КАК Партия,
			|	Т.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
			|	Т.Партия КАК ПартияПроизводства,
			|	Т.Организация КАК Организация,
			|	Т.ВидЗапасов КАК ВидЗапасов,
			|	Т.Номенклатура КАК Номенклатура,
			|	Т.Характеристика КАК Характеристика,
			|	Т.КорВидЗапасов КАК ВидЗапасовПродукции,
			|	Т.КорНоменклатура КАК НоменклатураПродукции,
			|	Т.КорХарактеристика КАК ХарактеристикаПродукции,
			|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
			|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
			|	Т.СтоимостьУпр КАК СтоимостьУпр,
			|	Т.СтоимостьРегл КАК СтоимостьРегл,
			|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
			|	Т.ВременнаяРазница КАК ВременнаяРазница,
			|	0 КАК НДСРегл,
			|	0 КАК НДСУпр
			|ИЗ
			|	ВТЗатратыНаВыпуск КАК Т
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Партия,
			|	АналитикаУчетаПартий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТПартииДетализация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Т.ЭтоОстаток,
			|	Т.ЭтоПартияПроизводства,
			|	Т.НомерЗатратыНаВыпуск,
			|	Т.Партия,
			|	Т.АналитикаУчетаПартий,
			|	Т.ПартияПроизводства,
			|	Т.Организация,
			|	Т.ВидЗапасов,
			|	Т.Номенклатура,
			|	Т.Характеристика,
			|	Т.ВидЗапасовПродукции,
			|	Т.НоменклатураПродукции,
			|	Т.ХарактеристикаПродукции,
			|	Т.СтатьяКалькуляции,
			|	Т.ДокументПоступления,
			|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
			|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
			|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
			|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
			|	СУММА(Т.НДСРегл) КАК НДСРегл,
			|	СУММА(Т.НДСУпр) КАК НДСУпр
			|ПОМЕСТИТЬ ВТПартииДетализация
			|ИЗ
			|	ВТПартииДетализацияБезГруппировки КАК Т
			|СГРУППИРОВАТЬ ПО
			|	Т.Партия,
			|	Т.АналитикаУчетаПартий,
			|	Т.ЭтоОстаток,
			|	Т.ЭтоПартияПроизводства,
			|	Т.НомерЗатратыНаВыпуск,
			|	Т.ПартияПроизводства,
			|	Т.Организация,
			|	Т.ВидЗапасов,
			|	Т.Номенклатура,
			|	Т.Характеристика,
			|	Т.ВидЗапасовПродукции,
			|	Т.НоменклатураПродукции,
			|	Т.ХарактеристикаПродукции,
			|	Т.СтатьяКалькуляции,
			|	Т.ДокументПоступления
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Партия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТПартииДетализацияБезГруппировки
			|";
				
			РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,,, Пояснение);
			
			Прервать;
			
		КонецЕсли;
		
		#КонецОбласти
		
		#Область ДобавлениеПартииДетализация_ОставшиесяЗатратыНаВыпуск_ОставшиесяПартииЗатрат_ОставшиесяПолуфабрикатыКРасчету
		
		// Временные таблицы:
		// ВТЗатратыПолуфабрикатов
		// ВТПартииДобавление
		// ВТДетализацияДобавлениеРасширенная
		// ВТПартииДетализация (добавление)
		// ВТПартииЗатратПромежуточная
		// ВТПартииЗатрат
		// ВТЗатратыНаВыпускПромежуточная
		// ВТЗатратыНаВыпуск
		// ВТПолуфабрикатыКРасчету
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПартииЗатрат.ЭтоОстаток,
		|	ПартииЗатрат.Партия КАК Партия,
		|	ПартииЗатрат.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ПартииЗатрат.Организация КАК Организация,
		|	ПартииПроизводства.ПартияВыпуска КАК ПартияВыпуска,
		|	ПартииПроизводства.АналитикаУчетаПартий КАК АналитикаУчетаПартийВыпуска,
		|	ПартииПроизводства.ПартияПроизводства,
		|	ПартииПолуфабрикатов.НДСВключенВСтоимость КАК Полуфабрикат_НДСВключенВСтоимость,
		|	ПартииПроизводства.НДСВключенВСтоимость КАК Продукция_НДСВключенВСтоимость,
		|	ВЫБОР
		|		КОГДА ПартииПолуфабрикатов.НДСВключенВСтоимость И НЕ ПартииПроизводства.НДСВключенВСтоимость
		|			ТОГДА -1
		|		КОГДА НЕ ПартииПолуфабрикатов.НДСВключенВСтоимость И ПартииПроизводства.НДСВключенВСтоимость
		|			ТОГДА 1
		|			ИНАЧЕ 0
		|	КОНЕЦ КАК ЗнакНДС,
		|	ЗатратыНаВыпуск.ВидЗапасов КАК ВидЗапасовПолуфабриката,
		|	ЗатратыНаВыпуск.Номенклатура КАК НоменклатураПолуфабриката,
		|	ЗатратыНаВыпуск.Характеристика КАК ХарактеристикаПолуфабриката,
		|	ЗатратыНаВыпуск.КорВидЗапасов КАК ВидЗапасовПродукции,
		|	ЗатратыНаВыпуск.КорНоменклатура КАК НоменклатураПродукции,
		|	ЗатратыНаВыпуск.КорХарактеристика КАК ХарактеристикаПродукции,
		|
		|	ПартииПроизводства.Количество КАК КоличествоПродукции,
		|	ПартииПолуфабрикатов.Количество КАК КоличествоПолуфабрикат,
		|	ПартииЗатрат.Количество КАК КоличествоПолуфабрикатНаПроизводство,
		|	ЗатратыНаВыпуск.Количество КАК КоличествоНаВыпуск,
		|	(ЗатратыНаВыпуск.Количество / ПартииПолуфабрикатов.Количество) КАК Коэффициент
		|ПОМЕСТИТЬ ВТЗатратыПолуфабрикатов
		|ИЗ
		|	ВТПартииЗатрат КАК ПартииЗатрат
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
		|		ПО ЗатратыНаВыпуск.НомерЗатраты = ПартииЗатрат.НомерЗатраты
		|		 И ЗатратыНаВыпуск.ЭтоОстаток = ПартииЗатрат.ЭтоОстаток
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииПроизводства КАК ПартииПроизводства
		|		ПО ПартииЗатрат.КорПартия = ПартииПроизводства.ПартияПроизводства
		|		 И ПартииЗатрат.ЭтоОстаток = ПартииПроизводства.ЭтоОстаток
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеПартииПроизводства КАК ПартииПолуфабрикатов
		|		ПО ПартииЗатрат.Партия = ПартииПолуфабрикатов.ПартияВыпуска
		|		 И ПартииЗатрат.АналитикаУчетаПартий = ПартииПолуфабрикатов.АналитикаУчетаПартий
		|		 И ПартииЗатрат.ЭтоОстаток = ПартииПолуфабрикатов.ЭтоОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ЭтоОстаток,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.Организация КАК Организация
		|ПОМЕСТИТЬ ВТПартииДобавление
		|ИЗ
		|	ВТДетализацияДобавление КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
		|	Т.ЭтоОстаток,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ПартияВыпуска, Т.Партия) КАК Партия,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.АналитикаУчетаПартийВыпуска, Т.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ПартияПроизводства, Т.ПартияПроизводства) КАК ПартияПроизводства,
		|	Т.Организация КАК Организация,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ВидЗапасовПолуфабриката, Т.ВидЗапасовПродукции) КАК ВидЗапасовПолуфабриката,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.НоменклатураПолуфабриката, Т.НоменклатураПродукции) КАК НоменклатураПолуфабриката,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ХарактеристикаПолуфабриката, Т.ХарактеристикаПродукции) КАК ХарактеристикаПолуфабриката,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ВидЗапасовПродукции, Т.ВидЗапасовПродукции) КАК ВидЗапасовПродукции,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.НоменклатураПродукции, Т.НоменклатураПродукции) КАК НоменклатураПродукции,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ХарактеристикаПродукции, Т.ХарактеристикаПродукции) КАК ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	Т.ДокументПоступления КАК ДокументПоступления,
		|	ВЫРАЗИТЬ(Т.СтоимостьУпр * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2)) КАК СтоимостьУпр,
		|	ВЫРАЗИТЬ(Т.СтоимостьРегл * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(Т.ПостояннаяРазница * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(Т.ВременнаяРазница * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
		|	ВЫРАЗИТЬ(Т.НДСРегл * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2)) КАК НДСРегл,
		|	ВЫРАЗИТЬ(Т.НДСУпр * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2)) КАК НДСУпр
		// Шаг 11.3
		|ПОМЕСТИТЬ ВТДетализацияДобавлениеРасширенная
		|ИЗ
		|	ВТДетализацияДобавление КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗатратыПолуфабрикатов КАК ЗатратыПолуфабрикатов
		|		ПО Т.Партия = ЗатратыПолуфабрикатов.Партия
		|			И Т.АналитикаУчетаПартий = ЗатратыПолуфабрикатов.АналитикаУчетаПартий
		|			И Т.Организация = ЗатратыПолуфабрикатов.Организация
		|		 	И Т.ЭтоОстаток = ЗатратыПолуфабрикатов.ЭтоОстаток
		|ГДЕ
		|	НЕ ЗатратыПолуфабрикатов.Партия ЕСТЬ NULL
		|		ИЛИ Т.НомерЗатратыНаВыпуск = -3 // НЗП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Включение/исключение НДС в стоимость
		|ВЫБРАТЬ
		|	-5 КАК НомерЗатратыНаВыпуск,
		|	Т.ЭтоОстаток,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ПартияВыпуска, Т.Партия) КАК Партия,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.АналитикаУчетаПартийВыпуска, Т.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ПартияПроизводства, Т.ПартияПроизводства) КАК ПартияПроизводства,
		|	Т.Организация КАК Организация,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ВидЗапасовПолуфабриката, Т.ВидЗапасовПродукции) КАК ВидЗапасовПолуфабриката,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.НоменклатураПолуфабриката, Т.НоменклатураПродукции) КАК НоменклатураПолуфабриката,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ХарактеристикаПолуфабриката, Т.ХарактеристикаПродукции) КАК ХарактеристикаПолуфабриката,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ВидЗапасовПродукции, Т.ВидЗапасовПродукции) КАК ВидЗапасовПродукции,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.НоменклатураПродукции, Т.НоменклатураПродукции) КАК НоменклатураПродукции,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ХарактеристикаПродукции, Т.ХарактеристикаПродукции) КАК ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|	СУММА(ВЫРАЗИТЬ(ЗатратыПолуфабрикатов.ЗнакНДС * Т.НДСУпр * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2))) КАК СтоимостьУпр,
		|	СУММА(ВЫРАЗИТЬ(ЗатратыПолуфабрикатов.ЗнакНДС * Т.НДСРегл * ЕСТЬNULL(ЗатратыПолуфабрикатов.Коэффициент, 1) КАК ЧИСЛО(31,2))) КАК СтоимостьРегл,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр
		|ИЗ
		|	ВТДетализацияДобавление КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыПолуфабрикатов КАК ЗатратыПолуфабрикатов
		|		ПО Т.Партия = ЗатратыПолуфабрикатов.Партия
		|			И Т.АналитикаУчетаПартий = ЗатратыПолуфабрикатов.АналитикаУчетаПартий
		|			И Т.Организация = ЗатратыПолуфабрикатов.Организация
		|		 	И Т.ЭтоОстаток = ЗатратыПолуфабрикатов.ЭтоОстаток
		|			И ЗатратыПолуфабрикатов.ЗнакНДС <> 0
		|			И (Т.НДСУпр <> 0 ИЛИ Т.НДСРегл <> 0)
		|СГРУППИРОВАТЬ ПО
		|	Т.ЭтоОстаток,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ПартияВыпуска, Т.Партия),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.АналитикаУчетаПартийВыпуска, Т.АналитикаУчетаПартий),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ПартияПроизводства, Т.ПартияПроизводства),
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ВидЗапасовПолуфабриката, Т.ВидЗапасовПродукции),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.НоменклатураПолуфабриката, Т.НоменклатураПродукции),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ХарактеристикаПолуфабриката, Т.ХарактеристикаПродукции),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ВидЗапасовПродукции, Т.ВидЗапасовПродукции),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.НоменклатураПродукции, Т.НоменклатураПродукции),
		|	ЕСТЬNULL(ЗатратыПолуфабрикатов.ХарактеристикаПродукции, Т.ХарактеристикаПродукции),
		|	Т.СтатьяКалькуляции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	-4 КАК НомерЗатратыНаВыпуск,
		|	ЗатратыНаВыпуск.ЭтоОстаток,
		|	ЗатратыНаВыпуск.КорПартия КАК Партия,
		|	ЗатратыНаВыпуск.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ЗатратыНаВыпуск.Партия КАК ПартияПроизводства,
		|	ЗатратыНаВыпуск.Организация КАК Организация,
		|	ЗатратыНаВыпуск.ВидЗапасов КАК ВидЗапасов,
		|	ЗатратыНаВыпуск.Номенклатура КАК Номенклатура,
		|	ЗатратыНаВыпуск.Характеристика КАК Характеристика,
		|	ЗатратыНаВыпуск.ВидЗапасов КАК ВидЗапасовПолуфабриката,
		|	ЗатратыНаВыпуск.Номенклатура КАК НоменклатураПолуфабриката,
		|	ЗатратыНаВыпуск.Характеристика КАК ХарактеристикаПолуфабриката,
		|	ЗатратыНаВыпуск.КорВидЗапасов КАК ВидЗапасовПродукции,
		|	ЗатратыНаВыпуск.КорНоменклатура КАК НоменклатураПродукции,
		|	ЗатратыНаВыпуск.КорХарактеристика КАК ХарактеристикаПродукции,
		|	ЗатратыНаВыпуск.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|	ЗатратыНаВыпуск.СтоимостьУпр,
		|	ЗатратыНаВыпуск.СтоимостьРегл,
		|	ЗатратыНаВыпуск.ПостояннаяРазница,
		|	ЗатратыНаВыпуск.ВременнаяРазница,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр
		|ИЗ
		|	ВТПартииЗатрат КАК ПартииЗатрат
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК ЗатратыНаВыпуск
		|		ПО ЗатратыНаВыпуск.НомерЗатраты = ПартииЗатрат.НомерЗатраты
		|		 И ЗатратыНаВыпуск.ЭтоОстаток = ПартииЗатрат.ЭтоОстаток
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПолуфабрикатыКРасчету КАК ПолуфабрикатыКРасчету
		|		ПО ПартииЗатрат.Партия = ПолуфабрикатыКРасчету.Партия
		|		 И ПартииЗатрат.АналитикаУчетаПартий = ПолуфабрикатыКРасчету.АналитикаУчетаПартий
		|		 И ПартииЗатрат.Организация = ПолуфабрикатыКРасчету.Организация
		|		 И ПартииЗатрат.ЭтоОстаток = ПолуфабрикатыКРасчету.ЭтоОстаток
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииДобавление КАК Отбор
		|		ПО ПартииЗатрат.Партия = Отбор.Партия
		|		 И ПартииЗатрат.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартий
		|		 И ПартииЗатрат.Организация = Отбор.Организация
		|		 И ПартииЗатрат.ЭтоОстаток = Отбор.ЭтоОстаток
		|ГДЕ
		|	Отбор.Партия ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	Т.ЭтоПартияПроизводства,
		|	Т.НомерЗатратыНаВыпуск,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ПартияПроизводства,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.ВидЗапасовПродукции,
		|	Т.НоменклатураПродукции,
		|	Т.ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции,
		|	Т.ДокументПоступления,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	Т.НДСРегл,
		|	Т.НДСУпр
		|ПОМЕСТИТЬ ВТПартииДетализацияБезГруппировки
		|ИЗ
		|	ВТПартииДетализация КАК Т
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	ЛОЖЬ КАК ЭтоПартияПроизводства,
		|	Т.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.ПартияПроизводства КАК ПартияПроизводства,
		|	Т.Организация КАК Организация,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	Т.ВидЗапасовПродукции КАК ВидЗапасовПродукции,
		|	Т.НоменклатураПродукции КАК НоменклатураПродукции,
		|	Т.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	Т.ДокументПоступления КАК ДокументПоступления,
		|	Т.СтоимостьУпр КАК СтоимостьУпр,
		|	Т.СтоимостьРегл КАК СтоимостьРегл,
		|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
		|	Т.ВременнаяРазница КАК ВременнаяРазница,
		|	Т.НДСРегл КАК НДСРегл,
		|	Т.НДСУпр КАК НДСУпр
		|ИЗ
		|	ВТДетализацияДобавлениеРасширенная КАК Т
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	ИСТИНА КАК ЭтоПартияПроизводства,
		|	Т.НомерЗатратыНаВыпуск КАК НомерЗатратыНаВыпуск,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.ПартияПроизводства КАК ПартияПроизводства,
		|	Т.Организация КАК Организация,
		|	Т.ВидЗапасовПолуфабриката КАК ВидЗапасов,
		|	Т.НоменклатураПолуфабриката КАК Номенклатура,
		|	Т.ХарактеристикаПолуфабриката КАК Характеристика,
		|	Т.ВидЗапасовПродукции КАК ВидЗапасовПродукции,
		|	Т.НоменклатураПродукции КАК НоменклатураПродукции,
		|	Т.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	Т.ДокументПоступления КАК ДокументПоступления,
		|	Т.СтоимостьУпр КАК СтоимостьУпр,
		|	Т.СтоимостьРегл КАК СтоимостьРегл,
		|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
		|	Т.ВременнаяРазница КАК ВременнаяРазница,
		|	Т.НДСРегл КАК НДСРегл,
		|	Т.НДСУпр КАК НДСУпр
		|ИЗ
		|	ВТДетализацияДобавлениеРасширенная КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	АналитикаУчетаПартий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПартииДетализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	Т.ЭтоПартияПроизводства,
		|	Т.НомерЗатратыНаВыпуск,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ПартияПроизводства,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.ВидЗапасовПродукции,
		|	Т.НоменклатураПродукции,
		|	Т.ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции,
		|	Т.ДокументПоступления,
		|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
		|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
		|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
		|	СУММА(Т.НДСРегл) КАК НДСРегл,
		|	СУММА(Т.НДСУпр) КАК НДСУпр
		|ПОМЕСТИТЬ ВТПартииДетализация
		|ИЗ
		|	ВТПартииДетализацияБезГруппировки КАК Т
		|СГРУППИРОВАТЬ ПО
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ЭтоОстаток,
		|	Т.ЭтоПартияПроизводства,
		|	Т.НомерЗатратыНаВыпуск,
		|	Т.ПартияПроизводства,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.ВидЗапасовПродукции,
		|	Т.НоменклатураПродукции,
		|	Т.ХарактеристикаПродукции,
		|	Т.СтатьяКалькуляции,
		|	Т.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	Т.НомерЗатраты,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.СтатьяКалькуляции,
		|	Т.КорПартия,
		|	Т.ДокументПоступления,
		|	Т.НДСВключенВСтоимость,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	Т.НДСРегл,
		|	Т.НДСУпр,
		|	Т.Количество
		// Шаг 11.4
		|ПОМЕСТИТЬ ВТПартииЗатратПромежуточная
		|ИЗ
		|	ВТПартииЗатрат КАК Т
		|ГДЕ
		|	НЕ (Т.Партия, Т.АналитикаУчетаПартий, Т.ЭтоОстаток) В
		|		(ВЫБРАТЬ Отбор1.Партия, Отбор1.АналитикаУчетаПартий, Отбор1.ЭтоОстаток ИЗ ВТПолуфабрикатыКРасчету КАК Отбор1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПартииЗатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	Т.НомерЗатраты,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.СтатьяКалькуляции,
		|	Т.КорПартия,
		|	Т.ДокументПоступления,
		|	Т.НДСВключенВСтоимость,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	Т.НДСРегл,
		|	Т.НДСУпр,
		|	Т.Количество
		|ПОМЕСТИТЬ ВТПартииЗатрат
		|ИЗ
		|	ВТПартииЗатратПромежуточная КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	Т.НомерЗатраты,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.КорПартия,
		|	Т.КорАналитикаУчетаПартий,
		|	Т.КорНоменклатура,
		|	Т.КорХарактеристика,
		|	Т.КорВидЗапасов,
		|	Т.СтатьяКалькуляции,
		|	Т.НДСВключенВСтоимость,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	Т.КоличествоВыпуск,
		|	Т.Количество
		|ПОМЕСТИТЬ ВТЗатратыНаВыпускПромежуточная
		|ИЗ
		|	ВТЗатратыНаВыпуск КАК Т
		|ГДЕ
		|	(Т.Партия, Т.Организация, Т.ЭтоОстаток) В
		|		(ВЫБРАТЬ Отбор1.КорПартия, Отбор1.Организация, Отбор1.ЭтоОстаток ИЗ ВТПартииЗатрат КАК Отбор1)
		|	И Т.НомерЗатраты <> -1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗатратыНаВыпуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ЭтоОстаток,
		|	Т.НомерЗатраты,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.Организация,
		|	Т.ВидЗапасов,
		|	Т.Номенклатура,
		|	Т.Характеристика,
		|	Т.КорПартия,
		|	Т.КорАналитикаУчетаПартий,
		|	Т.КорНоменклатура,
		|	Т.КорХарактеристика,
		|	Т.КорВидЗапасов,
		|	Т.СтатьяКалькуляции,
		|	Т.НДСВключенВСтоимость,
		|	Т.СтоимостьУпр,
		|	Т.СтоимостьРегл,
		|	Т.ПостояннаяРазница,
		|	Т.ВременнаяРазница,
		|	Т.КоличествоВыпуск,
		|	Т.Количество
		|ПОМЕСТИТЬ ВТЗатратыНаВыпуск
		|ИЗ
		|	ВТЗатратыНаВыпускПромежуточная КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПолуфабрикатыКРасчету
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.ЭтоОстаток,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.Организация КАК Организация
		|ПОМЕСТИТЬ ВТПолуфабрикатыКРасчету
		|ИЗ
		|	ВТПартииЗатрат КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗатратыНаВыпуск КАК Отбор
		|		ПО Т.Партия = Отбор.КорПартия
		|		И Т.АналитикаУчетаПартий = Отбор.КорАналитикаУчетаПартий
		|		И Т.Номенклатура = Отбор.КорНоменклатура
		|		И Т.Характеристика = Отбор.КорХарактеристика
		|		И Т.ВидЗапасов = Отбор.КорВидЗапасов
		|		И Т.Организация = Отбор.Организация
		|		И Т.ЭтоОстаток = Отбор.ЭтоОстаток
		|ГДЕ
		|	Отбор.КорПартия ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	ВТПолуфабрикатыКРасчету КАК Т
		|";
		
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина, Пояснение);
		ПродолжатьРасчет = НЕ РезультатЗапроса.Пустой();
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
			"ВТДетализацияДобавление, ВТЗатратыПолуфабрикатов, ВТПартииДобавление, ВТДетализацияДобавлениеРасширенная,
			|ВТПартииЗатратПромежуточная, ВТЗатратыНаВыпускПромежуточная, ВТПартииДетализацияБезГруппировки");
		
		#КонецОбласти
	
	КонецЦикла;
	
	#КонецОбласти
	
	#Область РассчитанныеПартии
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоПартияПроизводства,
	|	ЕСТЬNULL(ПартииКРасчету.Номенклатура, Т.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ПартииКРасчету.Характеристика, Т.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ПартииКРасчету.ВидЗапасов, Т.ВидЗапасов) КАК ВидЗапасов,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	МАКСИМУМ(ЕСТЬNULL(ВсеПартииПроизводства.ПартияПроизводства, ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка))) КАК ПартияПроизводства,
	|	МАКСИМУМ(ЕСТЬNULL(ВсеПартииПроизводства.НДСВключенВСтоимость, ЛОЖЬ)) КАК НДСВключенВСтоимость,
	|	МАКСИМУМ(ЕСТЬNULL(ПартииКРасчету.БезДетализации, ИСТИНА)) КАК БезДетализации,
	|	МАКСИМУМ(ЕСТЬNULL(СменаВидаДеятельностиНДС.ЕстьИзменениеВидаДеятельностиНДС, ЛОЖЬ)) КАК ЕстьИзменениеВидаДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
	|	ЕСТЬNULL(ПартииКРасчету.Количество, 0) КАК Количество,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(ВЫБОР КОГДА СменаВидаДеятельностиНДС.Партия ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Т.НДСРегл КОНЕЦ) КАК НДСРегл,
	|	СУММА(ВЫБОР КОГДА СменаВидаДеятельностиНДС.Партия ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Т.НДСУпр КОНЕЦ) КАК НДСУпр
	|ПОМЕСТИТЬ ВТРассчитанныеПартииПредварительная
	|ИЗ
	|	ВТПартииДетализация КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииКРасчету КАК ПартииКРасчету
	|		ПО Т.Партия = ПартииКРасчету.Партия
	|		 И Т.АналитикаУчетаПартий = ПартииКРасчету.АналитикаУчетаПартий
	|		 И Т.ЭтоОстаток = ПартииКРасчету.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК СменаВидаДеятельностиНДС
	|		ПО Т.Партия = СменаВидаДеятельностиНДС.Партия
	|		 И Т.АналитикаУчетаПартий = СменаВидаДеятельностиНДС.АналитикаУчетаПартий
	|		 И Т.ЭтоОстаток = СменаВидаДеятельностиНДС.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеПартииПроизводства КАК ВсеПартииПроизводства
	|		ПО Т.Партия = ВсеПартииПроизводства.ПартияВыпуска
	|		 И Т.АналитикаУчетаПартий = ВсеПартииПроизводства.АналитикаУчетаПартий
	|		 И Т.ЭтоОстаток = ВсеПартииПроизводства.ЭтоОстаток
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.Партия) В (&ТипыДокументовПартии)
	|	И НЕ Т.ЭтоПартияПроизводства
	|	И НЕ ЕСТЬNULL(СменаВидаДеятельностиНДС.ЕстьНДС, ЛОЖЬ) // уже есть записи в регистре детализации продукции, в т.ч. есть записи НДС 
	|	И НЕ Т.ЭтоОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПартииКРасчету.Номенклатура, Т.Номенклатура),
	|	ЕСТЬNULL(ПартииКРасчету.Характеристика, Т.Характеристика),
	|	ЕСТЬNULL(ПартииКРасчету.ВидЗапасов, Т.ВидЗапасов),
	|	ЕСТЬNULL(ПартииКРасчету.Количество, 0),
	|	Т.СтатьяКалькуляции,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ДокументПоступления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоПартияПроизводства,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ПартияПроизводства КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.ПартияПроизводства КАК ПартияПроизводства,
	|	МАКСИМУМ(ЕСТЬNULL(ВсеПартииПроизводства.НДСВключенВСтоимость, ЛОЖЬ)) КАК НДСВключенВСтоимость,
	|	МАКСИМУМ(ПартииКРасчету.БезДетализации) КАК БезДетализации,
	|	МАКСИМУМ(ЕСТЬNULL(СменаВидаДеятельностиНДС.ЕстьИзменениеВидаДеятельностиНДС, ЛОЖЬ)) КАК ЕстьИзменениеВидаДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
	|	СУММА(ПартииКРасчету.Количество) КАК Количество,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(ВЫБОР КОГДА СменаВидаДеятельностиНДС.Партия ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Т.НДСРегл КОНЕЦ) КАК НДСРегл,
	|	СУММА(ВЫБОР КОГДА СменаВидаДеятельностиНДС.Партия ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Т.НДСУпр КОНЕЦ) КАК НДСУпр
	|ИЗ
	|	ВТПартииДетализация КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииПроизводстваИзЗатратНаВыпуск КАК ПартииКРасчету
	|		ПО Т.ПартияПроизводства = ПартииКРасчету.Партия
	|		 И Т.Организация = ПартииКРасчету.Организация
	|		 И Т.ВидЗапасов = ПартииКРасчету.ВидЗапасов
	|		 И Т.Номенклатура = ПартииКРасчету.Номенклатура
	|		 И Т.Характеристика = ПартииКРасчету.Характеристика
	|		 И Т.Партия = ПартииКРасчету.КорПартия
	|		 И Т.АналитикаУчетаПартий = ПартииКРасчету.КорАналитикаУчетаПартий
	|		 И Т.НоменклатураПродукции = ПартииКРасчету.КорНоменклатура
	|		 И Т.ВидЗапасовПродукции = ПартииКРасчету.КорВидЗапасов
	|		 И Т.ХарактеристикаПродукции = ПартииКРасчету.Характеристика
	|		 И Т.ЭтоОстаток = ПартииКРасчету.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК СменаВидаДеятельностиНДС
	|		ПО Т.Партия = СменаВидаДеятельностиНДС.Партия
	|		 И Т.АналитикаУчетаПартий = СменаВидаДеятельностиНДС.АналитикаУчетаПартий
	|		 И Т.ЭтоОстаток = СменаВидаДеятельностиНДС.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеПартииПроизводства КАК ВсеПартииПроизводства
	|		ПО Т.Партия = ВсеПартииПроизводства.ПартияВыпуска
	|		 И Т.АналитикаУчетаПартий = ВсеПартииПроизводства.АналитикаУчетаПартий
	|		 И Т.ЭтоОстаток = ВсеПартииПроизводства.ЭтоОстаток
	|ГДЕ
	|	Т.ЭтоПартияПроизводства
	|	И Т.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И НЕ ЕСТЬNULL(СменаВидаДеятельностиНДС.ЕстьНДС, ЛОЖЬ) // уже есть записи в регистре детализации продукции, в т.ч. есть записи НДС 
	|	И НЕ Т.ЭтоОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.ПартияПроизводства,
	|	Т.Организация,
	|	Т.ДокументПоступления,
	|	Т.Партия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоПартияПроизводства,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ПартияПроизводства КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.ПартияПроизводства КАК ПартияПроизводства,
	|	МАКСИМУМ(ЕСТЬNULL(ВсеПартииПроизводства.НДСВключенВСтоимость, ЛОЖЬ)) КАК НДСВключенВСтоимость,
	|	МАКСИМУМ(ПартииКРасчету.БезДетализации) КАК БезДетализации,
	|	МАКСИМУМ(ЕСТЬNULL(СменаВидаДеятельностиНДС.ЕстьИзменениеВидаДеятельностиНДС, ЛОЖЬ)) КАК ЕстьИзменениеВидаДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеПереходНаРегистрДетализацияПродукции) КАК ТипЗаписи,
	|	СУММА(ПартииКРасчету.Количество) КАК Количество,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(ВЫБОР КОГДА СменаВидаДеятельностиНДС.Партия ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Т.НДСРегл КОНЕЦ) КАК НДСРегл,
	|	СУММА(ВЫБОР КОГДА СменаВидаДеятельностиНДС.Партия ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Т.НДСУпр КОНЕЦ) КАК НДСУпр
	|ИЗ
	|	ВТПартииДетализация КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииПроизводстваИзЗатратНаВыпуск КАК ПартииКРасчету
	|		ПО Т.ПартияПроизводства = ПартииКРасчету.Партия
	|		 И Т.Организация = ПартииКРасчету.Организация
	|		 И Т.ВидЗапасов = ПартииКРасчету.ВидЗапасов
	|		 И Т.Номенклатура = ПартииКРасчету.Номенклатура
	|		 И Т.Характеристика = ПартииКРасчету.Характеристика
	|		 И Т.Партия = ПартииКРасчету.КорПартия
	|		 И Т.АналитикаУчетаПартий = ПартииКРасчету.КорАналитикаУчетаПартий
	|		 И Т.НоменклатураПродукции = ПартииКРасчету.КорНоменклатура
	|		 И Т.ВидЗапасовПродукции = ПартииКРасчету.КорВидЗапасов
	|		 И Т.ХарактеристикаПродукции = ПартииКРасчету.КорХарактеристика
	|		 И Т.ЭтоОстаток = ПартииКРасчету.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеВидаДеятельностиНДС КАК СменаВидаДеятельностиНДС
	|		ПО Т.Партия = СменаВидаДеятельностиНДС.Партия
	|		 И Т.АналитикаУчетаПартий = СменаВидаДеятельностиНДС.АналитикаУчетаПартий
	|		 И Т.ЭтоОстаток = СменаВидаДеятельностиНДС.ЭтоОстаток
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеПартииПроизводства КАК ВсеПартииПроизводства
	|		ПО Т.Партия = ВсеПартииПроизводства.ПартияВыпуска
	|		 И Т.АналитикаУчетаПартий = ВсеПартииПроизводства.АналитикаУчетаПартий
	|		 И Т.Номенклатура = ВсеПартииПроизводства.Номенклатура
	|		 И Т.ВидЗапасов = ВсеПартииПроизводства.ВидЗапасов
	|		 И Т.Характеристика = ВсеПартииПроизводства.Характеристика
	|		 И Т.ЭтоОстаток = ВсеПартииПроизводства.ЭтоОстаток
	|ГДЕ
	|	Т.ЭтоПартияПроизводства
	|	И Т.ПартияПроизводства = Т.Партия
	|	И НЕ ЕСТЬNULL(СменаВидаДеятельностиНДС.ЕстьНДС, ЛОЖЬ) // уже есть записи в регистре детализации продукции, в т.ч. есть записи НДС 
	|	И Т.ЭтоОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.ПартияПроизводства,
	|	Т.Организация,
	|	Т.ДокументПоступления,
	|	Т.Партия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Выбор данных:
	// БезДетализации И НЕ ЕстьИзменениеВидаДеятельностиНДС - берем только суммы без НДС
	// БезДетализации И ЕстьИзменениеВидаДеятельностиНДС - берем все суммы
	// НЕ БезДетализации И НЕ ЕстьИзменениеВидаДеятельностиНДС - ничего не берем, т.к. детализация уже есть
	// НЕ БезДетализации И ЕстьИзменениеВидаДеятельностиНДС - только суммы НДС
	|ВЫБРАТЬ
	|	&НачалоПериода КАК ПериодРегистрации,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ДокументПоступления,
	|	Т.ПартияПроизводства,
	|	Т.Количество,
	|	МАКСИМУМ(Т.НДСВключенВСтоимость) КАК НДСВключенВСтоимость,
	|	Т.ТипЗаписи,
	|	СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.СтоимостьРегл ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьРегл,
	|	СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.СтоимостьУпр ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.ПостояннаяРазница ИНАЧЕ 0 КОНЕЦ) КАК ПостояннаяРазница,
	|	СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.ВременнаяРазница ИНАЧЕ 0 КОНЕЦ) КАК ВременнаяРазница,
	|	СУММА(ВЫБОР КОГДА Т.ЕстьИзменениеВидаДеятельностиНДС ТОГДА Т.НДСРегл ИНАЧЕ 0 КОНЕЦ) КАК НДСРегл,
	|	СУММА(ВЫБОР КОГДА Т.ЕстьИзменениеВидаДеятельностиНДС ТОГДА Т.НДСУпр ИНАЧЕ 0 КОНЕЦ) КАК НДСУпр
	|ПОМЕСТИТЬ ВТРассчитанныеПартии
	|ИЗ
	|	ВТРассчитанныеПартииПредварительная КАК Т
	|ГДЕ
	|	Т.БезДетализации ИЛИ Т.ЕстьИзменениеВидаДеятельностиНДС
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.СтатьяКалькуляции,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ДокументПоступления,
	|	Т.ПартияПроизводства,
	|	Т.Количество,
	|	Т.ТипЗаписи
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.СтоимостьРегл ИНАЧЕ 0 КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.СтоимостьУпр ИНАЧЕ 0 КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.ПостояннаяРазница ИНАЧЕ 0 КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР КОГДА Т.БезДетализации ТОГДА Т.ВременнаяРазница ИНАЧЕ 0 КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР КОГДА Т.ЕстьИзменениеВидаДеятельностиНДС ТОГДА Т.НДСРегл ИНАЧЕ 0 КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР КОГДА Т.ЕстьИзменениеВидаДеятельностиНДС ТОГДА Т.НДСУпр ИНАЧЕ 0 КОНЕЦ) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
		"ВТПартииКРасчету, ВТИзменениеВидаДеятельностиНДС, ВТПартииПроизводстваИзЗатратНаВыпуск, ВТПартииЗатратДляНДС,
		|ВТПартииЗатратПрошлыхПериодов, ВТВсеПартииПроизводства, ВТПартииДетализация, ВТПартииПроизводства,
		|ВТПартииЗатрат, ВТЗатратыНаВыпуск, ВТПолуфабрикатыКРасчету, ВТРассчитанныеПартииПредварительная");
	
	ПараметрыРасчета.ВремяНачалаЗаписи = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписатьСформированныеДвижения(ПараметрыРасчета);

	ПараметрыРасчета.ВремяОкончанияЗаписи = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПараметрыРасчета.ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДлительностьЗаписи = (ПараметрыРасчета.ВремяОкончанияЗаписи - ПараметрыРасчета.ВремяНачалаЗаписи) / 1000;
	ДлительностьРасчета = (ПараметрыРасчета.ВремяОкончания - ПараметрыРасчета.ВремяНачала) / 1000;
	
	ТекстПротокола = НСтр("ru = 'Протокол выполнения расчета детализации продукции.
		|Начало расчета: %1
		|Длительность расчета: %2, в т.ч. длительность записи движений: %3
		|
		|Выполнение запросов:
		|%4';
		|en = 'Протокол выполнения расчета детализации продукции.
		|Начало расчета: %1
		|Длительность расчета: %2, в т.ч. длительность записи движений: %3
		|
		|Выполнение запросов:
		|%4'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ТекстПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПротокола,
		РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(ПараметрыРасчета.ДатаНачала),
		РасчетСебестоимостиПротоколРасчета.ПредставлениеВремени(ДлительностьРасчета),
		РасчетСебестоимостиПротоколРасчета.ПредставлениеВремени(ДлительностьЗаписи),
		ПараметрыРасчета.РезультатВыполненияЗапроса);
	
	ЗаписьЖурналаРегистрации(
		СокрЛП(Справочники.ОперацииЗакрытияМесяца.РасчетДетализацииПродукции) + "." + НСтр("ru = 'Протокол выполнения расчета';
																							|en = 'Протокол выполнения расчета'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,,,
		ТекстПротокола);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

#Область РасчетДетализацииПродукции

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
//
Процедура ДобавитьЭтап_РасчетДетализацииПродукции(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Справочники.ОперацииЗакрытияМесяца.РасчетДетализацииПродукции);
	ПредшествующиеЭтапы = НоваяСтрока.ПредшествующиеЭтапы; // Массив	
	ПредшествующиеЭтапы.Добавить(Справочники.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости);
	
	НоваяСтрока.МультиязычноеНаименование = "ru = 'Расчет детализации продукции';
											|en = 'Расчет детализации продукции'"; // @НСтр-1
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Рассчитать';
										|en = 'Рассчитать'");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РасчетДетализацииПродукции.Использование_РасчетДетализацииПродукции");
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РасчетДетализацииПродукции.Оформление_РасчетДетализацииПродукции");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"РасчетДетализацииПродукции.Выполнить_РасчетДетализацииПродукции");
// ТоДо	
//	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
//		Метаданные.РегистрыСведений.ПротоколыРасчетаПартийИСебестоимости.Формы.ФормаПросмотраПротоколов.ПолноеИмя());
//	НоваяСтрока.ДействиеПодробнее.ОткрыватьВместоЖР = Истина;
//	НоваяСтрока.ДействиеПодробнее.НеТребуетсяПриУспешномВыполнении = Истина;
	НоваяСтрока.ВыполняетсяПриПредварительномЗакрытииМесяца = Ложь;
	
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_РасчетДетализацииПродукции(ПараметрыОбработчика) Экспорт
	
	Если ЗакрытиеМесяцаСервер.РасчетЭтапаНеТребуется(ПараметрыОбработчика.ДанныеЭтапа) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	ПериодРасчета    = НачалоМесяца(ПараметрыРасчета.ПериодРегистрации);
	
	МассивОрганизаций = ПараметрыОбработчика.ДанныеЭтапа.МассивОрганизаций;
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, МассивОрганизаций.Количество());

	Если НЕ РасчетСебестоимостиПовтИсп.ИспользуетсяДетализацияПродукции(ПериодРасчета) Тогда
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Не ведется учет детализации выпущенной продукции по статьям калькуляции.';
				|en = 'Не ведется учет детализации выпущенной продукции по статьям калькуляции.'"));
		Возврат;
	КонецЕсли;

	// Проверим ведение учета себестоимости - расчет возможен начиная с месяца, предшествующему началу учета (с момента ввода остатков).
	Если НЕ РасчетСебестоимостиПовтИсп.ВозможенРасчетСебестоимости(ПериодРасчета) Тогда
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет движений по регистрам себестоимости.';
				|en = 'Нет движений по регистрам себестоимости.'"));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	СоздатьВременнуюТаблицуОрганизацийДляДетализацииПродукции(Запрос, "ВТОрганизацииДляРасчетаДетализацииПродукции", ПериодРасчета);

	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТОрганизацииДляРасчетаДетализацииПродукции = 0 Тогда

		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет организаций, для которых в учетной политике используется метод оценки ""ФИФО скользящая""';
				|en = 'Нет организаций, для которых в учетной политике используется метод оценки ""ФИФО скользящая""'",
			ОбщегоНазначения.КодОсновногоЯзыка()));
	Иначе
		
		ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца(ПараметрыОбработчика, Истина, "ВТОрганизацииДляРасчетаДетализацииПродукции");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Оформление_РасчетДетализацииПродукции(ПараметрыОбработчика) Экспорт
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстПодробнее = "";
	
	Если ЗакрытиеМесяцаСервер.ТребуетсяПересчетЭтапа(ПараметрыОбработчика.ДанныеЭтапа) Тогда
		
// ТоДо
//		ПротоколыРасчета = РегистрыСведений.ОшибкиРасчетаПартийИСебестоимости.ПолучитьПротоколыРасчета(
//			ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации,
//			ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций);
//		
//		ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПротоколыРасчета.Количество());
//		
//		Если ЗначениеЗаполнено(ПротоколыРасчета) Тогда
//			ПараметрыОбработчика.ДанныеЭтапа.ТекстПодробнее = ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию();
//		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Выполнить_РасчетДетализацииПродукции(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	ДополнительныеСвойства = ПараметрыОбработчика.ДанныеЭтапа.ДополнительныеСвойства;

	НачалоПериода = ЗакрытиеМесяцаСервер.НачалоРасчета(ПараметрыОбработчика.ДанныеЭтапа.Код,
		ПараметрыРасчета.КонецПериода, , ПараметрыРасчета.МассивОрганизаций);
		
	Если НачалоПериода > ПараметрыРасчета.КонецПериода
	 И (ПараметрыОбработчика.ДанныеЭтапа.Состояние = Перечисления.СостоянияОперацийЗакрытияМесяца.ВыполненоСОшибками
	  ИЛИ ПараметрыОбработчика.ДанныеЭтапа.Состояние = Перечисления.СостоянияОперацийЗакрытияМесяца.НеВыполнено) Тогда
		НачалоПериода = ПараметрыРасчета.НачалоПериода;
	КонецЕсли;
	
	Пока НачалоПериода <= ПараметрыРасчета.КонецПериода Цикл
		
		ОкончаниеПериода = КонецМесяца(НачалоПериода);
		ДоступныеОрганизации = ЗакрытиеМесяцаСервер.ДоступныеДляРасчетаОрганизации(НачалоПериода, ПараметрыРасчета.МассивОрганизаций);
		НомерЗаданияДоРасчета = ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания();
		
		// Этап 1. Подготовка работы с заданиями.

		НачатьТранзакцию();

		Попытка
			ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(НомерЗаданияДоРасчета, ДоступныеОрганизации,
				ПараметрыОбработчика.ДанныеЭтапа.Код);
			ДанныеКРасчетуЗаМесяц = ЗакрытиеМесяцаСервер.ЗаданияКРасчетуЗаМесяц(НачалоПериода, ОкончаниеПериода,
				НомерЗаданияДоРасчета, ДоступныеОрганизации, ПараметрыОбработчика.ДанныеЭтапа.Код);

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр(
					"ru = 'При выполнении расчета за период %1 произошла ошибка:
					|%2';
					|en = 'An error occurred when calculating for the %1 period:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(НачалоПериода),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(ПараметрыОбработчика, ТекстОшибки,
				ДоступныеОрганизации, НачалоПериода);
		КонецПопытки;
		
		// Этап 2. Собственно расчет по организациям и периоду.
		Попытка

			ПараметрыЗапуска = Новый Структура;
			ПараметрыЗапуска.Вставить("НачалоПериода", 				НачалоПериода);
			ПараметрыЗапуска.Вставить("МассивОрганизаций",  	    ДоступныеОрганизации);
			ПараметрыЗапуска.Вставить("МестоВызоваРасчета", 	    "РасчетДетализацииПродукции.Выполнить_РасчетДетализацииПродукции");
			ПараметрыЗапуска.Вставить("ВыполняетсяЗакрытиеМесяца",  Истина);
			ПараметрыЗапуска.Вставить("АвтоматическоеТестирование", ПараметрыОбработчика.АвтоматическоеТестирование);
			ПараметрыЗапуска.Вставить("РежимЗакрытияМесяца",        ПараметрыОбработчика.РежимЗакрытияМесяца);
			ПараметрыЗапуска.Вставить("ИдентификаторРасчета", 		ПараметрыОбработчика.ИдентификаторРасчета);
			ПараметрыЗапуска.Вставить("ТолькоОднаОрганизация",	Ложь);
			
			РассчитатьДетализациюПродукции(ПараметрыЗапуска);
		
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр(
					"ru = 'Расчет детализации продукции по статьям калькуляции за период %1 завершилось с ошибкой:
					|%2';
					|en = 'Расчет детализации продукции по статьям калькуляции за период %1 завершилось с ошибкой:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(НачалоПериода),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(ПараметрыОбработчика, ТекстОшибки,
				ДанныеКРасчетуЗаМесяц.Организация, НачалоПериода);
		КонецПопытки;
		
		// Этап 3. Завершение работы с заданиями.

		ЗакрытиеМесяцаСервер.УдалитьЗаданияКРасчетуЗаТекущийПериод(ПараметрыОбработчика, ДанныеКРасчетуЗаМесяц);

		НачалоПериода = ОкончаниеПериода + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_РасчетДетализацииПродукции(ТаблицаПроверок) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура СформироватьДетализациюПродукции(МенеджерВременныхТаблиц, ИмяТаблицыОтбора, ИмяПоляОтбора, ИмяТаблицыДетализации = "ВТПартииПродукцииСоСтатьямиКалькуляции") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МетаПартии = Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартийПродукции.Измерения.Партия;
	ТипыДокументовПартии = Новый Массив;
	
	Для Каждого ТипПартии Из МетаПартии.Тип.Типы() Цикл
		ТипыДокументовПартии.Добавить(ТипПартии);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТипыДокументовПартии", ТипыДокументовПартии);
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ИмяПоляОтбора КАК Регистратор
	|ПОМЕСТИТЬ ВТОтборРегистраторы
	|ИЗ
	|	ИмяТаблицыОтбора КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяПоляОтбора", ИмяПоляОтбора);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыОтбора", ИмяТаблицыОтбора);

	Запрос.Текст = 	Запрос.Текст + "
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|" + "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	Т.Регистратор КАК Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Т.КорПартия
	|	КОНЕЦ КАК КорПартия,
	|	ВЫБОР КОГДА Т.КорПартия = НЕОПРЕДЕЛЕНО
	|	  ИЛИ Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ Т.КорАналитикаУчетаПартий
	|	КОНЕЦ КАК КорАналитикаУчетаПартий,
	|
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|
	|	Т.Подразделение КАК Подразделение,
	|	Т.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторСтроки,
	|	Т.ИдентификаторФинЗаписи,
	|
	|	СУММА(Т.Количество) КАК Количество,
	|	СУММА(Т.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(Т.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(Т.СтоимостьУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр + Т.ТрудозатратыУпр) КАК СтоимостьУпр,
	|	СУММА(Т.СтоимостьРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл + Т.ТрудозатратыРегл) КАК СтоимостьРегл,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТДвиженияСебестоимость
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборРегистраторы КАК Отбор
	|		ПО Т.Регистратор = Отбор.Регистратор
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.Партия) В (&ТипыДокументовПартии)
	|	И Т.Партия <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика,
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	Т.КорПартия,
	|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Т.КорПартия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Т.КорПартия = НЕОПРЕДЕЛЕНО
	|	  ИЛИ Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ Т.КорАналитикаУчетаПартий
	|	КОНЕЦ,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.Подразделение,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторСтроки,
	|	Т.ИдентификаторФинЗаписи
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|	((Партия),
	|	 (КорПартия),
	|	 (НомерЗаписи))
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР КОГДА Т.Количество <> 0 ТОГДА Т.НомерЗаписи ИНАЧЕ -1 КОНЕЦ) КАК НомерЗаписи,
	|	Т.Регистратор,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.Количество <> 0 ТОГДА Т.НомерСтроки ИНАЧЕ -1 КОНЕЦ) КАК НомерСтроки,
	|	Т.Период,
	|	Т.Организация,
	|	Т.ВидДвижения,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|
	|	МАКСИМУМ(ВЫБОР КОГДА Т.Количество <> 0 ТОГДА Т.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КОНЕЦ) КАК Подразделение,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.Количество <> 0 ТОГДА Т.НастройкаХозяйственнойОперации ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КОНЕЦ) КАК НастройкаХозяйственнойОперации,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.Количество <> 0 ТОГДА Т.ИдентификаторСтроки ИНАЧЕ """" КОНЕЦ) КАК ИдентификаторСтроки,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.Количество <> 0 ТОГДА Т.ИдентификаторФинЗаписи ИНАЧЕ """" КОНЕЦ) КАК ИдентификаторФинЗаписи,
	|
	|	ВЫБОР КОГДА МАКСИМУМ(Т.Количество) > 0 ТОГДА МАКСИМУМ(Т.Количество) ИНАЧЕ МИНИМУМ(Т.Количество) КОНЕЦ КАК Количество,
	|	СУММА(Т.ДопРасходыРегл) КАК Себестоимость_ДопРасходыРегл,
	|	СУММА(Т.ДопРасходыУпр) КАК Себестоимость_ДопРасходыУпр,
	|	СУММА(Т.СтоимостьУпр) КАК Себестоимость_СтоимостьУпр,
	|	СУММА(Т.СтоимостьРегл) КАК Себестоимость_СтоимостьРегл,
	|	СУММА(Т.ПостояннаяРазница) КАК Себестоимость_ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК Себестоимость_ВременнаяРазница
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостьСвернутая
	|ИЗ
	|	ВТДвиженияСебестоимость КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	ТИПЗНАЧЕНИЯ(Т.Партия) = ТИП(Справочник.ПартииПроизводства)
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР КОГДА МАКСИМУМ(Т.Количество) > 0 ТОГДА МАКСИМУМ(Т.Количество) ИНАЧЕ МИНИМУМ(Т.Количество) КОНЕЦ <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|	((Партия),
	|	 (КорПартия),
	|	 (НомерЗаписи))
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Детализация.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Детализация.ПартияПроизводства КАК ПартияПроизводства,
	|	Детализация.ДокументПоступления КАК ДокументПоступления,
	|	(ЕСТЬNULL(Детализация.НДСРегл, 0) <> 0 ИЛИ ЕСТЬNULL(Детализация.НДСУпр, 0) <> 0) КАК ЕстьНДС,
	|
	|	ВЫРАЗИТЬ((Т.Количество / Детализация.Количество) * Детализация.СтоимостьРегл КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ((Т.Количество / Детализация.Количество) * Детализация.НДСРегл КАК ЧИСЛО(31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ((Т.Количество / Детализация.Количество) * Детализация.СтоимостьУпр КАК ЧИСЛО(31,2)) КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ((Т.Количество / Детализация.Количество) * Детализация.НДСУпр КАК ЧИСЛО(31,2)) КАК НДСУпр,
	|	ВЫРАЗИТЬ((Т.Количество / Детализация.Количество) * Детализация.ПостояннаяРазница КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ((Т.Количество / Детализация.Количество) * Детализация.ВременнаяРазница КАК ЧИСЛО(31,2)) КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТДетализацияСебестоимости
	|ИЗ
	|	ВТДвиженияСебестоимостьСвернутая КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК Детализация
	|		ПО Т.Партия = Детализация.Партия
	|		И Т.АналитикаУчетаПартий = Детализация.АналитикаУчетаПартий
	|		И Т.Организация = Детализация.Организация
	|		И Т.ВидЗапасов = Детализация.ВидЗапасов
	|		И Т.Номенклатура = Детализация.Номенклатура
	|		И Т.Характеристика = Детализация.Характеристика
	|		И Детализация.Количество <> 0
	|		И Детализация.ПериодРегистрации <= Т.Период
	|		И Детализация.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	 НомерЗаписи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	МАКСИМУМ(Т.ПартияПроизводства) КАК ПартияПроизводства,
	|	МАКСИМУМ(Т.ЕстьНДС) КАК ЕстьНДС,
	|
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТДетализацияСебестоимостиСвернутая
	|ИЗ
	|	ВТДетализацияСебестоимости КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НомерЗаписи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	 НомерЗаписи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостиДляНДСДопРасходов
	|ИЗ
	|	ВТДвиженияСебестоимость КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДетализацияСебестоимостиСвернутая КАК Отбор
	|		ПО Т.НомерЗаписи = Отбор.НомерЗаписи
	|		И Т.НомерЗаписи = Отбор.НомерЗаписи
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.Партия) <> ТИП(Справочник.ПартииПроизводства)
	|ИНДЕКСИРОВАТЬ ПО
	|	 Партия
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Цены.СтатьяРасходов,
	|	Цены.ДокументПоступления,
	|	ВЫРАЗИТЬ(Т.Количество * Цены.НДСРегл КАК ЧИСЛО (31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Т.Количество * Цены.НДСУпр КАК ЧИСЛО (31,2)) КАК НДСУпр
	|ПОМЕСТИТЬ ВТСуммыПартийНДСПоСтатьям
	|ИЗ
	|	ВТДвиженияСебестоимостиДляНДСДопРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Цены
	|		ПО Т.Партия = Цены.Партия
	|		И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартий
	|		И Т.Организация = Цены.Организация
	|		И Т.ВидЗапасов = Цены.ВидЗапасов
	|		И Т.Номенклатура = Цены.Номенклатура
	|		И Т.Характеристика = Цены.Характеристика
	|		И Цены.ПериодРегистрации <= Т.Период
	|		И (Цены.НДСРегл <> 0
	|			ИЛИ Цены.НДСУпр <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Цены.СтатьяРасходов,
	|	Цены.ДокументПоступления,
	|	ВЫРАЗИТЬ(Т.Количество * Цены.НДСРегл КАК ЧИСЛО (31,2)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Т.Количество * Цены.НДСУпр КАК ЧИСЛО (31,2)) КАК НДСУпр
	|ИЗ
	|	ВТДвиженияСебестоимостиДляНДСДопРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Цены
	|		ПО Т.Партия = Цены.Партия
	|		И Т.Организация = Цены.Организация
	|		И Т.АналитикаУчетаНоменклатуры = Цены.АналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Цены.ВидЗапасов
	|		И Т.РазделУчета = Цены.РазделУчета
	|		И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартий
	|		И Т.АналитикаФинансовогоУчета = Цены.АналитикаФинансовогоУчета
	|		И Т.ВидДеятельностиНДС = Цены.ВидДеятельностиНДС
	|		И Т.Период = Цены.Период
	|		И (Цены.НДСРегл <> 0
	|			ИЛИ Цены.НДСУпр <> 0)
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|	((НомерЗаписи),
	|	 (СтатьяРасходов))
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Т.Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.Организация,
	|	Т.ВидДвижения,
	|
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия КАК ПартияНоменклатуры,
	|	Детализация.ПартияПроизводства КАК ПартияПроизводства,
	|	Детализация.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Детализация.ДокументПоступления КАК ДокументПоступления,
	|	Т.Подразделение,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	Т.ИдентификаторСтроки,
	|
	|	Т.Количество,
	|	Детализация.СтоимостьРегл,
	|	Детализация.НДСРегл,
	|	Детализация.СтоимостьУпр,
	|	Детализация.НДСУпр,
	|	Детализация.ПостояннаяРазница,
	|	Детализация.ВременнаяРазница
	|ПОМЕСТИТЬ ИмяТаблицыДетализации
	|ИЗ
	|	ВТДвиженияСебестоимостьСвернутая КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДетализацияСебестоимости КАК Детализация
	|		ПО Т.НомерЗаписи = Детализация.НомерЗаписи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Т.Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.Организация,
	|	Т.ВидДвижения,
	|
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия КАК ПартияНоменклатуры,
	|	Детализация.ПартияПроизводства КАК ПартияПроизводства,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПогрешностьРасчетаСебестоимости) КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
	|	Т.Подразделение,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	Т.ИдентификаторСтроки,
	|
	|	Т.Количество,
	|	Т.Себестоимость_СтоимостьРегл - Детализация.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	Т.Себестоимость_СтоимостьУпр - Детализация.СтоимостьУпр КАК СтоимостьУпр,
	|	0 КАК НДСУпр,
	|	Т.Себестоимость_ПостояннаяРазница - Детализация.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.Себестоимость_ВременнаяРазница - Детализация.ВременнаяРазница КАК ВременнаяРазница
	|ИЗ
	|	ВТДвиженияСебестоимостьСвернутая КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДетализацияСебестоимостиСвернутая КАК Детализация
	|		ПО Т.НомерЗаписи = Детализация.НомерЗаписи
	|ГДЕ
	|	Т.Себестоимость_СтоимостьРегл - Детализация.СтоимостьРегл <> 0
	|		ИЛИ Т.Себестоимость_СтоимостьУпр - Детализация.СтоимостьУпр <> 0
	|		ИЛИ Т.Себестоимость_ПостояннаяРазница - Детализация.ПостояннаяРазница <> 0
	|		ИЛИ Т.Себестоимость_ВременнаяРазница - Детализация.ВременнаяРазница <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Т.Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.Организация,
	|	Т.ВидДвижения,
	|
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия КАК ПартияНоменклатуры,
	|	Детализация.ПартияПроизводства КАК ПартияПроизводства,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ТранспортноЗаготовительныеЗатраты) КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
	|	Т.Подразделение,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	Т.ИдентификаторСтроки,
	|
	|	0 КАК Количество,
	|	Т.Себестоимость_ДопРасходыРегл КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	Т.Себестоимость_ДопРасходыУпр КАК СтоимостьУпр,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	ВТДвиженияСебестоимостьСвернутая КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДетализацияСебестоимостиСвернутая КАК Детализация
	|		ПО Т.НомерЗаписи = Детализация.НомерЗаписи
	|ГДЕ
	|	Т.Себестоимость_ДопРасходыРегл <> 0
	|		ИЛИ Т.Себестоимость_ДопРасходыУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Т.Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.Организация,
	|	Т.ВидДвижения,
	|
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия КАК ПартияНоменклатуры,
	|	Детализация.ПартияПроизводства КАК ПартияПроизводства,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ТранспортноЗаготовительныеЗатраты) КАК СтатьяКалькуляции,
	|	СуммыНДС.ДокументПоступления КАК ДокументПоступления,
	|	Т.Подразделение,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	Т.ИдентификаторСтроки,
	|
	|	0 КАК Количество,
	|	0 КАК СтоимостьРегл,
	|	СУММА(СуммыНДС.НДСРегл) КАК НДСРегл,
	|	0 КАК СтоимостьУпр,
	|	СУММА(СуммыНДС.НДСУпр) КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	ВТДвиженияСебестоимостьСвернутая КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДетализацияСебестоимостиСвернутая КАК Детализация
	|		ПО Т.НомерЗаписи = Детализация.НомерЗаписи
	|		И (Т.Себестоимость_ДопРасходыРегл <> 0
	|			ИЛИ Т.Себестоимость_ДопРасходыУпр <> 0)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСуммыПартийНДСПоСтатьям КАК СуммыНДС
	|		ПО Т.НомерЗаписи = СуммыНДС.НомерЗаписи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО Статья.Ссылка = СуммыНДС.СтатьяРасходов
	|		И (Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ИЛИ Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|СГРУППИРОВАТЬ ПО
	|	Т.НомерЗаписи,
	|	Т.Регистратор,
	|	Т.НомерСтроки,
	|	Т.Период,
	|	Т.Организация,
	|	Т.ВидДвижения,
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия,
	|	Детализация.ПартияПроизводства,
	|	СуммыНДС.ДокументПоступления,
	|	Т.Подразделение,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	Т.ИдентификаторСтроки
	|";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыДетализации", ИмяТаблицыДетализации);
	
	Запрос.Выполнить();
	
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(Запрос, СуществующиеВТ + "," + ИмяТаблицыДетализации);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос.МенеджерВременныхТаблиц, НовыеВТ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьПараметрыРасчета(ПараметрыЗапуска)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ДатаНачала", ТекущаяДатаСеанса());
	ПараметрыРасчета.Вставить("ВремяНачала", ТекущаяУниверсальнаяДатаВМиллисекундах());
	ПараметрыРасчета.Вставить("ВремяОкончания", Неопределено);
	ПараметрыРасчета.Вставить("ВремяНачалаЗаписи", Неопределено);
	ПараметрыРасчета.Вставить("ВремяОкончанияЗаписи", Неопределено);
	
	ПараметрыРасчета.Вставить("ИтерацийПартииПрошлыхПериодов", 0);
	ПараметрыРасчета.Вставить("ИтерацийИзменениеВидаДеятельностиНДС", 0);
	ПараметрыРасчета.Вставить("ИтерацийПартииДетализация", 0);
	
	ПараметрыРасчета.Вставить("МассивОрганизаций", ПараметрыЗапуска.МассивОрганизаций);
	ПараметрыРасчета.Вставить("НачалоПериода", НачалоМесяца(ПараметрыЗапуска.НачалоПериода));
	ПараметрыРасчета.Вставить("КонецПериода", КонецМесяца(ПараметрыЗапуска.НачалоПериода));
	ПараметрыРасчета.Вставить("МестоВызоваРасчета", ПараметрыЗапуска.МестоВызоваРасчета);
	ПараметрыРасчета.Вставить("РежимЗакрытияМесяца", ПараметрыЗапуска.РежимЗакрытияМесяца);
	ПараметрыРасчета.Вставить("ИдентификаторРасчета", ПараметрыЗапуска.ИдентификаторРасчета);
	ПараметрыРасчета.Вставить("АвтоматическоеТестирование", ПараметрыЗапуска.АвтоматическоеТестирование);
	ПараметрыРасчета.Вставить("ВыполняетсяЗакрытиеМесяца", ПараметрыЗапуска.ВыполняетсяЗакрытиеМесяца);
	ПараметрыРасчета.Вставить("РезультатВыполненияЗапроса", "");
	
	ПараметрыРасчета.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	
	// Типы налогообложения НДС
	ПараметрыРасчета.Вставить("ТипыНалогообложенияНДСНеУчитываетсяВСтоимости",
		УчетНДСУП.ТипыНалогообложенияНДСНеУчитываетсяВСтоимости());
	ПараметрыРасчета.Вставить("ТипыНалогообложенияНДСУчитываетсяВСтоимости",
		УчетНДСУП.ВидыДеятельностиНДСУчитываетсяВСтоимости());
	
	// Типы партий
	МетаПартии = Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартийПродукции.Измерения.Партия;
	ТипыДокументовПартии = Новый Массив;
	
	Для Каждого ТипПартии Из МетаПартии.Тип.Типы() Цикл
		
		Если Метаданные.Документы.Содержит(Метаданные.НайтиПоТипу(ТипПартии)) Тогда
			ТипыДокументовПартии.Добавить(ТипПартии);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыРасчета.Вставить("ТипыДокументовПартии", ТипыДокументовПартии);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

Процедура ИнициализироватьПараметрыЗапроса(ПараметрыРасчета, Запрос)
	
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОрганизаций", ПараметрыРасчета.МассивОрганизаций);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыРасчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыРасчета.КонецПериода);
	Запрос.УстановитьПараметр("ГраницаКонецПредыдущегоПериода", Новый Граница(ПараметрыРасчета.НачалоПериода-1, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСНеУчитываетсяВСтоимости",
		ПараметрыРасчета.ТипыНалогообложенияНДСНеУчитываетсяВСтоимости);
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСУчитываетсяВСтоимости",
		ПараметрыРасчета.ТипыНалогообложенияНДСУчитываетсяВСтоимости);
	
	Запрос.УстановитьПараметр("ТипыДокументовПартии", ПараметрыРасчета.ТипыДокументовПартии);
	
КонецПроцедуры

Функция СоздатьВременнуюТаблицуОрганизацийДляДетализацииПродукции(Запрос, ИмяВременнойТаблицы, ПериодРасчета) Экспорт

	Запрос.УстановитьПараметр("ОтборОрганизации", РасчетСебестоимостиПовтИсп.ОрганизацииСМетодомОценкиФИФО(ПериодРасчета));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	Справочник.Организации КАК Т
	|ГДЕ
	|	Т.Ссылка В(&МассивОрганизаций)
	|	И Т.Ссылка В(&ОтборОрганизации)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	Запрос.Выполнить();
	
КонецФункции

Процедура ЗаписатьСформированныеДвижения(ПараметрыРасчета)

	Запрос = Новый Запрос;
	ИнициализироватьПараметрыЗапроса(ПараметрыРасчета, Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК ЕстьСформированныеЗаписи,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ПериодРегистрации КАК ПериодРегистрации,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.ТипЗаписи,
	|	Т.ПартияПроизводства,
	|	Т.НДСВключенВСтоимость,
	|	Т.Количество КАК Количество,
	|	Т.СтоимостьРегл,
	|	Т.НДСРегл,
	|	Т.СтоимостьУпр,
	|	Т.НДСУпр,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница
	|ПОМЕСТИТЬ ВТВсеЗаписи
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартийПродукции КАК Т
	|ГДЕ
	|	Т.Организация В (&МассивОрганизаций)
	|	И Т.ПериодРегистрации = &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьСформированныеЗаписи,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ПериодРегистрации КАК ПериодРегистрации,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.ТипЗаписи,
	|	Т.ПартияПроизводства,
	|	Т.НДСВключенВСтоимость,
	|	-Т.Количество КАК Количество,
	|	-Т.СтоимостьРегл,
	|	-Т.НДСРегл,
	|	-Т.СтоимостьУпр,
	|	-Т.НДСУпр,
	|	-Т.ПостояннаяРазница,
	|	-Т.ВременнаяРазница
	|ИЗ
	|	ВТРассчитанныеПартии КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	АналитикаУчетаПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Т.ЕстьСформированныеЗаписи) КАК ЕстьСформированныеЗаписи,
	|	Т.Партия КАК Партия
	|ПОМЕСТИТЬ ВТИзмененныеПартии
	|ИЗ
	|	ВТВсеЗаписи КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.СтатьяКалькуляции,
	|	Т.ПериодРегистрации,
	|	Т.ДокументПоступления,
	|	Т.ТипЗаписи,
	|	Т.ПартияПроизводства,
	|	Т.НДСВключенВСтоимость
	|ИМЕЮЩИЕ
	|	СУММА(Т.Количество) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРегл) <> 0
	|		ИЛИ СУММА(Т.НДСРегл) <> 0
	|		ИЛИ СУММА(Т.СтоимостьУпр) <> 0
	|		ИЛИ СУММА(Т.НДСУпр) <> 0
	|		ИЛИ СУММА(Т.ПостояннаяРазница) <> 0
	|		ИЛИ СУММА(Т.ВременнаяРазница) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.ЕстьСформированныеЗаписи,
	|	Партии.Партия КАК Партия,
	|	РассчитанныеПартии.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	РассчитанныеПартии.Организация КАК Организация,
	|	РассчитанныеПартии.ВидЗапасов КАК ВидЗапасов,
	|	РассчитанныеПартии.Номенклатура КАК Номенклатура,
	|	РассчитанныеПартии.Характеристика КАК Характеристика,
	|	РассчитанныеПартии.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	РассчитанныеПартии.ПериодРегистрации КАК ПериодРегистрации,
	|	РассчитанныеПартии.ДокументПоступления КАК ДокументПоступления,
	|	РассчитанныеПартии.ТипЗаписи,
	|	РассчитанныеПартии.ПартияПроизводства,
	|	РассчитанныеПартии.НДСВключенВСтоимость,
	|	РассчитанныеПартии.Количество КАК Количество,
	|	РассчитанныеПартии.СтоимостьРегл,
	|	РассчитанныеПартии.НДСРегл,
	|	РассчитанныеПартии.СтоимостьУпр,
	|	РассчитанныеПартии.НДСУпр,
	|	РассчитанныеПартии.ПостояннаяРазница,
	|	РассчитанныеПартии.ВременнаяРазница
	|ПОМЕСТИТЬ ДанныеДляЗаписи
	|ИЗ
	|	ВТИзмененныеПартии КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРассчитанныеПартии КАК РассчитанныеПартии
	|		ПО Партии.Партия = РассчитанныеПартии.Партия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Партия,
	|	Т.ЕстьСформированныеЗаписи
	|ИЗ
	|	ВТИзмененныеПартии КАК Т
	|";
	
	РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
	Выборка = РезультатЗапроса.Выбрать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.Организация КАК Организация,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.ПериодРегистрации КАК ПериодРегистрации,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.ТипЗаписи,
	|	Т.ПартияПроизводства,
	|	Т.НДСВключенВСтоимость,
	|	Т.Количество КАК Количество,
	|	Т.СтоимостьРегл,
	|	Т.НДСРегл,
	|	Т.СтоимостьУпр,
	|	Т.НДСУпр,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница
	|ИЗ
	|	ДанныеДляЗаписи КАК Т
	|ГДЕ
	|	Т.Партия = &ТекущаяПартия
	|";
	
	Пока Выборка.Следующий() Цикл
		
		ТекущаяПартия = Выборка.Партия;
		
		НаборЗаписей = РегистрыСведений.ДетализацияСебестоимостиПартийПродукции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Партия.Установить(ТекущаяПартия);
		НаборЗаписей.Отбор.ПериодРегистрации.Установить(ПараметрыРасчета.НачалоПериода);
		
		НаборЗаписей.Заполнить(Неопределено);
		
		Если Выборка.ЕстьСформированныеЗаписи Тогда
			
			// Если нет сформированных записей, значит данные по этой партии надо удалить из регистра
			Запрос.УстановитьПараметр("ТекущаяПартия", ТекущаяПартия);

			НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		НаборЗаписей = Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
