#Область ПрограммныйИнтерфейс

// При изменении реквизита справочника СтатьиКалькуляции.
// 
// Параметры:
//  ИмяЭлемента - Строка - Имя команды
//  Форма - ФормаКлиентскогоПриложения - Форма статьи калькуляции
Процедура ПриИзмененииРеквизита(ИмяЭлемента, Форма) Экспорт
	
	ОбщегоНазначенияУТКлиент.ПродолжитьИзменениеРеквизита(Форма, ИмяЭлемента, Истина);
	
КонецПроцедуры

// Выполнить команду справочника СтатьиКалькуляции.
// 
// Параметры:
//  ИмяКоманды - Строка - Имя команды
//  Форма - ФормаКлиентскогоПриложения - Форма статьи калькуляции
Процедура ВыполнитьКоманду(ИмяКоманды, Форма) Экспорт
	
	ОбщегоНазначенияУТКлиент.ПродолжитьВыполнениеКоманды(Форма, ИмяКоманды, Ложь);
	
КонецПроцедуры

#КонецОбласти