#Область ПрограммныйИнтерфейс

// Возвращает параметры формирования текста запроса карт исследований
//
// Возвращаемое значение:
// 	Структура - из:
//  * ИмяВходнойТаблицы - Строка - Имя входной таблицы
//  * ИмяВыходнойТаблицы - Строка - Имя временной таблицы
//  * ВсеПоляВРезультате - Булево - Истина - если необходимо поместить все поля структуры/таблицы данных об карте исследования в результат выборки
//  * УничтожитьВременныеТаблицы - Булево - Истина - если необходимо уничтожить используемые временные таблицы
//  * РазделительИтоговогоПакета - Булево - Истина - если необходим разделитель итогового пакета
//  * УсловияОтбораВходящихДанных - Массив Из Строка - Дополнительные условия отбора входной таблицы.
//
Функция ПараметрыТекстаЗапросаКартИсследований() Экспорт
	
	Результат = Новый Структура;
	
	// Используется, если имя входной таблицы отличается от ВтСписокНоменклатуры
	Результат.Вставить("ИмяВходнойТаблицы",           "");
	// Используется, если результат необходимо поместить во временную таблицу 
	Результат.Вставить("ИмяВыходнойТаблицы",          "");
	// Истина - если необходимо поместить все поля структуры/таблицы данных об карте исследования в результат выборки
	Результат.Вставить("ВсеПоляВРезультате",          Ложь);
	// Истина - если необходимо уничтожить используемые временные таблицы
	Результат.Вставить("УничтожитьВременныеТаблицы",  Истина);
	// Истина - если необходим разделитель итогового пакета
	Результат.Вставить("РазделительИтоговогоПакета",  Истина);
	// Дополнительные условия отбора входной таблицы
	Результат.Вставить("УсловияОтбораВходящихДанных", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Устанавливает параметры запроса, сформированного функцией ТекстЗапросаКартИсследованийТоваров()
//
// Параметры:
//  Запрос          - Запрос    - Запрос выбора Карт исследования товаров.
//  ПараметрыВыбора - см. ИсследованиеТоваровКлиентСервер.ПараметрыВыбораНазначенияИсследованийКонструктор
//
Процедура УстановитьПараметрыЗапросаКартИсследованийТоваров(Запрос, ПараметрыВыбора) Экспорт
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ИсключитьКартуИсследованияТоваров", Справочники.КартыИсследованияТоваров.ПустаяСсылка());
	
	СписокПараметровБезОтбора = Новый Структура;
	СписокПараметровБезОтбора.Вставить("ИсключитьКартуИсследованияТоваров", "ИсключитьКартуИсследованияТоваровБезОтбора");
	
	Для каждого КлючИЗначение Из СписокПараметров Цикл
		ЗначениеПараметра = КлючИЗначение.Значение;
		Если ПараметрыВыбора.Свойство(КлючИЗначение.Ключ) Тогда
			ЗначениеПараметра = ПараметрыВыбора[КлючИЗначение.Ключ];
		КонецЕсли;
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, ЗначениеПараметра);
		Запрос.УстановитьПараметр(СписокПараметровБезОтбора[КлючИЗначение.Ключ], НЕ ЗначениеЗаполнено(ЗначениеПараметра));
	КонецЦикла;
	
	ИгнорируемыеУточненияПрименения = Новый Массив;
	Если ПараметрыВыбора.Свойство("ИгнорируемыеУточненияПрименения")
		И ЗначениеЗаполнено(ПараметрыВыбора.ИгнорируемыеУточненияПрименения) Тогда
		ИгнорируемыеУточненияПрименения = ПараметрыВыбора.ИгнорируемыеУточненияПрименения;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИгнорируемыеУточненияПрименения", ИгнорируемыеУточненияПрименения);

	Запрос.УстановитьПараметр("КлючСвязиНоменклатура",   ИсследованиеТоваровКлиентСервер.ОтборПоСвойствамКлючСвязиПредопределенный("Номенклатура"));
	Запрос.УстановитьПараметр("КлючСвязиХарактеристика", ИсследованиеТоваровКлиентСервер.ОтборПоСвойствамКлючСвязиПредопределенный("Характеристика"));

	Запрос.УстановитьПараметр("КлючСвязиПустой",         Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Если ПараметрыВыбора.Свойство("СтрокаПоиска") Тогда
		
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СокрЛП(ПараметрыВыбора.СтрокаПоиска) + "%");
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текст запроса карт исследования товаров
//
// Параметры:
//  ПараметрыЗапроса            - см. ИсследованиеТоваров.ПараметрыТекстаЗапросаКартИсследований
//  ПараметрыВыбораКартИсследованияТоваров - см. ИсследованиеТоваровКлиентСервер.ПараметрыВыбораНазначенияИсследованийКонструктор
// 
// Возвращаемое значение:
//  Строка - текст запроса для выбора карт исследования товаров
//
Функция ТекстЗапросаКартИсследованийТоваров(ПараметрыЗапроса, ПараметрыВыбораКартИсследованияТоваров) Экспорт
	
	ТаблицыУничтожить = Новый Массив;
	ТаблицыУничтожить.Добавить("ВтДоступныеКартыИсследованияТоваров");
	ТаблицыУничтожить.Добавить("ВтСоответствуютПараметрамНазначения");
	ТаблицыУничтожить.Добавить("ВтНайденоВСписке");
		
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	СписокНоменклатуры.ИндексДанных            КАК ИндексДанных,
		|	СписокНоменклатуры.Номенклатура            КАК Номенклатура,
		|	СписокНоменклатуры.Характеристика          КАК Характеристика,
		|	СписокНоменклатуры.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|
		|	КартыИсследованияТоваров.КартаИсследованияТоваров КАК КартаИсследованияТоваров,
		|	КартыИсследованияТоваров.Контроль                КАК Контроль,
		|	КартыИсследованияТоваров.ВариантОтбораОбразцов    КАК ВариантОтбораОбразцов,
		|	КартыИсследованияТоваров.КоличествоОбразцов       КАК КоличествоОбразцов,
		|	КартыИсследованияТоваров.ПроцентОбразцов          КАК ПроцентОбразцов,
		|
		|	КартыИсследованияТоваров.Номенклатура   = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК ЛюбаяНоменклатура,
		|	КартыИсследованияТоваров.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ЛюбаяХарактеристика
		|
		|ПОМЕСТИТЬ ВтИсточникДоступныхКартИсследованияТоваров
		|ИЗ
		|	РегистрСведений.КартыИсследованияТоваров КАК КартыИсследованияТоваров
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСписокНоменклатуры КАК СписокНоменклатуры
		|		 ПО КартыИсследованияТоваров.ВидНоменклатуры = СписокНоменклатуры.ВидНоменклатуры
		|			И (КартыИсследованияТоваров.Номенклатура = СписокНоменклатуры.Номенклатура
		|				ИЛИ КартыИсследованияТоваров.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|			И (КартыИсследованияТоваров.Характеристика = СписокНоменклатуры.Характеристика
		|				ИЛИ КартыИсследованияТоваров.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|			И &ТекстУсловиеОтбораВходящихДанных
		|
		|ГДЕ
		|
		|	(КартыИсследованияТоваров.КартаИсследованияТоваров <> &ИсключитьКартуИсследованияТоваров
		|		ИЛИ &ИсключитьКартуИсследованияТоваровБезОтбора)
		|
		|	И &ТекстУсловиеОтбораПоНаименованию
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
	ТекстПоляКартаИсследованияТоваров             = "КартыИсследованияТоваров.КартаИсследованияТоваров";
	ИмяВременнойТаблицыИсточникаКартИсследования  = "ВтИсточникДоступныхКартИсследованияТоваров";
	
	Если ПараметрыВыбораКартИсследованияТоваров.Свойство("СтрокаПоиска") Тогда
		ТекстУсловия = "
		|	И (&ТекстПоляНоменклатураКартыИсследованияТоваров.Наименование ПОДОБНО &СтрокаПоиска
		|		ИЛИ &СтрокаПоиска = """")";
	Иначе
		ТекстУсловия = "";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ТекстУсловиеОтбораПоНаименованию", ТекстУсловия);
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоступныеКартыИсследованияТоваров.ИндексДанных                   КАК ИндексДанных,
	|	ДоступныеКартыИсследованияТоваров.КартаИсследованияТоваров       КАК КартаИсследованияТоваров,
	|	ДоступныеКартыИсследованияТоваров.ЛюбаяНоменклатура              КАК ЛюбаяНоменклатура,
	|	ДоступныеКартыИсследованияТоваров.ЛюбаяХарактеристика            КАК ЛюбаяХарактеристика,
	|
	|	ДоступныеКартыИсследованияТоваров.Контроль           КАК Контроль,
	|	ДоступныеКартыИсследованияТоваров.ВариантОтбораОбразцов КАК ВариантОтбораОбразцов,
	|	ДоступныеКартыИсследованияТоваров.КоличествоОбразцов    КАК КоличествоОбразцов,
	|	ДоступныеКартыИсследованияТоваров.ПроцентОбразцов       КАК ПроцентОбразцов,
	|
	|	ОтборПоСвойствам.КлючСвязи КАК ВидУточненияПрименения,
	|
	|	ОтборПоСвойствам.Свойство  КАК Свойство,
	|
	|	ОтборПоСвойствам.Условие   КАК Условие,
	|	ВЫБОР
	|		КОГДА ОтборПоСвойствам.Условие В (""ВСписке"",""НеВСписке"")
	|			ТОГДА 0
	|		ИНАЧЕ ОтборПоСвойствам.Значение
	|	КОНЕЦ КАК ЗначениеНастройки,
	|
	|	ЕСТЬNULL(
	|		ВЫБОР ОтборПоСвойствам.КлючСвязи
	|			КОГДА &КлючСвязиНоменклатура
	|				ТОГДА ДопРеквизитНоменклатуры.Значение
	|			КОГДА &КлючСвязиХарактеристика
	|				ТОГДА ДопРеквизитХарактеристики.Значение
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОтборПоСвойствам.Значение) = ТИП(БУЛЕВО)
	|				ТОГДА ЛОЖЬ
	|			КОГДА ТИПЗНАЧЕНИЯ(ОтборПоСвойствам.Значение) = ТИП(ЧИСЛО)
	|				ТОГДА 0
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ЗначениеПараметра
	|
	|ПОМЕСТИТЬ ВтДоступныеКартыИсследованияТоваров
	|
	|ИЗ
	|	ВтИсточникДоступныхКартИсследованияТоваров КАК ДоступныеКартыИсследованияТоваров
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыИсследованияТоваров.ОтборПоСвойствам КАК ОтборПоСвойствам
	|		ПО ДоступныеКартыИсследованияТоваров.КартаИсследованияТоваров = ОтборПоСвойствам.Ссылка
	|			И ОтборПоСвойствам.КлючСвязи В (&КлючСвязиНоменклатура, &КлючСвязиХарактеристика)
	|			И НЕ ОтборПоСвойствам.КлючСвязи В (&ИгнорируемыеУточненияПрименения)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДопРеквизитНоменклатуры
	|		ПО ДоступныеКартыИсследованияТоваров.Номенклатура = ДопРеквизитНоменклатуры.Ссылка
	|			И ОтборПоСвойствам.КлючСвязи = &КлючСвязиНоменклатура
	|			И ОтборПоСвойствам.Свойство = ДопРеквизитНоменклатуры.Свойство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДопРеквизитХарактеристики
	|		ПО ДоступныеКартыИсследованияТоваров.Характеристика = ДопРеквизитХарактеристики.Ссылка
	|			И ОтборПоСвойствам.КлючСвязи = &КлючСвязиХарактеристика
	|			И ОтборПоСвойствам.Свойство = ДопРеквизитХарактеристики.Свойство
	|
	|
	|;
	|
	|ВЫБРАТЬ
	|	Т.ИндексДанных              КАК ИндексДанных,
	|	Т.КартаИсследованияТоваров  КАК КартаИсследованияТоваров,
	|	Т.ВидУточненияПрименения    КАК ВидУточненияПрименения
	|
	|ПОМЕСТИТЬ
	|	ВтНайденоВСписке
	|ИЗ
	|	ВтДоступныеКартыИсследованияТоваров КАК Т
	|
	|ГДЕ
	|	Т.Условие В (""ВСписке"",""НеВСписке"")
	|	И ИСТИНА В (
	|
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			Справочник.КартыИсследованияТоваров.ОтборПоСвойствам КАК Т2
	|		ГДЕ
	|			Т.ЗначениеПараметра = Т2.Значение
	|			И Т.КартаИсследованияТоваров = Т2.Ссылка
	|			И Т.ВидУточненияПрименения = Т2.КлючСвязи
	|		)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИндексДанных,
	|	КартаИсследованияТоваров,
	|	ВидУточненияПрименения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеКартыИсследованияТоваров.ИндексДанных                КАК ИндексДанных,
	|	ДоступныеКартыИсследованияТоваров.КартаИсследованияТоваров    КАК КартаИсследованияТоваров,
	|	ДоступныеКартыИсследованияТоваров.Контроль                   КАК Контроль,
	|	ДоступныеКартыИсследованияТоваров.ВариантОтбораОбразцов       КАК ВариантОтбораОбразцов,
	|	ДоступныеКартыИсследованияТоваров.КоличествоОбразцов          КАК КоличествоОбразцов,
	|	ДоступныеКартыИсследованияТоваров.ПроцентОбразцов             КАК ПроцентОбразцов
	|ПОМЕСТИТЬ ВтСоответствуютПараметрамНазначения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.ИндексДанных             КАК ИндексДанных,
	|		Т.КартаИсследованияТоваров КАК КартаИсследованияТоваров,
	|		Т.ЛюбаяНоменклатура        КАК ЛюбаяНоменклатура,
	|		Т.ЛюбаяХарактеристика      КАК ЛюбаяХарактеристика,
	|		Т.Контроль                КАК Контроль,
	|		Т.ВариантОтбораОбразцов    КАК ВариантОтбораОбразцов,
	|		Т.КоличествоОбразцов       КАК КоличествоОбразцов,
	|		Т.ПроцентОбразцов          КАК ПроцентОбразцов,
	|		Т.Условие                  КАК Условие,
	|		ВЫБОР Т.Условие
	|			КОГДА ""Равно""
	|				ТОГДА Т.ЗначениеПараметра = Т.ЗначениеНастройки
	|			КОГДА ""НеРавно""
	|				ТОГДА Т.ЗначениеПараметра <> Т.ЗначениеНастройки
	|			КОГДА ""Больше""
	|				ТОГДА Т.ЗначениеПараметра > Т.ЗначениеНастройки
	|			КОГДА ""БольшеИлиРавно""
	|				ТОГДА Т.ЗначениеПараметра >= Т.ЗначениеНастройки
	|			КОГДА ""Меньше""
	|				ТОГДА Т.ЗначениеПараметра < Т.ЗначениеНастройки
	|			КОГДА ""МеньшеИлиРавно""
	|				ТОГДА Т.ЗначениеПараметра <= Т.ЗначениеНастройки
	|			КОГДА ""ВСписке""
	|				ТОГДА НЕ НайденоВСписке.ИндексДанных ЕСТЬ NULL
	|			КОГДА ""НеВСписке""
	|				ТОГДА НайденоВСписке.ИндексДанных ЕСТЬ NULL
	|			КОГДА ""Заполнено""
	|				ТОГДА НЕ Т.ЗначениеПараметра В (НЕОПРЕДЕЛЕНО, ЛОЖЬ, 0)
	|			КОГДА ""НеЗаполнено""
	|				ТОГДА Т.ЗначениеПараметра В (НЕОПРЕДЕЛЕНО, ЛОЖЬ, 0)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК СоответствуетПараметрамНазначения
	|	ИЗ
	|		ВтДоступныеКартыИсследованияТоваров КАК Т
	|	
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтНайденоВСписке КАК НайденоВСписке
	|			ПО Т.ИндексДанных = НайденоВСписке.ИндексДанных
	|				И Т.КартаИсследованияТоваров = НайденоВСписке.КартаИсследованияТоваров
	|	) КАК ДоступныеКартыИсследованияТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеКартыИсследованияТоваров.ИндексДанных,
	|	ДоступныеКартыИсследованияТоваров.КартаИсследованияТоваров,
	|	ДоступныеКартыИсследованияТоваров.Контроль,
	|	ДоступныеКартыИсследованияТоваров.ВариантОтбораОбразцов,
	|	ДоступныеКартыИсследованияТоваров.КоличествоОбразцов,
	|	ДоступныеКартыИсследованияТоваров.ПроцентОбразцов,
	|	НЕ ДоступныеКартыИсследованияТоваров.ЛюбаяНоменклатура,
	|	НЕ ДоступныеКартыИсследованияТоваров.ЛюбаяХарактеристика
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ДоступныеКартыИсследованияТоваров.СоответствуетПараметрамНазначения) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	КартыИсследованияТоваров.ИндексДанных               КАК ИндексДанных,
	|	КартыИсследованияТоваров.КартаИсследованияТоваров   КАК КартаИсследованияТоваров,
	|	КартыИсследованияТоваров.Контроль                КАК Контроль,
	|	КартыИсследованияТоваров.ВариантОтбораОбразцов      КАК ВариантОтбораОбразцов,
	|	КартыИсследованияТоваров.КоличествоОбразцов         КАК КоличествоОбразцов,
	|	КартыИсследованияТоваров.ПроцентОбразцов            КАК ПроцентОбразцов,
	|	&РеквизитыКартыИсследованияТоваров,
	|	&ВСЕПОЛЯ_РЕКВИЗИТЫ,
	|	КартыИсследованияТоваров.КартаИсследованияТоваров.Представление КАК Представление
	|
	|ПОМЕСТИТЬ ИмяВыходнойТаблицы
	|
	|ИЗ
	|	ВтСоответствуютПараметрамНазначения КАК КартыИсследованияТоваров
	|
	|	,ВСЕПОЛЯ_СОЕДИНЕНИЕ
	|
	|";
	
	// Реквизиты Карты исследования товаров
	Если ЗначениеЗаполнено(ПараметрыВыбораКартИсследованияТоваров.РеквизитыКартыИсследованияТоваров) Тогда
		ПоляЗапроса = Новый Массив;
		Для каждого Реквизит Из СтрРазделить(ПараметрыВыбораКартИсследованияТоваров.РеквизитыКартыИсследованияТоваров, ",", Ложь) Цикл
			ПоляЗапроса.Добавить(СтрШаблон("КартыИсследованияТоваров.КартаИсследованияТоваров.%1 КАК %1,", СокрЛП(Реквизит)));
		КонецЦикла;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитыКартыИсследованияТоваров,", СтрСоединить(ПоляЗапроса,Символы.ПС));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитыКартыИсследованияТоваров,", "");
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВсеПоляВРезультате Тогда
		
		ТекстСоединениеВсеПоля = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтИсточникДоступныхКартИсследованияТоваров КАК Т
		|	ПО КартыИсследованияТоваров.ИндексДанных = Т.ИндексДанных
		|		И КартыИсследованияТоваров.КартаИсследованияТоваров = Т.КартаИсследованияТоваров
		|";
		ТекстРеквизитыВсеПоля  = "
		|	Т.*,
		|";
		ТекстИндексировать     = "";
		
	Иначе
		
		ТекстСоединениеВсеПоля = "";
		ТекстРеквизитыВсеПоля  = "";
		ТекстИндексировать     = "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИндексДанных";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВСЕПОЛЯ_РЕКВИЗИТЫ,", ТекстРеквизитыВсеПоля);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ",ВСЕПОЛЯ_СОЕДИНЕНИЕ", ТекстСоединениеВсеПоля);
	
	Если НЕ ПустаяСтрока(ПараметрыЗапроса.ИмяВыходнойТаблицы) Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ИмяВыходнойТаблицы", "ПОМЕСТИТЬ "+ПараметрыЗапроса.ИмяВыходнойТаблицы);
		ТекстЗапроса = ТекстЗапроса + ТекстИндексировать;
		
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ИмяВыходнойТаблицы", "");
		
	КонецЕсли;
	
	ТекстУсловиеОтбораВходящихДанных = "ИСТИНА";
	Если ЗначениеЗаполнено(ПараметрыЗапроса.УсловияОтбораВходящихДанных) Тогда
		ТекстУсловиеОтбораВходящихДанных = СтрСоединить(ПараметрыЗапроса.УсловияОтбораВходящихДанных, " И ");
	КонецЕсли;
	
	Если ПараметрыЗапроса.УничтожитьВременныеТаблицы Тогда
		
		Для Индекс = 0 По ТаблицыУничтожить.ВГраница() Цикл
			ТаблицыУничтожить[Индекс] = СтрШаблон("%1 УНИЧТОЖИТЬ %2", ОбщегоНазначения.РазделительПакетаЗапросов(), ТаблицыУничтожить[Индекс]);
		КонецЦикла;
		ТекстЗапроса = ТекстЗапроса + СтрСоединить(ТаблицыУничтожить);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.РазделительИтоговогоПакета Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПоляКартаИсследованияТоваров", ТекстПоляКартаИсследованияТоваров);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловиеОтбораВходящихДанных", ТекстУсловиеОтбораВходящихДанных);
	
	Если НЕ ПустаяСтрока(ПараметрыЗапроса.ИмяВходнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВтСписокНоменклатуры", ПараметрыЗапроса.ИмяВходнойТаблицы);
	КонецЕсли;
	
	Если ИмяВременнойТаблицыИсточникаКартИсследования <> "ВтИсточникДоступныхКартИсследованияТоваров" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВтИсточникДоступныхКартИсследованияТоваров", ИмяВременнойТаблицыИсточникаКартИсследования);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Остатки для заполнения документов ЗаявкаНаКонтрольКачестваТоваров и АктКонтроляКачестваТоваров.
// 
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений - таблица аналитик:
//   * КонтролируемаяПартия - СправочникСсылка.КонтролируемыеПартии - контролируемая партия
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//   * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//   * Склад - СправочникСсылка.Склады - склад
//   * Назначение - СправочникСсылка.Назначения - назначение
//   * Помещение - СправочникСсылка.СкладскиеПомещения - помещение
//   * Серия - СправочникСсылка.СерииНоменклатуры - серия
//  ДокументИсследования - ДокументСсылка.ИсследованиеКачестваТоваров - документ исследования.
// Возвращаемое значение:
//  ТаблицаЗначений - таблица остатков:
//   * КонтролируемаяПартия - СправочникСсылка.КонтролируемыеПартии - контролируемая партия
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//   * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//   * Склад - СправочникСсылка.Склады - склад
//   * Назначение - СправочникСсылка.Назначения - назначение
//   * Помещение - СправочникСсылка.СкладскиеПомещения - помещение
//   * Серия - СправочникСсылка.СерииНоменклатуры - серия
//   * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения - упаковка
//   * Количество - Число - остаток
//   * КоличествоУпаковок - Число - остаток в упаковках
Функция РезультатыИсследованногоТовараВыборочныйКонтроль(ТаблицаДанных, ДокументИсследования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("Ссылка", ДокументИсследования);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанных.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Серия КАК Серия,
	|	ТаблицаДанных.Склад КАК Склад,
	|	ТаблицаДанных.Назначение КАК Назначение,
	|	ТаблицаДанных.Помещение КАК Помещение,
	|	ТаблицаДанных.Упаковка КАК Упаковка,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ТаблицаДанных.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ОстаткиТоваров
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка КАК Исследование,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Номенклатура КАК Номенклатура,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Характеристика КАК Характеристика,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Серия КАК Серия,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Назначение КАК Назначение,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка.Склад КАК Склад,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка.Контроль КАК Контроль,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Заключение КАК Заключение,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Количество КАК Количество,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоГодное КАК КоличествоГодное,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоРазрушено КАК КоличествоРазрушено,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоНегодное КАК КоличествоНегодное,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТовары
	|ИЗ
	|	Документ.ИсследованиеКачестваТоваров.ПланИРезультатИсследования КАК
	|		ИсследованиеКачестваТоваровПланИРезультатИсследования
	|ГДЕ
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	СУММА(ИсследованныеТовары.Количество) КАК Количество,
	|	СУММА(ИсследованныеТовары.КоличествоГодное) КАК КоличествоГодное,
	|	СУММА(ИсследованныеТовары.КоличествоРазрушено) КАК КоличествоРазрушено,
	|	СУММА(ИсследованныеТовары.КоличествоНегодное) КАК КоличествоНегодное,
	|	СУММА(ИсследованныеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТоварыВыборочный
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	ИсследованныеТовары.Исследование КАК Исследование,
	|	ИсследованныеТовары.Заключение КАК Заключение
	|ПОМЕСТИТЬ ИсследованныеТоварыЗаключение
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад,
	|	ИсследованныеТовары.Исследование,
	|	ИсследованныеТовары.Заключение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.УдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ПОМЕСТИТЬ ИтогиИсследованныеТоварыВыборочный
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоНегодное = 0
	|	И ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ОформитьСписание) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.РазрушеноВПроцессеИсследований) КАК РезультатПроверкиКачества
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоРазрушено <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ПустаяСсылка) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.НеУдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоНегодное <> 0
	|	И ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиИсследованныеТоварыВыборочный.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ИтогиИсследованныеТоварыВыборочный.Номенклатура КАК Номенклатура,
	|	ИтогиИсследованныеТоварыВыборочный.Характеристика КАК Характеристика,
	|	ИтогиИсследованныеТоварыВыборочный.Серия КАК Серия,
	|	ИтогиИсследованныеТоварыВыборочный.Склад КАК Склад,
	|	ИтогиИсследованныеТоварыВыборочный.Назначение КАК Назначение,
	|	ИтогиИсследованныеТоварыВыборочный.Помещение КАК Помещение,
	|	ИтогиИсследованныеТоварыВыборочный.Упаковка КАК Упаковка,
	|	ИтогиИсследованныеТоварыВыборочный.Количество КАК Количество,
	|	ИтогиИсследованныеТоварыВыборочный.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ИтогиИсследованныеТоварыВыборочный.Действие КАК Действие,
	|	ИтогиИсследованныеТоварыВыборочный.РезультатПроверкиКачества КАК РезультатПроверкиКачества,
	|	ИсследованныеТоварыЗаключение.Исследование КАК Исследование,
	|	ИсследованныеТоварыЗаключение.Заключение КАК Заключение
	|ИЗ
	|	ИтогиИсследованныеТоварыВыборочный КАК ИтогиИсследованныеТоварыВыборочный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыЗаключение КАК ИсследованныеТоварыЗаключение
	|		ПО ИтогиИсследованныеТоварыВыборочный.Номенклатура = ИсследованныеТоварыЗаключение.Номенклатура
	|		И ИтогиИсследованныеТоварыВыборочный.Характеристика = ИсследованныеТоварыЗаключение.Характеристика
	|		И ИтогиИсследованныеТоварыВыборочный.Серия = ИсследованныеТоварыЗаключение.Серия
	|		И ИтогиИсследованныеТоварыВыборочный.Назначение = ИсследованныеТоварыЗаключение.Назначение
	|		И ИтогиИсследованныеТоварыВыборочный.Склад = ИсследованныеТоварыЗаключение.Склад";
	
	Исследования = Запрос.Выполнить().Выгрузить();

	Возврат Исследования;

КонецФункции

// Остатки для заполнения документов ЗаявкаНаКонтрольКачестваТоваров и АктКонтроляКачестваТоваров.
// 
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений - таблица аналитик:
//   * КонтролируемаяПартия - СправочникСсылка.КонтролируемыеПартии - контролируемая партия
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//   * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//   * Склад - СправочникСсылка.Склады - склад
//   * Назначение - СправочникСсылка.Назначения - назначение
//   * Помещение - СправочникСсылка.СкладскиеПомещения - помещение
//   * Серия - СправочникСсылка.СерииНоменклатуры - серия
//  ДокументИсследования - ДокументСсылка.ИсследованиеКачестваТоваров - документ исследования.
// Возвращаемое значение:
//  ТаблицаЗначений - таблица остатков:
//   * КонтролируемаяПартия - СправочникСсылка.КонтролируемыеПартии - контролируемая партия
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//   * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//   * Склад - СправочникСсылка.Склады - склад
//   * Назначение - СправочникСсылка.Назначения - назначение
//   * Помещение - СправочникСсылка.СкладскиеПомещения - помещение
//   * Серия - СправочникСсылка.СерииНоменклатуры - серия
//   * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения - упаковка
//   * Количество - Число - остаток
//   * КоличествоУпаковок - Число - остаток в упаковках
Функция РезультатыИсследованногоТовараСплошнойКонтроль(ТаблицаДанных, ДокументИсследования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("Ссылка", ДокументИсследования);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанных.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Серия КАК Серия,
	|	ТаблицаДанных.Склад КАК Склад,
	|	ТаблицаДанных.Назначение КАК Назначение,
	|	ТаблицаДанных.Помещение КАК Помещение,
	|	ТаблицаДанных.Упаковка КАК Упаковка,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ТаблицаДанных.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ОстаткиТоваров
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка КАК Исследование,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Номенклатура КАК Номенклатура,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Характеристика КАК Характеристика,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Серия КАК Серия,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Назначение КАК Назначение,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка.Склад КАК Склад,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка.Контроль КАК Контроль,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Заключение КАК Заключение,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Количество КАК Количество,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоГодное КАК КоличествоГодное,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоРазрушено КАК КоличествоРазрушено,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоНегодное КАК КоличествоНегодное,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТовары
	|ИЗ
	|	Документ.ИсследованиеКачестваТоваров.ПланИРезультатИсследования КАК
	|		ИсследованиеКачестваТоваровПланИРезультатИсследования
	|ГДЕ
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	СУММА(ИсследованныеТовары.Количество) КАК Количество,
	|	СУММА(ИсследованныеТовары.КоличествоГодное) КАК КоличествоГодное,
	|	СУММА(ИсследованныеТовары.КоличествоРазрушено) КАК КоличествоРазрушено,
	|	СУММА(ИсследованныеТовары.КоличествоНегодное) КАК КоличествоНегодное,
	|	СУММА(ИсследованныеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТоварыСплошной
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	ИсследованныеТовары.Исследование КАК Исследование,
	|	ИсследованныеТовары.Заключение КАК Заключение
	|ПОМЕСТИТЬ ИсследованныеТоварыЗаключение
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад,
	|	ИсследованныеТовары.Исследование,
	|	ИсследованныеТовары.Заключение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено -
	|			ИсследованныеТовары.КоличествоГодное >= ИсследованныеТовары.КоличествоНегодное
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено > 0
	|						ТОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено - ИсследованныеТовары.КоличествоГодное
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено -
	|			ИсследованныеТовары.КоличествоГодное >= ИсследованныеТовары.КоличествоНегодное
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено > 0
	|						ТОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено -
	|			ИсследованныеТовары.КоличествоГодное
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ПустаяСсылка) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.НеУдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ПОМЕСТИТЬ ИтогиИсследованныеТоварыСплошной
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоНегодное <> 0
	|	И ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено - ИсследованныеТовары.КоличествоГодное > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ОформитьСписание) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.РазрушеноВПроцессеИсследований) КАК РезультатПроверкиКачества
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоРазрушено <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено >= ИсследованныеТовары.КоличествоГодное
	|			ТОГДА ИсследованныеТовары.КоличествоГодное
	|		ИНАЧЕ ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок -
	|			ИсследованныеТовары.КоличествоРазрушено >= ИсследованныеТовары.КоличествоГодное
	|			ТОГДА ИсследованныеТовары.КоличествоГодное
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.УдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоГодное <> 0
	|	И ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиИсследованныеТоварыСплошной.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ИтогиИсследованныеТоварыСплошной.Номенклатура КАК Номенклатура,
	|	ИтогиИсследованныеТоварыСплошной.Характеристика КАК Характеристика,
	|	ИтогиИсследованныеТоварыСплошной.Серия КАК Серия,
	|	ИтогиИсследованныеТоварыСплошной.Склад КАК Склад,
	|	ИтогиИсследованныеТоварыСплошной.Назначение КАК Назначение,
	|	ИтогиИсследованныеТоварыСплошной.Помещение КАК Помещение,
	|	ИтогиИсследованныеТоварыСплошной.Упаковка КАК Упаковка,
	|	ИтогиИсследованныеТоварыСплошной.Количество КАК Количество,
	|	ИтогиИсследованныеТоварыСплошной.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ИтогиИсследованныеТоварыСплошной.Действие КАК Действие,
	|	ИтогиИсследованныеТоварыСплошной.РезультатПроверкиКачества КАК РезультатПроверкиКачества,
	|	ИсследованныеТоварыЗаключение.Исследование КАК Исследование,
	|	ИсследованныеТоварыЗаключение.Заключение КАК Заключение
	|ИЗ
	|	ИтогиИсследованныеТоварыСплошной КАК ИтогиИсследованныеТоварыСплошной
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыЗаключение КАК ИсследованныеТоварыЗаключение
	|		ПО ИтогиИсследованныеТоварыСплошной.Номенклатура = ИсследованныеТоварыЗаключение.Номенклатура
	|		И ИтогиИсследованныеТоварыСплошной.Характеристика = ИсследованныеТоварыЗаключение.Характеристика
	|		И ИтогиИсследованныеТоварыСплошной.Серия = ИсследованныеТоварыЗаключение.Серия
	|		И ИтогиИсследованныеТоварыСплошной.Назначение = ИсследованныеТоварыЗаключение.Назначение
	|		И ИтогиИсследованныеТоварыСплошной.Склад = ИсследованныеТоварыЗаключение.Склад
	|ГДЕ
	|	ИтогиИсследованныеТоварыСплошной.Количество <> 0";
	
	Исследования = Запрос.Выполнить().Выгрузить();

	Возврат Исследования;

КонецФункции

// Остатки для заполнения документов ЗаявкаНаКонтрольКачестваТоваров и АктКонтроляКачестваТоваров.
// 
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений - таблица аналитик:
//   * КонтролируемаяПартия - СправочникСсылка.КонтролируемыеПартии - контролируемая партия
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//   * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//   * Склад - СправочникСсылка.Склады - склад
//   * Назначение - СправочникСсылка.Назначения - назначение
//   * Помещение - СправочникСсылка.СкладскиеПомещения - помещение
//   * Серия - СправочникСсылка.СерииНоменклатуры - серия
//  ПоДокументамИсследования - Массив Из ДокументСсылка.ИсследованиеКачестваТоваров - документы исследования.
// Возвращаемое значение:
//  ТаблицаЗначений - таблица остатков:
//   * КонтролируемаяПартия - СправочникСсылка.КонтролируемыеПартии - контролируемая партия
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура
//   * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика
//   * Склад - СправочникСсылка.Склады - склад
//   * Назначение - СправочникСсылка.Назначения - назначение
//   * Помещение - СправочникСсылка.СкладскиеПомещения - помещение
//   * Серия - СправочникСсылка.СерииНоменклатуры - серия
//   * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения - упаковка
//   * Количество - Число - остаток
//   * КоличествоУпаковок - Число - остаток в упаковках
Функция РезультатыИсследованногоТовараПоЗаявкеНаКонтроль(ТаблицаДанных, ПоДокументамИсследования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("Ссылки", ПоДокументамИсследования);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанных.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Серия КАК Серия,
	|	ТаблицаДанных.Склад КАК Склад,
	|	ТаблицаДанных.Назначение КАК Назначение,
	|	ТаблицаДанных.Помещение КАК Помещение,
	|	ТаблицаДанных.Упаковка КАК Упаковка,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ТаблицаДанных.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ОстаткиТоваровПоПартии
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка КАК Исследование,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Номенклатура КАК Номенклатура,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Характеристика КАК Характеристика,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Серия КАК Серия,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Назначение КАК Назначение,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка.Склад КАК Склад,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка.Контроль КАК Контроль,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Заключение КАК Заключение,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Количество КАК Количество,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоГодное КАК КоличествоГодное,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоРазрушено КАК КоличествоРазрушено,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоНегодное КАК КоличествоНегодное,
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТовары
	|ИЗ
	|	Документ.ИсследованиеКачестваТоваров.ПланИРезультатИсследования КАК
	|		ИсследованиеКачестваТоваровПланИРезультатИсследования
	|ГДЕ
	|	ИсследованиеКачестваТоваровПланИРезультатИсследования.Ссылка В (&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	СУММА(ИсследованныеТовары.Количество) КАК Количество,
	|	СУММА(ИсследованныеТовары.КоличествоГодное) КАК КоличествоГодное,
	|	СУММА(ИсследованныеТовары.КоличествоРазрушено) КАК КоличествоРазрушено,
	|	СУММА(ИсследованныеТовары.КоличествоНегодное) КАК КоличествоНегодное,
	|	СУММА(ИсследованныеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТоварыВыборочный
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|ГДЕ
	|	ИсследованныеТовары.Контроль = ЗНАЧЕНИЕ(Перечисление.КонтрольКачества.Выборочный)
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	СУММА(ИсследованныеТовары.Количество) КАК Количество,
	|	СУММА(ИсследованныеТовары.КоличествоГодное) КАК КоличествоГодное,
	|	СУММА(ИсследованныеТовары.КоличествоРазрушено) КАК КоличествоРазрушено,
	|	СУММА(ИсследованныеТовары.КоличествоНегодное) КАК КоличествоНегодное,
	|	СУММА(ИсследованныеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ИсследованныеТоварыСплошной
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|ГДЕ
	|	ИсследованныеТовары.Контроль = ЗНАЧЕНИЕ(Перечисление.КонтрольКачества.Сплошной)
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад
	|ПОМЕСТИТЬ ИсследованныеПозиции
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровПоПартии.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваровПоПартии.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровПоПартии.Характеристика КАК Характеристика,
	|	ОстаткиТоваровПоПартии.Серия КАК Серия,
	|	ОстаткиТоваровПоПартии.Склад КАК Склад,
	|	ОстаткиТоваровПоПартии.Назначение КАК Назначение,
	|	ОстаткиТоваровПоПартии.Помещение КАК Помещение,
	|	ОстаткиТоваровПоПартии.Упаковка КАК Упаковка,
	|	ОстаткиТоваровПоПартии.Количество КАК Количество,
	|	ОстаткиТоваровПоПартии.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ОстаткиТоваров
	|ИЗ
	|	ОстаткиТоваровПоПартии КАК ОстаткиТоваровПоПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеПозиции КАК ИсследованныеПозиции
	|		ПО ОстаткиТоваровПоПартии.Номенклатура = ИсследованныеПозиции.Номенклатура
	|		И ОстаткиТоваровПоПартии.Характеристика = ИсследованныеПозиции.Характеристика
	|		И ОстаткиТоваровПоПартии.Серия = ИсследованныеПозиции.Серия
	|		И ОстаткиТоваровПоПартии.Назначение = ИсследованныеПозиции.Назначение
	|		И ОстаткиТоваровПоПартии.Склад = ИсследованныеПозиции.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.УдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ПОМЕСТИТЬ ИтогиИсследованныеТоварыВыборочный
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоНегодное = 0
	|	И ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|			ТОГДА ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|			ТОГДА ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ОформитьСписание) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.РазрушеноВПроцессеИсследований) КАК РезультатПроверкиКачества
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоРазрушено <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|			ТОГДА ОстаткиТоваров.КоличествоУпаковок - ЕСТЬNULL(ИсследованныеТовары.КоличествоРазрушено, 0)
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ПустаяСсылка) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.НеУдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.КоличествоНегодное <> 0
	|	И ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсследованныеТовары.Действие, ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)) = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|			ТОГДА ЕСТЬNULL(ИсследованныеТовары.Количество, ОстаткиТоваров.Количество)
	|		ИНАЧЕ ЕСТЬNULL(ИсследованныеТовары.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсследованныеТовары.Действие, ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)) = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|			ТОГДА ЕСТЬNULL(ИсследованныеТовары.КоличествоУпаковок, ОстаткиТоваров.КоличествоУпаковок)
	|		ИНАЧЕ ЕСТЬNULL(ИсследованныеТовары.КоличествоУпаковок, 0)
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ИсследованныеТовары.Действие, ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)) КАК Действие,
	|	ЕСТЬNULL(ИсследованныеТовары.РезультатПроверкиКачества, ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.УдовлетворяетТребованиям)) КАК РезультатПроверкиКачества
	|ПОМЕСТИТЬ АктуальныеОстаткиТоваров
	|ИЗ
	|	ОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиИсследованныеТоварыВыборочный КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено -
	|			ИсследованныеТовары.КоличествоГодное >= ИсследованныеТовары.КоличествоНегодное
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено > 0
	|						ТОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено - ИсследованныеТовары.КоличествоГодное
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено -
	|			ИсследованныеТовары.КоличествоГодное >= ИсследованныеТовары.КоличествоНегодное
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено > 0
	|						ТОГДА ИсследованныеТовары.КоличествоНегодное - ИсследованныеТовары.КоличествоРазрушено
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено -
	|			ИсследованныеТовары.КоличествоГодное
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ПустаяСсылка) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.НеУдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ПОМЕСТИТЬ ИтогиИсследованныеТоварыВыборочныйСплошной
	|ИЗ
	|	АктуальныеОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ОстаткиТоваров.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|	И ИсследованныеТовары.КоличествоНегодное <> 0
	|	И ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено - ИсследованныеТовары.КоличествоГодное > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок > ИсследованныеТовары.КоличествоРазрушено
	|			ТОГДА ИсследованныеТовары.КоличествоРазрушено
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.ОформитьСписание) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.РазрушеноВПроцессеИсследований) КАК РезультатПроверкиКачества
	|ИЗ
	|	АктуальныеОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ОстаткиТоваров.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|	И ИсследованныеТовары.КоличествоРазрушено <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено >= ИсследованныеТовары.КоличествоГодное
	|			ТОГДА ИсследованныеТовары.КоличествоГодное
	|		ИНАЧЕ ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваров.КоличествоУпаковок -
	|			ИсследованныеТовары.КоличествоРазрушено >= ИсследованныеТовары.КоличествоГодное
	|			ТОГДА ИсследованныеТовары.КоличествоГодное
	|		ИНАЧЕ ОстаткиТоваров.КоличествоУпаковок - ИсследованныеТовары.КоличествоРазрушено
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать) КАК Действие,
	|	ЗНАЧЕНИЕ(Перечисление.РезультатыПроверкиКачестваТоваров.УдовлетворяетТребованиям) КАК РезультатПроверкиКачества
	|ИЗ
	|	АктуальныеОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ОстаткиТоваров.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|	И ИсследованныеТовары.КоличествоГодное <> 0
	|	И ОстаткиТоваров.Количество - ИсследованныеТовары.КоличествоРазрушено > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ОстаткиТоваров.Количество КАК Количество,
	|	ОстаткиТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ОстаткиТоваров.Действие КАК Действие,
	|	ОстаткиТоваров.РезультатПроверкиКачества КАК РезультатПроверкиКачества
	|ИЗ
	|	АктуальныеОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыСплошной КАК ИсследованныеТовары
	|		ПО ОстаткиТоваров.Номенклатура = ИсследованныеТовары.Номенклатура
	|		И ОстаткиТоваров.Характеристика = ИсследованныеТовары.Характеристика
	|		И ОстаткиТоваров.Серия = ИсследованныеТовары.Серия
	|		И ОстаткиТоваров.Назначение = ИсследованныеТовары.Назначение
	|		И ОстаткиТоваров.Склад = ИсследованныеТовары.Склад
	|ГДЕ
	|	ИсследованныеТовары.Номенклатура ЕСТЬ NULL
	|	И ОстаткиТоваров.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваров.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Серия КАК Серия,
	|	ОстаткиТоваров.Склад КАК Склад,
	|	ОстаткиТоваров.Назначение КАК Назначение,
	|	ОстаткиТоваров.Помещение КАК Помещение,
	|	ОстаткиТоваров.Упаковка КАК Упаковка,
	|	ОстаткиТоваров.Количество КАК Количество,
	|	ОстаткиТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ОстаткиТоваров.Действие КАК Действие,
	|	ОстаткиТоваров.РезультатПроверкиКачества КАК РезультатПроверкиКачества
	|ИЗ
	|	АктуальныеОстаткиТоваров КАК ОстаткиТоваров
	|ГДЕ
	|	НЕ ОстаткиТоваров.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПоТоварамВАктеКонтроляКачества.Разблокировать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованныеТовары.Номенклатура КАК Номенклатура,
	|	ИсследованныеТовары.Характеристика КАК Характеристика,
	|	ИсследованныеТовары.Серия КАК Серия,
	|	ИсследованныеТовары.Назначение КАК Назначение,
	|	ИсследованныеТовары.Склад КАК Склад,
	|	ИсследованныеТовары.Исследование КАК Исследование,
	|	ИсследованныеТовары.Заключение КАК Заключение
	|ПОМЕСТИТЬ ИсследованныеТоварыЗаключение
	|ИЗ
	|	ИсследованныеТовары КАК ИсследованныеТовары
	|СГРУППИРОВАТЬ ПО
	|	ИсследованныеТовары.Номенклатура,
	|	ИсследованныеТовары.Характеристика,
	|	ИсследованныеТовары.Серия,
	|	ИсследованныеТовары.Назначение,
	|	ИсследованныеТовары.Склад,
	|	ИсследованныеТовары.Исследование,
	|	ИсследованныеТовары.Заключение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Номенклатура КАК Номенклатура,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Характеристика КАК Характеристика,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Серия КАК Серия,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Склад КАК Склад,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Назначение КАК Назначение,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Помещение КАК Помещение,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Упаковка КАК Упаковка,
	|	Сумма(ИтогиИсследованныеТоварыВыборочныйСплошной.Количество) КАК Количество,
	|	Сумма(ИтогиИсследованныеТоварыВыборочныйСплошной.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Действие КАК Действие,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.РезультатПроверкиКачества КАК РезультатПроверкиКачества
	|ПОМЕСТИТЬ ИтогиИсследования
	|ИЗ
	|	ИтогиИсследованныеТоварыВыборочныйСплошной КАК ИтогиИсследованныеТоварыВыборочныйСплошной
	|СГРУППИРОВАТЬ ПО
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.КонтролируемаяПартия,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Номенклатура,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Характеристика,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Серия,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Назначение,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Склад,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Помещение,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Упаковка,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.Действие,
	|	ИтогиИсследованныеТоварыВыборочныйСплошной.РезультатПроверкиКачества
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиИсследования.КонтролируемаяПартия КАК КонтролируемаяПартия,
	|	ИтогиИсследования.Номенклатура КАК Номенклатура,
	|	ИтогиИсследования.Характеристика КАК Характеристика,
	|	ИтогиИсследования.Серия КАК Серия,
	|	ИтогиИсследования.Склад КАК Склад,
	|	ИтогиИсследования.Назначение КАК Назначение,
	|	ИтогиИсследования.Помещение КАК Помещение,
	|	ИтогиИсследования.Упаковка КАК Упаковка,
	|	ИтогиИсследования.Количество КАК Количество,
	|	ИтогиИсследования.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ИтогиИсследования.Действие КАК Действие,
	|	ИтогиИсследования.РезультатПроверкиКачества КАК РезультатПроверкиКачества,
	|	ИсследованныеТоварыЗаключение.Исследование КАК Исследование,
	|	ИсследованныеТоварыЗаключение.Заключение КАК Заключение
	|ИЗ
	|	ИтогиИсследования КАК ИтогиИсследования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсследованныеТоварыЗаключение КАК ИсследованныеТоварыЗаключение
	|		ПО ИтогиИсследования.Номенклатура = ИсследованныеТоварыЗаключение.Номенклатура
	|		И ИтогиИсследования.Характеристика = ИсследованныеТоварыЗаключение.Характеристика
	|		И ИтогиИсследования.Серия = ИсследованныеТоварыЗаключение.Серия
	|		И ИтогиИсследования.Назначение = ИсследованныеТоварыЗаключение.Назначение
	|		И ИтогиИсследования.Склад = ИсследованныеТоварыЗаключение.Склад
	|ГДЕ
	|	ИтогиИсследования.Количество <> 0";
	
	Исследования = Запрос.Выполнить().Выгрузить();

	Возврат Исследования;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтборПоСвойствам

Функция ИсточникиСвойствДляОтбораПоСвойствам()
	
	Результат = Новый Массив;
	
	Результат.Добавить("Номенклатура");
	Результат.Добавить("Характеристика");
	
	Возврат Результат;
	
КонецФункции

// Устанавливает условное оформление таблицы отбора по свойствам
// 
// Параметры:
// 	УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - условное оформление формы
Процедура УстановитьУсловноеОформлениеТаблицыОтбораПоСвойствам(УсловноеОформление) Экспорт
	
	ИмяТаблицы = "ОтборПоСвойствам";
	
	// условия использования
	
	УсловияЗаполненность = Новый СписокЗначений;
	УсловияИнтервал      = Новый СписокЗначений;
	
	СтруктураУсловий = ИсследованиеТоваровКлиентСервер.СтруктураУсловийОтбораПоСвойствамНоменклатуры();
	Для каждого КлючИЗначение Из СтруктураУсловий Цикл
		
		Условие = КлючИЗначение.Значение; // см. ИсследованиеТоваровКлиентСервер.СтруктураУсловияОтбораПоСвойствамНоменклатуры
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Условие");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Условие", ИмяТаблицы));
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Условие.Идентификатор;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", Условие.Представление);
		
		Если Условие.Заполненность Тогда
			УсловияЗаполненность.Добавить(Условие.Идентификатор);
		КонецЕсли;
		
		Если Условие.Интервал Тогда
			УсловияИнтервал.Добавить(Условие.Идентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Условие");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Значение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Свойство", ИмяТаблицы));
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// отбор по свойствам в интервале
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппаДиапазон");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Значение1");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Значение2");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Условие", ИмяТаблицы));
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = УсловияИнтервал;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Значение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Условие", ИмяТаблицы));
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = УсловияИнтервал;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// отбор по свойствам на заполнено, не заполнено
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Значение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.Условие", ИмяТаблицы));
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = УсловияЗаполненность;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры

Процедура ЗаполнитьСписокОтборовПоСвойствам(ТаблицаДанных, ТаблицаНастроек, УсловиеСтруктурой = Ложь) Экспорт
	
	НастройкиГруппировки = Новый Структура;
	
	НастройкиГруппировки.Вставить("ВСписке",
							Новый Структура("Дополнение, Результат", "ВСписке", "ВСписке"));
	НастройкиГруппировки.Вставить("НеВСписке",
							Новый Структура("Дополнение, Результат", "НеВСписке", "НеВСписке"));
	НастройкиГруппировки.Вставить("Меньше",
							Новый Структура("Дополнение, Результат", "Больше", "ВИнтервале"));
	НастройкиГруппировки.Вставить("МеньшеИлиРавно",
							Новый Структура("Дополнение, Результат", "БольшеИлиРавно", "ВИнтервалеВключая"));
	
	ТекущаяСтрока = Неопределено;
	
	Для каждого Элемент Из ТаблицаНастроек Цикл
		
		Настройка = Новый Структура;
		Если НастройкиГруппировки.Свойство(Элемент.Условие, Настройка)
			И ТекущаяСтрока <> Неопределено
			И ТекущаяСтрока.Свойство = Элемент.Свойство 
			И ТекущаяСтрока.Условие = Настройка.Дополнение Тогда
			
			Если Настройка.Дополнение = Настройка.Результат Тогда
				ТекущаяСтрока.Значение.Добавить(Элемент.Значение);
			Иначе
				ТекущаяСтрока.Значение1 = ТекущаяСтрока.Значение;
				ТекущаяСтрока.Значение2 = Элемент.Значение;
				ТекущаяСтрока.Условие   = Настройка.Результат;
				ТекущаяСтрока = Неопределено;
			КонецЕсли;
			
		Иначе
			ТекущаяСтрока = ТаблицаДанных.Добавить();
			ТекущаяСтрока.Свойство = Элемент.Свойство;
			ТекущаяСтрока.Условие  = Элемент.Условие;
			Если Настройка <> Неопределено И Настройка.Дополнение = Настройка.Результат Тогда
				ТекущаяСтрока.Значение = Новый СписокЗначений;
				ТекущаяСтрока.Значение.ТипЗначения = Элемент.Свойство.ТипЗначения;
				ТекущаяСтрока.Значение.Добавить(Элемент.Значение);
			Иначе
				ТекущаяСтрока.Значение = Элемент.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если УсловиеСтруктурой Тогда
		СтруктураУсловий = ИсследованиеТоваровКлиентСервер.СтруктураУсловийОтбораПоСвойствамНоменклатуры();
		Для каждого ТекущаяСтрока Из ТаблицаДанных Цикл
			ТекущаяСтрока.Условие = СтруктураУсловий[ТекущаяСтрока.Условие];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Получает свойства для использования в отборах
//
// Параметры:
//  ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры - вид номенклатуры
//  ИсточникиСвойств - Строка - список источников, для которых получаются свойства
//  ТолькоДействующие - Булево - определяет необходимость включения в выборку только действующих свойств
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Поля - Произвольный - свойства для использования в отборах.
//
Функция ПолучитьСвойстваДляОтбораПоСвойствам(ВидНоменклатуры, ИсточникиСвойств = "", ТолькоДействующие = Истина) Экспорт
	
	Если ЗначениеЗаполнено(ИсточникиСвойств) Тогда
		СписокИсточников = СтрРазделить(ИсточникиСвойств, ",");
	Иначе
		СписокИсточников = ИсточникиСвойствДляОтбораПоСвойствам();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Набор_Справочник_Номенклатура_Общие", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие"));
	Запрос.УстановитьПараметр("Набор_Справочник_ХарактеристикиНоменклатуры_Общие", УправлениеСвойствами.НаборСвойствПоИмени("Справочник_ХарактеристикиНоменклатуры_Общие"));
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(
		ТекстЗапросаДоступныеСвойстваНоменклатуры(
			ТолькоДействующие,
			СписокИсточников.Найти("Номенклатура") <> Неопределено,
			СписокИсточников.Найти("Характеристика") <> Неопределено));
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = РезультатыЗапроса[0].Выгрузить();
	
	Для Индекс = 1 По РезультатыЗапроса.ВГраница() Цикл
		Выборка = РезультатыЗапроса[Индекс].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
		КонецЦикла;
	КонецЦикла;
	
	Результат.Свернуть("Свойство,ТипЗначения,Представление");
	
	Возврат Результат;
	
КонецФункции

Процедура ОчиститьНастройкиУточненияПримененияКартыИсследованияТоваров(ОтборПоСвойствам, ВидыНастроек = "Номенклатура,Характеристика") Экспорт
	
	Для каждого ВидНастройки Из СтрРазделить(ВидыНастроек,",") Цикл
	
		КлючСвязи = ИсследованиеТоваровКлиентСервер.ОтборПоСвойствамКлючСвязиПредопределенный(ВидНастройки);
		
		СписокСтрок = ОтборПоСвойствам.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
		Для каждого НайденнаяСтрока Из СписокСтрок Цикл
			ОтборПоСвойствам.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ТекстЗапросаДоступныеСвойстваНоменклатуры(ТолькоДействующие = Истина, ДоступныСвойстваНоменклатуры = Истина, ДоступныСвойстваХарактеристики = Истина)
	
	ТекстыЗапроса = Новый Массив();
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)                             КАК Вид,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка) КАК Свойство
	|ГДЕ
	|	ЛОЖЬ
	|");
	
	Если ДоступныСвойстваНоменклатуры Тогда
		
		// Доп реквизиты общие для номенклатуры
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.Ссылка КАК Вид,
		|	ТаблицаСвойств.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТаблицаСвойств
		|		ПО ИСТИНА
		|ГДЕ
		|	ВидыНоменклатуры.Ссылка В (&ВидыНоменклатуры)
		|	И ТаблицаСвойств.Ссылка = &Набор_Справочник_Номенклатура_Общие
		|	И &ТолькоДействующие");
		
		// Доп реквизиты вида номенклатуры
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.Ссылка КАК Вид,
		|	ТаблицаСвойств.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТаблицаСвойств
		|		ПО ВидыНоменклатуры.НаборСвойств = ТаблицаСвойств.Ссылка
		|ГДЕ
		|	ВидыНоменклатуры.Ссылка В (&ВидыНоменклатуры)
		|	И &ТолькоДействующие");
		
	КонецЕсли;
	
	Если ДоступныСвойстваХарактеристики Тогда
	
		// Доп реквизиты общие для всех характеристик
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.Ссылка КАК Вид,
		|	ТаблицаСвойств.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТаблицаСвойств
		|		ПО ИСТИНА
		|ГДЕ
		|	ВидыНоменклатуры.Ссылка В (&ВидыНоменклатуры) 
		|	И ВидыНоменклатуры.ИспользоватьХарактеристики
		|	И ТаблицаСвойств.Ссылка = &Набор_Справочник_ХарактеристикиНоменклатуры_Общие
		|	И &ТолькоДействующие");
		
		// Доп реквизиты характеристик вида номенклатуры
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.Ссылка КАК Вид,
		|	ТаблицаСвойств.Свойство КАК Свойство
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТаблицаСвойств
		|		ПО (ВЫБОР
		|				КОГДА ВидыНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
		|					ТОГДА ВидыНоменклатуры.ВладелецХарактеристик.НаборСвойствХарактеристик
		|				ИНАЧЕ ВидыНоменклатуры.НаборСвойствХарактеристик
		|			КОНЕЦ = ТаблицаСвойств.Ссылка)
		|ГДЕ
		|	ВидыНоменклатуры.Ссылка В(&ВидыНоменклатуры)
		|	И &ТолькоДействующие");
	
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Символы.ПС + " ОБЪЕДИНИТЬ " + Символы.ПС);
	
	Если ТолькоДействующие Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ТолькоДействующие", "И НЕ ТаблицаСвойств.ПометкаУдаления");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ТолькоДействующие", "");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить("
	|ВЫБРАТЬ
	|	Т.Вид                                     КАК Вид,
	|	Т.Свойство                                КАК Свойство,
	|	ПРЕДСТАВЛЕНИЕ(Т.Свойство)                 КАК Представление,
	|	Т.Свойство.ТипЗначения                    КАК ТипЗначения,
	|	Т.Свойство.ВладелецДополнительныхЗначений КАК ВладелецДополнительныхЗначений,
	|	Т.Свойство.ПометкаУдаления                КАК ПометкаУдаления,
	|	&ВыражениеИдентификатора                  КАК Идентификатор
	|ИЗ
	|	&ТекстЗапроса КАК Т", "&ТекстЗапроса", "(" + ТекстЗапроса + ")");
	
	МДДопРеквизитов = Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения;
	ВыражениеИдентификатора = РаботаСФормулами.ВыражениеПолногоИдентификатораХарактеристики(МДДопРеквизитов, Ложь);
	ВыражениеИдентификатора = СтрЗаменить(ВыражениеИдентификатора, "%ИмяТаблицы%", "Т.Свойство");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеИдентификатора", ВыражениеИдентификатора);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает признак использования серий для номенклатуры
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.Номенклатура, Неопределено - Ссылка на элемент номенклатуры.
//  
// Возвращаемое значение:
//  Булево - признак использования серий для номенклатуры.
//
Функция ИспользованиеСерий(Номенклатура) Экспорт
	
	Использование = Ложь;
	
	//++ НЕ ГОСИС
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
		Использование = Ложь;
	ИначеЕсли Номенклатура = Неопределено Тогда
		Использование = Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Использование = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА
		|			Номенклатура.ВладелецСерий <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
		|		ТОГДА
		|			Номенклатура.ВладелецСерий.ИспользоватьСерии
		|		КОГДА
		|			Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
		|		ТОГДА
		|			Номенклатура.ВидНоменклатуры.ИспользоватьСерии
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ПризнакИспользованияСерий
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|	И Номенклатура.ВидНоменклатуры.ПолитикиУчетаСерий.ПолитикаУчетаСерий.ТипПолитики <> ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Использование = Ложь;
		Если Выборка.Следующий() Тогда
			Использование = Выборка.ПризнакИспользованияСерий;
		КонецЕсли;
	КонецЕсли;
	//-- НЕ ГОСИС
	
	Возврат Использование;
	
КонецФункции

// Возвращает список исследований по которому не было оформления актов контроля качества товаров
//
// Параметры:
//  СписокИсследований - Массив Из ДокументСсылка.ИсследованиеКачестваТоваров - список исследований.
//  ЗаявкаНаКонтроль - ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров
//  
// Возвращаемое значение:
//  Массив Из ДокументСсылка.ИсследованиеКачестваТоваров
//
Функция СписокИсследованийСОформленнымиАктамиКонтроляКачества(СписокИсследований, ЗаявкаНаКонтроль) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокИсследований", СписокИсследований);
	Запрос.УстановитьПараметр("ДокументОснование", ЗаявкаНаКонтроль);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктКонтроляКачестваТоваровРезультатыИсследования.Исследование КАК Исследование
	|ПОМЕСТИТЬ ИсследованияВСуществующихАктахКонтроля
	|ИЗ
	|	Документ.АктКонтроляКачестваТоваров.РезультатыИсследования КАК АктКонтроляКачестваТоваровРезультатыИсследования
	|ГДЕ
	|	АктКонтроляКачестваТоваровРезультатыИсследования.Ссылка.ДокументОснование = &ДокументОснование
	|	И АктКонтроляКачестваТоваровРезультатыИсследования.Ссылка.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсследованияВСуществующихАктахКонтроля.Исследование КАК Исследование
	|ИЗ
	|	ИсследованияВСуществующихАктахКонтроля КАК ИсследованияВСуществующихАктахКонтроля
	|ГДЕ
	|	ИсследованияВСуществующихАктахКонтроля.Исследование В (&СписокИсследований)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исследование");

КонецФункции

// Возвращает список исследований созданных по Заявке на контроль
//
// Параметры:
//  ЗаявкаНаКонтроль - ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров.
//  
// Возвращаемое значение:
//  Массив Из ДокументСсылка.ИсследованиеКачестваТоваров
//
Функция СписокИсследованийПоЗаявкеНаКонтроль(ЗаявкаНаКонтроль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсследованиеКачестваТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИсследованиеКачестваТоваров КАК ИсследованиеКачестваТоваров
	|ГДЕ
	|	ИсследованиеКачестваТоваров.ЗаявкаНаКонтроль = &ЗаявкиНаКонтроль
	|	И ИсследованиеКачестваТоваров.Завершено = ИСТИНА
	|	И ИсследованиеКачестваТоваров.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЗаявкиНаКонтроль", ЗаявкаНаКонтроль);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Осуществляет вычисление текущего состояния заявки на контроль качества
//
// Параметры:
//	ЗаявкаНаКонтрольКачестваТоваров - ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров - Документ, состояние которого необходимо вычислить
//  
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияЗаявокНаИсследование
//
Функция РассчитатьСостояниеЗаявкиНаКонтроль(ЗаявкаНаКонтрольКачестваТоваров) Экспорт
	
	СостояниеЗаявки = Перечисления.СостоянияЗаявокНаИсследование.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ЗаявкаНаКонтрольКачестваТоваров) Тогда
	
		УстановитьПривилегированныйРежим(Истина);
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ ДокументЗаявкаНаКонтрольКачестваТоваров.Проведен
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявокНаИсследование.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(СостоянияЗаявокНаКонтрольКачества.Состояние,
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявокНаИсследование.Завершена))
		|	КОНЕЦ КАК Состояние
		|ИЗ
		|	Документ.ЗаявкаНаКонтрольКачестваТоваров КАК ДокументЗаявкаНаКонтрольКачестваТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаявокНаКонтрольКачества КАК СостоянияЗаявокНаКонтрольКачества
		|		ПО СостоянияЗаявокНаКонтрольКачества.Заявка = ДокументЗаявкаНаКонтрольКачестваТоваров.Ссылка
		|ГДЕ
		|	ДокументЗаявкаНаКонтрольКачестваТоваров.Ссылка = &ЗаявкаНаКонтрольКачестваТоваров";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ЗаявкаНаКонтрольКачестваТоваров", ЗаявкаНаКонтрольКачестваТоваров);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СостояниеЗаявки = Выборка.Состояние;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СостояниеЗаявки
	
КонецФункции

// Возвращает список показателей качества для указанного вида проверки, выбранных из карт исследования товаров.
// Отбираются первые 7 уникальных значений по дате убывания.
// 
// Параметры:
//   ВидПроверки - Строка - вид проверки для выбора показателей качества
//
// Возвращаемое значение:
//   СписокЗначений Из Строка - Список показателей качества
Функция ПоказательПолучитьСписокВыбора(ВидПроверки) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 7
	|	КартыИсследованияТоваров.ПоказательКачества КАК ПоказательКачества,
	|	КартыИсследованияТоваров.Ссылка.Дата КАК Дата
	|ИЗ
	|	Справочник.КартыИсследованияТоваров.Проверки КАК КартыИсследованияТоваров
	|ГДЕ
	|	КартыИсследованияТоваров.ВидПроверки = &ВидПроверки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";

	Запрос.УстановитьПараметр("ВидПроверки", ВидПроверки);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.ПоказательКачества);
	КонецЦикла;

	Возврат СписокВыбора;
	
КонецФункции

// Возвращает список видов проверок, используемых в карточках исследования товаров. 
// Отбираются первые 7 уникальных значений по дате убывания.
//
// Возвращаемое значение:
//   СписокЗначений из Строка - Список видов проверок
Функция ВидПроверкиПолучитьСписокВыбора() Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 7
	|	КартыИсследованияТоваров.ВидПроверки КАК ВидПроверки,
	|	КартыИсследованияТоваров.Ссылка.Дата КАК Дата
	|ИЗ
	|	Справочник.КартыИсследованияТоваров.Проверки КАК КартыИсследованияТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.ВидПроверки);
	КонецЦикла;

	Возврат СписокВыбора;
	
КонецФункции

// Возвращает список видов проверок соответствующий переданному тексту
// 
// Параметры:
//	ВидПроверки - Строка - Текст для поиска подходящих видов проверок
//	
// Возвращаемое значение:
// 	СписокЗначений из Строка - Список видов проверок
Функция ВидПроверкиПолучитьСписокВыбораАвтоПодбор(ВидПроверки) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 7
	|	КартыИсследованияТоваров.ВидПроверки КАК ВидПроверки,
	|	КартыИсследованияТоваров.Ссылка.Дата КАК Дата
	|ИЗ
	|	Справочник.КартыИсследованияТоваров.Проверки КАК КартыИсследованияТоваров
	|ГДЕ
	|	КартыИсследованияТоваров.ВидПроверки ПОДОБНО &ВидПроверки
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";

	Запрос.УстановитьПараметр("ВидПроверки", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(ВидПроверки) + "%");
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.ВидПроверки);
	КонецЦикла;

	Возврат СписокВыбора;
	
КонецФункции


// Возвращает параметры выбора назначения исследований.
//
// Возвращаемое значение:
// 	Структура - из:
//  * СвязиПараметровВыбора - Соответствие Из КлючИЗначение:
//	 ** Ключ - Строка - Вид настройки для которого необходимо получить ключ связи.
//	 ** Значение - Строка - Уникальный идентификатор.
//  * РеквизитыКартыИсследованияТоваров - Строка - список реквизитов КартыИсследованияТоваров
Функция ПараметрыВыбораНазначенияИсследований() Экспорт
	
	ПараметрыВыбора = ИсследованиеТоваровКлиентСервер.ПараметрыВыбораНазначенияИсследованийКонструктор();
	
	Возврат ПараметрыВыбора;
	
КонецФункции

#КонецОбласти

#КонецОбласти
