
#Область СлужебныйПрограммныйИнтерфейс

#Область ДеревоСпецификаций

// Возвращает структуру - информацию об остатках товара
//
// Параметры:
//  ДанныеОНоменклатуре - Структура - информация о номенклатуре и характеристике:
//  * Номенклатура	 	- СправочникСсылка.Номенклатура	- номенклатура,
//  * Характеристика	- СправочникСсылка.ХарактеристикиНоменклатуры - характеристика номенклатуры
// 
// Возвращаемое значение:
//  см. ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара
//
Функция СтруктураЗаполненияОстаткиТоваров(ДанныеОНоменклатуре) Экспорт
	
	СписокСкладов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	НЕ Склады.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокСкладов.Добавить(Выборка.Склад);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыПолученияЦеныИОстатков = ПодборТоваровКлиентСервер.НовыйПараметрыПолученияЦеныИОстатковТовара();
	ПараметрыПолученияЦеныИОстатков.Номенклатура = ДанныеОНоменклатуре.Номенклатура;
	ПараметрыПолученияЦеныИОстатков.Характеристика = ДанныеОНоменклатуре.Характеристика;
	ПараметрыПолученияЦеныИОстатков.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	ПараметрыПолученияЦеныИОстатков.Валюта = Справочники.Валюты.ПустаяСсылка();
	ПараметрыПолученияЦеныИОстатков.Склады = СписокСкладов;
	ПараметрыПолученияЦеныИОстатков.ВидыЦен = Справочники.ВидыЦен.ПустаяСсылка();
	ПараметрыПолученияЦеныИОстатков.КонтролируемаяПартия = Справочники.КонтролируемыеПартии.ПустаяСсылка();
	ПараметрыПолученияЦеныИОстатков.ПолучитьОстатки = Истина;
	ПараметрыПолученияЦеныИОстатков.ПолучитьЦену = Истина;
	
	СтруктураЗаполнения = ПодборТоваровВызовСервера.ЦенаПродажиИОстаткиТовара(ПараметрыПолученияЦеныИОстатков);
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецОбласти