#Область ПрограммныйИнтерфейс

// Позволяет скорректировать состав отчетов, фактически реализованных в прикладном решении
// и использующих возможности подсистемы СправкиРасчеты.
//
// Параметры:
//  ИменаОтчетов - Массив - Модифицируемый параметр: имена отчетов.
//
Процедура УстановитьИспользуемыеСправкиРасчеты(ИменаОтчетов) Экспорт

	ИменаОтчетов.Добавить("СправкаРасчетНалогаНаПрибыльОтОперацийРезультатКоторыхНеВключаетсяВПрибыль");
		
КонецПроцедуры

// Проверяет нужен ли для переданного типа сложный подбор.
//
// Параметры:
//  ТипЭлемента  - Тип - что нужно проверить.
//  СложныйПодбор - возвращаемое значение. Истина, если нужна сложная обработка подбора; Ложь - в противном случае.
//
Процедура ЭтоТипЭлементаСоСложнымПодбором(ТипЭлемента, СложныйПодбор) Экспорт

	Если ТипЭлемента = БухгалтерскийУчетКлиентСерверПереопределяемый.ТипЗначенияБанковскогоСчетаОрганизации() Тогда
		
		СложныйПодбор = Истина;
		
	КонецЕсли;

КонецПроцедуры

// Инициализирует коды дополнительных аналитик для бухгалтерских отчетов.
//
//	Возвращаемое значение:
//		Массив из Структура - содержит следующие свойства:
//			* Код - Строка - односимвольный код, любой кроме номеров субконто: 1, 2, 3;
//			* Наименование - Строка - Имя свойства;
//			* Представление - Строка.
//			* Тип - Тип.
//
Функция ДополнительныеАналитикиБухгалтерскихОтчетов() Экспорт
	
	ПараметрыСтрокой = "Код, Наименование, Представление, Тип";
	ДополнительныеАналитики = Новый Массив;

	//++ НЕ УТ

	Параметры = Новый Структура(ПараметрыСтрокой, 
								"@", "ОС_Владелец", НСтр("ru = 'ОС-владелец';
														|en = 'Fixed asset owner'"));
	Параметры.Вставить("Тип", БухгалтерскийУчетКлиентСерверПереопределяемый.ТипОсновныеСредства());
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"#", "Контрагент", НСтр("ru = 'Контрагент';
														|en = 'Counterparty'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ПартииРеализованнойНоменклатуры"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"$", "ДокументРеализации", НСтр("ru = 'Документ реализации';
																|en = 'Sales document'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ПартииРеализованнойНоменклатуры"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"%", "Договор", НСтр("ru = 'Договор';
													|en = 'Contract'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ПартииРеализованнойНоменклатуры"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"^", "Номенклатура", НСтр("ru = 'Номенклатура';
															|en = 'Items'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ПартииРеализованнойНоменклатуры"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"&", "ПартияНоменклатуры", НСтр("ru = 'Партия номенклатуры';
																|en = 'Product lot'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ПартииРеализованнойНоменклатуры"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"*", "ТоварыРаботыУслугиСобственногоПроизводства", НСтр("ru = 'Товары, работы, услуги собственного производства';
																						|en = 'Own-made goods, works, and services'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ПартииРеализованнойНоменклатуры"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"(", "ВариантНалогообложенияПрибыли", НСтр("ru = 'Вариант налогообложения прибыли';
																			|en = 'Profit taxation option'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ВариантыНалогообложенияРеализации"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								")", "СтавкаНДС", НСтр("ru = 'Ставка НДС';
														|en = 'VAT rate'"));
	Параметры.Вставить("Тип", Тип("СправочникСсылка.ВариантыНалогообложенияРеализации"));
	ДополнительныеАналитики.Добавить(Параметры);
	
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"й", "СтатьяРКМ", НСтр("ru = 'Статья РКМ';
														|en = 'Calculation and costing materials item'"),
								Тип("СправочникСсылка.СтатьиКалькуляции"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"ц", "УчитыватьПриФормированииЦеныПродукцииГОЗ", НСтр("ru = 'Учитывать при формировании цены продукции ГОЗ';
																						|en = 'Сonsider when generating SDO product price'"),
								Тип("СправочникСсылка.СтатьиКалькуляции"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"у", "СтатьяРКМ", НСтр("ru = 'Статья РКМ';
														|en = 'Calculation and costing materials item'"),
								Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ДополнительныеАналитики.Добавить(Параметры);
	Параметры = Новый Структура(ПараметрыСтрокой, 
								"к", "УчитыватьПриФормированииЦеныПродукцииГОЗ", НСтр("ru = 'Учитывать при формировании цены продукции ГОЗ';
																						|en = 'Сonsider when generating SDO product price'"),
								Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ДополнительныеАналитики.Добавить(Параметры);	

	//-- НЕ УТ
	
	Возврат ДополнительныеАналитики;
	
КонецФункции

// Дополняет список видов субконто дополнительной аналитикой.
//
// Параметры:
//  СписокВидовСубконто  - СписокЗначений из Строка - Возвращаемый параметр: дополняемый список, см. БухгалтерскиеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеНачалоВыбора.
//  СтрокаПоСубконто     - Строка.
//  Индекс               - Число.
//
// Возвращаемое значение:
//  Булево - Список был дополнен
//
Функция ДополнитьСписокВидовСубконто(СписокВидовСубконто, СтрокаПоСубконто, Индекс) Экспорт
	ДополнительныеАналитикиБухгалтерскихОтчетов = ДополнительныеАналитикиБухгалтерскихОтчетов();
	ИндексСубконто = Сред(СтрокаПоСубконто, Индекс*2, 1);
	ИспользованиеСубконто = ?(Сред(СтрокаПоСубконто, Индекс * 2 - 1, 1) = "+", Истина, Ложь);
	ЭтоДополнительнаяАналитика = Ложь;
	Для Каждого ДополнительнаяАналитика Из ДополнительныеАналитикиБухгалтерскихОтчетов Цикл
		Если ИндексСубконто = ДополнительнаяАналитика.Код Тогда
			СписокВидовСубконто.Добавить("Кор" + ДополнительнаяАналитика.Наименование, ДополнительнаяАналитика.Представление, ИспользованиеСубконто);
			ЭтоДополнительнаяАналитика = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭтоДополнительнаяАналитика;
КонецФункции	

// Дополняет строку по субконто элементом списка, если он является дополнительной аналитикой.
//
// Параметры:
//  СтрокаПоСубконто     - Строка - Возвращаемый параметр
//  ЭлементСписка        - ЭлементСпискаЗначений.
//
// Возвращаемое значение:
//  Булево - Список был дополнен
//
Функция ДополнитьСтрокуПоСубконто(СтрокаПоСубконто, ЭлементСписка) Экспорт
	ДополнительныеАналитикиБухгалтерскихОтчетов = ДополнительныеАналитикиБухгалтерскихОтчетов();
	ЭтоДополнительнаяАналитика = Ложь;
	Для Каждого ДополнительнаяАналитика Из ДополнительныеАналитикиБухгалтерскихОтчетов Цикл
		Если ЭлементСписка.Значение = "Кор" + ДополнительнаяАналитика.Наименование Тогда
			СтрокаПоСубконто = СтрокаПоСубконто + ДополнительнаяАналитика.Код;
			ЭтоДополнительнаяАналитика = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭтоДополнительнаяАналитика;
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Позволяет задать макет оформления в стиле прикладного решения.
//
// Параметры:
//  ЗначениеПоУмолчанию	- Строка - Модифицируемый параметр: имя общего макета.
//
Процедура УстановитьИмяМакетаОформленияПоУмолчанию(ЗначениеПоУмолчанию) Экспорт
	
	
КонецПроцедуры

// Определяет, насколько период отчета обычно отличается от периода, включающего сегодняшний день.
//
// Параметры:
//  Смещение  - Число - Возвращаемый параметр: смещение в месяцах, отрицательное для завершившихся периодов.
//  ИмяОтчета - Строка - Имя отчета.
//
Процедура УстановитьСмещениеПериодаОтчета(Смещение, Знач ИмяОтчета) Экспорт



КонецПроцедуры

// Устанавливает видимость элемента "Вид периода" в зависимости от настроек отчета.
//
// Параметры:
//	Элемент - Подменю командной панели - Элемент формы "Вид периода"
//	Отчет - ОтчетОбъект - Отчет
//
Процедура УправлениеВидимостьюВидПериода(Элемент, Отчет) Экспорт
	
	ЭтоКонецМесяца = КонецДня(Отчет.КонецПериода) = КонецМесяца(Отчет.КонецПериода);
	Элемент.Видимость = ЭтоКонецМесяца;
	
КонецПроцедуры

// Переопределяет строку с представлением периода.
//
// Параметры:
//	ТекстПериод - Строка - Текст представления периода.
//	НачалоПериода - Дата - Начало периода.
//	КонецПериода - Дата - Конец периода.
//	ТолькоДаты - Булево - Если Ложь, то возвращаемая строка включает предлог "за".
//	ВидПериода - Число - Вид периода. Если конец периода не задан или не является концом года, параметр игнорируется.
//
Процедура ПереопределитьПредставлениеПериода(ТекстПериод, НачалоПериода = '00010101', КонецПериода = '00010101', ВидПериода = 0) Экспорт
	
	ВидыПериода = БухгалтерскиеОтчетыКлиентСервер.ВидыПериода();
	
	Если ЗначениеЗаполнено(КонецПериода) И КонецПериода >= НачалоПериода
		И ВидПериода = ВидыПериода.МежотчетныйПериод И КонецДня(КонецПериода) = КонецМесяца(КонецПериода)
		И КонецДня(КонецПериода) <> КонецГода(КонецПериода)Тогда
		
		ТекстПериод = " " + НСтр("ru = 'за';
								|en = 'for'")+ " ";
		ТекстПериод = ТекстПериод + СтрШаблон(НСтр("ru = 'межотчетный период %1-%2 г.';
													|en = 'mid-term accounting period %1-%2'"), 
			Формат(КонецПериода, НСтр("ru = 'ДФ=''ММММ''';
										|en = 'DF=''MMMM'''")), Формат(КонецМесяца(КонецПериода) + 1, НСтр("ru = 'ДФ=''ММММ гггг''';
																										|en = 'DF=''MMMM yyyy'''")));
			
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

// Определяет нужно ли сбрасывать вид периода отчета к отчетному.
//
// Параметры:
//	НачалоПериода - Дата - Начало периода.
//	КонецПериода - Дата - Конец периода.
//	ВидПериода - Число - Вид периода. Если конец периода не задан или не является концом года, параметр игнорируется.
//
// Возвращаемое значение:
//  Булево - признак необходимости сброса.
//
Функция СбросКОтчетномуПериоду(НачалоПериода, КонецПериода, ВидПериода) Экспорт
	
	НуженСброс = Ложь;
	НуженСброс = КонецДня(КонецПериода) <> КонецМесяца(КонецПериода)
		ИЛИ КонецДня(НачалоПериода) <> КонецМесяца(НачалоПериода)
		И ВидПериода = БухгалтерскиеОтчетыКлиентСервер.ВидыПериода().МежотчетныйПериод;
		
	НуженСброс = НуженСброс ИЛИ КонецМесяца(КонецПериода) <> КонецМесяца(НачалоПериода)
		И ВидПериода = БухгалтерскиеОтчетыКлиентСервер.ВидыПериода().МежотчетныйПериод;
	
	Возврат НуженСброс;
	
КонецФункции

//-- НЕ УТ

#КонецОбласти