Функция НайтиХарактеристикуПоВидуНоменклатуры(
	НаименованиеВидаНоменклатуры,
	НаименованиеХарактеристики
	) Экспорт
	
	НаименованиеВидаНоменклатуры = СокрЛП(Строка(НаименованиеВидаНоменклатуры));
	НаименованиеХарактеристики = СокрЛП(Строка(НаименованиеХарактеристики));
	
	Если ПустаяСтрока(НаименованиеВидаНоменклатуры)
		Или ПустаяСтрока(НаименованиеХарактеристики) Тогда
		
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		
	КонецЕсли;
	
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(
	НаименованиеВидаНоменклатуры,
	Истина
	);
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(
	НаименованиеХарактеристики,
	Истина,
	Неопределено,
	ВидНоменклатуры
	);
	
	Возврат Характеристика;
	
КонецФункции

Функция ПолучитьХарактеристикуСтерильно() Экспорт
	
	Возврат НайтиХарактеристикуПоВидуНоменклатуры(
	"Продукция стерильная",
	"Стерильно"
	);
	
КонецФункции

Функция ПолучитьХарактеристикуНаСтерилизацию() Экспорт
	
	Возврат НайтиХарактеристикуПоВидуНоменклатуры(
	"Продукция стерильная",
	"На стерилизацию"
	);
	
КонецФункции

Функция СтруктураИзВыборки(РезультатЗапроса, Выборка, Результат)  Экспорт
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(
		Колонка.Имя,
		Выборка[Колонка.Имя]
		);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроведениеПоШтрихкодам(Источник, Отказ, РежимПроведения) Экспорт
	Если Не Отказ ТОгда
		ИмяРесурса = "";
		Если ТипЗнч(Источник)= Тип("ДокументОбъект.ПередачаТоваровХранителю") ТОгда
			ИмяРесурса = "ПереданПереработчику";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ОтчетПереработчика2_5") ТОгда
			ИмяРесурса = "Стерилизован";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") ТОгда
			ИмяРесурса = "Передвинут";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
			ИмяРесурса = "Перемещен";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПересчетТоваров") ТОгда
			ИмяРесурса = "Пересчитан";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.УпаковочныйЛист") ТОгда
			ИмяРесурса = "Упакован";
		ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.РеализацияТоваровУслуг") ТОгда
			ИмяРесурса = "Отгружен";
		КонецЕсли;	
		
		Если ИмяРесурса <> "" ТОгда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод КАК Штрихкод
			|ПОМЕСТИТЬ ВТ1
			|ИЗ
			|	&Штрихкоды КАК Штрихкоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура КАК Номенклатура,
			|	Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства КАК ЭтапПроизводства,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Серия КАК Серия,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номер КАК Номер,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод КАК Штрихкод,
			|	&Ссылка КАК ДокументДвижения
			|ПОМЕСТИТЬ ВТ2
			|ИЗ
			|	ВТ1 КАК ВТ1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(
			|				,
			|				ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ЭтапПроизводства2_2)
			|					И Напечатан) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ1.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ2.Номенклатура КАК Номенклатура,
			|	ВТ2.ЭтапПроизводства КАК ЭтапПроизводства,
			|	ВТ2.Серия КАК Серия,
			|	ВТ2.Номер КАК Номер,
			|	ВТ2.Штрихкод КАК Штрихкод,
			|	ВТ2.ДокументДвижения КАК ДокументДвижения
			|ИЗ
			|	ВТ2 КАК ВТ2
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(, ДокументДвижения = &ССылка) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ2.Номенклатура = Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура
			|			И ВТ2.ЭтапПроизводства = Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства
			|			И ВТ2.Серия = Разр_ЯрлыкиКоробовСрезПоследних.Серия
			|			И ВТ2.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод
			|			И (ВЫБОР
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ПередачаТоваровХранителю)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.ПереданПереработчику
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ОтчетПереработчика2_5)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Стерилизован
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.РеализацияТоваровУслуг)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Отгружен
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ПеремещениеТоваров)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Перемещен
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ПересчетТоваров)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Пересчитан
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.УпаковочныйЛист)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Упакован
			|				КОГДА ТИПЗНАЧЕНИЯ(ВТ2.ДокументДвижения) = ТИП(Документ.ДвижениеПродукцииИМатериалов)
			|					ТОГДА Разр_ЯрлыкиКоробовСрезПоследних.Передвинут
			|			КОНЕЦ)
			|ГДЕ
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура ЕСТЬ NULL";
			
			Запрос.Параметры.Вставить("Штрихкоды",Источник.Разр_Штрихкоды.Выгрузить());
			Запрос.Параметры.Вставить("Ссылка", Источник.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаписьРС = РегистрыСведений.Разр_ЯрлыкиКоробов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьРС,ВыборкаДетальныеЗаписи);
				ЗаписьРС.Период = ТекущаяДатаСеанса();
				ЗаписьРС.ДокументДвижения = Источник.Ссылка;
				ЗаписьРС[ИмяРесурса] = Истина;
				ЗаписьРС.Автор = ПараметрыСеанса.ТекущийПользователь;
				ЗаписьРС.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ОтменаПроведенияПоШтрихкодам(Источник, Отказ) Экспорт
	Если Не Отказ ТОгда
		//ИмяРесурса = "";
		//Если ТипЗнч(Источник)= Тип("ДокументОбъект.ПередачаТоваровХранителю") ТОгда
		//	ИмяРесурса = "Напечатан";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ОтчетПереработчика2_5") ТОгда
		//	ИмяРесурса = "ПереданПереработчику";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПересчетТоваров") ТОгда
		//	ИмяРесурса = "Стерилизован";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПеремещениеТоваров") ТОгда
		//	ИмяРесурса = "Пересчитан";	
		//	//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") ТОгда
		//	//	ИмяРесурса = "Передвинут";		
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.УпаковочныйЛист") ТОгда
		//	ИмяРесурса = "Пересчитан";
		//ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.РеализацияТоваровУслуг") ТОгда
		//	ИмяРесурса = "Упакован";
		//КонецЕсли;	
		
		//Если ИмяРесурса <> "" ТОгда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод КАК Штрихкод
			|ПОМЕСТИТЬ ВТ1
			|ИЗ
			|	&Штрихкоды КАК Штрихкоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура КАК Номенклатура,
			|	Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства КАК ЭтапПроизводства,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Серия КАК Серия,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Номер КАК Номер,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод КАК Штрихкод,
			|	&Ссылка КАК ДокументДвижения
			|ПОМЕСТИТЬ ВТ2
			|ИЗ
			|	ВТ1 КАК ВТ1
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(
			|				,
			|				ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ЭтапПроизводства2_2)
			|					И Напечатан) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ1.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ2.Номенклатура КАК Номенклатура,
			|	ВТ2.ЭтапПроизводства КАК ЭтапПроизводства,
			|	ВТ2.Серия КАК Серия,
			|	ВТ2.Номер КАК Номер,
			|	ВТ2.Штрихкод КАК Штрихкод,
			|	ВТ2.ДокументДвижения КАК ДокументДвижения,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Напечатан КАК Напечатан,
			|	Разр_ЯрлыкиКоробовСрезПоследних.ПереданПереработчику КАК ПереданПереработчику,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Стерилизован КАК Стерилизован,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Отгружен КАК Отгружен,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Перемещен КАК Перемещен,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Пересчитан КАК Пересчитан,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Упакован КАК Упакован,
			|	Разр_ЯрлыкиКоробовСрезПоследних.Передвинут КАК Передвинут
			|ИЗ
			|	ВТ2 КАК ВТ2
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Разр_ЯрлыкиКоробов.СрезПоследних(
			|				,
			|				ВЫБОР
			|					КОГДА ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ПередачаТоваровХранителю)
			|						ТОГДА ДокументДвижения = &ССылка
			|								И (Напечатан
			|									ИЛИ ПереданПереработчику)
			|					КОГДА ТИПЗНАЧЕНИЯ(ДокументДвижения) = ТИП(Документ.ОтчетПереработчика2_5)
			|						ТОГДА ДокументДвижения = &ССылка
			|								И (ПереданПереработчику
			|									ИЛИ Стерилизован)
			|				КОНЕЦ) КАК Разр_ЯрлыкиКоробовСрезПоследних
			|		ПО ВТ2.Номенклатура = Разр_ЯрлыкиКоробовСрезПоследних.Номенклатура
			|			И ВТ2.ЭтапПроизводства = Разр_ЯрлыкиКоробовСрезПоследних.ЭтапПроизводства
			|			И ВТ2.Серия = Разр_ЯрлыкиКоробовСрезПоследних.Серия
			|			И ВТ2.Штрихкод = Разр_ЯрлыкиКоробовСрезПоследних.Штрихкод";
			
			Запрос.Параметры.Вставить("Штрихкоды",Источник.Разр_Штрихкоды.Выгрузить());
			Запрос.Параметры.Вставить("Ссылка", Источник.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаписьРС = РегистрыСведений.Разр_ЯрлыкиКоробов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьРС,ВыборкаДетальныеЗаписи);
				ЗаписьРС.Период = ТекущаяДатаСеанса();
				ЗаписьРС.ДокументДвижения = Источник.Ссылка;
				//ЗаписьРС[ИмяРесурса] = Истина;
				ЗаписьРС.Автор = ПараметрыСеанса.ТекущийПользователь;
				ЗаписьРС.Записать();
			КонецЦикла;			
		//КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
