////////////////////////////////////////////////////////////////
// Модуль "НазначенияКлиентСервер" содержит процедуры и функции для 
// работы с назначениями на клиенте и на сервере.
//
////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Заполнение

// Возвращает параметры заполнения по типу назначения
// 
// Возвращаемое значение:
//  Структура - с ключами:
// * ИмяЗаполняемогоПоля - Строка                            - имя заполняемого поля
// * ИмяПоляТЧ           - Строка, Неопределено              - источник значение заполнения, приоритетнее чем ЗначениеПоля
// * ЗначениеПоля        - Произвольный                      - значение заполнения
// * ТипНазначения       - ПеречислениеСсылка.ТипыНазначений - тип назначения, по которому заполняется указанное поле указанным значением
//
Функция ПараметрыЗаполнения() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяЗаполняемогоПоля");
	Параметры.Вставить("ИмяПоляТЧ");
	Параметры.Вставить("ЗначениеПоля");
	Параметры.Вставить("ТипНазначения");
	
	Возврат Параметры;
	
КонецФункции

// Предназначена для использования в формах документах в обработчиках событий, которые приводят к изменению назначения в
// строке табличной части документа. Добавляет в структуру действий действие, которое отрабатывается механизмами
// обработки табличных частей, см. ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ Выполнение такого
// действия актуализирует назначение в строке табличной части документа, в соответствии с изменившимся направлением деятельности.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма в которой необходимо выполнить действие по обработки строки табличной части.
//  СтруктураДействий - Структура - Структура действий, используемая механизмами обработки табличных частей (см.
//                                  процедуру ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ).
//  Устарело - Булево - Для совместимости с НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки
Процедура СтруктураДействийВставитьПриДобавленииСтроки(Форма, СтруктураДействий, Устарело = Ложь) Экспорт
	
	Если Устарело Тогда
		ПорядокОбработкиДокумента = Форма.МетаданныеФормы;
		Кэш = Форма.НаправленияДеятельностиКэшированныеЗначения;
	Иначе
		ПорядокОбработкиДокумента = Форма.НазначенияКэшированныеЗначения.ПорядокОбработкиДокумента;
		Кэш = Форма.НазначенияКэшированныеЗначения;
	КонецЕсли;
	
	ИмяРеквизитаПоЗаказу = ПорядокОбработкиДокумента.ИмяРеквизитаПоЗаказу;
	ИмяРеквизитаОбособленно = ПорядокОбработкиДокумента.Служебные.ИмяРеквизитаОбособленно;

	НазначениеПоУмолчанию = Неопределено;
	Если ИмяРеквизитаПоЗаказу = Неопределено
		Или Не ЗначениеЗаполнено(Форма.Объект[ИмяРеквизитаПоЗаказу])
		Или Не Форма.Объект[ИмяРеквизитаПоЗаказу] Тогда
			НазначениеПоУмолчанию = Кэш.НазначениеПоУмолчанию;
	КонецЕсли;
		
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение", НазначениеПоУмолчанию);
	
	Если ИмяРеквизитаОбособленно <> Неопределено И ЗначениеЗаполнено(НазначениеПоУмолчанию) Тогда
		СтруктураДействий.Вставить("ЗаполнитьФлагОбособленноПоНазначению", ИмяРеквизитаОбособленно);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет невидимое поле Назначение в документах исходя из заполненного поля Обособленно.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма в которой необходимо выполнить действие по обработки строки табличной части.
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - строка в которой нужно заполнить назначение исходя из флага Обособленно.
//  Устарело - Булево - Для совместимости с НаправленияДеятельностиКлиентСервер.ЗаполнитьНазначениеПоФлагуОбособленно
Процедура ЗаполнитьНазначениеПоФлагуОбособленно(Форма, ТекущаяСтрока, Устарело = Ложь) Экспорт
	
	Если Устарело Тогда
		НазначениеПоУмолчанию = Форма.НаправленияДеятельностиКэшированныеЗначения.НазначениеПоУмолчанию;
	Иначе
		НазначениеПоУмолчанию = Форма.НазначенияКэшированныеЗначения.НазначениеПоУмолчанию;
	КонецЕсли;
	Если ТекущаяСтрока.Обособленно Тогда
		
		ТекущаяСтрока.Назначение = НазначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПредставления

// Определяет представление типа назначения по реквизитам назначения.
// Параметры:
//  РеквизитыНазначения - Структура - структура с полями:
//   * Заказ - см. Справочник.Назначения.Заказ
//   * Договор - см. Справочник.Назначения.Договор
//   * Партнер - см. Справочник.Назначения.Партнер
//   * ТипНазначения - см. Справочник.Назначения.ТипНазначения
//  КодЯзыка - Строка - Код языка.
// Возвращаемое значение:
//  Строка - Представление
Функция ПредставлениеТипаНазначения(РеквизитыНазначения, КодЯзыка) Экспорт
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(РеквизитыНазначения.Заказ) Тогда
		
		ТипДокумента = ТипЗнч(РеквизитыНазначения.Заказ);
		
		Если ТипДокумента = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
			Результат = НСтр("ru = 'Заказ на сборку (разборку)';
							|en = 'Kitting order'", КодЯзыка);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			Результат = НСтр("ru = 'Заказ на перемещение';
							|en = 'Transfer order'", КодЯзыка);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Результат = НСтр("ru = 'Заказ на внутреннее потребление';
							|en = 'Inventory consumption order'", КодЯзыка);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Результат = НСтр("ru = 'Заказ клиента';
							|en = 'Sales order'", КодЯзыка);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			Результат = НСтр("ru = 'Заявка на возврат товаров от клиента';
							|en = 'Sales return request'", КодЯзыка);
		//++ НЕ УТ
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказМатериаловВПроизводство") Тогда
			Результат = НСтр("ru = 'Заказ материалов в производство';
							|en = 'Material order for shop floor stockroom'", КодЯзыка);
		//++ Устарело_Переработка24
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПереработчику") Тогда
			Результат = НСтр("ru = 'Заказ переработчику (2.4)';
							|en = 'Subcontracting purchase order (2.4)'", КодЯзыка);
		//-- Устарело_Переработка24
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПереработчику2_5") Тогда
			Результат = НСтр("ru = 'Заказ переработчику';
							|en = 'Subcontracting purchase order'", КодЯзыка);
		//-- НЕ УТ
	
		//++ НЕ УТКА
	
		//++ Устарело_Переработка24
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказДавальца") Тогда
			Результат = НСтр("ru = 'Заказ давальца (2.4)';
							|en = 'Subcontracting sales order (2.4)'", КодЯзыка);
		//-- Устарело_Переработка24
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказДавальца2_5") Тогда
			Результат = НСтр("ru = 'Заказ давальца';
							|en = 'Subcontracting sales order'", КодЯзыка);
		//++ Устарело_Производство21
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			Результат = НСтр("ru = 'Заказ на производство (2.1)';
							|en = 'Production order (2.1)'", КодЯзыка);
		//-- Устарело_Производство21
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказНаРемонт") Тогда
			Результат = НСтр("ru = 'Заказ на ремонт';
							|en = 'R&M order'", КодЯзыка);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
			Результат = НСтр("ru = 'Этап производства';
							|en = 'Production stage'", КодЯзыка);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказНаПроизводство2_2") Тогда
			Результат = НСтр("ru = 'Заказ на производство';
							|en = 'Production order'", КодЯзыка);
		//-- НЕ УТКА
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(РеквизитыНазначения.Договор) Тогда
		
		Если РеквизитыНазначения.ТипНазначения = ПредопределенноеЗначение("Перечисление.ТипыНазначений.ПоставкаПодПринципала") Тогда
			Результат = НСтр("ru = 'Закупка под принципала';
							|en = 'Purchase for principal'", КодЯзыка);
		ИначеЕсли РеквизитыНазначения.ТипНазначения = ПредопределенноеЗначение("Перечисление.ТипыНазначений.Давальческое2_5")
				//++ Устарело_Переработка24
				Или РеквизитыНазначения.ТипНазначения = ПредопределенноеЗначение("Перечисление.ТипыНазначений.ДавальческоеМатериалы22")
				//-- Устарело_Переработка24
				Или Ложь Тогда
				Результат = НСтр("ru = 'Договор с давальцем';
								|en = 'Subcontracting agreement'", КодЯзыка);
		Иначе
			Результат = НСтр("ru = 'Договор с переработчиком';
							|en = 'Contract with subcontractor'", КодЯзыка);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(РеквизитыНазначения.Партнер) Тогда
		
		Если РеквизитыНазначения.ТипНазначения = ПредопределенноеЗначение("Перечисление.ТипыНазначений.Давальческое2_5")
			//++ Устарело_Переработка24
			Или РеквизитыНазначения.ТипНазначения = ПредопределенноеЗначение("Перечисление.ТипыНазначений.ДавальческоеМатериалы22")
			//-- Устарело_Переработка24
			Или Ложь Тогда
			Результат = НСтр("ru = 'Давалец';
							|en = 'Material provider'", КодЯзыка);
		Иначе
			Результат = НСтр("ru = 'Переработчик';
							|en = 'Subcontractor'", КодЯзыка);
		КонецЕсли;
		
	Иначе
		
		Результат = НСтр("ru = 'Направление деятельности';
						|en = 'Line of business'", КодЯзыка);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти