
&Перед("ДобавитьКомандыПечати")
Процедура Разр_ДобавитьКомандыПечати(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Разр_ЭтикеткаКомплект1РУ";
	КомандаПечати.Представление = НСтр("ru = 'Этикетка Комплект 1 РУ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МенеджерПечати  = "Документ.ЭтапПроизводства2_2";
КонецПроцедуры

&Перед("Печать")
Процедура Разр_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	#Если Сервер Тогда
	Если УправлениеПечатью.НужноПечататьМакет(
        КоллекцияПечатныхФорм,
        "Разр_ЭтикеткаКомплект1РУ"
    ) Тогда

        ТабличныйДокумент = Разр_СформироватьПечатнуюФормуЭтикеткаКомплект1РУ(
            МассивОбъектов,
            ОбъектыПечати,
            ПараметрыПечати
        );

        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
            КоллекцияПечатныхФорм,
            "Разр_ЭтикеткаКомплект1РУ",
            НСтр("ru = 'Этикетка Комплект 1 РУ'"),
            ТабличныйДокумент,
            ,
            "Документ.ЭтапПроизводства2_2.Разр_ЭтикеткаКомплект1РУ"
        );
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Функция Разр_СформироватьПечатнуюФормуЭтикеткаКомплект1РУ(
    МассивОбъектов,
    ОбъектыПечати,
    ПараметрыПечати
)
#Если Сервер Тогда
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		ТаблицаДанных = ПолучитьТЧДляПечати(ОбъектПечати);
    ТабДокумент = Новый ТабличныйДокумент;

    Макет = УправлениеПечатью.МакетПечатнойФормы(
        "Документ.ЭтапПроизводства2_2.Разр_ЭтикеткаКомплект1РУ"
    );
    ДанныеДляПечати = ПолучитьДанныеДляПечати(ОбъектПечати);
	
    Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ДанныеДляПечати);
	ТабДокумент.Вывести(Шапка);
    
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Заполнить(ДанныеДляПечати);
	Подвал.Параметры.НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДляПечати.Номер,Истина,Истина) + " - " + Формат(ДанныеДляПечати.ДатаИзготовления,"ДФ=yyyy");
	Подвал2 = Макет.ПолучитьОбласть("Подвал2");
	Подвал2.Параметры.Заполнить(ДанныеДляПечати);
	Рисунок = Макет.ПолучитьОбласть("Рисунок");
	Рисунок.ПолеСверху 			= 0;
	Рисунок.ПолеСлева 			= 0;
	Рисунок.ПолеСправа 			= 0;
	Рисунок.ПолеСнизу 			= 0;
	//Эмблема = Макет.ПолучитьОбласть("Эмблема");
	ОбластьСтрок = Новый ТабличныйДокумент;
	ОбластьРисунков = Новый ТабличныйДокумент;
	ОбластьСтрокИПодвала = Новый ТабличныйДокумент;	
	Номер = 1;
	Для Каждого стр Из ТаблицаДанных Цикл
		
		Строка.Параметры.Заполнить(Стр);
		Строка.Параметры.Номер = Номер;		
		ОбластьСтрок.Вывести(Строка);
		
		Номер = Номер+1;
	КонецЦикла;	
	
	ОбластьСтрок.Вывести(Подвал);
	//мИзображения = ПолучитьРисунки(ОбъектПечати);
	
	//ПределЦикла = Макс(мИзображения.Количество()-1,4);
	ПределЦикла = Макс(ТаблицаДанных.Количество()-1,4);
		Для Н=0 По  ПределЦикла Цикл
			//с = мИзображения[Н].Ссылка.Хранилище.Получить();
			РисунокИзображение = Рисунок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			РисунокИзображение.ГраницаСверху = Ложь;
			РисунокИзображение.ГраницаСнизу = Ложь;
			РисунокИзображение.ГраницаСправа = Ложь;
			РисунокИзображение.ГраницаСлева = Ложь;
			РисунокИзображение.Имя = "D"+Н;			
			
			//Если Н<мИзображения.Количество() Тогда
			Если Н<ТаблицаДанных.Количество() Тогда
				//НомФайл = мИзображения[Н].Картинка.Получить();
				Если ЗначениеЗаполнено(ТаблицаДанных[Н].Картинка) Тогда
					НомФайл = ТаблицаДанных[Н].Картинка.Получить();
					Если ТипЗнч(НомФайл) = ТИП("ДвоичныеДанные") ТОгда
						НомКартинка = Новый Картинка(НомФайл);
						РисунокИзображение.Картинка = НомКартинка;
						//Рисунок.Параметры.НомерКоличество = Строка(Н+1)+" - "+мИзображения[Н].Количество+" "+мИзображения[Н].ЕдиницаИзмерения;
						
						//Иначе
						//	Рисунок.Параметры.НомерКоличество ="";	
					КонецЕсли;
				КонецЕсли;
				Рисунок.Параметры.НомерКоличество = Строка(Н+1)+" - "+ТаблицаДанных[Н].Количество+" "+ТаблицаДанных[Н].ЕдиницаИзмерения;
			Иначе
				Рисунок.Параметры.НомерКоличество ="";
			КонецЕсли;
			
			РисунокИзображение.Высота = 24;
			РисунокИзображение.Ширина = 20;
			//РисунокИзображение.Верх = 0;
			//РисунокИзображение.Лево = 20*Н+2;
			РисунокИзображение.РазмерКартинки = РазмерКартинки.Пропорционально;
			
			
			
			
			Если Н%5 = 0 ТОгда
				ОбластьРисунков.Вывести(Рисунок);
			Иначе
				ОбластьРисунков.Присоединить(Рисунок);
			КонецЕсли;
			
			Рисунок.Рисунки.Очистить();
			
		КонецЦикла;	
	
	ОбластьСтрокИПодвала.Присоединить(ОбластьСтрок);
	ОбластьСтрокИПодвала.Присоединить(ОбластьРисунков);
	ТабДокумент.Вывести(ОбластьСтрокИПодвала);
	ТабДокумент.Вывести(Подвал2);
    

    Возврат ТабДокумент;
	КонецЦикла;
    #КонецЕсли
КонецФункции

Функция ПолучитьТЧДляПечати(ОбъектПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК Этап,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Наименование КАК НоменклатураНаименование
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &ОбъектПечати
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НоменклатураДополнительныеРеквизиты4.Значение.Родитель.Наименование = ВТ1.НоменклатураНаименование
	|			ТОГДА НоменклатураДополнительныеРеквизиты4.Значение
	|		ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|	КОНЕЦ КАК Наименование,
	|	НоменклатураДополнительныеРеквизиты1.Значение КАК Материал,
	|	НоменклатураДополнительныеРеквизиты2.Значение КАК Размер,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок / ВТ1.КоличествоУпаковок КАК Количество,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки КАК НомерСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка КАК ЕдиницаИзмерения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ФайлКартинки.ФайлХранилище КАК Картинка,
	|	НоменклатураДополнительныеРеквизиты3.Значение = ИСТИНА КАК НеПечататьВКомплекте
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""НаименованиеДляПаспорта"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты1
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = НоменклатураДополнительныеРеквизиты1.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты1.Свойство.ИдентификаторДляФормул = ""Материал"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты2
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = НоменклатураДополнительныеРеквизиты2.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты2.Свойство.ИдентификаторДляФормул = ""Размер"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты3
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = НоменклатураДополнительныеРеквизиты3.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты3.Свойство.ИдентификаторДляФормул = ""НеПечататьВКомплекте"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты4
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = НоменклатураДополнительныеРеквизиты4.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты4.Свойство.ИдентификаторДляФормул = ""ДополнительноеНаименованиеВНаборе"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = ВТ1.Этап
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &ОбъектПечати
	|	И (НоменклатураДополнительныеРеквизиты3.Значение ЕСТЬ NULL
	|			ИЛИ НоменклатураДополнительныеРеквизиты3.Значение = ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("ОбъектПечати", ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗ;	
	
КонецФункции // ()

Функция ПолучитьРисунки(ОбъектПечати)
   		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок КАК Количество,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки КАК НомерСтроки,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка КАК ЕдиницаИзмерения,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ФайлКартинки.ФайлХранилище КАК Картинка
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
		|ГДЕ
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &ОбъектПечати
		|	И НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ФайлКартинки.ФайлХранилище ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОбъектПечати", ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗ;	

КонецФункции // ()

Функция ПолучитьДанныеДляПечати(ОбъектПечати)
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Комплекты,
	|	(ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты1.Значение КАК СТРОКА(300))) + "" "" + (ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты2.Значение КАК СТРОКА(300))) КАК Сертификат,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Артикул КАК Артикул,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.ДатаПотребности КАК ДатаИзготовления,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.Номер КАК Номер,
	|	ДОБАВИТЬКДАТЕ(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.ДатаПотребности, ГОД, ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.СрокГодности) КАК СрокГодности,
	|	НоменклатураДополнительныеРеквизиты3.Значение КАК Гост,
	|	НоменклатураДополнительныеРеквизиты4.Значение КАК Назначение
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""НаименованиеРУ"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты1
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураДополнительныеРеквизиты1.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты1.Свойство.ИдентификаторДляФормул = ""НомерРУ1"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты2
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураДополнительныеРеквизиты2.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты2.Свойство.ИдентификаторДляФормул = ""НомерТУ1"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты3
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураДополнительныеРеквизиты3.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты3.Свойство.ИдентификаторДляФормул = ""ГОСТ"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты4
	|		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураДополнительныеРеквизиты4.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты4.Свойство.ИдентификаторДляФормул = ""НазначениеНаЭтикеткуВнутреннюю"")
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &ОбъектПечати";
	
	Запрос.УстановитьПараметр("ОбъектПечати", ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка;

КонецФункции // ПолучитьДанныеДляПечати()

