
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапуститьРасчет() Экспорт
	
	Если СтруктураЗаказаСлужебный.БлокироватьРасчет() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭкспортнойПроцедуры = "СтруктураЗаказа.ЗапуститьРасчетПродолжение";
	ПараметрыПроцедуры = Новый Массив();

	Ключ = Метаданные.РегламентныеЗадания.РасчетСтруктурыЗаказа.Ключ;
	
	УстановитьПривилегированныйРежим(Истина);
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ, Состояние", Ключ, СостояниеФоновогоЗадания.Активно));
	УстановитьПривилегированныйРежим(Ложь);
	
	Если АктивныеЗадания.Количество() = 0 Тогда
		
		Попытка
			ФоновыеЗадания.Выполнить(
				ИмяЭкспортнойПроцедуры,
				ПараметрыПроцедуры,
				Ключ,
				НСтр("ru = 'Расчет структуры заказа. Управляющий поток';
					|en = 'Order structure calculation. Thread of control'"));
		Исключение
			// задание уже запущено
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьРасчетПродолжение() Экспорт
	
	ПротоколРасчета = ПротоколРасчета();
	
	ПорядокРасчета = Новый Массив;
	
	Действие = ПараметрыДействия();
	Действие.Имя = НСтр("ru = 'Распределение';
						|en = 'Allocation'");
	Действие.ИмяПроцедуры = "СтруктураЗаказа.ВыполнитьРаспределениеЗапасов";
	Действие.ПоляВыборки = "Номенклатура,Характеристика,Склад,Назначение";
	Действие.ПоляГруппировки = "Идентификатор";
	Действие.ПараметрыОбработкиОшибок.ТипОшибки = Перечисления.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство.ОшибкаРаспределенияЗапасов;
	Действие.ОчередьЗаданий = РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов;
	Действие.КоличествоПорций = ПротоколРасчета.ПараметрыРасчета.КоличествоПотоков;
	ДобавитьТекстЗапросаПорционнойВыборки(Действие, ПротоколРасчета.ПараметрыРасчета, Действие.ПоляВыборки);
	ПорядокРасчета.Добавить(Действие);
	
	Действие = ПараметрыДействия();
	Действие.Имя = НСтр("ru = 'Разузлование';
						|en = 'Explosion'");
	Действие.ИмяПроцедуры = "СтруктураЗаказа.ВыполнитьРазузлование";
	Действие.ПоляВыборки = "Спецификация,ЗаказНаПроизводство";
	Действие.ПараметрыОбработкиОшибок.ТипОшибки = Перечисления.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство.ОшибкаРазузлования;
	Действие.ПараметрыОбработкиОшибок.ПоляГруппировки = "ЗаказНаПроизводство";
	Действие.ОчередьЗаданий = РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации;
	Действие.КоличествоПорций = ПротоколРасчета.ПараметрыРасчета.КоличествоПотоков;
	ДобавитьТекстЗапросаПорционнойВыборки(Действие, ПротоколРасчета.ПараметрыРасчета, Действие.ПоляВыборки);
	ПорядокРасчета.Добавить(Действие);
	
	Действие = ПараметрыДействия();
	Действие.Имя = НСтр("ru = 'Пересчет структуры заказа';
						|en = 'Order structure recalculation'");
	Действие.ИмяПроцедуры = "СтруктураЗаказаСлужебный.ВыполнитьПересчет";
	Действие.ПоляВыборки = "ЗаказНаПроизводство";
	Действие.ПараметрыОбработкиОшибок.ТипОшибки = Перечисления.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство.ОшибкаРазузлования;
	Действие.ПараметрыОбработкиОшибок.ПоляГруппировки = "ЗаказНаПроизводство";
	Действие.ОчередьЗаданий = РегистрыСведений.ЗаданияКОчисткеСтруктурыЗаказа;
	Действие.КоличествоПорций = ПротоколРасчета.ПараметрыРасчета.КоличествоПотоков;
	ДобавитьТекстЗапросаПорционнойВыборки(Действие, ПротоколРасчета.ПараметрыРасчета, Действие.ПоляВыборки);
	ПорядокРасчета.Добавить(Действие);
	
	ВыполнитьДействия(ПорядокРасчета, ПротоколРасчета);
	
КонецПроцедуры

Процедура ВыполнитьДействия(ПорядокРасчета, ПротоколРасчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтменитьВыполнениеВсехПотоков();
	
	ТекущееДействие = Неопределено;
	НомерОчереди = -1;
	
	Попытка
		
		ПродолжатьРасчет = Ложь;
		
		Пока Истина Цикл //
			
			ГраницаРасчета = Константы.ГраницаРасчетаСтруктурыЗаказов.ПолучитьИСдвинуть();
			
			ЕстьЗаданияКРасчету = ВыбратьИзмененияИзОчередей(ГраницаРасчета, ПорядокРасчета, ТекущееДействие, НомерОчереди);
			
			Если ЕстьЗаданияКРасчету Тогда
				
				ПоследняяЗапись = Неопределено;
				ВсегоПорций = 0;
				
				Пока Истина Цикл
					
					Если ВсегоПорций = 0
						И ЕстьЗаданияКРасчету Тогда
						
						Задания = ВыбратьДанныеДляОбработки(
							ПротоколРасчета.ПараметрыРасчета,
							НомерОчереди,
							ТекущееДействие.ТекстЗапроса,
							ТекущееДействие.УсловиеПорционнойВыборки,
							ПоследняяЗапись,
							ЕстьЗаданияКРасчету); // ТаблицаЗначений
							
						Если ТекущееДействие.ИмяПроцедуры = ПроцедураРаспределенияЗапасов() Тогда
							ДополнитьТаблицуИдентификаторомДляГруппировки(Задания);
							ТекущееДействие.ПоляВыборки = "Номенклатура,Характеристика,Склад,Назначение,Идентификатор";
						КонецЕсли;
							
						ПорцииРасчета = РазбитьНаПорции(
							Задания,
							ТекущееДействие.ПоляВыборки,
							ТекущееДействие.ПоляГруппировки,
							ТекущееДействие.КоличествоПорций);
							
						ВсегоПорций = ПорцииРасчета.Количество();
						
					КонецЕсли;
					
					Если ВсегоПорций > 0 Тогда
						
						ПараметрыДействия = Новый Структура(
							"Очередь,
							|ПорцияРасчета,
							|ПараметрыРасчета",
							 НомерОчереди,
							 ПорцииРасчета[0],
							 ПротоколРасчета.ПараметрыРасчета);
						
						ВыполнитьПоток(
							ТекущееДействие.Имя,
							ТекущееДействие.ИмяПроцедуры,
							ПараметрыДействия,
							ПротоколРасчета);
						
						ПорцииРасчета.Удалить(0);
						
						ВсегоПорций = ВсегоПорций - 1;
						
					КонецЕсли;
					
					Если ВсегоПорций > 0 Или ЕстьЗаданияКРасчету Тогда
						Продолжить;
					КонецЕсли;
					
					ОжидатьЗавершениеРасчета(ПротоколРасчета);
				
					Если НайденыОшибкиПриРасчете(
							ПротоколРасчета,
							ПорцииРасчета,
							ТекущееДействие) Тогда
						ВсегоПорций = ПорцииРасчета.Количество();
						Продолжить;
					КонецЕсли;
				
					ТекущееДействие.ОчередьЗаданий.УдалитьЗадания(НомерОчереди);
					
					ЕстьЗаданияКРасчету = ВыбратьИзмененияИзОчередей(ГраницаРасчета, ПорядокРасчета, ТекущееДействие, НомерОчереди);
					
					Если ЕстьЗаданияКРасчету Тогда
						Продолжить;
					КонецЕсли;
					
					Прервать;
					
				КонецЦикла;
				
				ПродолжатьРасчет = Истина;
				
			КонецЕсли;
			
			СтруктураЗаказаСлужебный.ВыполнитьДействияВКонцеТактаРасчета(ГраницаРасчета);
			
			Если Не ПродолжатьРасчет Тогда
				Прервать;
			КонецЕсли;
			
			ПродолжатьРасчет = Ложь;
			ПротоколРасчета.ТекТакт = ПротоколРасчета.ТекТакт + 1;
			
		КонецЦикла;
		
	Исключение
		ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьВыполнениеВсехПотоков();
	КонецПопытки;
	
	ЗаписатьПротоколРасчетаВЖурналРегистрации(ПротоколРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПорядокРасчета

Функция ПараметрыДействия()

	ПараметрыДействия = Новый Структура;
	
	ПараметрыДействия.Вставить("Имя","");
	ПараметрыДействия.Вставить("ИмяПроцедуры","");
	
	ПараметрыДействия.Вставить("ОчередьЗаданий");
	
	ПараметрыДействия.Вставить("ПоляВыборки", "");
	ПараметрыДействия.Вставить("ПоляГруппировки", "");
	ПараметрыДействия.Вставить("ПараметрыОбработкиОшибок", Новый Структура("ТипОшибки,ПоляГруппировки",,""));
	
	ПараметрыДействия.Вставить("КоличествоПорций", 1);
	
	Возврат ПараметрыДействия;
	
КонецФункции

Процедура ДобавитьТекстЗапросаПорционнойВыборки(Действие, ПараметрыРасчета, ПорядокСтрока)
	
	Порядок = СтрРазделить(ПорядокСтрока, ",");
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ //ПЕРВЫЕ 10000
		|	&ПоляВыборки
		|ИЗ
		|	&ИмяРегистра КАК Таблица
		|ГДЕ
		|	Таблица.Очередь = &Очередь
		|	И &УсловиеПорционнойВыборки
		|//УПОРЯДОЧИТЬ #ПорционнаяВыборка
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистра", Действие.ОчередьЗаданий.ПолноеИмя());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", ПоляВыборки(Порядок));
	
	Если ПараметрыРасчета.ПорционнаяВыборка Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПЕРВЫЕ 10000", "ПЕРВЫЕ" + " " + Формат(ПараметрыРасчета.РазмерВыборки, "ЧН=0; ЧГ=0"));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УПОРЯДОЧИТЬ #ПорционнаяВыборка", "УПОРЯДОЧИТЬ ПО" + " " + ПоляУпорядочивания(Порядок));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПЕРВЫЕ 10000", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УПОРЯДОЧИТЬ #ПорционнаяВыборка", "");
	КонецЕсли;
	
	Действие.Вставить("ТекстЗапроса", ТекстЗапроса);
	
	Поля = Порядок;
	ИмяТаблицы = "Таблица";
	
	КоличествоПолей = Поля.Количество();
	
	Результат = Новый Массив();
	
	Шаблон1 = "%1.%2 %3 &%2";
	Шаблон2 = "(%1)";
	
	Пока КоличествоПолей > 0 Цикл
		
		Список = Новый Массив(КоличествоПолей);
		
		Граница = КоличествоПолей - 1;
		
		Для Индекс = 0 По Граница Цикл
			Если Индекс = Граница Тогда
				Список[Индекс] = СтрШаблон(Шаблон1, ИмяТаблицы, Поля[Индекс], ">");
			Иначе
				Список[Индекс] = СтрШаблон(Шаблон1, ИмяТаблицы, Поля[Индекс], "=");
			КонецЕсли;
		КонецЦикла;
		
		ТекстУсловия = СтрШаблон(Шаблон2, СтрСоединить(Список, " И "));
		Результат.Добавить(ТекстУсловия);
		
		КоличествоПолей = КоличествоПолей - 1;
		
	КонецЦикла;
	
	Действие.Вставить("УсловиеПорционнойВыборки", СтрСоединить(Результат, " ИЛИ "));
	
КонецПроцедуры

Функция ПоляВыборки(Поля, ИмяТаблицы = "Таблица")
	
	КоличествоПолей = Поля.Количество();
	
	Список = Новый Массив(КоличествоПолей);
	
	Шаблон = "%1.%2 КАК %2";
	
	Для Индекс = 0 По КоличествоПолей - 1 Цикл
		Список[Индекс] = СтрШаблон(Шаблон, ИмяТаблицы, Поля[Индекс]);
	КонецЦикла;
	
	Возврат СтрСоединить(Список, ",");
	
КонецФункции

Функция ПоляУпорядочивания(Поля, ИмяТаблицы = "Таблица")
	
	КоличествоПолей = Поля.Количество();
	
	Список = Новый Массив(КоличествоПолей);
	
	Шаблон = "%1.%2";
	
	Для Индекс = 0 По КоличествоПолей - 1 Цикл
		Список[Индекс] = СтрШаблон(Шаблон, ИмяТаблицы, Поля[Индекс]);
	КонецЦикла;
	
	Возврат СтрСоединить(Список, ",");
	
КонецФункции

Функция ВыбратьДанныеДляОбработки(ПараметрыРасчета, Очередь, ТекстЗапроса, УсловиеПорционнойВыборки, ПоследняяЗапись, ПродолжатьРасчет)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Очередь", Очередь);
	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Если ПараметрыРасчета.ПорционнаяВыборка И ПоследняяЗапись <> Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеПорционнойВыборки", УсловиеПорционнойВыборки);
		
		Для каждого КлючИЗначение Из ПоследняяЗапись Цикл
			Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
	Иначе
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеПорционнойВыборки", "ИСТИНА")
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Если ПараметрыРасчета.ПорционнаяВыборка Тогда
		
		Если ПараметрыРасчета.РазмерВыборки > Данные.Количество() Тогда
			
			ПродолжатьРасчет = Ложь;
			ПоследняяЗапись = Неопределено;
			
		Иначе
			
			ПродолжатьРасчет = Истина;
			
			ПоследняяСтрока = Данные[Данные.Количество()-1];
			
			Если ПоследняяЗапись = Неопределено Тогда
				
				ПоследняяЗапись = Новый Структура();
				
				Для каждого Колонка Из Данные.Колонки Цикл
					ПоследняяЗапись.Вставить(Колонка.Имя, ПоследняяСтрока[Колонка.Имя]);
				КонецЦикла;
				
			Иначе
				ЗаполнитьЗначенияСвойств(ПоследняяЗапись, ПоследняяСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ПоследняяЗапись = Неопределено;
		ПродолжатьРасчет = Ложь;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ВыбратьИзмененияИзОчередей(ГраницаРасчета, ПорядокРасчета, Действие, НомерОчереди)
	
	НомерОчереди = -1;
	Действие = Неопределено;
	ТекущийНомерОчереди = -1;
	
	Для Индекс = 0 По ПорядокРасчета.ВГраница() Цикл
		ТекущееДействие = ПорядокРасчета.Получить(Индекс);
		ТекущийНомерОчереди = ТекущееДействие.ОчередьЗаданий.ВыбратьИзменения(ГраницаРасчета);
		Если ТекущийНомерОчереди >= 0 И (НомерОчереди = -1 Или НомерОчереди > ТекущийНомерОчереди) Тогда
			Действие = ТекущееДействие;
			НомерОчереди = ТекущийНомерОчереди;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерОчереди >= 0;
	
КонецФункции

Процедура ДополнитьТаблицуИдентификаторомДляГруппировки(Задания)
	
	ИспользуютсяАналоги = ПолучитьФункциональнуюОпцию("ИспользоватьАналогиМатериалов");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("Задания", Задания);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Склад КАК Склад,
	|	Товары.Назначение КАК Назначение,
	|	&ПустойИдентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ТаблицаЗаданий
	|ИЗ
	|	&Задания КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика";
	Запрос.Выполнить();
	
	Если ИспользуютсяАналоги Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение,
		|	ЕСТЬNULL(СвязиНоменклатурыПоРазрешениямНаЗамену.Идентификатор, ЕСТЬNULL(КэшКлючей.Идентификатор, &ПустойИдентификатор)) КАК Идентификатор
		|ПОМЕСТИТЬ ТаблицаЗаданийСКлючами
		|ИЗ
		|	ТаблицаЗаданий КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиНоменклатурыПоРазрешениямНаЗамену КАК СвязиНоменклатурыПоРазрешениямНаЗамену
		|		ПО Таблица.Номенклатура = СвязиНоменклатурыПоРазрешениямНаЗамену.Номенклатура
		|			И Таблица.Характеристика = СвязиНоменклатурыПоРазрешениямНаЗамену.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КэшИдентификаторовСвязейНоменклатурыПоРазрешениямНаЗамену КАК КэшКлючей
		|		ПО Таблица.Номенклатура = КэшКлючей.Номенклатура
		|			И Таблица.Характеристика = КэшКлючей.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Порции.Номенклатура КАК Номенклатура,
		|	Порции.Характеристика КАК Характеристика
		|ИЗ
		|	ТаблицаЗаданийСКлючами КАК Порции
		|ГДЕ
		|	Порции.Идентификатор = &ПустойИдентификатор";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Порции.Номенклатура        КАК Номенклатура,
		|	Порции.Характеристика      КАК Характеристика
		|ИЗ
		|	ТаблицаЗаданий КАК Порции
		|;";
	
	КонецЕсли;
	
	ТаблицаКлючей = Запрос.Выполнить().Выгрузить();
	ТаблицаКлючей.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));

	Для каждого НайденнаяСтрока Из ТаблицаКлючей Цикл
		НайденнаяСтрока.Идентификатор = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	ПоместитьТаблицуЗначенийВоВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц, "КлючиПоНоменклатуре", ТаблицаКлючей,,, "Номенклатура,Характеристика");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Склад КАК Склад,
	|	Таблица.Назначение КАК Назначение,
	|	ЕСТЬNULL(КлючиПоНоменклатуре.Идентификатор, Таблица.Идентификатор) КАК Идентификатор
	|ИЗ
	|	ТаблицаЗаданий КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиПоНоменклатуре КАК КлючиПоНоменклатуре
	|		ПО Таблица.Номенклатура = КлючиПоНоменклатуре.Номенклатура
	|			И Таблица.Характеристика = КлючиПоНоменклатуре.Характеристика";
	
	Если ИспользуютсяАналоги Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗаданий", "ТаблицаЗаданийСКлючами");
	
	КонецЕсли;
	
	Задания = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Функция ПроцедураРаспределенияЗапасов()

	Возврат "СтруктураЗаказа.ВыполнитьРаспределениеЗапасов";

КонецФункции 

#КонецОбласти

#Область Разузлование

Процедура ВыполнитьРазузлование(ПараметрыДействия, АдресРезультата) Экспорт
	
	КлючеваяОперация = "СтруктураЗаказа.Разузлование";
	НачалоРасчета = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РазмерПорции = ПараметрыДействия.ПорцияРасчета.Количество();
	ЗамерВремени = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(КлючеваяОперация);
	ВыполнитьРазузлованиеВнутриЗамераВремени(ПараметрыДействия);
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ЗамерВремени, РазмерПорции);
	РезультатРасчета = Новый Структура("Операция, РазмерПорции, Длительность", КлючеваяОперация, РазмерПорции, ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоРасчета);
	ПоместитьВоВременноеХранилище(РезультатРасчета, АдресРезультата);
	
КонецПроцедуры

Процедура ВыполнитьРазузлованиеВнутриЗамераВремени(ПараметрыДействия)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыРасчета = ПараметрыДействия.ПараметрыРасчета;
	
	ИспользуетсяГрафикПроизводства = УправлениеПроизводством.ИспользуетсяГрафикПроизводства();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Очередь", ПараметрыДействия.Очередь);
	Запрос.УстановитьПараметр("ПорцияРасчета", ПорцияРасчетаГруппыИзделий(ПараметрыДействия.ПорцияРасчета));
	Запрос.УстановитьПараметр("РассчитыватьИзменения", ПараметрыРасчета.РассчитыватьИзменения);
	Запрос.УстановитьПараметр("РазрешитьПовтИспРассчитанныхДанных", ПараметрыРасчета.РазрешитьПовтИспРассчитанныхДанных);
	Запрос.УстановитьПараметр("ПустаяСпецификация", Справочники.РесурсныеСпецификации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеНазначение", Справочники.Назначения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойЭтап", Справочники.ЭтапыПроизводства.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Запрос.УстановитьПараметр("ИспользуетсяГрафикПроизводства", ИспользуетсяГрафикПроизводства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|
	|	КэшНСИ.ГруппаИзделий КАК ГруппаИзделий,
	|
	|	Движения.Номенклатура        КАК Номенклатура,
	|	Движения.Характеристика      КАК Характеристика,
	|	Движения.Склад               КАК Склад,
	|	Движения.Назначение          КАК Назначение,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КлючНоменклатура    КАК КлючНоменклатура,
	|
	|	КэшНСИ.Спецификация КАК Спецификация,
	|
	|	НЕ МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЭтоПолуфабрикат,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|			  И Движения.ГруппаИзделий = КэшНСИ.ГруппаИзделий
	|			ТОГДА Движения.КлючПартия
	|		ИНАЧЕ &ПустойКлючСвязи
	|	КОНЕЦ) КАК КлючПартия,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.КлючПартия
	|		ИНАЧЕ &ПустойКлючСвязи
	|	КОНЕЦ) КАК КлючПартияРодитель,
	|
	|	ISNULL(МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.Уровень
	|	КОНЕЦ), 0) КАК УровеньРодитель,
	|
	|	ISNULL(МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.ДлительностьДоВыпуска
	|	КОНЕЦ), 0) КАК ДлительностьДоВыпускаРодитель,
	|
	|	ISNULL(МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.ИдентификаторВГруппеИзделий
	|	КОНЕЦ), """") КАК ИдентификаторВГруппеИзделийРодитель,
	|	
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|			ТОГДА Движения.Спецификация
	|		ИНАЧЕ &ПустаяСпецификация
	|	КОНЕЦ) КАК СпецификацияВыпуска,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|			ТОГДА Движения.ИдентификаторВерсииДанных
	|		ИНАЧЕ &ПустойКлючСвязи
	|	КОНЕЦ) КАК ИдентификаторВерсииДанных,
	|	
	|	МАКСИМУМ(Движения.НазначениеСтруктуры) КАК НазначениеСтруктуры,
	|
	|	ВЫБОР
	|		КОГДА СУММА(Движения.Заказано
	|					+ Движения.КОбеспечению
	|					- Движения.Заменено
	|					- Движения.РаспределеноИзЗапасов
	|					- Движения.РаспределеноИзЗапасовОбособленно
	|					- Движения.РаспределеноИзПартий
	|					- Движения.РаспределеноИзПартийОбособленно) > 0
	|		ТОГДА СУММА(Движения.Заказано
	|					+ Движения.КОбеспечению
	|					- Движения.Заменено
	|					- Движения.РаспределеноИзЗапасов
	|					- Движения.РаспределеноИзЗапасовОбособленно
	|					- Движения.РаспределеноИзПартий
	|					- Движения.РаспределеноИзПартийОбособленно)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Требуется
	|
	|ПОМЕСТИТЬ Дельта
	|ИЗ
	|
	|	РегистрСведений.СтруктураЗаказа КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ
	|		ПО КэшНСИ.Номенклатура        = Движения.Номенклатура
	|		 И КэшНСИ.Характеристика      = Движения.Характеристика
	|		 И КэшНСИ.Склад               = Движения.Склад
	|		 И КэшНСИ.Назначение          = Движения.Назначение
	|		 И КэшНСИ.ЗаказНаПроизводство = Движения.ЗаказНаПроизводство
	|
	|ГДЕ
	|	КэшНСИ.ГруппаИзделий В (&ПорцияРасчета)
	|	И (НЕ КэшНСИ.ЭтоРазбираемоеИзделие
	|			ИЛИ НЕ Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)) // ограничение зацикливания разборки
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Номенклатура, Движения.Характеристика, Движения.Склад, Движения.Назначение,
	|	Движения.ЗаказНаПроизводство, Движения.КлючНоменклатура, КэшНСИ.ГруппаИзделий, КэшНСИ.Спецификация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Движения.Заказано + Движения.КОбеспечению) <> 0 ИЛИ СУММА(Движения.Запланировано) <> 0
	|;
	|
	|ВЫБРАТЬ
	|
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДД.ГруппаИзделий       КАК ГруппаИзделий,
	|	ДД.Спецификация        КАК Спецификация,
	|	ДД.КлючПартия          КАК КлючПартия,
	|
	|	МАКСИМУМ(ДД.КлючНоменклатура) КАК КлючНоменклатура,
	|	МАКСИМУМ(ДД.ИдентификаторВГруппеИзделий) КАК ИдентификаторВГруппеИзделий,
	|
	|	ISNULL(МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Запущено))
	|			ТОГДА ИСТИНА
	|	КОНЕЦ), ЛОЖЬ) КАК Запущена
	|
	|ПОМЕСТИТЬ Партии
	|ИЗ
	|	РегистрСведений.СтруктураЗаказа КАК ДД
	|
	|ГДЕ
	|	ДД.ГруппаИзделий В (&ПорцияРасчета)
	|		И ДД.ВидСтроки В (
	|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Запущено))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.ГруппаИзделий, ДД.ЗаказНаПроизводство, ДД.Спецификация, ДД.КлючПартия
	|
	|ИНДЕКСИРОВАТЬ
	|	ПО НАБОРАМ ((ГруппаИзделий,Запущена,ИдентификаторВГруппеИзделий), (КлючПартия,Запущена))
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|
	|	Партии.ГруппаИзделий КАК ГруппаИзделий
	|
	|ПОМЕСТИТЬ ГруппыСОшибками
	|ИЗ
	|	Партии КАК Партии
	|
	|ГДЕ
	|	ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрСведений.ПротоколРасчетаСтруктурыЗаказа КАК ДД
	|		ГДЕ
	|			ДД.ИдентификаторОшибки = Партии.КлючПартия)
	|
	|ИНДЕКСИРОВАТЬ
	|	ПО ГруппаИзделий
	|;
	|
	|ВЫБРАТЬ
	|	
	|	АвтоНомерЗаписи() КАК ИндексСтроки,
	|
	|	Изделия.ГруппаИзделий КАК ГруппаИзделий,
	|	
	|	Изделия.Номенклатура        КАК Номенклатура,
	|	Изделия.Характеристика      КАК Характеристика,
	|	Изделия.Склад               КАК Склад,
	|	Изделия.Назначение          КАК Назначение,
	|	Изделия.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Изделия.КлючНоменклатура    КАК КлючНоменклатура,
	|	Изделия.КлючПартия          КАК КлючПартия,
	|	Изделия.Требуется           КАК Требуется,
	|	
	|	Изделия.Спецификация КАК Спецификация,
	|	Изделия.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|
	|	Изделия.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА НЕ (Изделия.Спецификация.ЕстьПараметризацияРесурсов
	|				ИЛИ Изделия.Спецификация.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.СписокНоменклатуры)
	|				ИЛИ НЕ Изделия.Спецификация.ВыпускПроизвольнымиПорциями
	|				ИЛИ Изделия.Спецификация.ЕстьНекратныеНормативыВРЦ
	|				ИЛИ Изделия.Спецификация.МинимальнаяПартияВыпуска > 0)
	//++ Устарело_Переработка24
	|			  И Изделия.ЗаказНаПроизводство.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	//-- Устарело_Переработка24
	|			  И Изделия.ЗаказНаПроизводство.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья2_5)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПовтИсп,
	|	Изделия.Спецификация.ТипПроизводственногоПроцесса КАК ТипПроцесса,
	|	ВЫБОР
	|		КОГДА Изделия.Спецификация.МинимальнаяПартияВыпуска > 0
	|			ИЛИ Изделия.Спецификация.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.СписокНоменклатуры)
	|			ИЛИ НЕ Изделия.Спецификация.ВыпускПроизвольнымиПорциями
	|				И НЕ (Изделия.Спецификация.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.Номенклатура)
	|					И Изделия.Спецификация.ОсновноеИзделиеКоличествоУпаковок = 1
	|					И Изделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МножественныйЗапуск,
	|	Изделия.Спецификация.ВыпускПроизвольнымиПорциями КАК ВыпускПроизвольнымиПорциями,
	|	Изделия.Спецификация.МинимальнаяПартияВыпуска КАК МинимальнаяПартияВыпуска,
	|	Изделия.Спецификация.ОптимальнаяПартияВыпуска КАК ОптимальнаяПартияВыпуска,
	|	Изделия.Спецификация.ДопустимоеПревышениеОптимальнойПартииВыпуска КАК ДопустимоеПревышениеОптимальнойПартииВыпуска,
	|	ВЫБОР
	|		КОГДА Изделия.Спецификация.ЕстьПараметризацияРесурсов
	|			 ИЛИ Изделия.Спецификация.ЕстьУточняемоеОсновноеИзделие
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПараметрическаяСпецификация,
	|	ВЫБОР
	|		КОГДА Изделия.ИдентификаторВерсииДанных <> &ПустойКлючСвязи
	|		ТОГДА Изделия.ИдентификаторВерсииДанных
	|		ИНАЧЕ Изделия.Спецификация.ИдентификаторВерсииДанных
	|	КОНЕЦ КАК ИдентификаторВерсииДанных,
	|	ВЫБОР 
	|		КОГДА ИСТИНА В (
	|				ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					ГруппыСОшибками КАК ДД
	|				ГДЕ
	|					ДД.ГруппаИзделий = Изделия.ГруппаИзделий)
	|			ТОГДА ИСТИНА
	|		КОГДА ИСТИНА В (
	|				ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации КАК ДД
	|				ГДЕ
	|					ДД.ПолныйРасчет
	|					И ДД.Очередь = &Очередь
	|					И ДД.Спецификация = Изделия.Спецификация
	|					И ДД.ЗаказНаПроизводство = Изделия.ЗаказНаПроизводство)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолныйРасчет,
	|
	|	&ТекстПоляНазначениеСтруктуры КАК НазначениеСтруктуры,
	|	&ТекстПоляНазначениеСвободногоВыпуска КАК НазначениеСвободногоВыпуска,
	|
	|	Изделия.ЗаказНаПроизводство.Подразделение           КАК ПодразделениеДиспетчер,
	|	Изделия.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Изделия.ЗаказНаПроизводство.НачатьНеРанее           КАК НачалоПроизводства,
	|	ВЫБОР
	|		КОГДА Изделия.ЗаказНаПроизводство.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья2_5)
	|			ТОГДА ИСТИНА
	//++ Устарело_Переработка24
	|		КОГДА Изделия.ЗаказНаПроизводство.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
	|			ТОГДА ИСТИНА
	//-- Устарело_Переработка24
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                               КАК ПроизводствоИзДавальческогоСырья,
	|
	|	Изделия.УровеньРодитель КАК УровеньРодитель,
	|	Изделия.КлючПартияРодитель КАК КлючПартияРодитель,
	|	Изделия.ДлительностьДоВыпускаРодитель КАК ДлительностьДоВыпускаРодитель,
	|	Изделия.ИдентификаторВГруппеИзделийРодитель КАК ИдентификаторВГруппеИзделийРодитель
	|
	|ПОМЕСТИТЬ Изделия
	|ИЗ
	|	Дельта КАК Изделия
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|
	|	Изделия.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных
	|
	|ПОМЕСТИТЬ ИзделияПовтИсп
	|ИЗ
	|	Изделия КАК Изделия
	|
	|ГДЕ
	|	&РазрешитьПовтИспРассчитанныхДанных
	|	И Изделия.ПовтИсп
	|	И НЕ Изделия.ПолныйРасчет
	|	И Изделия.ИдентификаторВерсииДанных <> &ПустойКлючСвязи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторВерсииДанных
	|;
	|
	|ВЫБРАТЬ
	|
	|	Движения.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных,
	|	МАКСИМУМ(Движения.КлючПартия) КАК КлючПартия
	|
	|ПОМЕСТИТЬ КэшДанных
	|ИЗ
	|
	|	ИзделияПовтИсп КАК Изделия
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Движения
	|	ПО Изделия.ИдентификаторВерсииДанных = Движения.ИдентификаторВерсииДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.ИдентификаторВерсииДанных
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючПартия, ИдентификаторВерсииДанных
	|;
	|
	|ВЫБРАТЬ // КЭШ данных (движения номенклатуры)
	|
	|	Движения.Спецификация КАК Спецификация,
	|	Движения.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных,
	|
	|	ВЫБОР
	|		КОГДА Движения.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА ""МатериалыИУслуги""
	|		КОГДА Движения.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|									ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|									ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|			ТОГДА ""Изделия""
	|		КОГДА Движения.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск))
	|			ТОГДА ""СвободныйВыпуск""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИмяТЧ,
	|
	|	Движения.Номенклатура   КАК Номенклатура,
	|	Движения.Характеристика КАК Характеристика,
	|	Движения.Склад          КАК Склад,
	|
	|	ВЫБОР
	|		КОГДА Движения.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Обособленно,
	|	ВЫБОР
	|		КОГДА Движения.КОбеспечению <> 0 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|		КОГДА Движения.НеОбеспечивать <> 0 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ПустаяСсылка)
	|	КОНЕЦ КАК ВариантОбеспечения,
	|
	|	Движения.Подразделение КАК Подразделение,
	|	Движения.Этап КАК Этап,
	|
	|	Движения.СпецификацияПолуфабриката КАК СпецификацияПолуфабриката,
	|	Движения.КлючСвязиСтрокаСпецификации КАК КлючСвязиСтрокаСпецификации,
	|	Движения.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|	Движения.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|	Движения.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|	Движения.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Движения.РазрешениеНаЗамену КАК РазрешениеНаЗамену
	|
	|ИЗ
	|	КэшДанных КАК Кэш
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Движения
	|	ПО Кэш.КлючПартия          = Движения.КлючПартия
	|	 И Кэш.ИдентификаторВерсииДанных = Движения.ИдентификаторВерсииДанных
	|	 И НЕ Движения.ДополнительнаяЗапись
	|;
	|
	|ВЫБРАТЬ // КЭШ данных (трудозатраты)
	|
	|	Движения.Спецификация КАК Спецификация,
	|	Движения.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных,
	|
	|	Движения.ВидРабот КАК ВидРабот,
	|
	|	Движения.Подразделение КАК Подразделение,
	|	Движения.Этап КАК Этап,
	|	
	|	Движения.КлючСвязиСтрокаСпецификации КАК КлючСвязиСтрокаСпецификации,
	|	Движения.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|	Движения.СтатьяКалькуляции КАК СтатьяКалькуляции
	|
	|ИЗ
	|	КэшДанных КАК Кэш
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудозатратыСтруктурыЗаказа КАК Движения
	|	ПО Кэш.КлючПартия          = Движения.КлючПартия
	|	 И Кэш.ИдентификаторВерсииДанных = Движения.ИдентификаторВерсииДанных
	|	 И НЕ Движения.ДополнительнаяЗапись
	|;
	|
	|ВЫБРАТЬ // движения до изменения (движения номенклатуры)
	|
	|	Движения.Номенклатура        КАК Номенклатура,
	|	Движения.Характеристика      КАК Характеристика,
	|	Движения.Склад               КАК Склад,
	|	Движения.Назначение          КАК Назначение,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КлючНоменклатура    КАК КлючНоменклатура,
	|	Движения.КлючПартия          КАК КлючПартия,
	|	Движения.ВидСтроки           КАК ВидСтроки,
	|	Движения.ЗаказНаПоступление  КАК ЗаказНаПоступление,
	|	Движения.ДатаПоступления     КАК ДатаПоступления,
	|
	|	-Движения.КОбеспечению КАК КОбеспечению,
	|	-Движения.НеОбеспечивать КАК НеОбеспечивать,
	|	-Движения.Запланировано КАК Запланировано,
	|	-Движения.РазборкаЗапланировано КАК РазборкаЗапланировано,
	|
	|	Движения.Уровень                          КАК Уровень,
	|	Движения.ДополнительнаяЗапись             КАК ДополнительнаяЗапись,
	|	Движения.Подразделение                    КАК Подразделение,
	|	Движения.Этап                             КАК Этап,
	|	Движения.Спецификация                     КАК Спецификация,
	|	Движения.ИдентификаторВерсииДанных        КАК ИдентификаторВерсииДанных,
	|	Движения.КлючСвязиСтрокаСпецификации      КАК КлючСвязиСтрокаСпецификации,
	|	Движения.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|	Движения.НазначениеСтруктуры              КАК НазначениеСтруктуры,
	|	Движения.СпецификацияПолуфабриката        КАК СпецификацияПолуфабриката,
	|	Движения.ДлительностьДоВыпуска            КАК ДлительностьДоВыпуска,
	|	Движения.ИдентификаторВГруппеИзделий      КАК ИдентификаторВГруппеИзделий,
	|	Движения.ГруппаИзделий                    КАК ГруппаИзделий,
	|	Движения.СтатьяКалькуляции                КАК СтатьяКалькуляции,
	|	Движения.РазрешениеНаЗамену               КАК РазрешениеНаЗамену
	|
	|ИЗ
	|	Партии КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Движения
	|	ПО Партии.КлючПартия = Движения.КлючПартия
	|	 И НЕ Партии.Запущена
	|
	|ГДЕ
	|	(&РассчитыватьИзменения
	|		И Движения.ВидСтроки <> ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Зарезервировано)
	|	ИЛИ Движения.ВидСтроки В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск)))
	|	И (Движения.РазрешениеНаЗамену = ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ // движения до изменения (трудозатраты)
	|
	|	Движения.ВидРабот            КАК ВидРабот,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КлючВидРабот        КАК КлючВидРабот,
	|	Движения.КлючПартия          КАК КлючПартия,
	|
	|	-Движения.Количество КАК Количество,
	|
	|	Движения.ДополнительнаяЗапись             КАК ДополнительнаяЗапись,
	|	Движения.Подразделение                    КАК Подразделение,
	|	Движения.Этап                             КАК Этап,
	|	Движения.Спецификация                     КАК Спецификация,
	|	Движения.ИдентификаторВерсииДанных              КАК ИдентификаторВерсииДанных,
	|	Движения.КлючСвязиСтрокаСпецификации      КАК КлючСвязиСтрокаСпецификации,
	|	Движения.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|	Движения.СтатьяКалькуляции                КАК СтатьяКалькуляции
	|
	|ИЗ
	|	Партии КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудозатратыСтруктурыЗаказа КАК Движения
	|	ПО Партии.КлючПартия = Движения.КлючПартия
	|	 И НЕ Партии.Запущена
	|
	|ГДЕ
	|	&РассчитыватьИзменения
	|;
	|
	|ВЫБРАТЬ // данные по номенклатуры (НСИ)
	|
	|	Изделия.ИндексСтроки                                  КАК Идентификатор,
	|	Изделия.Спецификация                                  КАК Спецификация,
	|	Изделия.Номенклатура                                  КАК Номенклатура,
	|	Изделия.Характеристика                                КАК Характеристика,
	|	Изделия.Требуется                                     КАК Количество,
	|
	|	Изделия.ПодразделениеДиспетчер                        КАК ПодразделениеДиспетчер,
	|	Изделия.НаправлениеДеятельности                       КАК НаправлениеДеятельности,
	|	Изделия.НачалоПроизводства                            КАК НачалоПроизводства
	|
	|ИЗ
	|	Изделия КАК Изделия
	|
	|ГДЕ
	|	(Изделия.ПолныйРасчет
	|		ИЛИ Не Изделия.ПовтИсп
	|		ИЛИ (Изделия.ИдентификаторВерсииДанных) НЕ
	|			 В (
	|				ВЫБРАТЬ
	|					Кэш.ИдентификаторВерсииДанных ИЗ КэшДанных
	|			КАК Кэш))
	|	И Изделия.Требуется <> 0
	|;
	|
	|ВЫБРАТЬ // график производства
	|
	|	Таблица.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Таблица.КлючПартия КАК КлючПартия
	|
	|ИЗ
	|	ПодстановкаЗаданияКРасчетуГрафика КАК Таблица
	|;
	|
	|ВЫБРАТЬ // все партии
	|
	|	Партии.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Партии.Спецификация        КАК Спецификация,
	|	Партии.ГруппаИзделий       КАК ГруппаИзделий,
	|	Партии.КлючПартия          КАК КлючПартия,
	|
	|	Партии.КлючНоменклатура КАК КлючНоменклатура, // основной ключ номенклатуры
	|	Партии.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|
	|	Партии.Запущена КАК Запущена,
	|	ВЫБОР 
	|		КОГДА Партии.Запущена
	|			ИЛИ ИСТИНА В (
	|				ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					Партии КАК ДД
	|				ГДЕ
	|					ДД.ГруппаИзделий = Партии.ГруппаИзделий
	|					И ДД.Запущена
	|					И ДД.ИдентификаторВГруппеИзделий = Партии.ИдентификаторВГруппеИзделий)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КлючИспользован,
	|
	|	ГруппыСОшибками.ГруппаИзделий ЕСТЬ НЕ NULL КАК БылиОшибки
	|
	|ИЗ
	|	Партии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыСОшибками КАК ГруппыСОшибками
	|		ПО Партии.ГруппаИзделий = ГруппыСОшибками.ГруппаИзделий
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаИзделий
	|;
	|
	|ВЫБРАТЬ // все изделия
	|
	|	Изделия.ИндексСтроки КАК ИндексСтроки,
	|
	|	Изделия.ГруппаИзделий КАК ГруппаИзделий,
	|	
	|	Изделия.Номенклатура        КАК Номенклатура,
	|	Изделия.Характеристика      КАК Характеристика,
	|	Изделия.Склад               КАК Склад,
	|	Изделия.Назначение          КАК Назначение,
	|	Изделия.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Изделия.КлючНоменклатура    КАК КлючНоменклатура,
	|	Изделия.КлючПартия          КАК КлючПартия,
	|	Изделия.Требуется           КАК Требуется,
	|
	|	Изделия.Спецификация КАК Спецификация,
	|
	|	Изделия.УровеньРодитель КАК УровеньРодитель,
	|	Изделия.КлючПартияРодитель КАК КлючПартияРодитель,
	|	Изделия.ДлительностьДоВыпускаРодитель КАК ДлительностьДоВыпускаРодитель,
	|	Изделия.ИдентификаторВГруппеИзделийРодитель КАК ИдентификаторВГруппеИзделийРодитель,
	|
	|	Изделия.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	Изделия.ПроизводствоИзДавальческогоСырья КАК ПроизводствоИзДавальческогоСырья,
	|	Изделия.НазначениеСтруктуры КАК НазначениеСтруктуры,
	|	Изделия.НазначениеСвободногоВыпуска КАК НазначениеСвободногоВыпуска,
	|	
	|	Изделия.ПовтИсп КАК ПовтИсп,
	|	Изделия.ТипПроцесса КАК ТипПроцесса,
	|	Изделия.ПараметрическаяСпецификация КАК ПараметрическаяСпецификация,
	|	Изделия.МножественныйЗапуск КАК МножественныйЗапуск,
	|	Изделия.ВыпускПроизвольнымиПорциями КАК ВыпускПроизвольнымиПорциями,
	|	Изделия.МинимальнаяПартияВыпуска КАК МинимальнаяПартияВыпуска,
	|	Изделия.ОптимальнаяПартияВыпуска КАК ОптимальнаяПартияВыпуска,
	|	Изделия.ДопустимоеПревышениеОптимальнойПартииВыпуска КАК ДопустимоеПревышение,
	|	Изделия.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных,
	|	Изделия.ПолныйРасчет КАК ПолныйРасчет,
	|
	|	ISNULL(ВЫБОР
	|		КОГДА Изделия.ПараметрическаяСпецификация И СпецификацииИзделий.Порядок <> 1
	|			ТОГДА ИСТИНА
	|		КОГДА СпецификацииИзделий.ПобочныйВыход
	|			ТОГДА ИСТИНА
	|	КОНЕЦ, ЛОЖЬ) КАК ПобочныйВыход,
	|
	|	ISNULL(СпецификацииИзделий.Порядок, 1) КАК Порядок,
	|	ISNULL(СпецификацииИзделий.КоличествоУпаковокНаЕдиницуПартииЗапуска, 1) * ISNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК КоличествоНаЕдиницуПартииЗапуска,  
	|	ISNULL(ВЫБОР
	|		КОГДА СпецификацииИзделий.КоличествоУпаковокОсновногоИзделияНаЕдиницуПартииЗапуска = 0
	|			ТОГДА 1
	|		ИНАЧЕ СпецификацииИзделий.КоличествоУпаковокОсновногоИзделияНаЕдиницуПартииЗапуска 
	|	КОНЕЦ, 1) * ISNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска
	|ИЗ
	|	Изделия КАК Изделия
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииИзделий КАК СпецификацииИзделий
	|	ПО Изделия.Спецификация = СпецификацииИзделий.Спецификация
	|	 И СпецификацииИзделий.ВидНоменклатуры = Изделия.ВидНоменклатуры
	|	 И СпецификацииИзделий.Номенклатура   В (Изделия.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	 И СпецификацииИзделий.Характеристика В (Изделия.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|
	|ГДЕ
	|	Изделия.Требуется > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаИзделий
	|;
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляНазначениеСтруктуры", СтруктураЗаказаПроведениеДокументов.ТекстПоляНазначениеМатериалов("Изделия.ЗаказНаПроизводство", "Изделия.НазначениеСтруктуры"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляНазначениеСвободногоВыпуска", СтруктураЗаказаПроведениеДокументов.ТекстПоляНазначениеСвободногоВыпуска("Изделия.ЗаказНаПроизводство"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки("СпецификацииИзделий.Упаковка", "Изделия.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки("СпецификацииИзделий.УпаковкаОсновногоИзделия", "Изделия.Номенклатура"));
	
	Если ИспользуетсяГрафикПроизводства Тогда
		ПодстановкаЗаданияКРасчетуГрафика =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Изделия.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	&ПустойКлючСвязи КАК КлючПартия
		|ИЗ
		|	Изделия КАК Изделия
		|ГДЕ
		|	Изделия.Требуется > 0
		|		И ИСТИНА НЕ В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК Таблица
		|			ГДЕ
		|				Таблица.ЗаказНаПроизводство = Изделия.ЗаказНаПроизводство
		|				И Таблица.СтатусГрафика = 0)";
	Иначе
		ПодстановкаЗаданияКРасчетуГрафика = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Изделия.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	ВЫБОР
		|		КОГДА ИСТИНА НЕ В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.НормативныйГрафикСтруктурыЗаказа КАК Таблица
		|			ГДЕ
		|				Таблица.ЗаказНаПроизводство = Изделия.ЗаказНаПроизводство)
		|			ТОГДА &ПустойКлючСвязи
		|		ИНАЧЕ ISNULL(Партии.КлючПартия, Изделия.КлючПартияРодитель)
		|	КОНЕЦ КАК КлючПартия
		|ИЗ
		|	Изделия КАК Изделия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Партии КАК Партии
		|		ПО Изделия.ГруппаИзделий = Партии.ГруппаИзделий
		|		 И НЕ Партии.Запущена
		|ГДЕ
		|	ИСТИНА НЕ В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			РегистрСведений.ПротоколРасчетаСтруктурыЗаказа КАК Таблица
		|		ГДЕ
		|			Таблица.ЗаказНаПроизводство = Изделия.ЗаказНаПроизводство
		|			И Таблица.ТипОшибки = ЗНАЧЕНИЕ(Перечисление.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство.ОшибкаРасчетаНормативногоГрафика))";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПодстановкаЗаданияКРасчетуГрафика", "(" + ПодстановкаЗаданияКРасчетуГрафика + ")");
		
	Хранилище = Хранилище();

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоПакетов = РезультатЗапроса.Количество();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();

#Область КэшДанных
	
	КэшДанных = Новый Структура();
	КэшДанных.Вставить("СтруктураЗаказа", РезультатЗапроса[КоличествоПакетов-8].Выгрузить());
	КэшДанных.СтруктураЗаказа.Индексы.Добавить("Спецификация,ИдентификаторВерсииДанных");
	КэшДанных.Вставить("Трудозатраты", РезультатЗапроса[КоличествоПакетов-7].Выгрузить());
	КэшДанных.Трудозатраты.Индексы.Добавить("Спецификация,ИдентификаторВерсииДанных");
	
#КонецОбласти

#Область ДвиженияДоИзменения
	
	ЗагрузитьДвиженияВХранилище(Хранилище, "СтруктураЗаказа",             РезультатЗапроса[КоличествоПакетов-6].Выгрузить(),, Новый Структура("ДвиженияДоИзменения", Истина));
	ЗагрузитьДвиженияВХранилище(Хранилище, "ТрудозатратыСтруктурыЗаказа", РезультатЗапроса[КоличествоПакетов-5].Выгрузить(),, Новый Структура("ДвиженияДоИзменения", Истина));
	
#КонецОбласти

#Область НСИ
	
	Если РезультатЗапроса[КоличествоПакетов-4].Пустой() Тогда
		ДанныеСпецификаций = Новый Соответствие();
	Иначе
		ДанныеСпецификаций = Справочники.РесурсныеСпецификации.ДанныеСпецификации(РезультатЗапроса[КоличествоПакетов-4].Выгрузить(), ПараметрыВыборкиДанныхСпецификации());
	КонецЕсли;
	
#КонецОбласти

#Область ГрафикПроизводства

	// В нормативном графике задания регистрируются по упрощенной схеме, в боевом графике рассчитываются по изменениям.
	
	Если Не ИспользуетсяГрафикПроизводства Тогда
		РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.ДобавитьЗадания(РезультатЗапроса[КоличествоПакетов-3].Выгрузить());
	Иначе
		Если РезультатЗапроса[КоличествоПакетов-3].Пустой() Тогда
			ЗаданияКРасчетуГрафика = РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.СоздатьНаборЗаписей().ВыгрузитьКолонки("ЗаказНаПроизводство,КлючПартия");
			ЕстьЗаданияКРасчетуГрафикаПолныйРасчет = Ложь;
		Иначе
			ЗаданияКРасчетуГрафика = РезультатЗапроса[КоличествоПакетов-3].Выгрузить();
			ЕстьЗаданияКРасчетуГрафикаПолныйРасчет = Истина;
			ЗаданияКРасчетуГрафикаПолныйРасчет = ЗаданияКРасчетуГрафика.Скопировать();
			ЗаданияКРасчетуГрафикаПолныйРасчет.Свернуть("ЗаказНаПроизводство");
			ЗаданияКРасчетуГрафикаПолныйРасчет.Индексы.Добавить("ЗаказНаПроизводство");
		КонецЕсли;
		ЗаданияКОчисткеГрафика = ЗаданияКРасчетуГрафика.СкопироватьКолонки();
	КонецЕсли;
	
#КонецОбласти

#Область КлючиСвязи

	Параметры = Новый Структура;
	Параметры.Вставить("Строки", Новый Структура("ДополнительнаяЗапись", Ложь));
	Параметры.Вставить("Колонки", "КлючПартия,КлючНоменклатура,КлючСвязиСтрокаСпецификации");
	Параметры.Вставить("КолонкиПоЗначению");
	Параметры.Вставить("НовыеИменаКолонок", Новый Структура("КлючНоменклатура", "КлючСвязи"));
	
	КэшКлючиСвязи1 = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
		Хранилище.СтруктураЗаказа,
		Параметры.Строки,
		Параметры.Колонки,
		Параметры.КолонкиПоЗначению,
		Параметры.НовыеИменаКолонок);
	
	Параметры = Новый Структура;
	Параметры.Вставить("Строки", Новый Структура("ДополнительнаяЗапись", Ложь));
	Параметры.Вставить("Колонки", "КлючПартия,КлючВидРабот,КлючСвязиСтрокаСпецификации");
	Параметры.Вставить("КолонкиПоЗначению");
	Параметры.Вставить("НовыеИменаКолонок", Новый Структура("КлючВидРабот", "КлючСвязи"));
	
	КэшКлючиСвязи2 = ОбщегоНазначенияУТ.ВыгрузитьТаблицуЗначений(
		Хранилище.ТрудозатратыСтруктурыЗаказа,
		Параметры.Строки,
		Параметры.Колонки,
		Параметры.КолонкиПоЗначению,
		Параметры.НовыеИменаКолонок);
	
	СоединитьТаблицы(КэшКлючиСвязи1, КэшКлючиСвязи2);
	
	КлючиСвязи = Новый Структура("Кэш, Ключ", КэшКлючиСвязи1, Новый Структура("КлючПартия, КлючСвязиСтрокаСпецификации"));
	
	КэшКлючиСвязи1 = Неопределено;
	КэшКлючиСвязи2 = Неопределено;
	
	КлючиСвязи.Кэш.Индексы.Добавить("КлючПартия,КлючСвязиСтрокаСпецификации");

#КонецОбласти

	// партии до изменения
	ПартииДоИзменения = СкопироватьКолонки(РезультатЗапроса[КоличествоПакетов-2].Колонки);
	ПартииДоИзменения.Колонки.Добавить("ИдентификаторВГруппеИзделийКлючРодитель", ОбщегоНазначения.ОписаниеТипаСтрока(35)); // см. ОпределяемыеТипы.ИдентификаторВГруппеИзделийСтруктурыЗаказа
	МаксимальныйКодПартииВГруппеИзделий = Новый Соответствие;
	МаксКодПартииТек = 0;
	ГруппаИзделийТек = Неопределено;
	Выборка = РезультатЗапроса[КоличествоПакетов-2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторВГруппеИзделийКлючРодитель = ИзвлечьКлючРодителяИзИдентификатора(Выборка.ИдентификаторВГруппеИзделий);
		МаксКодПартии = ИзвлечьКодПартииИзИдентификатора(Выборка.ИдентификаторВГруппеИзделий);
		Если ГруппаИзделийТек <> Выборка.ГруппаИзделий Или МаксКодПартии > МаксКодПартииТек Тогда
			МаксимальныйКодПартииВГруппеИзделий[Выборка.ГруппаИзделий] = МаксКодПартии;
			МаксКодПартииТек = МаксКодПартии;
			ГруппаИзделийТек = Выборка.ГруппаИзделий
		КонецЕсли;
		Если Не Выборка.Запущена Тогда // подлежит перепланированию (динамическая партия)
			Партия = ПартииДоИзменения.Добавить();
			ЗаполнитьЗначенияСвойств(Партия, Выборка);
			Партия.ИдентификаторВГруппеИзделийКлючРодитель = ИдентификаторВГруппеИзделийКлючРодитель;
		КонецЕсли;
	КонецЦикла;
	ПартииДоИзменения.Индексы.Добавить("ГруппаИзделий, ИдентификаторВГруппеИзделийКлючРодитель");
	КэшПартияКлючПоиска = Новый Структура("ГруппаИзделий, ИдентификаторВГруппеИзделийКлючРодитель");
	КэшПартия = Неопределено;
	
	ВсеПартииНовые = НЕ ПартииДоИзменения.Количество() > 0;
	БылиОшибки = Ложь;

	// текущие партии
	Партии = СкопироватьКолонки(ПартииДоИзменения.Колонки,, "КлючНоменклатура");
	Партии.Колонки.Добавить("РазмерПартии", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой))); // в единице основного изделия
	Партии.Колонки.Добавить("НоваяПартия", Новый ОписаниеТипов("Булево"));
	Партии.Колонки.Добавить("РассчитыватьИзменения", Новый ОписаниеТипов("Булево"));
	Партии.Колонки.Добавить("Действует", Новый ОписаниеТипов("Булево"));
	Партии.Колонки.Добавить("ПроизводствоИзДавальческогоСырья", Новый ОписаниеТипов("Булево"));
	Партии.Колонки.Добавить("Протокол");
	ПартииГруппы = Партии.СкопироватьКолонки();
	ПартииГруппы.Колонки.Добавить("Строки", Новый ОписаниеТипов("Массив"));
	ПартииГруппы.Колонки.Добавить("КорректировкаСтрок");
	ПартииГруппы.Колонки.Добавить("Остаток"); // число или массив чисел
	
	ПартияСтруктура = Новый Структура("КлючПартия");
	ПустойКлючСвязи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Изделия = РезультатЗапроса[КоличествоПакетов-1].Выгрузить();
	ИзделияГруппы = СкопироватьКолонки(Изделия.Колонки, "Порядок,Требуется,ПобочныйВыход,ДлительностьДоВыпускаРодитель,ИдентификаторВГруппеИзделийРодитель");
	ИзделияГруппы.Колонки.Добавить("ПоляГруппировки", Новый ОписаниеТипов("Строка"));
	ИзделияГруппы.Колонки.Добавить("Изделие");
	
	ВсегоИзделий = Изделия.Количество();
	Индекс = 0;
	
	Пока ВсегоИзделий > Индекс Цикл
		
		Изделие = Изделия[Индекс];

		ГруппаИзделий = Изделие.ГруппаИзделий;
		МаксимальныйНомерПартии = ЗначениеИзСоответствия(МаксимальныйКодПартииВГруппеИзделий, ГруппаИзделий, 0);
		
		Если Не
			(Изделие.МножественныйЗапуск Или Изделие.ОптимальнаяПартияВыпуска > 0 Или Изделие.ПобочныйВыход) Тогда
			
			Пока ВсегоИзделий > Индекс И ГруппаИзделий = Изделия[Индекс].ГруппаИзделий Цикл
				Изделие = Изделия[Индекс];
				
				Партия = ПартииГруппы.Добавить();
				ЗаполнитьЗначенияСвойств(Партия, Изделие, "ЗаказНаПроизводство,ГруппаИзделий,Спецификация" + ", ПроизводствоИзДавальческогоСырья");
				Партия.РазмерПартии = Изделие.Требуется;
				Партия.Строки.Добавить(Изделие);
				
				ИдентификаторВГруппеИзделийКлючРодитель = ИзвлечьКлючПартииИзИдентификатора(Изделие.ИдентификаторВГруппеИзделийРодитель); // идентификатор родителя
				Если Не ВсеПартииНовые
					И НайтиВКэшеКлючПартии(ПартииДоИзменения, ИдентификаторВГруппеИзделийКлючРодитель, Изделие.ГруппаИзделий, Изделие, КэшПартияКлючПоиска, КэшПартия) Тогда
					ЗаполнитьЗначенияСвойств(Партия, КэшПартия, "КлючПартия,ИдентификаторВГруппеИзделий");
				Иначе
					МаксимальныйНомерПартии = МаксимальныйНомерПартии + 1;
					Партия.КлючПартия = Новый УникальныйИдентификатор();
					Партия.НоваяПартия = Истина;
					Партия.ИдентификаторВГруппеИзделий = ИдентификаторПартииВГруппеИзделий(
						Изделие.ГруппаИзделий,
						ИдентификаторВГруппеИзделийКлючРодитель,
						Изделие.УровеньРодитель,
						МаксимальныйНомерПартии);
				КонецЕсли;
				
				Индекс = Индекс + 1;
			КонецЦикла;
			
		Иначе
			
			ВыпускПроизвольнымиПорциями = Изделие.ВыпускПроизвольнымиПорциями;
			КоэффициентПересчетаПартииЗапуска = ?(ВыпускПроизвольнымиПорциями, 1, Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска);
			ОптимальныйВыпуск = Окр(Изделие.ОптимальнаяПартияВыпуска * КоэффициентПересчетаПартииЗапуска, 3);
			МинимальныйВыпуск = Окр(Изделие.МинимальнаяПартияВыпуска * КоэффициентПересчетаПартииЗапуска, 3);
			ДопустимоеПревышение = Окр(Изделие.ДопустимоеПревышение * КоэффициентПересчетаПартииЗапуска, 3);
			ДельтаМинимумОптимум = Изделие.ОптимальнаяПартияВыпуска - Изделие.МинимальнаяПартияВыпуска;
			
			МаксПорядок = Изделие.Порядок;
			ЕстьРазныйПорядок = Ложь;
			ЕстьОграничениеДоступности = Ложь; 
			
			Пока ВсегоИзделий > Индекс И ГруппаИзделий = Изделия[Индекс].ГруппаИзделий Цикл
				
				Изделие = Изделия[Индекс];
				
				ИзделиеГруппы = ИзделияГруппы.Добавить();
				ЗаполнитьЗначенияСвойств(ИзделиеГруппы, Изделие, "Порядок,Требуется,ПобочныйВыход,ДлительностьДоВыпускаРодитель,ИдентификаторВГруппеИзделийРодитель");
				ИзделиеГруппы.Изделие = Изделие;
				
				Если Не Изделие.ПобочныйВыход Тогда
					Если Не Изделие.МножественныйЗапуск Тогда
						ИзделиеГруппы.ПоляГруппировки = "" + Изделие.КлючНоменклатура;
					Иначе
						
						Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
						
						Если Изделие.МножественныйЗапуск Тогда
							Хеш.Добавить("" + Изделие.ГруппаИзделий);
							Хеш.Добавить("" + Изделие.КлючПартияРодитель);
							Хеш.Добавить("" + Изделие.ДлительностьДоВыпускаРодитель);
						КонецЕсли;
						
						Если Не Изделие.НазначениеСтруктуры.Пустая() Тогда
							Хеш.Добавить("" + Изделие.НазначениеСтруктуры.УникальныйИдентификатор()); 
							ЕстьОграничениеДоступности = Истина;
						КонецЕсли;
						
						Если Изделие.ПараметрическаяСпецификация Тогда
							Хеш.Добавить("" + Изделие.Номенклатура.УникальныйИдентификатор());
							Хеш.Добавить("" + Изделие.Характеристика.УникальныйИдентификатор());
							ЕстьОграничениеДоступности = Истина;
						КонецЕсли;
						
						ИзделиеГруппы.ПоляГруппировки = Хеш.ХешСумма;
					КонецЕсли;
					
				КонецЕсли;
				
				Если МаксПорядок <> Изделие.Порядок Тогда
					МаксПорядок = Макс(МаксПорядок, Изделие.Порядок);
					ЕстьРазныйПорядок = Истина;
				КонецЕсли;
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
			ПоляСортировки = "ДлительностьДоВыпускаРодитель УБЫВ, ПобочныйВыход, ИдентификаторВГруппеИзделийРодитель, ПоляГруппировки, Порядок, Требуется УБЫВ";
			ИзделияГруппы.Сортировать(ПоляСортировки, Новый СравнениеЗначений());

			ГраницаИзделияГруппы = ИзделияГруппы.Количество() - 1;
			ТактРасчетаРазмераПартии = Истина;
			i = 0; // курсор для поиска остатка в партиях
			X = 0; // итератор обхода изделий
			Y = 0; // итератор расчета состава партий (правая граница)
			ГраницаИзделийПредыдущая = 0;
			ГраницаПартийТекущая = -1;
			ПоляГруппировки = Неопределено;
			ЕстьОшибки = Ложь;
			
			ТекущееИзделие = Неопределено; // основное изделие партии
			ТекущийПорядок = -1;
			ПредыдующийРазмерПартии = 0;
			РазмерПартии = 0;
			КоличествоИзделия = 0;
			
			Пока ГраницаИзделияГруппы >= X Цикл
				
				ИзделиеГруппы = ИзделияГруппы[X];
				
				Если ЕстьРазныйПорядок И ТекущийПорядок <> ИзделиеГруппы.Порядок Или ЕстьОграничениеДоступности И (МинимальныйВыпуск > 0 Или Не ВыпускПроизвольнымиПорциями) Тогда
					// обходим все партии, если состав изделий разрозненный или есть остаток в партиях, но не из всех партий можно брать остатки
					i = 0;
				КонецЕсли;
				
				Пока ГраницаПартийТекущая >= i И ИзделиеГруппы.Требуется > 0 Цикл // учет остатка в партиях 
					
					Изделие = ИзделиеГруппы.Изделие;
					Партия = ПартииГруппы[i];
					
					Если Партия.КлючПартия <> ПустойКлючСвязи Тогда // партия инициализирована
						Если ЕстьОграничениеДоступности
							И (НЕ Изделие.ПобочныйВыход И Изделие.НазначениеСтруктуры <> Партия.Строки[0].НазначениеСтруктуры
								ИЛИ Изделие.ПараметрическаяСпецификация 
									И Изделие.Порядок = 1 
									И (Изделие.Номенклатура <> Партия.Строки[0].Номенклатура
											ИЛИ Изделие.Характеристика <> Партия.Строки[0].Характеристика)) Тогда
							ОстатокПартии = 0;
						Иначе
							Если Не ЕстьРазныйПорядок Тогда 
								ОстатокПартии = Партия.Остаток;
							Иначе
								ОстатокПартии = Партия.Остаток[ИзделиеГруппы.Порядок - 1];
								Если ОстатокПартии = Неопределено Тогда
									ОстатокПартии = ?(Изделие.Порядок > 1, Партия.РазмерПартии * Изделие.КоличествоНаЕдиницуПартииЗапуска / Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска, Партия.РазмерПартии);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					Иначе
						ЗаполнитьЗначенияСвойств(Партия, Изделие, "ЗаказНаПроизводство,ГруппаИзделий,Спецификация" + ",ПроизводствоИзДавальческогоСырья");
						ИдентификаторВГруппеИзделийКлючРодитель = ИзвлечьКлючПартииИзИдентификатора(Изделие.ИдентификаторВГруппеИзделийРодитель); // идентификатор родителя
						Если Не ВсеПартииНовые
							И НайтиВКэшеКлючПартии(ПартииДоИзменения, ИдентификаторВГруппеИзделийКлючРодитель, Изделие.ГруппаИзделий, Изделие, КэшПартияКлючПоиска, КэшПартия) Тогда
							ЗаполнитьЗначенияСвойств(Партия, КэшПартия, "КлючПартия,ИдентификаторВГруппеИзделий");
						Иначе
							МаксимальныйНомерПартии = МаксимальныйНомерПартии + 1;
							Партия.КлючПартия = Новый УникальныйИдентификатор();
							Партия.НоваяПартия = Истина;
							Партия.ИдентификаторВГруппеИзделий = ИдентификаторПартииВГруппеИзделий(
								Изделие.ГруппаИзделий,
								ИдентификаторВГруппеИзделийКлючРодитель,
								Изделие.УровеньРодитель,
								МаксимальныйНомерПартии);
						КонецЕсли;
						ОстатокПартии = ?(Изделие.Порядок > 1, Партия.РазмерПартии * Изделие.КоличествоНаЕдиницуПартииЗапуска / Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска, Партия.РазмерПартии);
						Если ЕстьРазныйПорядок Тогда
							Партия.Остаток = Новый Массив(МаксПорядок);
						КонецЕсли;
					КонецЕсли;
					
					Распределено = Мин(ОстатокПартии, ИзделиеГруппы.Требуется);
					Если Распределено > 0 Тогда
						
						Партия.Строки.Добавить(Изделие);
						
						Если Распределено <> Изделие.Требуется Тогда 
							Партия.КорректировкаСтрок = ?(Партия.КорректировкаСтрок = Неопределено, Новый Соответствие(), Партия.КорректировкаСтрок);
							Партия.КорректировкаСтрок.Вставить(Изделие.КлючНоменклатура, Изделие.Требуется - Распределено);
						КонецЕсли;
						
						ИзделиеГруппы.Требуется = ИзделиеГруппы.Требуется - Распределено;  
						ОстатокПартии = ОстатокПартии - Распределено;
					
						Если ЕстьРазныйПорядок Тогда
							Партия.Остаток[ИзделиеГруппы.Порядок-1] = ОстатокПартии;
						Иначе
							Партия.Остаток = ОстатокПартии;
						КонецЕсли;
						
					КонецЕсли;
					
					Если ОстатокПартии = 0 Тогда
						i = i + 1;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТактРасчетаРазмераПартии Тогда
					
					ГруппировкаРавна = (ПоляГруппировки = ИзделиеГруппы.ПоляГруппировки 
						Или ПоляГруппировки = Неопределено);
					Если ГруппировкаРавна Тогда // расчет размера партий
						Если ТекущееИзделие = Неопределено Тогда
							ТекущееИзделие = ИзделиеГруппы.Изделие;
							ТекущийПорядок = ИзделиеГруппы.Порядок;
						КонецЕсли;
						// побочный выход не участвует в расчете размера партий
						Если Не ИзделиеГруппы.Изделие.ПобочныйВыход Тогда
						 	Если ТекущийПорядок = ИзделиеГруппы.Порядок Тогда 
								КоличествоИзделия = КоличествоИзделия + ИзделиеГруппы.Требуется;
							Иначе
								РазмерПартии = ?(ТекущееИзделие.Порядок > 1, КоличествоИзделия * ТекущееИзделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска / ТекущееИзделие.КоличествоНаЕдиницуПартииЗапуска, КоличествоИзделия);
								ПредыдующийРазмерПартии = Макс(РазмерПартии, ПредыдующийРазмерПартии);
								ТекущееИзделие = ИзделиеГруппы.Изделие;
								ТекущийПорядок = ИзделиеГруппы.Порядок;
								КоличествоИзделия = ИзделиеГруппы.Требуется;
							КонецЕсли;
						КонецЕсли;
						X = X + 1;
						Y = X;
					КонецЕсли;
					Если Не ГруппировкаРавна Или X > ГраницаИзделияГруппы Тогда // формирование партий
						
						РазмерПартии = ?(ТекущееИзделие.Порядок > 1, КоличествоИзделия * ТекущееИзделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска / ТекущееИзделие.КоличествоНаЕдиницуПартииЗапуска, КоличествоИзделия);
						РазмерПартии = Макс(РазмерПартии, ПредыдующийРазмерПартии);

						ТактРасчетаРазмераПартии = Ложь;
						X = ГраницаИзделийПредыдущая;
						ГраницаПартийПредыдущая = ГраницаПартийТекущая;
						
						Если Не ВыпускПроизвольнымиПорциями Тогда
							// округление до целых партий
							КоличествоПорций = РазмерПартии / КоэффициентПересчетаПартииЗапуска;
							Если Цел(КоличествоПорций) <> КоличествоПорций Тогда
								РазмерПартии = (Цел(КоличествоПорций) + 1) * КоэффициентПересчетаПартииЗапуска;
							КонецЕсли;
						КонецЕсли;
						
						Если РазмерПартии > 0 Тогда
							Если ОптимальныйВыпуск > 0 Тогда 
								
								Пока РазмерПартии >= ОптимальныйВыпуск Цикл
									ПартииГруппы.Добавить().РазмерПартии = ОптимальныйВыпуск;
									РазмерПартии = РазмерПартии - ОптимальныйВыпуск; 
									ГраницаПартийТекущая = ГраницаПартийТекущая + 1;
								КонецЦикла;
								
								КоличествоПартий = (ГраницаПартийТекущая - ГраницаПартийПредыдущая);
								
								// если можем покрыть остаток за счет допустимого превышения
								Если РазмерПартии <= КоличествоПартий * ДопустимоеПревышение Тогда
									
									Для Сч = -ГраницаПартийТекущая По -(ГраницаПартийПредыдущая + 1) Цикл
										Если РазмерПартии <= 0 Тогда
											Прервать;
										КонецЕсли;
										ПартииГруппы[-Сч].РазмерПартии = ПартииГруппы[-Сч].РазмерПартии + Мин(ДопустимоеПревышение, РазмерПартии);
										РазмерПартии = РазмерПартии - Мин(ДопустимоеПревышение, РазмерПартии);
									КонецЦикла;
									
								// если можем покрыть остаток за счет сокращения оптимальных партий до минимальных
								Иначе  
								
									Для Сч = -ГраницаПартийТекущая По -(ГраницаПартийПредыдущая + 1) Цикл
										Если РазмерПартии >= МинимальныйВыпуск Тогда
											Прервать;
										КонецЕсли;
										ПартииГруппы[-Сч].РазмерПартии = ПартииГруппы[-Сч].РазмерПартии - Мин(ДельтаМинимумОптимум, МинимальныйВыпуск - РазмерПартии);
										РазмерПартии = РазмерПартии + Мин(ДельтаМинимумОптимум, МинимальныйВыпуск - РазмерПартии);
									КонецЦикла;
									
									ПартииГруппы.Добавить().РазмерПартии = Макс(РазмерПартии, МинимальныйВыпуск);
									ГраницаПартийТекущая = ГраницаПартийТекущая + 1;

								КонецЕсли;
								
							Иначе
								
								ПартииГруппы.Добавить().РазмерПартии = Макс(РазмерПартии, МинимальныйВыпуск);
								ГраницаПартийТекущая = ГраницаПартийТекущая + 1;
								
							КонецЕсли;
						КонецЕсли;
						
						i = ГраницаПартийПредыдущая + 1;
						
						ТекущееИзделие = Неопределено;
						ТекущийПорядок = -1;
						ПредыдующийРазмерПартии = 0;
						РазмерПартии =  0;
						КоличествоИзделия = 0;
						
					КонецЕсли;
					ПоляГруппировки = ИзделиеГруппы.ПоляГруппировки;
					
				Иначе
					Если ИзделиеГруппы.Требуется > 0 Тогда
						ЕстьОшибки = Истина;
					КонецЕсли;
					X = X + 1;
					Если Y = X Тогда
						ТактРасчетаРазмераПартии = Истина;
						ГраницаИзделийПредыдущая = Y;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьОшибки Тогда
				
				Если ГраницаПартийТекущая = -1 Тогда // в заказе только побочные изделия
					
					Партия = ПартииГруппы.Добавить();
					ЗаполнитьЗначенияСвойств(Партия, Изделие, "ЗаказНаПроизводство,ГруппаИзделий,Спецификация, КлючПартия");
					
					Для каждого Строка Из ИзделияГруппы Цикл
						Партия.Строки.Добавить(Строка.Изделие);
					КонецЦикла;
					
					Если Партия.КлючПартия = ПустойКлючСвязи Тогда
						Партия.НоваяПартия = Истина;
						Партия.КлючПартия = Новый УникальныйИдентификатор();
					КонецЕсли;
					
				КонецЕсли;
				
				Партия = ПартииГруппы[0];
				
				Для каждого Строка Из ИзделияГруппы Цикл
					
					Если Строка.Требуется = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Партия.БылиОшибки = Истина;
					ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Строка.Изделие.Номенклатура, Строка.Изделие.Характеристика,,,Строка.Изделие.Назначение);
					Шаблон = НСтр("ru = 'Не удалось запланировать изделие ""%1"" в количестве %2 %3 по спецификации %4 ""%5"".';
									|en = 'Cannot schedule the ""%1"" finished product in the amount of %2 %3 under the %4 ""%5"" BOM.'");
					ТекстСообщения = СтрШаблон(Шаблон,
						ПредставлениеНоменклатуры, Строка.Требуется, Строка.Изделие.Номенклатура.ЕдиницаИзмерения, Строка.Изделие.Спецификация.Код, Строка.Изделие.Спецификация.Наименование);
					ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
					ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Партия.ЗаказНаПроизводство,
						ТекстСообщения);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ИзделияГруппы.Очистить();
			
		КонецЕсли;
		
		Для каждого Партия Из ПартииГруппы Цикл
			
			Если Партия.Строки.Количество() > 0
				И ПроверитьЗацикливаниеРазузлованияСтруктурыЗаказа(Партия, Партия.Строки, ПараметрыРасчета) Тогда
				Партия.РазмерПартии = 0; // блокируем расчет
			КонецЕсли;
			
			ЗаполнитьДвиженияПоРезультатуРазузлования(Хранилище, Партия, Партия.Строки, КэшДанных, ДанныеСпецификаций, КлючиСвязи);
			
			Партия.Действует             = Партия.РазмерПартии > 0 Или Партия.Строки.Количество() > 0;
			Партия.РассчитыватьИзменения = Партия.Действует И НЕ Партия.НоваяПартия И НЕ Изделие.ПолныйРасчет И НЕ Партия.БылиОшибки И ПараметрыРасчета.РассчитыватьИзменения;
			
			ЗаполнитьЗначенияСвойств(Партии.Добавить(), Партия);
			
			Если ИспользуетсяГрафикПроизводства
				И Партия.Действует
				И (Не ЕстьЗаданияКРасчетуГрафикаПолныйРасчет
					ИЛИ ЗаданияКРасчетуГрафикаПолныйРасчет.Найти(Партия.ЗаказНаПроизводство, "ЗаказНаПроизводство") = Неопределено) Тогда
				ЗаполнитьЗначенияСвойств(ЗаданияКРасчетуГрафика.Добавить(), Партия);
			КонецЕсли;
			
			БылиОшибки = БылиОшибки Или Партия.БылиОшибки;
			
		КонецЦикла;
		
		КэшПартийГруппыИзделий = Неопределено;
		ПартииГруппы.Очистить();
		
	КонецЦикла;
	
	Изделия.Очистить();
	КлючиСвязи = Неопределено;
	
	// в ИБ после расчета могут остаться "старые" ключи партий, по ним нужно "затереть" данные
	
	Если Не
		ВсеПартииНовые Тогда
		
		Партии.Индексы.Добавить("КлючПартия");
		
		Для каждого ПартияДоИзменения Из ПартииДоИзменения Цикл
			
			БылиОшибки = БылиОшибки Или ПартияДоИзменения.БылиОшибки;
			
			Партия = Партии.Найти(ПартияДоИзменения.КлючПартия, "КлючПартия");
			
			Если Не Партия = Неопределено Тогда
				Партия.БылиОшибки = Партия.БылиОшибки Или ПартияДоИзменения.БылиОшибки; 
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Партии.Добавить(), ПартияДоИзменения);
			
			Если ИспользуетсяГрафикПроизводства Тогда
				ЗаполнитьЗначенияСвойств(ЗаданияКОчисткеГрафика.Добавить(), ПартияДоИзменения);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	МаксимальныйКодПартииВГруппеИзделий = Неопределено;
	ПартииДоИзменения = Неопределено;
	
	// расчет "дельты" для записи изменений по спецификациям "повт.исп = ложь" (в режиме "дополнение")
	
	Если ВсеПартииНовые Тогда
		
		ВсегоСтрок = 0;
		
		Для каждого Данные Из Хранилище Цикл
			
			Таблица = Данные.Значение; // ТаблицаЗначений
			
			Таблица.Колонки.Добавить("НомерПорции", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
			Таблица.Индексы.Добавить("КлючПартия");
			
			ВсегоСтрок = Макс(ВсегоСтрок, Таблица.Количество());
			
		КонецЦикла;
		
	Иначе
		
		НайденныеПартии = Партии.НайтиСтроки(Новый Структура("РассчитыватьИзменения", Истина));
		
		ВсегоСтрок = 0;
		Для каждого Данные Из Хранилище Цикл
			
			Таблица = Данные.Значение; // ТаблицаЗначений
			
			Если НайденныеПартии.ВГраница() <> -1 Тогда
				
				ЗначенияЗаполнения = Новый Структура("РассчитыватьИзменения", Истина);
				
				ПараметрыОтбора = Новый Структура("КлючПартия");
				
				Таблица.Колонки.Добавить("РассчитыватьИзменения", Новый ОписаниеТипов("Булево"));
				Таблица.Индексы.Добавить("КлючПартия");
				
				Для каждого Партия Из НайденныеПартии Цикл
					ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Партия);
					ЗаполнитьКолонкиВТаблицеПоПараметрамОтбора(Таблица, ПараметрыОтбора, ЗначенияЗаполнения);
				КонецЦикла;
				
				Таблица.Индексы.Удалить(0);
				
				Если Данные.Ключ = "СтруктураЗаказа" Тогда
					РассчитатьИзмененияИДобавитьСторноДвиженияВТаблицуСтруктураЗаказа(Таблица);
				КонецЕсли;
				
				Если Данные.Ключ = "ТрудозатратыСтруктурыЗаказа" Тогда
					РассчитатьИзмененияИДобавитьСторноДвиженияВТаблицуТрудозатратыСтруктурыЗаказа(Таблица);
				КонецЕсли;
				
			КонецЕсли;
			
			Таблица.Колонки.Добавить("НомерПорции", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
			Таблица.Индексы.Добавить("КлючПартия");
			
			ВсегоСтрок = Макс(ВсегоСтрок, Таблица.Количество());
			
		КонецЦикла;
		
	КонецЕсли;
	
	Партии.Колонки.Добавить("НомерПорции", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
	
	// группировка партий в ПорцииЗаписи по порциям записи
	
	ПорцииЗаписи = ПорцииЗаписи();
	
	Если ВсеПартииНовые
		И КоличествоСтрокВНабореЗаписей() > ВсегоСтрок Тогда
		
		ПорцииЗаписи.Добавить().НомерПорции = 0;
		
	Иначе
	
		ВсегоПартий = Партии.Количество();
		
		КоличествоСтрок = 0;
		Контейнер = Новый Массив();
		
		Для X = 0 По ВсегоПартий - 1 Цикл
			
			Партия = Партии[X];
			
			ЗаполнитьЗначенияСвойств(ПартияСтруктура, Партия);
			
			Замещать = Не Партия.НоваяПартия И Не Партия.РассчитыватьИзменения;
			
			Для каждого Данные Из Хранилище Цикл
				Контейнер.Добавить(Данные.Значение.НайтиСтроки(ПартияСтруктура));
			КонецЦикла;
			
			КоличествоСтрок = Контейнер[0].Количество();
			
			ПорцияЗаписи = ПорцияЗаписи(ПорцииЗаписи, Замещать, Истина, КоличествоСтрок);
			
			Для каждого Коллекция Из Контейнер Цикл
				УстановитьНомерПорцииВКоллекцииДвижений(Коллекция, ПорцияЗаписи.НомерПорции);
			КонецЦикла;
			
			Партия.НомерПорции = ПорцияЗаписи.НомерПорции;
			
			Контейнер.Очистить();
			
			ПорцияЗаписи.КоличествоСтрок = ПорцияЗаписи.КоличествоСтрок + КоличествоСтрок;
			ПорцияЗаписи.Доступно = КоличествоСтрокВНабореЗаписей() > ПорцияЗаписи.КоличествоСтрок;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// расчет таблицы изменений для регистрации заданий к распределению запасов
	
	ПустаяГруппаИзделийСтруктура = Новый Структура("ГруппаИзделий", ПустаяГруппаИзделий()); // исключаем строки вида ПроизводствоПродукция, ПроизводствоПолуфабриката
	
	Если ВсеПартииНовые
		Или ПараметрыРасчета.РассчитыватьИзменения Тогда
		
		ИзменениеЗапасов = Хранилище.СтруктураЗаказа.Скопировать(ПустаяГруппаИзделийСтруктура, "НомерПорции," + "Номенклатура,Характеристика,Склад,Назначение" + ",ЗаказНаПроизводство"); // ТаблицаЗначений
		ИзменениеЗапасов.Свернуть("НомерПорции," + "Номенклатура,Характеристика,Склад,Назначение" + ",ЗаказНаПроизводство");
		ИзменениеЗапасов.Индексы.Добавить("НомерПорции");
		
	Иначе
		
		Измерения = РегистрыСведений.СтруктураЗаказа.СтруктураМетаданных().ИзмеренияСтрока;
		ИзменениеЗапасов = Хранилище.СтруктураЗаказа.Скопировать(ПустаяГруппаИзделийСтруктура, "НомерПорции," + Измерения + ",КОбеспечению,Запланировано"); // ТаблицаЗначений
		СвернутьТаблицуИУдалитьНулевыеСтроки(ИзменениеЗапасов, "НомерПорции," + Измерения, "КОбеспечению,Запланировано");
		ИзменениеЗапасов.Свернуть("НомерПорции," + "Номенклатура,Характеристика,Склад,Назначение" + ",ЗаказНаПроизводство");
		ИзменениеЗапасов.Индексы.Добавить("НомерПорции");
		
	КонецЕсли;
	
	// подготовка к записи ошибок расчета
	
	Если БылиОшибки Тогда
		
		КонтрольДублей = Новый Соответствие();
		ОшибкиПартий = РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.СоздатьНаборЗаписей().ВыгрузитьКолонки("ЗаказНаПроизводство,ИдентификаторОшибки");
		ОшибкиПартий.Колонки.Добавить("НомерПорции", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
		ОшибкиПартий.Колонки.Добавить("Протокол");
		ПартииСОшибками = Партии.НайтиСтроки(Новый Структура("БылиОшибки", Истина));
		
		Для каждого Партия Из ПартииСОшибками Цикл
			
			ТекстСообщения = "";
			
			Если ЗначениеЗаполнено(Партия.Протокол) Тогда // исключаем дубли
				КонтрольДублей_ГруппаИзделий = КонтрольДублей.Получить(Партия.ГруппаИзделий);
				Если КонтрольДублей_ГруппаИзделий = Неопределено Тогда
					КонтрольДублей_ГруппаИзделий = Новый Соответствие();
					КонтрольДублей.Вставить(Партия.ГруппаИзделий, КонтрольДублей_ГруппаИзделий);
				КонецЕсли;
				Для Каждого Сообщение Из Партия.Протокол Цикл
					Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
					Хеш.Добавить(Сообщение);
					Если КонтрольДублей_ГруппаИзделий[Хеш.ХешСумма] <> Истина Тогда
						ТекстСообщения = ?(ТекстСообщения = "", Сообщение, ТекстСообщения + ";" + Сообщение);
						КонтрольДублей_ГруппаИзделий.Вставить(Хеш.ХешСумма, Истина);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ТекстСообщения = "" И Партия.НоваяПартия Тогда // по "старым" партиям ошибки нужно очистить (БылиОшибки = Истина)
				Продолжить;
			КонецЕсли;
			
			Ошибка = ОшибкиПартий.Добавить();
			ЗаполнитьЗначенияСвойств(Ошибка, Партия, "ЗаказНаПроизводство,НомерПорции");
			Ошибка.ИдентификаторОшибки = Партия.КлючПартия;
			
			Если Не ТекстСообщения = "" Тогда
 				Протокол = РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.ПротоколМакет();
				Протокол.Данные = СтруктураПоПолям(Партия, "Спецификация, ЗаказНаПроизводство");
				Протокол.ТекстСообщения = ТекстСообщения;
				Ошибка.Протокол = Новый ХранилищеЗначения(Протокол, Новый СжатиеДанных(9)); // регистрация ошибок
			КонецЕсли;
			
		КонецЦикла;
		
		ОшибкиПартий.Индексы.Добавить("НомерПорции");

		ПартииСОшибками = Неопределено;
		КонтрольДублей = Неопределено;

	КонецЕсли;
	
	// подготовка движений к записи (удаление записей "до изменения", необходимых для контроля изменений на предыдущем шаге)
	
	Если Не
		ВсеПартииНовые Тогда
		
		Для каждого Данные Из Хранилище Цикл
			НайденныеСтроки = Данные.Значение.НайтиСтроки(Новый Структура("ДвиженияДоИзменения", Истина));
			УдалитьСтрокиИзТаблицы(Данные.Значение, НайденныеСтроки);
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Данные Из Хранилище Цикл
		Таблица = Данные.Значение; // ТаблицаЗначений
		Таблица.ЗагрузитьКолонку(Таблица.ВыгрузитьКолонку("КлючПартия"), "КлючНабор"); // отдельное измерение для записи движений
		Таблица.Индексы.Добавить("НомерПорции");
	КонецЦикла;
	
	Партии.Индексы.Добавить("НомерПорции");
	
	// запись результата разузлования
	
	Если ИспользуетсяГрафикПроизводства Тогда
		Если ЗаданияКОчисткеГрафика.Количество() > 0 Тогда
			РегистрыСведений.ГрафикЭтаповПроизводства2_2.ОчиститьГрафикИЗагрузкуПартии(ЗаданияКОчисткеГрафика);
			ЗаданияКОчисткеГрафика.Очистить();
		КонецЕсли;
		Если ЗаданияКРасчетуГрафика.Количество() > 0 Тогда
			РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.ДобавитьЗадания(ЗаданияКРасчетуГрафика);
			ЗаданияКРасчетуГрафика.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ВсегоПорций = ПорцииЗаписи.Количество();
	Индекс = 0;
	
	СчетчикОшибок = 1;
	
	Пока ВсегоПорций > Индекс Цикл
		
		ПорцияЗаписи = ПорцииЗаписи[Индекс];
		ПорцияЗаписиСтруктура = Новый Структура("НомерПорции", ПорцияЗаписи.НомерПорции);
		ИзмененныеСтроки = ИзменениеЗапасов.Скопировать(ПорцияЗаписиСтруктура);
		
		НачатьТранзакцию();
		Попытка
			
			Если Не ПорцияЗаписи.Замещать Тогда
				
				НаборЗаписей = РегистрыСведений.СтруктураЗаказа.СоздатьНаборЗаписей();
				НаборЗаписей.Загрузить(Хранилище.СтруктураЗаказа.Скопировать(ПорцияЗаписиСтруктура));
				НаборЗаписей.Записать(Ложь);
				
				НаборЗаписей = РегистрыСведений.ТрудозатратыСтруктурыЗаказа.СоздатьНаборЗаписей();
				НаборЗаписей.Загрузить(Хранилище.ТрудозатратыСтруктурыЗаказа.Скопировать(ПорцияЗаписиСтруктура));
				НаборЗаписей.Записать(Ложь);
				
			Иначе
				
				НайденныеПартии = Партии.НайтиСтроки(ПорцияЗаписиСтруктура);
				
				Для каждого Партия Из НайденныеПартии Цикл
					
					ЗаполнитьЗначенияСвойств(ПартияСтруктура, Партия);
					
					НаборЗаписей = РегистрыСведений.СтруктураЗаказа.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.КлючНабор.Установить(Партия.КлючПартия);
					Если Партия.Действует Тогда
						НаборЗаписей.Загрузить(Хранилище.СтруктураЗаказа.Скопировать(ПартияСтруктура));
					КонецЕсли;
					НаборЗаписей.Записать(Истина);
					
					НаборЗаписей = РегистрыСведений.ТрудозатратыСтруктурыЗаказа.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.КлючНабор.Установить(Партия.КлючПартия);
					Если Партия.Действует Тогда
						НаборЗаписей.Загрузить(Хранилище.ТрудозатратыСтруктурыЗаказа.Скопировать(ПартияСтруктура));
					КонецЕсли;
					НаборЗаписей.Записать(Истина);
					
				КонецЦикла;
				
			КонецЕсли;
			
			РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов.ДобавитьЗаданияВСледующуюОчередь(ИзмененныеСтроки, ПараметрыДействия.Очередь);
			
			Если БылиОшибки Тогда
				СтруктураОшибок = Новый Структура();
				СтруктураОшибок.Вставить("ТипОшибки", Перечисления.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство.ОшибкаЗаполненияДанныхСпецификации);
				СтруктураОшибок.Вставить("Ошибки", ОшибкиПартий.Скопировать(ПорцияЗаписиСтруктура));
				РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.ЗарегистрироватьОшибки(СтруктураОшибок);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Если СчетчикОшибок < КоличествоПопытокЗаписи() Тогда
				ЗаписатьНеудачнуюПопыткуЗаписиВЖурналРегистрации(СчетчикОшибок, ТекстОшибки);
				СчетчикОшибок = СчетчикОшибок + 1;
				Продолжить;
			КонецЕсли;
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
		Индекс = Индекс + 1;
		СчетчикОшибок = 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция Хранилище()
	
	Хранилище = Новый Структура(); // Хранилище движений
	
	Возврат Хранилище;
	
КонецФункции

Процедура ЗагрузитьДвиженияВХранилище(Хранилище, ИмяРегистра, Данные, ПривестиТипы = Истина, КолонкиПоЗначению = Неопределено)

	Если ПривестиТипы Тогда
	
		Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		Набор.Загрузить(Данные);
		Хранилище.Вставить(ИмяРегистра, Набор.Выгрузить());
		
	Иначе
		Хранилище.Вставить(ИмяРегистра, Данные);
	КонецЕсли;
	
	Таблица = Хранилище[ИмяРегистра]; // ТаблицаЗначений
	
	Если КолонкиПоЗначению <> Неопределено Тогда
		Для каждого Колонка Из КолонкиПоЗначению Цикл
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(Колонка.Значение));
			Таблица.Колонки.Добавить(Колонка.Ключ, Новый ОписаниеТипов(МассивТипов));
			Таблица.ЗаполнитьЗначения(Колонка.Значение, Колонка.Ключ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьЗацикливаниеРазузлованияСтруктурыЗаказа(Партия, Изделия, ПараметрыРасчета)
	
	ОписаниеЦикла = "";
	
	ЕстьОшибки = Ложь;
	
	Изделие = Изделия[0];
	Уровень = Изделие.УровеньРодитель + 1;

	Если Уровень > ПараметрыРасчета.МаксГлубинаРасчета Тогда
		ЕстьОшибки = Истина;
		Партия.БылиОшибки = Истина;
		Шаблон = НСтр("ru = 'Превышена максимальная глубина разузлования структуры заказа (%1)';
						|en = 'The maximum explosion depth of the order structure is exceeded (%1)'");
		ТекстСообщения = СтрШаблон(Шаблон, ПараметрыРасчета.МаксГлубинаРасчета);
		ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
		ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
			ТекстСообщения);
	КонецЕсли;
	
	Если Не ЕстьОшибки И Уровень > ПараметрыРасчета.ИскатьЦиклыПосле Тогда
		
		ЕстьОшибки = Ложь;
		
		СвязиСпецификаций = Новый Соответствие();
		
		Запрос = Новый Запрос();
		
		Запрос.УстановитьПараметр("ПустойКлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|
		|	КэшНСИ.Спецификация          КАК Спецификация,
		|	Движения.КлючНоменклатура    КАК КлючНоменклатура,
		|	Иерархия.Спецификация        КАК СпецификацияРодитель,
		|	Иерархия.КлючНоменклатура    КАК КлючНоменклатураРодитель,
		|	Иерархия.Номенклатура        КАК НоменклатураРодитель,
		|	Иерархия.Характеристика      КАК ХарактеристикаРодитель,
		|	Иерархия.Склад               КАК СкладРодитель,
		|	Иерархия.Назначение          КАК НазначениеРодитель,
		|	Иерархия.ЗаказНаПроизводство КАК ЗаказНаПроизводствоРодитель
		|ИЗ
		|	РегистрСведений.СтруктураЗаказа КАК Движения
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ
		|		ПО КэшНСИ.Номенклатура        = Движения.Номенклатура
		|		 И КэшНСИ.Характеристика      = Движения.Характеристика
		|		 И КэшНСИ.Склад               = Движения.Склад
		|		 И КэшНСИ.Назначение          = Движения.Назначение
		|		 И КэшНСИ.ЗаказНаПроизводство = Движения.ЗаказНаПроизводство
		|		 И Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
		|		 И Движения.Разделитель = &ПустойКлючСвязи
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Иерархия
		|		ПО Движения.КлючПартия = Иерархия.КлючПартия
		|		 И Иерархия.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
		|								 ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката))
		|		 И Иерархия.Разделитель = &ПустойКлючСвязи
		|
		|ГДЕ
		|	Движения.Номенклатура          = &Номенклатура
		|	И Движения.Характеристика      = &Характеристика
		|	И Движения.Склад               = &Склад
		|	И Движения.Назначение          = &Назначение
		|	И Движения.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|	И Движения.КлючНоменклатура    = &КлючНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|
		|	КэшНСИ1.Спецификация         КАК Спецификация,
		|	Движения.КлючНоменклатура    КАК КлючНоменклатура,
		|	КэшНСИ2.Спецификация         КАК СпецификацияРодитель,
		|	Иерархия.КлючНоменклатура    КАК КлючНоменклатураРодитель,
		|	Иерархия.Номенклатура        КАК НоменклатураРодитель,
		|	Иерархия.Характеристика      КАК ХарактеристикаРодитель,
		|	Иерархия.Склад               КАК СкладРодитель,
		|	Иерархия.Назначение          КАК НазначениеРодитель,
		|	Иерархия.ЗаказНаПроизводство КАК ЗаказНаПроизводствоРодитель
		|
		|ИЗ
		|	РегистрСведений.СтруктураЗаказа КАК Движения
		|	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ1
		|		ПО КэшНСИ1.Номенклатура        = Движения.Номенклатура
		|		 И КэшНСИ1.Характеристика      = Движения.Характеристика
		|		 И КэшНСИ1.Склад               = Движения.Склад
		|		 И КэшНСИ1.Назначение          = Движения.Назначение
		|		 И КэшНСИ1.ЗаказНаПроизводство = Движения.ЗаказНаПроизводство
		|		 И Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
		|		 И Движения.Разделитель = &ПустойКлючСвязи
		|	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Перемещение
		|		ПО Движения.КлючПартия = Перемещение.КлючПартия
		|		 И Перемещение.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение)
		|		 И Перемещение.Разделитель = &ПустойКлючСвязи
		|	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Иерархия
		|		ПО Перемещение.Номенклатура        = Иерархия.Номенклатура
		|		 И Перемещение.Характеристика      = Иерархия.Характеристика
		|		 И Перемещение.Назначение          = Иерархия.Назначение
		|		 И Перемещение.ЗаказНаПроизводство = Иерархия.ЗаказНаПроизводство
		|		 И Перемещение.КлючСвязиСтрокаСпецификации = Иерархия.КлючНоменклатура
		|		 И Иерархия.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
		|		 И Иерархия.Разделитель = &ПустойКлючСвязи
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ2
		|		ПО КэшНСИ2.Номенклатура        = Иерархия.Номенклатура
		|		 И КэшНСИ2.Характеристика      = Иерархия.Характеристика
		|		 И КэшНСИ2.Склад               = Иерархия.Склад
		|		 И КэшНСИ2.Назначение          = Иерархия.Назначение
		|		 И КэшНСИ2.ЗаказНаПроизводство = Иерархия.ЗаказНаПроизводство
		|		 И Иерархия.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
		|		 И Иерархия.Разделитель = &ПустойКлючСвязи
		|ГДЕ
		|	Движения.Номенклатура          = &Номенклатура
		|	И Движения.Характеристика      = &Характеристика
		|	И Движения.Склад               = &Склад
		|	И Движения.Назначение          = &Назначение
		|	И Движения.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|	И Движения.КлючНоменклатура    = &КлючНоменклатура
		|";
		Запрос.УстановитьПараметр("Номенклатура",        Изделие.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",      Изделие.Характеристика);
		Запрос.УстановитьПараметр("Склад",               Изделие.Склад);
		Запрос.УстановитьПараметр("Назначение",          Изделие.Назначение);
		Запрос.УстановитьПараметр("ЗаказНаПроизводство", Изделие.ЗаказНаПроизводство);
		Запрос.УстановитьПараметр("КлючНоменклатура",    Изделие.КлючНоменклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НайтиЦиклыВСвязяхСпецификаций(
				СвязиСпецификаций, Выборка.Спецификация, Выборка.СпецификацияРодитель, ОписаниеЦикла, ЕстьОшибки);
			
			Если ЕстьОшибки Тогда
				
				Партия.БылиОшибки = Истина;
				Шаблон = НСтр("ru = 'Обнаружено зацикливание спецификаций: %1 \%2 %3';
								|en = 'Bill of materials looping is found: %1 \%2 %3'");
				ТекстСообщения = СтрШаблон(Шаблон, ОписаниеЦикла, СокрЛП(Выборка.Спецификация.Код), СокрЛП(Выборка.Спецификация.Наименование));
				ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
				ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
					ТекстСообщения);
				Прервать;
				
			Иначе
				
				Связь = СвязиСпецификаций.Получить(Выборка.Спецификация);
				Если Связь = Неопределено Тогда
					СвязиСпецификаций.Вставить(
						Выборка.Спецификация,
						ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.СпецификацияРодитель));
				Иначе
					Если Связь.Найти(Выборка.СпецификацияРодитель) = Неопределено Тогда
						Связь.Добавить(Выборка.СпецификацияРодитель);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
				
			Запрос.УстановитьПараметр("Номенклатура",        Выборка.НоменклатураРодитель);
			Запрос.УстановитьПараметр("Характеристика",      Выборка.ХарактеристикаРодитель);
			Запрос.УстановитьПараметр("Склад",               Выборка.СкладРодитель);
			Запрос.УстановитьПараметр("Назначение",          Выборка.НазначениеРодитель);
			Запрос.УстановитьПараметр("ЗаказНаПроизводство", Выборка.ЗаказНаПроизводствоРодитель);
			Запрос.УстановитьПараметр("КлючНоменклатура",    Выборка.КлючНоменклатураРодитель);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЕстьОшибки;

КонецФункции

Процедура НайтиЦиклыВСвязяхСпецификаций(СвязиСпецификаций, Спецификация, СпецификацияРодитель, ОписаниеЦикла, Отказ)
	
	Если Спецификация = СпецификацияРодитель Тогда
		Отказ = Истина;
	Иначе
		
		Связь = СвязиСпецификаций.Получить(СпецификацияРодитель);
		
		Если Связь = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого Предшественник Из Связь Цикл
			
			Если Предшественник = Спецификация Тогда
				
				Отказ = Истина;
				ОписаниеЦикла = "" + СтрШаблон(НСтр("ru = '""%1 %2""';
													|en = '""%1 %2""'"), СокрЛП(Спецификация.Код), СокрЛП(Спецификация.Наименование));
			Иначе
				
				НайтиЦиклыВСвязяхСпецификаций(
					СвязиСпецификаций, Спецификация, Предшественник, ОписаниеЦикла, Отказ);
				
			КонецЕсли;
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		ОписаниеЦикла = ОписаниеЦикла + "\" + СтрШаблон(НСтр("ru = '""%1 %2""';
															|en = '""%1 %2""'"), СокрЛП(СпецификацияРодитель.Код), СокрЛП(СпецификацияРодитель.Наименование));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияПоРезультатуРазузлования(Хранилище, Партия, Изделия, КэшДанных, ДанныеСпецификаций, КлючиСвязи)
	
	ИдентификаторВГруппеИзделий = Партия.ИдентификаторВГруппеИзделий;
	
	Если Партия.РазмерПартии > 0 ИЛИ Партия.Строки.Количество() > 0 Тогда // см. ПроверитьЗацикливаниеРазузлованияСтруктурыЗаказа()
		
		Изделие = Изделия[0];
		Уровень = Изделие.УровеньРодитель + 1;

		Кэш = Неопределено;
		
		ПустоеНазначение = Справочники.Назначения.ПустаяСсылка();
		
	#Область Кэш
	
		Если Изделие.ПовтИсп И НЕ Изделие.ПолныйРасчет Тогда
			
			ПараметрыОтбора = Новый Структура("Спецификация, ИдентификаторВерсииДанных", Изделие.Спецификация, Изделие.ИдентификаторВерсииДанных);
			
			КэшДвижений = КэшДанных.СтруктураЗаказа.НайтиСтроки(ПараметрыОтбора);
			Если КэшДвижений.ВГраница() <> -1 Тогда
				
				Кэш = Новый Структура("Изделия,СвободныйВыпуск,МатериалыИУслуги", Новый Массив(), Новый Массив(), Новый Массив());
				
				Для каждого Строка Из КэшДвижений Цикл
					Кэш[Строка.ИмяТЧ].Добавить(Строка);
				КонецЦикла;
				
				Кэш.Вставить("Трудозатраты", КэшДанных.Трудозатраты.НайтиСтроки(ПараметрыОтбора));
			
				Если Кэш.Изделия.ВГраница() = -1 Тогда
					Кэш = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	#КонецОбласти
	
	Если Кэш <> Неопределено Тогда
	
	#Область Изделия
			
			ДвиженияНоменклатура = Хранилище.СтруктураЗаказа; // ТаблицаЗначений
		
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("Уровень",               Уровень);
			КолонкиПоЗначению.Вставить("КлючПартия",            Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("ГруппаИзделий",         Изделие.ГруппаИзделий);
			КолонкиПоЗначению.Вставить("Спецификация",          Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство",   Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("Этап",                  Кэш.Изделия[0].Этап);
			КолонкиПоЗначению.Вставить("Подразделение",         Кэш.Изделия[0].Подразделение);
			КолонкиПоЗначению.Вставить("ИдентификаторВГруппеИзделий", ИдентификаторВГруппеИзделий);
			КолонкиПоЗначению.Вставить("ДлительностьДоВыпуска", Изделие.ДлительностьДоВыпускаРодитель);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", Изделие.ИдентификаторВерсииДанных);
			
			Для каждого Строка Из Изделия Цикл
				
				НоваяСтрока = ДвиженияНоменклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Склад,Назначение,НазначениеСтруктуры");
				
				НоваяСтрока.КлючНоменклатура = Строка.КлючНоменклатура;

				Если НЕ
					Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка Тогда
					
					Если Строка.ЭтоПолуфабрикат Тогда
						НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката;
					Иначе
						НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(Партия.КорректировкаСтрок) Тогда
						НоваяСтрока.Запланировано = Строка.Требуется;
					Иначе
						НоваяСтрока.Запланировано = Строка.Требуется - ПривестиЗначение(ТипЧисло(), Партия.КорректировкаСтрок[Строка.КлючНоменклатура]);
					КонецЕсли;
					
				Иначе
					
					НоваяСтрока.РазборкаЗапланировано = Строка.Требуется;
					НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка;
					
				КонецЕсли;
				
				НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоНаЕдиницуПартииЗапуска;
				
			КонецЦикла;
			
			#КонецОбласти
	
	#Область СвободныйВыпуск_ПобочныйВыход
	
			ДвиженияНоменклатура = Хранилище.СтруктураЗаказа; // ТаблицаЗначений
	
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("Уровень",               Уровень);
			КолонкиПоЗначению.Вставить("КлючПартия",            Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("Спецификация",          Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство",   Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("ЗаказНаПоступление",    Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("НазначениеСтруктуры",   ПустоеНазначение);
			КолонкиПоЗначению.Вставить("Назначение",                ?(Партия.ПроизводствоИзДавальческогоСырья, Изделие.НазначениеСвободногоВыпуска, ПустоеНазначение));
			КолонкиПоЗначению.Вставить("ИдентификаторВГруппеИзделий", ИдентификаторВГруппеИзделий);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", Изделие.ИдентификаторВерсииДанных);
			
			Для каждого Строка Из Кэш.СвободныйВыпуск Цикл
				
				НоваяСтрока = ДвиженияНоменклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Склад,Этап,Подразделение,СтатьяКалькуляции");
				
				НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск;
				
				Если Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот
					И Строка.Обособленно Тогда
					НоваяСтрока.Назначение = Изделие.НазначениеСтруктуры;
				ИначеЕсли Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка
					И НЕ Изделие.Назначение.Пустая()
					И НЕ ЗначениеЗаполнено(Строка.СтатьяКалькуляции) Тогда // основное изделие
					НоваяСтрока.Назначение = Изделие.Назначение;
				КонецЕсли;
				
				НоваяСтрока.Запланировано = Партия.РазмерПартии * Строка.КоличествоНаЕдиницуПартииЗапуска / Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска;
				
				НоваяСтрока.ДлительностьДоВыпуска = Изделие.ДлительностьДоВыпускаРодитель + (Строка.ДлительностьДоВыпуска - Кэш.Изделия[0].ДлительностьДоВыпуска);
				НоваяСтрока.КлючСвязиСтрокаСпецификации = Строка.КлючСвязиСтрокаСпецификации;
				НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоНаЕдиницуПартииЗапуска;
				
				УстановитьКлючСвязиСтроки(НоваяСтрока, "СтруктураЗаказа", "КлючНоменклатура", КлючиСвязи); // "00000000-0000-0000-0000-000000000000"
				
			КонецЦикла;
	
	#КонецОбласти
	
	#Область Материалы
	
			ДвиженияНоменклатура = Хранилище.СтруктураЗаказа; // ТаблицаЗначений
			
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("Уровень",               Уровень);
			КолонкиПоЗначению.Вставить("КлючПартия",            Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("Спецификация",          Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство",   Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("Назначение",            ПустоеНазначение); // приведение типа по всем измерениям
			КолонкиПоЗначению.Вставить("НазначениеСтруктуры",   Изделие.НазначениеСтруктуры);
			КолонкиПоЗначению.Вставить("ИдентификаторВГруппеИзделий", ИдентификаторВГруппеИзделий);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", Изделие.ИдентификаторВерсииДанных);
			
			Для каждого Строка Из Кэш.МатериалыИУслуги Цикл
				
				НоваяСтрока = ДвиженияНоменклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Этап,Подразделение,СтатьяКалькуляции,РазрешениеНаЗамену");
				
				НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление;
				
				Если Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка
					И (Изделие.Номенклатура = НоваяСтрока.Номенклатура И Изделие.Характеристика = НоваяСтрока.Характеристика) Тогда
					НоваяСтрока.Склад = Изделие.Склад;
					НоваяСтрока.Назначение = Изделие.Назначение;
				Иначе
					
					НоваяСтрока.Склад = Строка.Склад;
					Если Строка.Обособленно Тогда
						НоваяСтрока.Назначение = Изделие.НазначениеСтруктуры;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда
					НоваяСтрока.НеОбеспечивать = Партия.РазмерПартии * Строка.КоличествоНаЕдиницуПартииЗапуска / Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска;
				Иначе
					НоваяСтрока.КОбеспечению = Партия.РазмерПартии * Строка.КоличествоНаЕдиницуПартииЗапуска / Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска;
				КонецЕсли;
				
				НоваяСтрока.СпецификацияПолуфабриката = Строка.СпецификацияПолуфабриката;
				НоваяСтрока.ДлительностьДоВыпуска = Изделие.ДлительностьДоВыпускаРодитель + (Строка.ДлительностьДоВыпуска - Кэш.Изделия[0].ДлительностьДоВыпуска);
				НоваяСтрока.КлючСвязиСтрокаСпецификации = Строка.КлючСвязиСтрокаСпецификации;
				НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоНаЕдиницуПартииЗапуска;
				
				УстановитьКлючСвязиСтроки(НоваяСтрока, "СтруктураЗаказа", "КлючНоменклатура", КлючиСвязи);
				
			КонецЦикла;
			
	#КонецОбласти
	
	#Область Трудозатраты
	
			ДвиженияТрудозатраты = Хранилище.ТрудозатратыСтруктурыЗаказа; // ТаблицаЗначений
	
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("КлючПартия",          Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("Спецификация",        Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство", Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", Изделие.ИдентификаторВерсииДанных);
			
			Для каждого Строка Из Кэш.Трудозатраты Цикл
			
				НоваяСтрока = ДвиженияТрудозатраты.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "ВидРабот,Этап,Подразделение,СтатьяКалькуляции");
				
				НоваяСтрока.Количество = Партия.РазмерПартии * Строка.КоличествоНаЕдиницуПартииЗапуска / Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска;
				
				НоваяСтрока.КлючСвязиСтрокаСпецификации = Строка.КлючСвязиСтрокаСпецификации;
				НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоНаЕдиницуПартииЗапуска;
				
				УстановитьКлючСвязиСтроки(НоваяСтрока, "ТрудозатратыСтруктурыЗаказа", "КлючВидРабот", КлючиСвязи);
				
			КонецЦикла;
			
	#КонецОбласти
	
		Иначе
			
			ДанныеСпецификации = ДанныеСпецификации(Изделие, Партия.РазмерПартии, ДанныеСпецификаций);
			
	#Область Изделия
		
			ДвиженияНоменклатура = Хранилище.СтруктураЗаказа; // ТаблицаЗначений
			
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("Уровень",               Уровень);
			КолонкиПоЗначению.Вставить("КлючПартия",            Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("ГруппаИзделий",         Изделие.ГруппаИзделий);
			КолонкиПоЗначению.Вставить("Спецификация",          Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство",   Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("Этап",                  ДанныеСпецификации.ОсновноеИзделие.Этап);
			КолонкиПоЗначению.Вставить("Подразделение",         ДанныеСпецификации.ОсновноеИзделие.ПодразделениеЭтапа);
			КолонкиПоЗначению.Вставить("ИдентификаторВГруппеИзделий", ИдентификаторВГруппеИзделий);
			КолонкиПоЗначению.Вставить("ДлительностьДоВыпуска", Изделие.ДлительностьДоВыпускаРодитель);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", ?(Партия.ПроизводствоИзДавальческогоСырья, "", ДанныеСпецификации.ИдентификаторВерсииДанных));
			
			Для каждого Строка Из Изделия Цикл
				
				НоваяСтрока = ДвиженияНоменклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Склад,Назначение,НазначениеСтруктуры");
				
				НоваяСтрока.КлючНоменклатура = Строка.КлючНоменклатура;
				
				Если НЕ
					Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка Тогда
					
					Если Строка.ЭтоПолуфабрикат Тогда
						НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката;
					Иначе
						НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(Партия.КорректировкаСтрок) Тогда
						НоваяСтрока.Запланировано = Строка.Требуется;
					Иначе
						НоваяСтрока.Запланировано = Строка.Требуется - ПривестиЗначение(ТипЧисло(), Партия.КорректировкаСтрок[Строка.КлючНоменклатура]);
					КонецЕсли;
					
				Иначе
					
					НоваяСтрока.РазборкаЗапланировано = Строка.Требуется;
					НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка;
					
				КонецЕсли;
				
				НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоНаЕдиницуПартииЗапуска;
				
			КонецЦикла;
			
	#КонецОбласти
	
	#Область СвободныйВыпуск_ПобочныйВыход
	
			ДвиженияНоменклатура = Хранилище.СтруктураЗаказа; // ТаблицаЗначений
		
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("Уровень",               Уровень);
			КолонкиПоЗначению.Вставить("КлючПартия",            Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("Спецификация",          Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство",   Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("ЗаказНаПоступление",    Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("НазначениеСтруктуры",   ПустоеНазначение);
			КолонкиПоЗначению.Вставить("Назначение",                ?(Партия.ПроизводствоИзДавальческогоСырья, Изделие.НазначениеСвободногоВыпуска, ПустоеНазначение));
			КолонкиПоЗначению.Вставить("ИдентификаторВГруппеИзделий", ИдентификаторВГруппеИзделий);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", ?(Партия.ПроизводствоИзДавальческогоСырья, "", ДанныеСпецификации.ИдентификаторВерсииДанных));
			
			Если Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка Тогда
				// В разборке все выходных изделий - свободный выпуск (без доп расчета)
				СвободныйВыпуск = КомплектующиеРазборки(Партия, ДанныеСпецификации);
			Иначе
				// В производстве нужно рассчитывать свободный выпуск с учетом заказанного количества изделий
				СвободныйВыпуск = СвободныйВыпуск(Партия, ДанныеСпецификации);
			КонецЕсли;
			
			Для каждого Строка Из СвободныйВыпуск Цикл
				
				Если Строка.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УточняетсяПриПроизводстве
					ИЛИ Строка.СпособАвтовыбораХарактеристики = Перечисления.СпособыАвтовыбораХарактеристики.УточняетсяПриПроизводстве
					ИЛИ (Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка
							И Строка.ВидСтроки = Перечисления.ВидыСтрокСпецификации.ПромежуточныйПолуфабрикат) Тогда
					Продолжить;
				КонецЕсли;
				
				Если (Строка.СпособАвтовыбораНоменклатуры <> Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ
						И Не ЗначениеЗаполнено(Строка.Номенклатура)
					ИЛИ Строка.СпособАвтовыбораХарактеристики <> Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ
						И Не ЗначениеЗаполнено(Строка.Характеристика)) Тогда
					Партия.БылиОшибки = Истина;
					ИмяТЧ = ?(ЗначениеЗаполнено(Строка.СтатьяКалькуляции), НСтр("ru = '""Побочные изделия""';
																				|en = '""By-products""'"), НСтр("ru = '""Выходные изделия""';
																													|en = '""Finished products""'"));
					Шаблон = НСтр("ru = 'При разузловании изделия по спецификации %1 ""%2"" в строке №%3 списка %4 не удалось выполнить автовыбор номенклатуры по причине: %5.';
									|en = 'Cannot autoselect an item while exploding the product by the %1 ""%2"" bill of materials in line No.%3 of the ""%4"" list due to: %5.'");
					ТекстСообщения = СтрШаблон(Шаблон, ДанныеСпецификации.Код, ДанныеСпецификации.СпецификацияПредставление, Строка.НомерСтроки, ИмяТЧ, Строка.СведенияАвтовыбора);
					ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
					ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
						ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				Если Строка.Склад.Пустая()
					И Строка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
					Партия.БылиОшибки = Истина;
					ИмяТЧ = ?(ЗначениеЗаполнено(Строка.СтатьяКалькуляции), НСтр("ru = '""Побочные изделия""';
																				|en = '""By-products""'"), НСтр("ru = '""Выходные изделия""';
																													|en = '""Finished products""'"));
					Шаблон = НСтр("ru = 'При разузловании изделия по спецификации %1 ""%2"" в строке №%3 списка %4 не удалось подобрать склад.';
									|en = 'Cannot pick a warehouse while exploding the product by the %1 ""%2"" bill of materials in line No.%3 of the ""%4"" list.'");
					ТекстСообщения = СтрШаблон(Шаблон, ДанныеСпецификации.Код, ДанныеСпецификации.СпецификацияПредставление, Строка.НомерСтроки, ИмяТЧ);
					ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
					ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
						ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ДвиженияНоменклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Этап,СтатьяКалькуляции");
				
				НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск;
				
				Если Строка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
					НоваяСтрока.Склад = Строка.Склад;
				Иначе
					НоваяСтрока.Склад = Строка.ПодразделениеЭтапа;
				КонецЕсли;
				
				Если Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот
					И ЗначениеЗаполнено(Строка.СтатьяКалькуляции)
					И Строка.ПодлежитРемонту Тогда
					НоваяСтрока.Назначение = Изделие.НазначениеСтруктуры;
				ИначеЕсли Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка
					И НЕ Изделие.Назначение.Пустая()
					И НЕ ЗначениеЗаполнено(Строка.СтатьяКалькуляции) Тогда // основное изделие
					НоваяСтрока.Назначение = Изделие.Назначение;
				КонецЕсли;
				
				НоваяСтрока.Запланировано = Строка.Количество;
				
				НоваяСтрока.Подразделение = Строка.ПодразделениеЭтапа;
				НоваяСтрока.ДлительностьДоВыпуска = Строка.ДлительностьДоВыпуска + Изделие.ДлительностьДоВыпускаРодитель;
				НоваяСтрока.КлючСвязиСтрокаСпецификации = Строка.КлючСвязи; // КлючСвязиСтрокаСпецификации
				
				Если Строка.АлгоритмРасчетаКоличества <> "" И ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковок > 0 Тогда
					НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.Количество
																		* ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковокНаЕдиницуПартииВыпуска / ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковок;
				Иначе
					НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоУпаковокНаЕдиницуПартииВыпуска * Строка.ДанныеУпаковки.Числитель / Строка.ДанныеУпаковки.Знаменатель;
				КонецЕсли;
				
				УстановитьКлючСвязиСтроки(НоваяСтрока, "СтруктураЗаказа", "КлючНоменклатура", КлючиСвязи); // "00000000-0000-0000-0000-000000000000"
				
			КонецЦикла;
			
	#КонецОбласти
	
	#Область Материалы

			ДвиженияНоменклатура = Хранилище.СтруктураЗаказа; // ТаблицаЗначений
			
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("Уровень",               Уровень);
			КолонкиПоЗначению.Вставить("КлючПартия",            Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("Спецификация",          Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство",   Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("Назначение",            ПустоеНазначение); // приведение типа по всем измерениям
			КолонкиПоЗначению.Вставить("НазначениеСтруктуры",   Изделие.НазначениеСтруктуры);
			КолонкиПоЗначению.Вставить("ИдентификаторВГруппеИзделий", ИдентификаторВГруппеИзделий);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", ?(Партия.ПроизводствоИзДавальческогоСырья, "", ДанныеСпецификации.ИдентификаторВерсииДанных));
		
			Для каждого Строка Из ДанныеСпецификации.МатериалыИУслуги Цикл
				
				Если Строка.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УточняетсяПриПроизводстве
					ИЛИ Строка.СпособАвтовыбораХарактеристики = Перечисления.СпособыАвтовыбораХарактеристики.УточняетсяПриПроизводстве
					// Внутреннее товародвижение из сборки исключаем полностью, остальных случаях оставляем но не обеспечиваем (съемные узлы ремонта)
					ИЛИ (Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка
							И Строка.ВидСтроки = Перечисления.ВидыСтрокСпецификации.ПромежуточныйПолуфабрикат) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Строка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор
					И Не ЗначениеЗаполнено(Строка.Номенклатура)
					И Строка.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УточняетсяПриПроизводстве
					И Справочники.РесурсныеСпецификации.ЭтоСтрокаТЧМатериалыИРаботы(Строка.ВидСтроки) Тогда
					Партия.БылиОшибки = Истина;
					Шаблон = НСтр("ru = 'При разузловании изделия по спецификации %1 ""%2"" в строке №%3 списка ""Материалы и работы"": %4';
									|en = 'While exploding the product by the %1 ""%2"" bill of materials in line No.%3 of the ""Materials and works"" list: %4'");
					ТекстСообщения = СтрШаблон(Шаблон, ДанныеСпецификации.Код, ДанныеСпецификации.СпецификацияПредставление, Строка.НомерСтроки, Строка.СведенияАвтовыбора);
					ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
					ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
						ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				Если (Строка.СпособАвтовыбораНоменклатуры <> Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ
						И Не ЗначениеЗаполнено(Строка.Номенклатура)
					ИЛИ Строка.СпособАвтовыбораХарактеристики <> Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ
						И Строка.ХарактеристикиИспользуются
						И Не ЗначениеЗаполнено(Строка.Характеристика))
					И Справочники.РесурсныеСпецификации.ЭтоСтрокаТЧМатериалыИРаботы(Строка.ВидСтроки) Тогда
					Партия.БылиОшибки = Истина;
					Шаблон = НСтр("ru = 'При разузловании изделия по спецификации %1 ""%2"" в строке №%3 списка ""Материалы и работы"" не удалось выполнить автовыбор номенклатуры по причине: %4.';
									|en = 'Cannot autoselect an item while exploding the product by the %1 ""%2"" bill of materials in line No.%3 of the ""Materials and works"" list due to: %4.'");
					ТекстСообщения = СтрШаблон(Шаблон, ДанныеСпецификации.Код, ДанныеСпецификации.СпецификацияПредставление, Строка.НомерСтроки, Строка.СведенияАвтовыбора);
					ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
					ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
						ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				Если Строка.Склад.Пустая()
					И НЕ Строка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа
					И Справочники.РесурсныеСпецификации.ЭтоСтрокаТЧМатериалыИРаботы(Строка.ВидСтроки) Тогда
					Партия.БылиОшибки = Истина;
					Шаблон = НСтр("ru = 'При разузловании изделия по спецификации %1 ""%2"" в строке №%3 списка ""Материалы и работы"" не удалось подобрать склад.';
									|en = 'Cannot pick the warehouse while exploding the product by the %1 ""%2"" bill of materials in line No.%3 of the ""Materials and works"" list.'");
					ТекстСообщения = СтрШаблон(Шаблон, ДанныеСпецификации.Код, ДанныеСпецификации.СпецификацияПредставление, Строка.НомерСтроки);
					ДобавитьСообщениеВСписокОшибок(Партия.Протокол, ТекстСообщения);
					ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,Изделие.ЗаказНаПроизводство,
						ТекстСообщения);
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ДвиженияНоменклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Характеристика,Этап,СтатьяКалькуляции");
				
				НоваяСтрока.ВидСтроки = Перечисления.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление;
				
				Если Изделие.ТипПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка
					И (Изделие.Номенклатура = НоваяСтрока.Номенклатура И Изделие.Характеристика = НоваяСтрока.Характеристика) Тогда
					НоваяСтрока.Склад = Изделие.Склад;
					НоваяСтрока.Назначение = Изделие.Назначение;
				Иначе
					
					Если Строка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
						НоваяСтрока.Склад = Строка.Склад;
					Иначе
						НоваяСтрока.Склад = Строка.ПодразделениеЭтапа;
					КонецЕсли;
					Если Строка.Обособленно Или Строка.Запланировать И Партия.ПроизводствоИзДавальческогоСырья Тогда
						НоваяСтрока.Назначение = Изделие.НазначениеСтруктуры;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется
						ИЛИ Строка.ВидСтроки = Перечисления.ВидыСтрокСпецификации.ПромежуточныйПолуфабрикат Тогда
					НоваяСтрока.НеОбеспечивать = Строка.Количество;
				Иначе
					НоваяСтрока.КОбеспечению = Строка.Количество;
				КонецЕсли;
				
				НоваяСтрока.Подразделение = Строка.ПодразделениеЭтапа;
				НоваяСтрока.СпецификацияПолуфабриката = ?(Строка.ПроизводитсяВПроцессе, Строка.Спецификация, Справочники.РесурсныеСпецификации.ПустаяСсылка());
				НоваяСтрока.ДлительностьДоВыпуска = Строка.ДлительностьДоВыпуска + Изделие.ДлительностьДоВыпускаРодитель;
				НоваяСтрока.КлючСвязиСтрокаСпецификации = Строка.КлючСвязи; // КлючСвязиСтрокаСпецификации
				
				Если Строка.АлгоритмРасчетаКоличества <> "" И ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковок > 0 Тогда
					НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.Количество
																		* ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковокНаЕдиницуПартииВыпуска / ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковок;
				Иначе
					НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоУпаковокНаЕдиницуПартииВыпуска * Строка.ДанныеУпаковки.Числитель / Строка.ДанныеУпаковки.Знаменатель;
				КонецЕсли;
				
				УстановитьКлючСвязиСтроки(НоваяСтрока, "СтруктураЗаказа", "КлючНоменклатура", КлючиСвязи);
				
			КонецЦикла;
			
	#КонецОбласти
	
	#Область Трудозатраты
	
			ДвиженияТрудозатраты = Хранилище.ТрудозатратыСтруктурыЗаказа; // ТаблицаЗначений
		
			КолонкиПоЗначению = Новый Структура();
			КолонкиПоЗначению.Вставить("КлючПартия",          Партия.КлючПартия);
			КолонкиПоЗначению.Вставить("Спецификация",        Изделие.Спецификация);
			КолонкиПоЗначению.Вставить("ЗаказНаПроизводство", Изделие.ЗаказНаПроизводство);
			КолонкиПоЗначению.Вставить("ИдентификаторВерсииДанных", ?(Партия.ПроизводствоИзДавальческогоСырья, "", ДанныеСпецификации.ИдентификаторВерсииДанных));
			
			Для каждого Строка Из ДанныеСпецификации.Трудозатраты Цикл
			
				НоваяСтрока = ДвиженияТрудозатраты.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КолонкиПоЗначению);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "ВидРабот,Этап,СтатьяКалькуляции");
				
				НоваяСтрока.Количество = Строка.Количество;
				
				НоваяСтрока.Подразделение = Строка.ПодразделениеЭтапа;
				НоваяСтрока.КлючСвязиСтрокаСпецификации = Строка.КлючСвязи; // КлючСвязиСтрокаСпецификации
				
				Если Строка.АлгоритмРасчетаКоличества <> "" И ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковок > 0 Тогда
					НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.Количество
																		* ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковокНаЕдиницуПартииВыпуска / ДанныеСпецификации.ОсновноеИзделие.КоличествоУпаковок;
				Иначе
					НоваяСтрока.КоличествоНаЕдиницуПартииЗапуска = Строка.КоличествоНаЕдиницуПартииВыпуска;
				КонецЕсли;
				
				УстановитьКлючСвязиСтроки(НоваяСтрока, "ТрудозатратыСтруктурыЗаказа", "КлючВидРабот", КлючиСвязи);
				
			КонецЦикла;
			
	#КонецОбласти
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Партия.БылиОшибки Тогда
		ЗаполнитьРеквизитыВДвиженияхПоПараметрамОтбора(Хранилище, Новый Структура("КлючПартия", Партия.КлючПартия), Новый Структура("ИдентификаторВерсииДанных", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	КонецЕсли;

КонецПроцедуры

Функция НуженДопРасчетСвободногоВыпуска(Партия, ДанныеСпецификации)
	
	Если ДанныеСпецификации.ВыходныеИзделия.Количество() > 1 Или Партия.Остаток <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеСпецификации.ВозвратныеОтходы.Количество() > 0 И НайтиСтрокуПоЗначениюКолонкиВМассивеСтрок(Партия.Строки, "ПобочныйВыход", Истина) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция СвободныйВыпуск(Партия, ДанныеСпецификации)
	
	Изделия = Партия.Строки;
	
	НуженДопРасчетСвободногоВыпуска = НуженДопРасчетСвободногоВыпуска(Партия, ДанныеСпецификации);
	
	Если НЕ
		НуженДопРасчетСвободногоВыпуска Тогда
		
		СвободныйВыпуск = ДанныеСпецификации.ВозвратныеОтходы;
		
	Иначе
		
		СвободныйВыпуск = ДанныеСпецификации.ВозвратныеОтходы.СкопироватьКолонки();
		
		Кэш = СвободныйВыпуск.СкопироватьКолонки("Номенклатура,Характеристика,Количество,КоличествоУпаковокНаЕдиницуПартииВыпуска"); // ТаблицаЗначений
		Кэш.Колонки.Добавить("Строка");
		
		Для каждого Строка Из ДанныеСпецификации.ВыходныеИзделия Цикл
			НоваяСтрока = Кэш.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Строка = Строка;
		КонецЦикла;
		
		Для каждого Строка Из ДанныеСпецификации.ВозвратныеОтходы Цикл
			НоваяСтрока = Кэш.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Строка = Строка;
		КонецЦикла;
		
		Кэш.Индексы.Добавить("Номенклатура,Характеристика");
		
		СтруктураОтбора = Новый Структура("Номенклатура,Характеристика");
		
		Для каждого Изделие Из Изделия Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, Изделие);
			
			Если Не ЗначениеЗаполнено(Партия.КорректировкаСтрок) Тогда
				Требуется = Изделие.Требуется;
			Иначе
				Требуется = Изделие.Требуется - ПривестиЗначение(ТипЧисло(), Партия.КорректировкаСтрок[Изделие.КлючНоменклатура]);
			КонецЕсли;
			
			Строки = Кэш.НайтиСтроки(СтруктураОтбора);
			
			Для каждого Строка Из Строки Цикл
				Распределено = Мин(Требуется, Строка.Количество);
				Строка.Количество = Строка.Количество - Распределено;
				Требуется = Требуется - Распределено;
			КонецЦикла;
			
		КонецЦикла;
		
		Для каждого Строка Из Кэш Цикл
			
			Если Строка.Количество > 0 Или Строка.КоличествоУпаковокНаЕдиницуПартииВыпуска > 0 И Строка.Строка.Владелец() = ДанныеСпецификации.ВозвратныеОтходы Тогда
				НоваяСтрока = СвободныйВыпуск.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка.Строка);
				НоваяСтрока.Количество = Строка.Количество;
				НоваяСтрока.КоличествоУпаковокНаЕдиницуПартииВыпуска = Строка.КоличествоУпаковокНаЕдиницуПартииВыпуска;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвободныйВыпуск;
	
КонецФункции 

Функция КомплектующиеРазборки(Партия, ДанныеСпецификации)

	НуженДопРасчетСвободногоВыпуска = ДанныеСпецификации.ВозвратныеОтходы.Количество() > 0;

	Если НЕ
		НуженДопРасчетСвободногоВыпуска Тогда
		
		СвободныйВыпуск = ДанныеСпецификации.ВыходныеИзделия;
		
		Если СвободныйВыпуск.Колонки.Найти("СтатьяКалькуляции") = Неопределено Тогда
			СвободныйВыпуск.Колонки.Добавить("СтатьяКалькуляции", Новый ОписаниеТипов("СправочникСсылка.СтатьиКалькуляции"));
		КонецЕсли;
		
	Иначе
		
		СвободныйВыпуск = ДанныеСпецификации.ВозвратныеОтходы.Скопировать();
		
		Для каждого Строка Из ДанныеСпецификации.ВыходныеИзделия Цикл
			НоваяСтрока = СвободныйВыпуск.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
		
	КонецЕсли;

	Возврат СвободныйВыпуск;
	
КонецФункции

// Рассчитывает изменения и добавляет сторно записи в таблицу движений
// 
// Параметры:
// 	Движения - ТаблицаЗначений - движения
Процедура РассчитатьИзмененияИДобавитьСторноДвиженияВТаблицуСтруктураЗаказа(Движения)
	
	СтруктураМетаданных = РегистрыСведений.СтруктураЗаказа.СтруктураМетаданных();
	
	ПервичныеСтроки = Движения.НайтиСтроки(Новый Структура("РассчитыватьИзменения", Истина));
	
	Дельты = Движения.СкопироватьКолонки(
		СтруктураМетаданных.ИзмеренияСтрока + ",КОбеспечению,НеОбеспечивать,Запланировано,РазборкаЗапланировано");
	
	Дельты.Колонки.Добавить("НомерСтрокиДвиженияДоИзменения", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	Дельты.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	Для Индекс = 0 По ПервичныеСтроки.ВГраница() Цикл
		
		Строка = ПервичныеСтроки[Индекс];
		
		НоваяСтрока = Дельты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.ДополнительнаяЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ДвиженияДоИзменения Тогда
			НоваяСтрока.НомерСтрокиДвиженияДоИзменения = Индекс + 1;
		Иначе
			НоваяСтрока.НомерСтроки                    = Индекс + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Дельты.Свернуть(СтруктураМетаданных.ИзмеренияСтрока,
		"КОбеспечению,НеОбеспечивать,Запланировано,РазборкаЗапланировано" + ",НомерСтроки,НомерСтрокиДвиженияДоИзменения");
	
	Для каждого Дельта Из Дельты Цикл
		
		Если (Дельта.КОбеспечению = 0 И Дельта.НеОбеспечивать = 0 И Дельта.Запланировано = 0 И Дельта.РазборкаЗапланировано = 0) Тогда
			Продолжить;
		КонецЕсли;
		
		ДвиженияДоИзменения = НЕ Дельта.КОбеспечению >= 0 Или НЕ Дельта.НеОбеспечивать >= 0 Или НЕ Дельта.Запланировано >= 0 Или НЕ Дельта.РазборкаЗапланировано >= 0;
		
		НоваяСтрока = Движения.Добавить();
		
		ИндексСтроки = ?(ДвиженияДоИзменения, Дельта.НомерСтрокиДвиженияДоИзменения, Дельта.НомерСтроки) - 1;
		ПервичнаяСтрока = ПервичныеСтроки[ИндексСтроки];
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПервичнаяСтрока, СтруктураМетаданных.РеквизитыСтрока);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Дельта);
		
		Если ДвиженияДоИзменения ИЛИ Дельта.НомерСтрокиДвиженияДоИзменения <> 0 Тогда
		
			НоваяСтрока.ДополнительнаяЗапись = Истина;
			НоваяСтрока.Разделитель = Новый УникальныйИдентификатор();
			
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьСтрокиИзТаблицы(Движения, ПервичныеСтроки);
	
КонецПроцедуры

// Рассчитывает изменения и добавляет сторно записи в таблицу движений
// 
// Параметры:
// 	Движения - ТаблицаЗначений - движения
Процедура РассчитатьИзмененияИДобавитьСторноДвиженияВТаблицуТрудозатратыСтруктурыЗаказа(Движения)
	
	СтруктураМетаданных = РегистрыСведений.ТрудозатратыСтруктурыЗаказа.СтруктураМетаданных();
	
	ПервичныеСтроки = Движения.НайтиСтроки(Новый Структура("РассчитыватьИзменения", Истина));
	
	Дельты = Движения.СкопироватьКолонки(СтруктураМетаданных.ИзмеренияСтрока + ",Количество");
	
	Дельты.Колонки.Добавить("НомерСтрокиДвиженияДоИзменения", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	Дельты.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	Для Индекс = 0 По ПервичныеСтроки.ВГраница() Цикл
		
		Строка = ПервичныеСтроки[Индекс];
		
		НоваяСтрока = Дельты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.ДополнительнаяЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ДвиженияДоИзменения Тогда
			НоваяСтрока.НомерСтрокиДвиженияДоИзменения = Индекс + 1;
		Иначе
			НоваяСтрока.НомерСтроки                    = Индекс + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Дельты.Свернуть(СтруктураМетаданных.ИзмеренияСтрока, "Количество" + ", НомерСтроки, НомерСтрокиДвиженияДоИзменения");
	
	Для каждого Дельта Из Дельты Цикл
		
		Если Дельта.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДвиженияДоИзменения = НЕ Дельта.Количество >= 0;
		
		НоваяСтрока = Движения.Добавить();
		
		ИндексСтроки = ?(ДвиженияДоИзменения, Дельта.НомерСтрокиДвиженияДоИзменения, Дельта.НомерСтроки) - 1;
		ПервичнаяСтрока = ПервичныеСтроки[ИндексСтроки];
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПервичнаяСтрока, СтруктураМетаданных.РеквизитыСтрока);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Дельта);
		
		Если ДвиженияДоИзменения ИЛИ Дельта.НомерСтрокиДвиженияДоИзменения <> 0 Тогда
		
			НоваяСтрока.ДополнительнаяЗапись = Истина;
			НоваяСтрока.Разделитель = Новый УникальныйИдентификатор();
			
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьСтрокиИзТаблицы(Движения, ПервичныеСтроки);
	
КонецПроцедуры

Функция ПорцииЗаписи()
	
	Порции = Новый ТаблицаЗначений();
	
	Порции.Колонки.Добавить("НомерПорции", ОбщегоНазначения.ОписаниеТипаЧисло(4, 0));
	
	Порции.Колонки.Добавить("Замещать", Новый ОписаниеТипов("Булево"));
	Порции.Колонки.Добавить("Доступно", Новый ОписаниеТипов("Булево"));
	
	Порции.Колонки.Добавить("КоличествоСтрок", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	Возврат Порции;
	
КонецФункции

Функция ПорцияЗаписи(ПорцииЗаписи, Замещать, Найти = Ложь, КоличествоСтрок = 1, ПорцияЗаписи = Неопределено)
	
	Если Найти
		И ПорцияЗаписи = Неопределено Тогда
		
		КоличествоСтрокВНабореЗаписей = КоличествоСтрокВНабореЗаписей();
		
		НайденныеСтроки = ПорцииЗаписи.НайтиСтроки(Новый Структура("Доступно, Замещать", Найти, Замещать));
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если КоличествоСтрок < ( КоличествоСтрокВНабореЗаписей - НайденнаяСтрока.КоличествоСтрок ) Тогда
				
				ПорцияЗаписи = НайденнаяСтрока;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПорцияЗаписи = Неопределено Тогда
		
		ПорцияЗаписи = ПорцииЗаписи.Добавить();
		
		ПорцияЗаписи.Замещать    = Замещать;
		ПорцияЗаписи.НомерПорции = ПорцииЗаписи.Количество();
		
	КонецЕсли;
	
	Возврат ПорцияЗаписи;
	
КонецФункции

Процедура УстановитьНомерПорцииВКоллекцииДвижений(Коллекция, НомерПорции)
	
	Для каждого ТекущаяСтрока Из Коллекция Цикл ТекущаяСтрока.НомерПорции = НомерПорции;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКолонкиВТаблицеПоПараметрамОтбора(Таблица, ПараметрыОтбора, КолонкиПоЗначению)
	
	Если ПараметрыОтбора = Неопределено Тогда
	
		Для каждого ТекущаяСтрока Из Таблица Цикл ЗаполнитьЗначенияСвойств(ТекущаяСтрока, КолонкиПоЗначению);
		КонецЦикла;
	
	Иначе
		
		Для каждого ТекущаяСтрока Из Таблица.НайтиСтроки(ПараметрыОтбора) Цикл ЗаполнитьЗначенияСвойств(ТекущаяСтрока, КолонкиПоЗначению);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыВДвиженияхПоПараметрамОтбора(Хранилище, ПараметрыОтбора, КолонкиПоЗначению)
	
	Для каждого Данные Из Хранилище Цикл
		ЗаполнитьКолонкиВТаблицеПоПараметрамОтбора(Данные.Значение, ПараметрыОтбора, КолонкиПоЗначению);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьКлючСвязиСтроки(Строка, ИмяТЧ, ИмяПоля, КлючиСвязи)
	
	ЗаполнитьЗначенияСвойств(КлючиСвязи.Ключ, Строка);
	
	НайденныеСтроки = КлючиСвязи.Кэш.НайтиСтроки(КлючиСвязи.Ключ);
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		
		Строка[ИмяПоля] = НайденныеСтроки[0].КлючСвязи;
		
	Иначе
		
		Строка[ИмяПоля] = Новый УникальныйИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ГруппаИзделийКонтрольнаяСумма(Данные, ИмяПоляСпецификация = "Спецификация", ИмяПоляЗаказ = "ЗаказНаПроизводство") Экспорт
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	
	ХешированиеДанных.Добавить("" + Данные[ИмяПоляСпецификация].УникальныйИдентификатор());
	ХешированиеДанных.Добавить("" + Данные[ИмяПоляЗаказ].УникальныйИдентификатор());
	
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	
КонецФункции

Функция ПустаяГруппаИзделий()
	
	Возврат "                                ";
	
КонецФункции

Функция ПорцияРасчетаГруппыИзделий(ПорцияРасчета)
	
	КоличествоСтрок = ПорцияРасчета.Количество();
	
	ГруппыИзделий = Новый Массив(КоличествоСтрок);
	
	Для Индекс = 0 По КоличествоСтрок - 1 Цикл
		ГруппыИзделий[Индекс] = ГруппаИзделийКонтрольнаяСумма(ПорцияРасчета[Индекс]);
	КонецЦикла;
	
	Возврат ГруппыИзделий;
	
КонецФункции

Функция ИдентификаторПартииВГруппеИзделий(Знач ГруппаИзделий, Знач ИдентификаторВГруппеИзделийКлючРодитель, Знач УровеньРодитель, Знач НомерВГруппеИзделий)
	
	Если УровеньРодитель > 0 И ПустаяСтрока(ИдентификаторВГруппеИзделийКлючРодитель) Тогда
		Возврат ""; // пропускаем, чтобы сохранить поведение для "старых" заказов (обработчик обновления не делаем)
	КонецЕсли;
	
	//ИдентификаторВГруппеИзделий - Строка (70)
	//  * группа изделий родителя (32 символа)
	//  * номер партии в группе изделий родителя (3 символа в Base36)
	//  * группа изделий (32 символа)
	//  * номер партии в группе изделий (3 символа в Base36)
	
	НомерВГруппеИзделий36 = ПреобразоватьBase36(НомерВГруппеИзделий, 3); // см. ОпределяемыеТипы.ИдентификаторВГруппеИзделийСтруктурыЗаказа
	
	Результат = ""
		+ ИдентификаторВГруппеИзделийКлючРодитель
		+ ГруппаИзделий
		+ Лев("000", 3 - СтрДлина(НомерВГруппеИзделий36))
		+ НомерВГруппеИзделий36;
	
	Возврат Результат;
	
КонецФункции

Функция ИзвлечьКлючРодителяИзИдентификатора(Знач ИдентификаторВГруппеИзделий)
	
	Результат = Лев(ИдентификаторВГруппеИзделий, 35); // см. ОпределяемыеТипы.ИдентификаторВГруппеИзделийСтруктурыЗаказа

	Если Результат = "" Тогда
		Результат = "00000000000000000000000000000000000";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИзвлечьКлючПартииИзИдентификатора(Знач ИдентификаторВГруппеИзделий)
	
	Результат = Прав(ИдентификаторВГруппеИзделий, 35); // см. ОпределяемыеТипы.ИдентификаторВГруппеИзделийСтруктурыЗаказа

	Если Результат = "" Тогда
		Результат = "00000000000000000000000000000000000";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИзвлечьКодПартииИзИдентификатора(Знач ИдентификаторВГруппеИзделий)
	
	Результат = ПреобразоватьИзBase36ВДесятичноеЧисло(Прав(ИдентификаторВГруппеИзделий, 3)); // см. ОпределяемыеТипы.ИдентификаторВГруппеИзделийСтруктурыЗаказа
	Возврат Результат;
	
КонецФункции

Функция ИзвлечьГруппуИзделияИзИдентификатора(Знач ИдентификаторВГруппеИзделий)
	
	Результат = Сред(ИдентификаторВГруппеИзделий, 35, 32); // см. ОпределяемыеТипы.ИдентификаторВГруппеИзделийСтруктурыЗаказа
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьBase36(Знач ДесятичноеЧисло, Знач Разрядность = 15)
	
	Результат = "";
	
	ДесятичноеЧисло = Мин(ДесятичноеЧисло, Pow(36, Разрядность));
	
	Пока ДесятичноеЧисло > 0 Цикл
		ОстатокОтДеления = ДесятичноеЧисло % 36;
		ДесятичноеЧисло  = (ДесятичноеЧисло - ОстатокОтДеления) / 36;
		Результат        = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", ОстатокОтДеления + 1, 1) + Результат;
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьИзBase36ВДесятичноеЧисло(Знач Значение)
	
	Значение = ВРег(Значение);
	ДлинаСтроки = СтрДлина(Значение);
	
	Результат = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Результат = Результат * 36 + СтрНайти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Значение, НомерСимвола, 1)) - 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиВКэшеКлючПартии(КэшПартий, Знач ИдентификаторВГруппеИзделийКлючРодитель, Знач ГруппаИзделий, ПоляПриоритета, КэшПартияКлючПоиска, ПодходящаяПартия)
	
	ПодходящаяПартия = Неопределено;

	КэшПартияКлючПоиска.ГруппаИзделий = ГруппаИзделий;
	КэшПартияКлючПоиска.ИдентификаторВГруппеИзделийКлючРодитель = ИдентификаторВГруппеИзделийКлючРодитель;
	
	ПодходящаяПартия0 = Неопределено;
	ПодходящаяПартия1 = Неопределено;
	
	НайденныеСтроки = КэшПартий.НайтиСтроки(КэшПартияКлючПоиска);
	
	Для каждого Строка ИЗ НайденныеСтроки Цикл
		
		Если Строка.КлючИспользован Тогда
			Продолжить;
		КонецЕсли;
		
		ПодходящаяПартия = Строка;
		
		Если ПодходящаяПартия.КлючПартия = ПоляПриоритета.КлючПартия Тогда
			Если ПодходящаяПартия.КлючНоменклатура = ПоляПриоритета.КлючНоменклатура Тогда
				ПодходящаяПартия0 = ПодходящаяПартия;
				Прервать;
			КонецЕсли;
			ПодходящаяПартия1 = ПодходящаяПартия;
		КонецЕсли;
		
	КонецЦикла;
	
	ПодходящаяПартия = ?(ПодходящаяПартия0 <> Неопределено,
							ПодходящаяПартия0,
							?(ПодходящаяПартия1 <> Неопределено,
									ПодходящаяПартия1,
									ПодходящаяПартия));
	
	Если ПодходящаяПартия <> Неопределено Тогда
		
		ПодходящаяПартия.КлючИспользован = Истина;
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьСообщениеВСписокОшибок(СписокОшибок, ТекстСообщения)

	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли;
	
	СписокОшибок.Добавить(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область РаспределениеЗапасов

Процедура ВыполнитьРаспределениеЗапасов(ПараметрыДействия, АдресРезультата) Экспорт
	
	КлючеваяОперация = "СтруктураЗаказа.РаспределениеЗапасов";
	НачалоРасчета = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РазмерПорции = ПараметрыДействия.ПорцияРасчета.Количество();
	ЗамерВремени = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(КлючеваяОперация);
	ВыполнитьРаспределениеЗапасовВнутриЗамераВремени(ПараметрыДействия);
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ЗамерВремени, РазмерПорции);
	РезультатРасчета = Новый Структура("Операция, РазмерПорции, Длительность", КлючеваяОперация, РазмерПорции, ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоРасчета);
	ПоместитьВоВременноеХранилище(РезультатРасчета, АдресРезультата);
	
КонецПроцедуры

Процедура ВыполнитьРаспределениеЗапасовВнутриЗамераВремени(ПараметрыДействия)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	СостояниеЗапасов = Новый Массив();
	СостояниеЗапасов.Добавить(Перечисления.СостоянияЗапаса.ВНаличии);
	СостояниеЗапасов.Добавить(Перечисления.СостоянияЗапаса.ВНаличииОжидаетсяРазблокировка);
	СостояниеЗапасов.Добавить(Перечисления.СостоянияЗапаса.ОжидаетсяКПоступлению);
	СостояниеЗапасов.Добавить(Перечисления.СостоянияЗапаса.ОжидаетсяКПоступлениюСБлокировкой);
	СостояниеЗапасов.Добавить(Перечисления.СостоянияЗапаса.НаСогласованииПоставки);
	
	ХарактеристикаПотребности = Перечисления.ХарактеристикиПотребности.Излишек;
	
	ПараметрыРасчета = ПараметрыДействия.ПараметрыРасчета;
	ПорцияРасчета = ПараметрыДействия.ПорцияРасчета;
	
	ИспользуютсяАналоги = ПолучитьФункциональнуюОпцию("ИспользоватьАналогиМатериалов");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПорцияРасчета", ПорцияРасчета);
	Запрос.УстановитьПараметр("СостояниеЗапасов", СостояниеЗапасов);
	Запрос.УстановитьПараметр("ХарактеристикаПотребности", ХарактеристикаПотребности);
	Запрос.УстановитьПараметр("ПустойКлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Запрос.УстановитьПараметр("ИспользуютсяАналоги", ИспользуютсяАналоги);
	
	МассивТекстовЗапроса = Новый Массив;
	
	ТекстПорцияРасчета = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Склад КАК Склад,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ПорцияРасчета
	|ИЗ
	|	&ПорцияРасчета КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Назначение
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Склад КАК Склад,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Обособленно КАК Обособленно,
	|	Товары.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ТоварыПоПорции
	|ИЗ (
	|
	|ВЫБРАТЬ
	|
	|	Товары.Номенклатура   КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад,
	|
	|	ТоварыНоменклатура.ОбособленнаяЗакупкаПродажа КАК Обособленно,
	|
	|	ВЫБОР
	|		КОГДА ТоварыНоменклатура.ОбособленнаяЗакупкаПродажа
	|		  ИЛИ Товары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА Товары.Назначение
	|		КОГДА ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ПорцияРасчета КАК ДД
	|			ГДЕ
	|				ДД.Номенклатура = Товары.Номенклатура
	|				И ДД.Характеристика = Товары.Характеристика
	|				И ДД.Склад = Товары.Склад
	|				И ДД.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.РаспределениеЗапасов КАК ДД
	|			ГДЕ
	|				ДД.СостояниеЗапаса В (&СостояниеЗапасов)
	|				И ДД.ХарактеристикаПотребности = &ХарактеристикаПотребности
	|				И ДД.Номенклатура = Товары.Номенклатура
	|				И ДД.Характеристика = Товары.Характеристика
	|				И ДД.Склад = Товары.Склад
	|				И ДД.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|				И ДД.Количество > 0)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.СтруктураЗаказа КАК ДД
	|			ГДЕ
	|				ДД.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск)
	|				И ДД.Номенклатура = Товары.Номенклатура
	|				И ДД.Характеристика = Товары.Характеристика
	|				И ДД.Склад = Товары.Склад
	|				И ДД.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		ИНАЧЕ Товары.Назначение
	|	КОНЕЦ КАК Назначение,
	|	Товары.Идентификатор КАК Идентификатор
	|
	|ИЗ
	|	ПорцияРасчета КАК Товары
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТоварыНоменклатура
	|		ПО Товары.Номенклатура = ТоварыНоменклатура.Ссылка
	|
	|) КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Назначение";
	
	ТекстАналогиМатериалов = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвязиМатериаловИАналогов.Номенклатура КАК Номенклатура,
	|	СвязиМатериаловИАналогов.Характеристика КАК Характеристика,
	|	СвязиМатериаловИАналогов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СвязанныеАналогиМатериалов
	|ИЗ
	|	ТоварыПоПорции КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязиНоменклатурыПоРазрешениямНаЗамену КАК СвязиМатериаловИАналогов
	|		ПО (Товары.Идентификатор = СвязиМатериаловИАналогов.Идентификатор)
	|ГДЕ
	|	&ИспользуютсяАналоги
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор";
	
	ТекстДополнениеАналогами = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвязанныеАналогиМатериалов.Номенклатура КАК Номенклатура,
	|	СвязанныеАналогиМатериалов.Характеристика КАК Характеристика,
	|	Товары.Склад КАК Склад,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Обособленно КАК Обособленно,
	|	Товары.Идентификатор КАК Идентификатор
	|ДОБАВИТЬ ТоварыПоПорции
	|ИЗ
	|	ТоварыПоПорции КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвязанныеАналогиМатериалов КАК СвязанныеАналогиМатериалов
	|		ПО (Товары.Идентификатор = СвязанныеАналогиМатериалов.Идентификатор)";
	
	МассивТекстовЗапроса.Добавить(ТекстПорцияРасчета);
	МассивТекстовЗапроса.Добавить(ТекстАналогиМатериалов);
	
	Если ИспользуютсяАналоги Тогда
		МассивТекстовЗапроса.Добавить(ТекстДополнениеАналогами);
	КонецЕсли;
	
	ТекстНоменклатурныйПлан = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Обособленно КАК Обособленно,
	|	Товары.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВсеТовары
	|ИЗ (
	|
	|ВЫБРАТЬ
	|
	|	Товары.Номенклатура   КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ТоварыПоПорции КАК ДД
	|			ГДЕ
	|				ДД.Номенклатура = Товары.Номенклатура
	|				И ДД.Характеристика = Товары.Характеристика
	|				И ДД.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		ИНАЧЕ Товары.Назначение
	|	КОНЕЦ КАК Назначение,
	|	Товары.Обособленно КАК Обособленно,
	|	Товары.Идентификатор КАК Идентификатор
	|
	|ИЗ
	|	ТоварыПоПорции КАК Товары
	|
	|) КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Назначение
	|;
	|ВЫБРАТЬ
	|
	|	АвтоНомерЗаписи() КАК ИндексСтроки,
	|
	|	Товары.Идентификатор         КАК Идентификатор,
	|	Движения.Номенклатура        КАК Номенклатура,
	|	Движения.Характеристика      КАК Характеристика,
	|	Движения.Склад               КАК Склад,
	|	Движения.Назначение          КАК Назначение,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КлючНоменклатура    КАК КлючНоменклатура,
	|
	|	СУММА(Движения.КОбеспечению) КАК КОбеспечению,
	|	СУММА(Движения.Заменено) КАК Заменено,
	|	СУММА(Движения.Заказано)
	|		- СУММА(ВЫБОР
	|			КОГДА Движения.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|				ТОГДА Движения.РаспределеноИзПартий + Движения.РаспределеноИзПартийОбособленно
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Заказано,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск) ТОГДА
	|				Движения.Запланировано + Движения.РазборкаЗапланировано
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ) КАК Запланировано,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение) ТОГДА
	|				Движения.Запланировано + Движения.РазборкаЗапланировано
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ) КАК ЗапланированоПереместить,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск) ТОГДА
	|				Движения.Запланировано
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ) КАК СвободныйВыпуск,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Зарезервировано)
	|					И Движения.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО
	|				ТОГДА Движения.РаспределеноИзЗапасов + Движения.РаспределеноИзЗапасовОбособленно
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РаспределеноИзНаличияНаСкладе,
	|	СУММА(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката))
	|				ТОГДА Движения.Запланировано
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ) КАК КонтрольОграниченияЗацикливания,
	|
	|	МАКСИМУМ(Товары.Назначение) КАК НазначениеГруппировка,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЭтоПродукция,
	|
	|	МИНИМУМ(Движения.ЗаказНаПоступление) КАК ЗаказНаПоступление,
	|	МИНИМУМ(Движения.ДатаПоступления) КАК ДатаПоступления,
	|	
	|	МИНИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки НЕ В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение))
	|			ТОГДА Движения.КлючПартия
	|	КОНЕЦ) КАК КлючПартия,
	|	
	|	МИНИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки НЕ В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение))
	|			ТОГДА Движения.Этап
	|	КОНЕЦ) КАК Этап,
	|
	|	МИНИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки НЕ В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Разборка),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение))
	|			ТОГДА Движения.Подразделение
	|	КОНЕЦ) КАК Подразделение,
	|
	|	МАКСИМУМ(Движения.НазначениеСтруктуры) КАК НазначениеСтруктуры,
	|
	|	ISNULL(МИНИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.Уровень
	|	КОНЕЦ), 0) КАК Уровень,
	|
	|	ISNULL(МИНИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.СвободныйВыпуск))
	|			ТОГДА Движения.ДлительностьДоВыпуска
	|	КОНЕЦ), 0) КАК ДлительностьДоВыпуска,
	|
	|	ISNULL(МИНИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.ИдентификаторВГруппеИзделий
	|	КОНЕЦ), 0) КАК ИдентификаторВГруппеИзделий,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление) ТОГДА
	|			Движения.Спецификация
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|	КОНЕЦ) КАК Спецификация,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление) ТОГДА
	|			Движения.КлючСвязиСтрокаСпецификации
	|		ИНАЧЕ
	|			&ПустойКлючСвязи
	|	КОНЕЦ) КАК КлючСвязиСтрокаСпецификации,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|			И Движения.РазрешениеНаЗамену <> ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка) ТОГДА
	|			&ПустойКлючСвязи
	|		ИНАЧЕ
	|			Движения.КлючСвязиПеремещение
	|	КОНЕЦ) КАК КлючСвязиПеремещение,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.РазрешениеНаЗамену = ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка)
	|			ИЛИ Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|		ТОГДА Движения.КлючСвязиПеремещение
	|		ИНАЧЕ &ПустойКлючСвязи
	|	КОНЕЦ) КАК КлючСвязиПотребности,
	|	МАКСИМУМ(Движения.РазрешениеНаЗамену <> ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка)) КАК ЭтоАналог,
	|	МАКСИМУМ(Движения.СпецификацияПолуфабриката) КАК СпецификацияПолуфабриката,
	|
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки В (
	|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|			ТОГДА Движения.КоличествоНаЕдиницуПартииЗапуска
	|	КОНЕЦ) КАК КоличествоНаЕдиницуПартииЗапуска,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Движения.КОбеспечению > 0
	|				ТОГДА Движения.КлючНабор
	|		КОНЕЦ) КАК КлючНабор,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Движения.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|		И Движения.КлючСвязиПеремещение = &ПустойКлючСвязи ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ) КАК ИсходнаяПотребность
	|	
	|ПОМЕСТИТЬ НоменклатурныйПлан
	|
	|ИЗ
	|	ВсеТовары КАК Товары
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК Движения
	|	ПО Товары.Номенклатура   = Движения.Номенклатура
	|	 И Товары.Характеристика = Движения.Характеристика
	|	 И (Товары.Назначение    = Движения.Назначение
	|		ИЛИ Не Товары.Обособленно И Товары.Назначение В (Движения.НазначениеСтруктуры, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)))
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Идентификатор, Движения.Номенклатура, Движения.Характеристика, Движения.Склад, Движения.Назначение,
	|	Движения.ЗаказНаПроизводство, Движения.КлючНоменклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаПроизводство, КлючНоменклатура, КлючПартия";
	
	МассивТекстовЗапроса.Добавить(ТекстНоменклатурныйПлан);
	
	Запрос.Текст = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.Выполнить();
	
	ПолучитьИПоместитьВКэшСпособыОбеспечения(МенеджерВременныхТаблиц, "НоменклатурныйПлан");
	
	МассивТекстовЗапроса.Очистить();
	
	ТекстЗапросаРезультирующиеТаблицы = 
	"ВЫБРАТЬ
	|
	|	График.Номенклатура     КАК Номенклатура,
	|	График.Характеристика   КАК Характеристика,
	|	График.Склад            КАК Склад,
	|	График.Назначение       КАК Назначение,
	|
	|	График.ЗаказНаПоступление КАК ЗаказНаПоступление,
	|	График.ДатаДоступности    КАК ДатаДоступности,
	|
	|	График.Количество КАК Доступно
	|
	|ПОМЕСТИТЬ График
	|ИЗ
	|	ВсеТовары КАК Товары
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК График
	|	ПО Товары.Номенклатура   = График.Номенклатура
	|	 И Товары.Характеристика = График.Характеристика
	|	 И (Товары.Назначение = График.Назначение
	|		ИЛИ Не Товары.Обособленно И Товары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|
	|ГДЕ
	|	График.Количество > 0
	|		И График.СостояниеЗапаса В (&СостояниеЗапасов)
	|		И График.ХарактеристикаПотребности = &ХарактеристикаПотребности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура, Характеристика, Склад, Назначение
	|;
	|УНИЧТОЖИТЬ ПорцияРасчета
	|;
	|УНИЧТОЖИТЬ ТоварыПоПорции
	|;
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	План.ЗаказНаПроизводство КАК Ссылка
	|ПОМЕСТИТЬ ВсеЗаказы
	|ИЗ
	|	НоменклатурныйПлан КАК План
	|;"  + ?(ИспользуютсяАналоги, ТекстЗапросаАналогиМатериалов(Запрос), "")
	 + СтруктураЗаказаСлужебный.ТекстЗапросаВременнаяТаблицаОчередьЗаказов("ВсеЗаказы", "Очередь")
	 + "ВЫБРАТЬ
	|	НоменклатурныйПлан.КлючСвязиПеремещение КАК КлючСвязиПеремещение,
	|	НоменклатурныйПлан.КлючСвязиПотребности КАК КлючСвязиПотребности
	|ПОМЕСТИТЬ ЗаменаКлючей
	|ИЗ
	|	НоменклатурныйПлан КАК НоменклатурныйПлан
	|ГДЕ 
	|	&ИспользуютсяАналоги 
	|	И НоменклатурныйПлан.ЭтоАналог
	|	И НоменклатурныйПлан.КОбеспечению > 0
	|	И НоменклатурныйПлан.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючСвязиПеремещение
	|
	|;
	|ВЫБРАТЬ
	|	НоменклатурныйПлан.Номенклатура КАК Номенклатура,
	|	НоменклатурныйПлан.Характеристика КАК Характеристика,
	|	НоменклатурныйПлан.Склад КАК Склад,
	|	НоменклатурныйПлан.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	НоменклатурныйПлан.КлючНоменклатура КАК КлючНоменклатура,
	|	НоменклатурныйПлан.КлючПартия КАК КлючПартия,
	|	НоменклатурныйПлан.КлючНабор КАК КлючНабор,
	|	ЕСТЬNULL(ЗаменаКлючей.КлючСвязиПотребности, НоменклатурныйПлан.КлючСвязиПеремещение) КАК КлючСвязиПеремещение
	|ИЗ
	|	НоменклатурныйПлан КАК НоменклатурныйПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаменаКлючей КАК ЗаменаКлючей
	|		ПО НоменклатурныйПлан.КлючСвязиПеремещение = ЗаменаКлючей.КлючСвязиПеремещение
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КэшНСИ.Номенклатура.СхемаОбеспечения КАК СхемаОбеспечения,
	|	ЕСТЬNULL(КэшНСИ.СпособОбеспечения.ДлительностьВДнях, 0) * 86400 КАК ДлительностьПеремещения,
	|	КэшНСИ.Склад КАК СкладПолучатель,
	|	КэшНСИ.СпособОбеспечения.ИсточникОбеспеченияПотребностей КАК СкладОтправитель
	|ИЗ
	|	НоменклатурныйПлан КАК План
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ
	|		ПО План.Номенклатура = КэшНСИ.Номенклатура
	|			И План.Характеристика = КэшНСИ.Характеристика
	|			И План.ЗаказНаПроизводство = КэшНСИ.ЗаказНаПроизводство
	|ГДЕ
	|	КэшНСИ.Запланировать
	|;
	|
	|ВЫБРАТЬ
	|
	|	График.Номенклатура       КАК Номенклатура,
	|	График.Характеристика     КАК Характеристика,
	|	График.Склад              КАК Склад,
	|	График.Назначение         КАК Назначение,
	|
	|	График.ЗаказНаПоступление КАК ЗаказНаПоступление,
	|	График.ДатаДоступности    КАК ДатаПоступления,
	|
	|	ВЫБОР
	|		КОГДА График.ДатаДоступности = ДАТАВРЕМЯ(1,1,1) И График.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО ТОГДА
	|			1
	|		КОГДА График.ДатаДоступности <> ДАТАВРЕМЯ(1,1,1) И График.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ТОГДА
	|			2
	|		ИНАЧЕ
	|			3
	|	КОНЕЦ КАК ТипЗапаса,
	|	
	|	График.Доступно КАК Доступно,
	|
	|	-1 КАК НомерОчереди,
	|	-1 КАК ПорядокНормативногоГрафика
	|	
	|ИЗ
	|	График КАК График
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|
	|	План.Номенклатура       КАК Номенклатура,
	|	План.Характеристика     КАК Характеристика,
	|	План.Склад              КАК Склад,
	|	План.Назначение         КАК Назначение,
	|
	|	План.ЗаказНаПоступление КАК ЗаказНаПоступление,
	|	План.ДатаПоступления    КАК ДатаПоступления,
	|
	|	5 КАК ТипЗапаса,
	|	
	|	План.СвободныйВыпуск КАК Доступно,
	|
	|	ISNULL(Очередь.НомерОчереди, 0)        КАК НомерОчереди,
	|	ISNULL(-План.ДлительностьДоВыпуска, 0) КАК ПорядокНормативногоГрафика
	|	
	|ИЗ
	|	НоменклатурныйПлан КАК План
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Очередь КАК Очередь
	|		ПО Очередь.Ссылка = План.ЗаказНаПроизводство
	|	
	|ГДЕ
	|	План.СвободныйВыпуск > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад, Назначение, ТипЗапаса, НомерОчереди, ПорядокНормативногоГрафика, ДатаПоступления, ЗаказНаПоступление
	|;
	|
	|ВЫБРАТЬ
	|
	|	План.ИндексСтроки КАК ИндексСтроки,
	|
	|	План.Номенклатура   КАК Номенклатура,
	|	План.Номенклатура.СхемаОбеспечения КАК СхемаОбеспечения,
	|	План.Характеристика КАК Характеристика,
	|	План.Склад          КАК Склад,
	|
	|	ВЫБОР
	|		КОГДА План.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|			План.Назначение
	|		ИНАЧЕ
	|			План.НазначениеСтруктуры
	|	КОНЕЦ КАК Назначение,
	|	ВЫБОР
	|		КОГДА План.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК Обособленно,
	|
	|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	План.КлючПартия          КАК КлючПартия,
	|	План.КлючНоменклатура    КАК КлючНоменклатура,
	|	План.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|
	|	План.КОбеспечению КАК Требуется,
	|	План.Запланировано КАК Запланировано,
	|	План.КонтрольОграниченияЗацикливания КАК КонтрольОграниченияЗацикливания,
	|	План.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|
	|	ISNULL(Очередь.НомерОчереди, 0)        КАК НомерОчереди,
	|	ISNULL(-План.ДлительностьДоВыпуска, 0) КАК ПорядокНормативногоГрафика
	|	
	|ИЗ
	|	НоменклатурныйПлан КАК План
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Очередь КАК Очередь
	|		ПО Очередь.Ссылка = План.ЗаказНаПроизводство
	|
	|ГДЕ
	|	План.ИсходнаяПотребность И План.КОбеспечению > 0 И НЕ План.ЭтоПродукция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад, План.НазначениеГруппировка УБЫВ, НомерОчереди, Назначение УБЫВ, Обособленно УБЫВ, ПорядокНормативногоГрафика,
	|	  ВЫБОР
	|			КОГДА План.Этап ССЫЛКА Документ.ЭтапПроизводства2_2 ТОГДА
	|				1
	|			ИНАЧЕ
	|				2
	|	  КОНЕЦ,
	|	  ВЫБОР
	|			КОГДА План.Этап ССЫЛКА Документ.ЭтапПроизводства2_2 ТОГДА
	|				План.Этап
	|			ИНАЧЕ
	|				NULL
	|	  КОНЕЦ,
	|	  ИдентификаторВГруппеИзделий,
	|	  КлючПартия,
	|	  КлючНоменклатура
	|;
	|УНИЧТОЖИТЬ ВсеЗаказы; УНИЧТОЖИТЬ Очередь;
	|";
	
	МассивТекстовЗапроса.Добавить(ТекстЗапросаРезультирующиеТаблицы);
	
	Запрос.Текст = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоПакетов = РезультатЗапроса.Количество();
	
	Если ИспользуютсяАналоги Тогда
		ДанныеОбАналогах = ДанныеОбАналогахДляРасчетаСтруктурыЗаказа(МенеджерВременныхТаблиц);
	Иначе
		ДанныеОбАналогах = Неопределено;
	КонецЕсли;

	РезультатРаспределения = Новый ТаблицаЗначений();
	РезультатРаспределения.Колонки.Добавить("ИндексСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	РезультатРаспределения.Колонки.Добавить("Назначение", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.Назначение.Тип);
	РезультатРаспределения.Колонки.Добавить("ДатаПоступления", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.ДатаПоступления.Тип);
	РезультатРаспределения.Колонки.Добавить("ЗаказНаПоступление", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.ЗаказНаПоступление.Тип);
	РезультатРаспределения.Колонки.Добавить("Распределено", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	РезультатРаспределения.Колонки.Добавить("Номенклатура", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.Номенклатура.Тип);
	РезультатРаспределения.Колонки.Добавить("Характеристика", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.Характеристика.Тип);
	РезультатРаспределения.Колонки.Добавить("Склад", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.Склад.Тип);
	РезультатРаспределения.Колонки.Добавить("РазрешениеНаЗамену", Метаданные.РегистрыСведений.СтруктураЗаказа.Реквизиты.РазрешениеНаЗамену.Тип);
	РезультатРаспределения.Колонки.Добавить("ТипЗаписи", ОбщегоНазначения.ОписаниеТипаЧисло(1,0));
	РезультатРаспределения.Колонки.Добавить("КлючНоменклатура", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.КлючНоменклатура.Тип);
	РезультатРаспределения.Колонки.Добавить("КлючПартия", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.КлючПартия.Тип);
	РезультатРаспределения.Колонки.Добавить("КлючНабор", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.КлючНабор.Тип);
	РезультатРаспределения.Колонки.Добавить("КлючСвязиПеремещение", Метаданные.РегистрыСведений.СтруктураЗаказа.Реквизиты.КлючСвязиПеремещение.Тип);
	РезультатРаспределения.Колонки.Добавить("КлючСвязиАналог", Метаданные.РегистрыСведений.СтруктураЗаказа.Реквизиты.КлючСвязиПеремещение.Тип);
	РезультатРаспределения.Колонки.Добавить("КлючНоменклатураПотребности", Метаданные.РегистрыСведений.СтруктураЗаказа.Реквизиты.КлючСвязиПеремещение.Тип);
	РезультатРаспределения.Колонки.Добавить("ДлительностьПеремещения", ОбщегоНазначения.ОписаниеТипаЧисло(14, 4));
	РезультатРаспределения.Колонки.Добавить("КоличествоНаЕдиницуПартииЗапуска", Метаданные.РегистрыСведений.СтруктураЗаказа.Реквизиты.КоличествоНаЕдиницуПартииЗапуска.Тип);
	
	РаспределитьЗапасы(РезультатЗапроса[КоличествоПакетов-3], РезультатЗапроса[КоличествоПакетов-4], РезультатЗапроса[КоличествоПакетов-5], РезультатРаспределения, ДанныеОбАналогах, РезультатЗапроса[КоличествоПакетов-6]);
	ПоместитьРезультатРаспределенияЗапасовВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, РезультатРаспределения, ПараметрыРасчета.РассчитыватьИзменения);
	РезультатРаспределения = Неопределено;
	
	РассчитатьИзмененияИЗаписатьРезультатРаспределенияЗапасов(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|
	|	План.Номенклатура        КАК Номенклатура,
	|	План.Характеристика      КАК Характеристика,
	|	План.Склад               КАК Склад,
	|	План.Назначение          КАК Назначение,
	|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|
	|	КэшНСИ.ТипОбеспечения    КАК ТипОбеспечения,
	|	КэшНСИ.Спецификация      КАК Спецификация,
	|
	|	КэшНСИ.ИдентификаторОшибки КАК ИдентификаторОшибки
	|
	|ПОМЕСТИТЬ ПланПроизводства
	|ИЗ
	|	РасчетИзменений КАК План
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ
	|	ПО План.Номенклатура        = КэшНСИ.Номенклатура
	|	 И План.Характеристика      = КэшНСИ.Характеристика
	|	 И План.Склад               = КэшНСИ.Склад
	|	 И План.Назначение          = КэшНСИ.Назначение
	|	 И План.ЗаказНаПроизводство = КэшНСИ.ЗаказНаПроизводство
	|	 И КэшНСИ.Запланировать
	|	И (КэшНСИ.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство))
	|
	|
	|ГДЕ
	|	ВЫБОР
	|		КОГДА План.ЭтоПродукция ИЛИ КэшНСИ.ЭтоРазбираемоеИзделие ТОГДА // ограничение зацикливания разборки
	|			План.Заказано <> План.Запланировано
	|		ИНАЧЕ
	|			План.КоличествоКПроизводству <> 0
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Спецификация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() И Выборка.Количество > 0 Тогда
		ЗапланироватьПроизводство(ПараметрыРасчета, МенеджерВременныхТаблиц, "ПланПроизводства", ПараметрыДействия.Очередь);
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьЗапасы(РезультатТребуется, РезультатЗапасы, РезультатСклады, РезультатРаспределения, ТаблицаРазрешений, РезультатКэшКлючейПартий)
	
	Если РезультатТребуется.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикТовары = СкопироватьКолонки(РезультатЗапасы.Колонки, "Номенклатура,Характеристика,Склад,Назначение");
	
	ГрафикТовары.Колонки.Добавить("ЭтоАналог",      Новый ОписаниеТипов("Булево"));
	ГрафикТовары.Колонки.Добавить("ГрафикРазряжен", Новый ОписаниеТипов("Булево"));
	ГрафикТовары.Колонки.Добавить("Индекс",         Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	ГрафикТовары.Колонки.Добавить("Граница",        Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	
	ГрафикЕстьДоступно = Неопределено;
	
	График = РезультатЗапасы.Выгрузить();
	Индекс = 0;
		
	ГрафикТовара = Неопределено;
	
	Пока График.Количество() > Индекс Цикл
		
		ТекущаяСтрока = График[Индекс];
		
		Если НЕ (Индекс > 0
			 И ГрафикТовара.Номенклатура   = ТекущаяСтрока.Номенклатура
			 И ГрафикТовара.Характеристика = ТекущаяСтрока.Характеристика
			 И ГрафикТовара.Склад          = ТекущаяСтрока.Склад
			 И ГрафикТовара.Назначение     = ТекущаяСтрока.Назначение)  Тогда

			ГрафикТовара = ГрафикТовары.Добавить();
			ЗаполнитьЗначенияСвойств(ГрафикТовара, ТекущаяСтрока);
			ГрафикТовара.Индекс = Индекс;

		КонецЕсли;
		
		Индекс               = Индекс + 1;
		ГрафикТовара.Граница = Индекс;
		
	КонецЦикла;
	
	НаличиеОстатков = График.Скопировать(,"Номенклатура, Характеристика, Склад");
	НаличиеОстатков.Свернуть("Номенклатура, Характеристика, Склад");
	НаличиеОстатков.Индексы.Добавить("Номенклатура, Характеристика, Склад");
	ПоискНаличиеОстатков = Новый Структура("Номенклатура, Характеристика, Склад");
	
	ТаблицаРасчетаПеремещений = СкопироватьКолонки(РезультатРаспределения.Колонки, "ИндексСтроки,Номенклатура,Характеристика,РазрешениеНаЗамену,КлючНоменклатура,КлючПартия,Склад");
	ТаблицаРасчетаПеремещений.Колонки.Добавить("ПорядковыйНомер", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаРасчетаПеремещений.Колонки.Добавить("ЗаказНаПроизводство", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.ЗаказНаПроизводство.Тип);
	ТаблицаРасчетаПеремещений.Колонки.Добавить("КоличествоНаЕдиницуПартииЗапуска", Метаданные.РегистрыСведений.СтруктураЗаказа.Реквизиты.КоличествоНаЕдиницуПартииЗапуска.Тип);

	ТаблицаСкладов = РезультатСклады.Выгрузить();
	ТаблицаСкладов.Индексы.Добавить("СхемаОбеспечения, СкладПолучатель");
	
	ЦепочкаСкладов = Новый ТаблицаЗначений;
	ЦепочкаСкладов.Колонки.Добавить("СкладОтправитель", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.Склад.Тип);
	ЦепочкаСкладов.Колонки.Добавить("СкладПолучатель", Метаданные.РегистрыСведений.СтруктураЗаказа.Измерения.Склад.Тип);
	ЦепочкаСкладов.Колонки.Добавить("ДлительностьПеремещения", ОбщегоНазначения.ОписаниеТипаЧисло(14, 4));
	ЦепочкаСкладов.Колонки.Добавить("ПорядковыйНомер", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	ПоискСкладов = Новый Структура("СхемаОбеспечения, СкладПолучатель");
	ПоискСкладовСравнение = Новый Структура("СхемаОбеспечения, СкладПолучатель");
	
	СоответствиеЦепочекСкладов = Новый Соответствие;
	МассивСкладовПроверкаЗацикливания = Новый Массив;
	ДлительностьПеремещенияСумма = 0;
	
	ИтерацияРаспределениеМатериалов = "Материалы";
	ИтерацияРаспределениеПриоритетныхАналогов = "ПриоритетныеАналоги";
	ИтерацияРаспределениеОбычныхАналогов = "ОбычныеАналоги";
	
	ИтерацииРаспределенияЗапасов = Новый Массив;
	ИтерацииРаспределенияЗапасов.Добавить(ИтерацияРаспределениеМатериалов);
	
	ЕстьАналоги = ТипЗнч(ТаблицаРазрешений) = Тип("ТаблицаЗначений") И ТаблицаРазрешений.Количество() > 0;
	
	Если ЕстьАналоги Тогда
		ИтерацииРаспределенияЗапасов.Вставить(0, ИтерацияРаспределениеПриоритетныхАналогов);
		ИтерацииРаспределенияЗапасов.Добавить(ИтерацияРаспределениеОбычныхАналогов);
		ТаблицаРазрешений.Индексы.Добавить("Номенклатура, Характеристика, Ссылка, ПриоритетныйАналог");
	КонецЕсли;
		
	ТребуетсяОстаток = Неопределено;
	
	ПоискРазрешений = Новый Структура("Номенклатура, Характеристика, Ссылка, ПриоритетныйАналог");
	АналитикаАналога = Новый Структура("Номенклатура, Характеристика, Склад, Назначение");
	
	ГрафикТовары.Индексы.Добавить("Номенклатура,Характеристика,Склад,Назначение");
	
	ТипЗаписиРаспределениеЗапасовРезерв = ТипЗаписиРаспределениеЗапасовРезерв();
	ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение = ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение();
	ТипЗаписиРаспределениеЗапасовТребуетсяПотребление =  ТипЗаписиРаспределениеЗапасовТребуетсяПотребление();
	ТипЗаписиРаспределениеЗапасовЗакрытиеПотребности = ТипЗаписиРаспределениеЗапасовЗакрытиеПотребности();
	ТипЗаписиРаспределениеЗапасовЗамена = ТипЗаписиРаспределениеЗапасовЗамена();
	ТипЗаписиРаспределениеЗапасовНеОбеспечивать = ТипЗаписиРаспределениеЗапасовНеОбеспечивать();
	
	Требуется = Неопределено;
	Индекс = -1;
	Граница = -1;
	
	Аналитика = Новый Структура("Номенклатура,Характеристика,Склад,Назначение");
	ПустойКлючСвязи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ЕстьЗацикливаниеЦепочки = Ложь;
	
	ТаблицаКэшКлючейПартийПеремещений = РезультатКэшКлючейПартий.Выгрузить();
	ТаблицаКэшКлючейПартийПеремещений.Индексы.Добавить("Номенклатура, Характеристика, Склад, ЗаказНаПроизводство, КлючСвязиПеремещение");
	ПоискКлючейПартий = Новый Структура("Номенклатура, Характеристика, Склад, ЗаказНаПроизводство, КлючСвязиПеремещение");
	РезультатРаспределенияНеОбеспечивать = РезультатРаспределения.СкопироватьКолонки();

	Выборка = РезультатТребуется.Выбрать();

	ЕстьЗаписиВВыборке = Выборка.Следующий();
	
	Пока ЕстьЗаписиВВыборке Цикл
		
		ПоискКлючейПартий.ЗаказНаПроизводство = Выборка.ЗаказНаПроизводство;
		ПоискКлючейПартий.КлючСвязиПеремещение = Выборка.КлючНоменклатура;
		ПоискСкладов.СхемаОбеспечения = Выборка.СхемаОбеспечения;
		ПоискСкладов.СкладПолучатель = Выборка.Склад;
		
		ПерезаполнитьДанныеСкладов = НЕ (ПоискСкладов.СхемаОбеспечения = ПоискСкладовСравнение.СхемаОбеспечения
			И ПоискСкладов.СкладПолучатель = ПоискСкладовСравнение.СкладПолучатель);
		ИндексСклада = 1;
		
		Если ПерезаполнитьДанныеСкладов Тогда
			
			ЕстьЗацикливаниеЦепочки = Ложь;
			ДлительностьПеремещенияСумма = 0;
			ЦепочкаСкладов.Очистить();
			МассивСкладовПроверкаЗацикливания.Очистить();
			МассивСкладовПроверкаЗацикливания.Добавить(Выборка.Склад);
			
			НоваяСтрокаЦепочки = ЦепочкаСкладов.Добавить();
			НоваяСтрокаЦепочки.СкладОтправитель = Выборка.Склад;
			НоваяСтрокаЦепочки.ПорядковыйНомер = ИндексСклада;
		
		КонецЕсли;
		
		Пока ПерезаполнитьДанныеСкладов Цикл
		
			НайденныеСклады = ТаблицаСкладов.НайтиСтроки(ПоискСкладов);
			ДобавленСклад = Ложь;
		
			Для каждого СтрокаТаблицыСкладов Из НайденныеСклады Цикл
				
				Если МассивСкладовПроверкаЗацикливания.Найти(СтрокаТаблицыСкладов.СкладПолучатель) = Неопределено
				   И ЗначениеЗаполнено(СтрокаТаблицыСкладов.СкладПолучатель)
				   И ТипЗнч(СтрокаТаблицыСкладов.СкладПолучатель) = Тип("СправочникСсылка.Склады") Тогда
					МассивСкладовПроверкаЗацикливания.Добавить(СтрокаТаблицыСкладов.СкладПолучатель);
					ДобавленСклад = Истина;
				КонецЕсли;
				
				Если МассивСкладовПроверкаЗацикливания.Найти(СтрокаТаблицыСкладов.СкладОтправитель) = Неопределено
				   И ЗначениеЗаполнено(СтрокаТаблицыСкладов.СкладОтправитель)
				   И ТипЗнч(СтрокаТаблицыСкладов.СкладОтправитель) = Тип("СправочникСсылка.Склады") Тогда
					МассивСкладовПроверкаЗацикливания.Добавить(СтрокаТаблицыСкладов.СкладОтправитель);
					ДобавленСклад = Истина;
				КонецЕсли;
				
				ПоискСкладов.СкладПолучатель = СтрокаТаблицыСкладов.СкладОтправитель;
				
				Если ДобавленСклад Тогда
					
					ИндексСклада = ИндексСклада + 1;
					
					НоваяСтрокаЦепочки = ЦепочкаСкладов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаЦепочки, СтрокаТаблицыСкладов);
					ДлительностьПеремещения = ?(СтрокаТаблицыСкладов.ДлительностьПеремещения > 0, СтрокаТаблицыСкладов.ДлительностьПеремещения, 0.0001);
					ДлительностьПеремещенияСумма = ДлительностьПеремещенияСумма + ДлительностьПеремещения;
					НоваяСтрокаЦепочки.ДлительностьПеремещения = ДлительностьПеремещенияСумма;
					НоваяСтрокаЦепочки.ПорядковыйНомер = ИндексСклада;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НайденныеСклады.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если Не ДобавленСклад И ЗначениеЗаполнено(ПоискСкладов.СкладПолучатель) И ТипЗнч(ПоискСкладов.СкладПолучатель) = Тип("СправочникСсылка.Склады") Тогда
				ЕстьЗацикливаниеЦепочки = Истина;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		ПоискСкладовСравнение.СхемаОбеспечения = Выборка.СхемаОбеспечения;
		ПоискСкладовСравнение.СкладПолучатель = Выборка.Склад;
				
		СкладПотребности = МассивСкладовПроверкаЗацикливания[МассивСкладовПроверкаЗацикливания.ВГраница()];
		
		ЗамененоВсего = 0;
		ТребуетсяОстаток = Выборка.Требуется;
		ЗаполнитьЗначенияСвойств(Аналитика, Выборка);
		
		Если ЕстьАналоги Тогда
			
			ЗаполнитьЗначенияСвойств(ПоискРазрешений, Аналитика);
			ПоискРазрешений.ПриоритетныйАналог = Истина;
			ПоискРазрешений.Ссылка = Выборка.ИндексСтроки;
			
			ДоступныеПриоритетныеРазрешения = ТаблицаРазрешений.НайтиСтроки(ПоискРазрешений);
			ЕстьПриоритетныеРазрешения = ДоступныеПриоритетныеРазрешения.Количество() > 0;
			
			ПоискРазрешений.ПриоритетныйАналог = Ложь;
			ДоступныеРазрешения = ТаблицаРазрешений.НайтиСтроки(ПоискРазрешений);
			ЕстьОбычныеРазрешения = ДоступныеРазрешения.Количество() > 0;
		
		КонецЕсли;
		
		КлючНоменклатураСкладаПотребности = Неопределено;
		КлючПартияСкладаПотребности = Неопределено;
		ЕстьПеремещения = Ложь;
		
		Для каждого ИтерацияРаспределения Из ИтерацииРаспределенияЗапасов Цикл
			
			Если ТребуетсяОстаток = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если ИтерацияРаспределения = ИтерацияРаспределениеПриоритетныхАналогов 
			 ИЛИ ИтерацияРаспределения = ИтерацияРаспределениеОбычныхАналогов Тогда
			
				КоллекцияРазрешений = ?(ИтерацияРаспределения = ИтерацияРаспределениеПриоритетныхАналогов, ДоступныеПриоритетныеРазрешения, ДоступныеРазрешения);
				ФлагНаличияРазрешений = ?(ИтерацияРаспределения = ИтерацияРаспределениеПриоритетныхАналогов, ЕстьПриоритетныеРазрешения, ЕстьОбычныеРазрешения);
			
				Если ЕстьАналоги И ФлагНаличияРазрешений Тогда
					
					Для каждого СтрокаСкладов Из ЦепочкаСкладов Цикл
						
						Склад = СтрокаСкладов.СкладОтправитель;
						
						Если ТребуетсяОстаток = 0 Тогда
							Прервать;
						КонецЕсли;
						
						Аналитика.Склад = Склад;
						СкладСовпадает = Склад = Выборка.Склад;
						
						Для каждого СтрокаРазрешение Из КоллекцияРазрешений Цикл
							
							КоэффициентРаспределения = ПроизводствоКлиентСервер.КоэффициентПоНормативу(
								СтрокаРазрешение.КонтролироватьКратность, ТребуетсяОстаток, СтрокаРазрешение.КоличествоУпаковок, СтрокаРазрешение.ДанныеУпаковки);
							
							АналогиРазрешения = СтрокаРазрешение.Аналоги;
							
							Для каждого СтрокаАналог Из АналогиРазрешения Цикл
								
								СтрокаАналог.КлючНоменклатураАналог = Новый УникальныйИдентификатор;
								
								ЗаполнитьЗначенияСвойств(АналитикаАналога, Аналитика);
								ЗаполнитьЗначенияСвойств(АналитикаАналога, СтрокаАналог);
								
								ГрафикТовара = ГрафикТовара(ГрафикТовары, АналитикаАналога, Граница, Индекс, Выборка); // СтрокаТаблицыЗначений
								
								УсловиеГрафикТовара = Истина;
								Остаток = 0;
								Пока УсловиеГрафикТовара Цикл
									
									СтрокаАналог.ГрафикиТовара.Добавить(ГрафикТовара);
									ГраницаОбход = Граница;
									ИндексОбход = Индекс;
									
									Пока ГраницаОбход > ИндексОбход Цикл
										
										Запас = График[ИндексОбход];
										
										Если ЗначениеЗаполнено(Запас.ЗаказНаПоступление) 
										   И ИтерацияРаспределения = ИтерацияРаспределениеОбычныхАналогов Тогда
										
											ИндексОбход = ИндексОбход + 1;
											Продолжить;
										
										КонецЕсли;
										
										Остаток = Остаток + Запас.Доступно;
										ИндексОбход = ИндексОбход + 1;
										
									КонецЦикла;
									
									УсловиеГрафикТовара = СледующийГрафикТовара(ГрафикТовара, АналитикаАналога, Граница, Индекс, Выборка);
								
								КонецЦикла;
								
								Коэффициент = ПроизводствоКлиентСервер.КоэффициентПоНормативу(
									СтрокаРазрешение.КонтролироватьКратность, Остаток, СтрокаАналог.КоличествоУпаковок, СтрокаАналог.ДанныеУпаковки);
									
								КоэффициентРаспределения = Мин(КоэффициентРаспределения, Коэффициент);
								
							КонецЦикла;
							
							Если КоэффициентРаспределения > 0 Тогда
								
								ЗамененоПоСтроке = РасчетноеКоличествоНоменклатуры(СтрокаРазрешение.КоличествоУпаковок, КоэффициентРаспределения, СтрокаРазрешение.ДанныеУпаковки);
								ТребуетсяОстаток = ТребуетсяОстаток - ЗамененоПоСтроке;
								ЗамененоВсего = ЗамененоВсего + ЗамененоПоСтроке;
								
								КоэффициентКоличествоНаЕдиницуПартииЗапуска = ПроизводствоКлиентСервер.КоэффициентПоНормативу(
									СтрокаРазрешение.КонтролироватьКратность, Выборка.КоличествоНаЕдиницуПартииЗапуска, СтрокаРазрешение.КоличествоУпаковок, СтрокаАналог.ДанныеУпаковки);
								
								Для каждого СтрокаАналог Из АналогиРазрешения Цикл
									
									ОсталосьРаспределить = РасчетноеКоличествоНоменклатуры(СтрокаАналог.КоличествоУпаковок, КоэффициентРаспределения, СтрокаАналог.ДанныеУпаковки);
									КоличествоНаЕдиницуПартииЗапуска = РасчетноеКоличествоНоменклатуры(СтрокаАналог.КоличествоУпаковок, КоэффициентКоличествоНаЕдиницуПартииЗапуска, СтрокаАналог.ДанныеУпаковки);
									
									СтрокаТаблицыРасчетаПеремещений = ТаблицаРасчетаПеремещений.Добавить();
									СтрокаТаблицыРасчетаПеремещений.РазрешениеНаЗамену = СтрокаРазрешение.Разрешение;
									СтрокаТаблицыРасчетаПеремещений.ИндексСтроки = Выборка.ИндексСтроки;
									СтрокаТаблицыРасчетаПеремещений.ПорядковыйНомер = СтрокаСкладов.ПорядковыйНомер;
									СтрокаТаблицыРасчетаПеремещений.КоличествоНаЕдиницуПартииЗапуска = КоличествоНаЕдиницуПартииЗапуска;
									ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасчетаПеремещений, СтрокаАналог, "Номенклатура, Характеристика");
									ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасчетаПеремещений, Выборка, "КлючНоменклатура, КлючПартия, Склад, ЗаказНаПроизводство");
									ЕстьПеремещения = Истина;
									
									КлючИзКэша = Новый УникальныйИдентификатор;
									ЗаполнитьЗначенияСвойств(ПоискКлючейПартий, СтрокаАналог, "Номенклатура, Характеристика");
									ПоискКлючейПартий.Склад = Склад;
									Для Каждого СтрокаТаблицыКэша Из ТаблицаКэшКлючейПартийПеремещений.НайтиСтроки(ПоискКлючейПартий) Цикл
										
										СтрокаАналог.КлючНоменклатураАналог = СтрокаТаблицыКэша.КлючНоменклатура;
										КлючИзКэша = СтрокаТаблицыКэша.КлючПартия;
										Прервать;
									
									КонецЦикла;
									
									КлючПартия = ?(СкладСовпадает, Выборка.КлючПартия, КлючИзКэша);
									
									Для каждого ГрафикТовара Из СтрокаАналог.ГрафикиТовара Цикл // СтрокаТаблицыЗначений
										
										Если ГрафикТовара = Неопределено Тогда
											Продолжить;
										КонецЕсли;
										
										Индекс = ГрафикТовара.Индекс; // Число
										Граница = ГрафикТовара.Граница; // Число
										
										Пока ОсталосьРаспределить > 0 И Граница > Индекс Цикл
										
											Запас = График[Индекс];
											Если ЗначениеЗаполнено(Запас.ЗаказНаПоступление) 
											   И ИтерацияРаспределения = ИтерацияРаспределениеОбычныхАналогов Тогда
											
												Индекс = Индекс + 1;
												Продолжить;
											
											КонецЕсли;
									
											Распределено = Мин(ОсталосьРаспределить, Запас.Доступно);
											
											Если Распределено > 0 Тогда
											
												Потребность = РезультатРаспределения.Добавить();
												ЗаполнитьЗначенияСвойств(Потребность, Выборка, "ИндексСтроки");
												ЗаполнитьЗначенияСвойств(Потребность, Запас, "Номенклатура,Характеристика,ДатаПоступления,ЗаказНаПоступление,Назначение,Склад");
												Потребность.Распределено = Распределено;
												Потребность.РазрешениеНаЗамену = СтрокаРазрешение.Разрешение;
												Потребность.ДлительностьПеремещения = СтрокаСкладов.ДлительностьПеремещения;
												Потребность.КоличествоНаЕдиницуПартииЗапуска = КоличествоНаЕдиницуПартииЗапуска;
												
												Потребность.КлючНоменклатура = СтрокаАналог.КлючНоменклатураАналог;
												Потребность.КлючПартия = КлючПартия;
												Потребность.КлючНоменклатураПотребности = Выборка.КлючНоменклатура;
												
											Иначе
												
												ГрафикТовара.ГрафикРазряжен = ГрафикТовара.ГрафикРазряжен Или Запас.Доступно > 0;
												
												Если ГрафикЕстьДоступно = Неопределено И Запас.Доступно > 0 Тогда
													ГрафикЕстьДоступно = ГрафикТовара;
												КонецЕсли;
												
												Если Не ГрафикТовара.ГрафикРазряжен Тогда
													Прервать;
												Иначе
													Индекс = Индекс + 1;
													Продолжить;
												КонецЕсли;	
											
											КонецЕсли;
											
											Запас.Доступно = Запас.Доступно - Распределено;
											ОсталосьРаспределить = ОсталосьРаспределить - Распределено;
											
											Если Запас.Доступно > 0 Тогда
												Продолжить;
											Иначе
												Если Индекс = ГрафикТовара.Индекс Тогда
													ГрафикТовара.Индекс = ГрафикТовара.Индекс + 1;
													ГрафикТовара.ГрафикРазряжен = Ложь;
												КонецЕсли;
											КонецЕсли;
											
											Индекс = Индекс + 1;	
										
										КонецЦикла;
										
									КонецЦикла;
									
									СтрокаАналог.ГрафикиТовара.Очистить();
									СтрокаАналог.КлючНоменклатураАналог = ПустойКлючСвязи;
									
								КонецЦикла;
								
							КонецЕсли;
							
						КонецЦикла;	
						
					КонецЦикла;	
				
				КонецЕсли;
				
			Иначе // распределение материалов
				
				ЗаполнитьЗначенияСвойств(ПоискНаличиеОстатков, Выборка, "Номенклатура, Характеристика");
				
				Для каждого СтрокаСкладов Из ЦепочкаСкладов Цикл
					
					Если ТребуетсяОстаток = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Склад = СтрокаСкладов.СкладОтправитель;
					
					ПоискНаличиеОстатков.Склад = Склад;
					ЕстьСтроки = НаличиеОстатков.НайтиСтроки(ПоискНаличиеОстатков).Количество() > 0;
					
					Если Не ЕстьСтроки Тогда
						Продолжить;
					КонецЕсли;
					
					СкладСовпадает = Склад = Выборка.Склад;
					
					Аналитика.Склад = Склад;
					
					КлючИзКэша = Новый УникальныйИдентификатор;
					КлючНоменклатураМатериал = Новый УникальныйИдентификатор;
					ЗаполнитьЗначенияСвойств(ПоискКлючейПартий, Выборка, "Номенклатура, Характеристика");
					ПоискКлючейПартий.Склад = Склад;
					Для Каждого СтрокаТаблицыКэша Из ТаблицаКэшКлючейПартийПеремещений.НайтиСтроки(ПоискКлючейПартий) Цикл
						
						КлючНоменклатураМатериал = СтрокаТаблицыКэша.КлючНоменклатура;
						КлючИзКэша = СтрокаТаблицыКэша.КлючПартия;
						Прервать;
					
					КонецЦикла;
					КлючПартия = ?(СкладСовпадает, Выборка.КлючПартия, КлючИзКэша);
					
					ГрафикТовара = ГрафикТовара(ГрафикТовары, Аналитика, Граница, Индекс, Выборка); // СтрокаТаблицыЗначений
					КлючНоменклатураМатериал = ?(СкладСовпадает, Выборка.КлючНоменклатура, КлючНоменклатураМатериал);
					
					Если Склад = СкладПотребности Тогда
								
						КлючНоменклатураСкладаПотребности = КлючНоменклатураМатериал;
						КлючПартияСкладаПотребности = КлючПартия;
					
					КонецЕсли;
					
					Пока ЕстьЗаписиВВыборке
						И Аналитика.Номенклатура   = Выборка.Номенклатура
						И Аналитика.Характеристика = Выборка.Характеристика
						И Аналитика.Склад          = Склад
						И Аналитика.Назначение     = Выборка.Назначение Цикл
						
						Требуется = ?(Не Требуется = Неопределено, Требуется, ТребуетсяОстаток);
						
						Пока Требуется > 0 И Граница > Индекс Цикл
							
							Запас = График[Индекс];
							
							Если ЗапасДоступен(Выборка, Запас) Тогда
								
								Распределено = Мин(Требуется, Запас.Доступно);

								Потребность = РезультатРаспределения.Добавить();
								ЗаполнитьЗначенияСвойств(Потребность, Выборка, "ИндексСтроки");
								ЗаполнитьЗначенияСвойств(Потребность, Запас, "Номенклатура, Характеристика,ДатаПоступления,ЗаказНаПоступление,Назначение,Склад");
								Потребность.Распределено = Распределено;
								
								Потребность.КлючНоменклатура = КлючНоменклатураМатериал;
								Потребность.КлючПартия = КлючПартия;
								Потребность.ДлительностьПеремещения = СтрокаСкладов.ДлительностьПеремещения;
								Потребность.КлючНоменклатураПотребности = Выборка.КлючНоменклатура;
								
								Если НЕ СкладСовпадает Тогда
											
									СтрокаТаблицыРасчетаПеремещений = ТаблицаРасчетаПеремещений.Добавить();
									СтрокаТаблицыРасчетаПеремещений.РазрешениеНаЗамену = Документы.РазрешениеНаЗаменуМатериалов.ПустаяСсылка();
									СтрокаТаблицыРасчетаПеремещений.ИндексСтроки = Выборка.ИндексСтроки;
									СтрокаТаблицыРасчетаПеремещений.ПорядковыйНомер = СтрокаСкладов.ПорядковыйНомер;
									ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасчетаПеремещений, Выборка, "Номенклатура, Характеристика, КлючНоменклатура, КлючПартия, Склад, ЗаказНаПроизводство");
									ЕстьПеремещения = Истина;
								
								КонецЕсли;
								
							Иначе
								
								ГрафикТовара.ГрафикРазряжен = ГрафикТовара.ГрафикРазряжен Или Запас.Доступно > 0;
								
								Если ГрафикЕстьДоступно = Неопределено И Запас.Доступно > 0 Тогда
									ГрафикЕстьДоступно = ГрафикТовара;
								КонецЕсли;
								
								Если Не ГрафикТовара.ГрафикРазряжен Тогда
									Прервать;
								Иначе
									Индекс = Индекс + 1;
									Продолжить;
								КонецЕсли;
								
							КонецЕсли;
							
							Запас.Доступно = Запас.Доступно - Распределено;
							Требуется = Требуется - Распределено;
							ТребуетсяОстаток = ТребуетсяОстаток - Распределено;
							
							Если Запас.Доступно > 0 Тогда
								Продолжить;
							Иначе
								Если Индекс = ГрафикТовара.Индекс Тогда
									ГрафикТовара.Индекс = ГрафикТовара.Индекс + 1;
									ГрафикТовара.ГрафикРазряжен = Ложь;
								КонецЕсли;
							КонецЕсли;
							
							Индекс = Индекс + 1;
							
						КонецЦикла;
						
						Если Требуется > 0 И СледующийГрафикТовара(ГрафикТовара, Аналитика, Граница, Индекс, Выборка) Тогда
							Продолжить;
						КонецЕсли;
						
						Если ГрафикЕстьДоступно <> Неопределено Тогда
							ГрафикТовара = ГрафикЕстьДоступно;
							Индекс  = ГрафикТовара.Индекс;
							Граница = ГрафикТовара.Граница;
						КонецЕсли;
						
						ГрафикЕстьДоступно = Неопределено;
						Требуется = Неопределено;
						
						Прервать;
						
					КонецЦикла;
					
				КонецЦикла;	
			
			КонецЕсли;	
		
		КонецЦикла;
		
		// Фиксация оставшейся потребности в материале
		
		Если ТребуетсяОстаток > 0 Тогда
			
			Потребность = РезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(Потребность, Выборка);
			Потребность.ТипЗаписи = ТипЗаписиРаспределениеЗапасовЗакрытиеПотребности;
			Потребность.Склад = СкладПотребности;
			Потребность.Распределено = ТребуетсяОстаток;
			Потребность.КлючНоменклатураПотребности = Выборка.КлючНоменклатура;
			
			КлючИзКэша = Новый УникальныйИдентификатор;
			КлючНоменклатураПотребность = Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(ПоискКлючейПартий, Потребность, "Номенклатура, Характеристика, Склад");
			Для Каждого СтрокаТаблицыКэша Из ТаблицаКэшКлючейПартийПеремещений.НайтиСтроки(ПоискКлючейПартий) Цикл
				
				КлючНоменклатураПотребность = СтрокаТаблицыКэша.КлючНоменклатура;
				КлючИзКэша = СтрокаТаблицыКэша.КлючПартия;
				Прервать;
			
			КонецЦикла;
			
			Потребность.КлючНоменклатура = ?(КлючНоменклатураСкладаПотребности <> Неопределено, КлючНоменклатураСкладаПотребности, КлючНоменклатураПотребность);
			Потребность.КлючПартия = ?(КлючПартияСкладаПотребности <> Неопределено, КлючПартияСкладаПотребности, КлючИзКэша);
			Потребность.ДлительностьПеремещения = ДлительностьПеремещенияСумма;
			
			Если НЕ Выборка.Обособленно Тогда
				Потребность.Назначение = Справочники.Назначения.ПустаяСсылка();
			КонецЕсли;
			
			СкладСовпадает = СкладПотребности = Выборка.Склад;
			
			Если НЕ СкладСовпадает Тогда
									
				СтрокаТаблицыРасчетаПеремещений = ТаблицаРасчетаПеремещений.Добавить();
				СтрокаТаблицыРасчетаПеремещений.РазрешениеНаЗамену = Документы.РазрешениеНаЗаменуМатериалов.ПустаяСсылка();
				СтрокаТаблицыРасчетаПеремещений.ИндексСтроки = Выборка.ИндексСтроки;
				СтрокаТаблицыРасчетаПеремещений.ПорядковыйНомер = МассивСкладовПроверкаЗацикливания.Количество();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасчетаПеремещений, Выборка, "Номенклатура, Характеристика, КлючНоменклатура, КлючПартия, Склад, ЗаказНаПроизводство");
				ЕстьПеремещения = Истина;
			
			КонецЕсли;
			
			Если ЕстьЗацикливаниеЦепочки Тогда
				
				Потребность = РезультатРаспределенияНеОбеспечивать.Добавить(); // Запись Перемещение
				ЗаполнитьЗначенияСвойств(Потребность, Выборка);
				Потребность.ТипЗаписи = ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение;
				Потребность.Склад = СкладПотребности;
				Потребность.Распределено = ТребуетсяОстаток;
								
				КлючПартияПеремещениеЗацикливание = Новый УникальныйИдентификатор;
				
				Потребность.КлючНоменклатура = ?(КлючНоменклатураСкладаПотребности <> Неопределено, КлючНоменклатураСкладаПотребности, Новый УникальныйИдентификатор);
				Потребность.КлючПартия = КлючПартияПеремещениеЗацикливание;
				Потребность.ДлительностьПеремещения = ДлительностьПеремещенияСумма;
				
				Если НЕ Выборка.Обособленно Тогда
					Потребность.Назначение = Справочники.Назначения.ПустаяСсылка();
				КонецЕсли;
				
				Потребность = РезультатРаспределенияНеОбеспечивать.Добавить(); // Запись Потребление - Не обеспечивать
				ЗаполнитьЗначенияСвойств(Потребность, Выборка);
				Потребность.ТипЗаписи = ТипЗаписиРаспределениеЗапасовНеОбеспечивать;
				Потребность.Склад = Выборка.Склад;
				Потребность.Распределено = ТребуетсяОстаток;
				
				Потребность.КлючНоменклатура = Новый УникальныйИдентификатор;
				Потребность.КлючПартия = КлючПартияПеремещениеЗацикливание;
				Потребность.ДлительностьПеремещения = ДлительностьПеремещенияСумма;
				
				Если НЕ Выборка.Обособленно Тогда
					Потребность.Назначение = Справочники.Назначения.ПустаяСсылка();
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
		// Отражение замененного количества
		
		Если ЗамененоВсего > 0 Тогда
		
			Потребность = РезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(Потребность, Выборка);
			Потребность.Распределено = ЗамененоВсего;
			
			Потребность.ТипЗаписи = ТипЗаписиРаспределениеЗапасовЗамена;
			Потребность.КлючНоменклатураПотребности = Выборка.КлючНоменклатура;
			
		КонецЕсли;
		
		Если ЕстьПеремещения Тогда
		
			СоответствиеЦепочекСкладов.Вставить(Выборка.ИндексСтроки, ЦепочкаСкладов.Скопировать());
		
		КонецЕсли;
			
		ЕстьЗаписиВВыборке = Выборка.Следующий();
		
	КонецЦикла;
	
	// Формирование записей по перемещениям материалов и аналогов
	
	СвязиАналогов = РезультатРаспределения.СкопироватьКолонки("ИндексСтроки, Номенклатура, Характеристика, Склад, РазрешениеНаЗамену, КлючНоменклатура");
		
	Если ТаблицаРасчетаПеремещений.Количество() > 0 Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Таблица.ИндексСтроки КАК ИндексСтроки,
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.РазрешениеНаЗамену КАК РазрешениеНаЗамену,
		|	Таблица.КлючНоменклатура КАК КлючНоменклатура,
		|	Таблица.КлючПартия КАК КлючПартия,
		|	Таблица.Склад КАК Склад,
		|	Таблица.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	Таблица.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
		|	Таблица.ПорядковыйНомер КАК ПорядковыйНомер
		|ПОМЕСТИТЬ ТаблицаРасчетаПеремещений
		|ИЗ
		|	&ТаблицаРасчетаПеремещений КАК Таблица
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.ИндексСтроки КАК ИндексСтроки,
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.РазрешениеНаЗамену КАК РазрешениеНаЗамену,
		|	Таблица.КлючНоменклатура КАК КлючНоменклатура,
		|	Таблица.КлючПартия КАК КлючПартия,
		|	Таблица.Склад КАК Склад,
		|	Таблица.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	Таблица.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
		|	МАКСИМУМ(Таблица.ПорядковыйНомер) КАК ПорядковыйНомер
		|ИЗ
		|	ТаблицаРасчетаПеремещений КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ИндексСтроки,
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.РазрешениеНаЗамену,
		|	Таблица.КлючНоменклатура,
		|	Таблица.КлючПартия,
		|	Таблица.Склад,
		|	Таблица.ЗаказНаПроизводство,
		|	Таблица.КоличествоНаЕдиницуПартииЗапуска";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТаблицаРасчетаПеремещений", ТаблицаРасчетаПеремещений);
		ТаблицаПеремещений = Запрос.Выполнить().Выгрузить();
		
		РезультатРаспределенияПоиск = РезультатРаспределения.Скопировать();
		РезультатРаспределенияПоиск.Индексы.Добавить("Номенклатура, Характеристика, Склад, РазрешениеНаЗамену, ИндексСтроки");
		ПоискТоваров = Новый Структура("Номенклатура, Характеристика, Склад, РазрешениеНаЗамену, ИндексСтроки");
		
		Для каждого СтрокаТаблицы Из ТаблицаПеремещений Цикл
			
			РаспределеноИтого = 0;
			РаспределениеАналога = ЗначениеЗаполнено(СтрокаТаблицы.РазрешениеНаЗамену);
			ЦепочкаСкладов = СоответствиеЦепочекСкладов.Получить(СтрокаТаблицы.ИндексСтроки);
			
			ПотребностьПолучатель = Неопределено;
			ЗаполнитьЗначенияСвойств(ПоискТоваров, СтрокаТаблицы, "Номенклатура, Характеристика, РазрешениеНаЗамену, ИндексСтроки");
			
			ИндексСкладов = СтрокаТаблицы.ПорядковыйНомер - 1;
			
			Пока ИндексСкладов > 0 Цикл
			
				СтрокаСкладов = ЦепочкаСкладов[ИндексСкладов];
				ИндексСкладов = ИндексСкладов - 1;
				ПоискТоваров.Склад = СтрокаСкладов.СкладОтправитель;
				
				ТаблицаПоНоменклатуре = РезультатРаспределенияПоиск.НайтиСтроки(ПоискТоваров);
				
				Если ТаблицаПоНоменклатуре.Количество() > 0 Тогда
				
					Для каждого СтрокаТЗ Из ТаблицаПоНоменклатуре Цикл
						РаспределеноИтого = РаспределеноИтого + СтрокаТЗ.Распределено;
						КлючНоменклатура = СтрокаТЗ.КлючНоменклатура;
						КлючПартия = СтрокаТЗ.КлючПартия;
					КонецЦикла;
					
				Иначе
					
					КлючНоменклатура = Новый УникальныйИдентификатор;
					КлючПартия = Новый УникальныйИдентификатор;
					
					ЗаполнитьЗначенияСвойств(ПоискКлючейПартий, СтрокаТаблицы, "Номенклатура, Характеристика, Склад, ЗаказНаПроизводство");
					ПоискКлючейПартий.КлючСвязиПеремещение = СтрокаТаблицы.КлючНоменклатура;
				
				КонецЕсли;
				
				Если ПотребностьПолучатель <> Неопределено Тогда
					ПотребностьПолучатель.КлючНоменклатура = КлючНоменклатура;
					ПотребностьПолучатель.ДлительностьПеремещения = СтрокаСкладов.ДлительностьПеремещения;
				КонецЕсли;
				
				Если РаспределеноИтого > 0 Тогда
				
					ПотребностьОтправитель = РезультатРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(ПотребностьОтправитель, СтрокаТаблицы);
					ПотребностьОтправитель.Склад = СтрокаСкладов.СкладОтправитель;
					ПотребностьОтправитель.ДлительностьПеремещения = СтрокаСкладов.ДлительностьПеремещения;
					ПотребностьОтправитель.Распределено = РаспределеноИтого;
					ПотребностьОтправитель.ТипЗаписи = ТипЗаписиРаспределениеЗапасовТребуетсяПотребление;
					ПотребностьОтправитель.КлючНоменклатура = КлючНоменклатура;
					ПотребностьОтправитель.КлючПартия = КлючПартия;
					ПотребностьОтправитель.КлючНоменклатураПотребности = СтрокаТаблицы.КлючНоменклатура;
					
					ПотребностьПолучатель = РезультатРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(ПотребностьПолучатель, СтрокаТаблицы);
					ПотребностьПолучатель.Склад = СтрокаСкладов.СкладПолучатель;
					ПотребностьПолучатель.Распределено = РаспределеноИтого;
					ПотребностьПолучатель.ТипЗаписи = ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение;
					ПотребностьПолучатель.КлючПартия = КлючПартия;
					ПотребностьПолучатель.КлючНоменклатураПотребности = СтрокаТаблицы.КлючНоменклатура;
					
				КонецЕсли;
			
			КонецЦикла;
				
			Если ПотребностьПолучатель <> Неопределено Тогда
				ПотребностьПолучатель.КлючНоменклатура = СтрокаТаблицы.КлючНоменклатура;
			КонецЕсли;
			
			Если РаспределениеАналога Тогда
				
				ПоискТоваров.Склад = СтрокаТаблицы.Склад;
				ТаблицаПоНоменклатуре = РезультатРаспределенияПоиск.НайтиСтроки(ПоискТоваров);
				КлючНаборПотребностиАналога = Новый УникальныйИдентификатор;
				
				Если ТаблицаПоНоменклатуре.Количество() > 0 Тогда
				
					Для каждого СтрокаТЗ Из ТаблицаПоНоменклатуре Цикл
						РаспределеноИтого = РаспределеноИтого + СтрокаТЗ.Распределено;
						КлючНоменклатура = СтрокаТЗ.КлючНоменклатура;
						КлючПартия = СтрокаТЗ.КлючПартия;
					КонецЦикла;
					
					ЗаполнитьЗначенияСвойств(ПоискКлючейПартий, СтрокаТаблицы, "Номенклатура, Характеристика, Склад, ЗаказНаПроизводство");
					ПоискКлючейПартий.КлючСвязиПеремещение = СтрокаТаблицы.КлючНоменклатура;
					
					Для Каждого СтрокаТаблицыКэша Из ТаблицаКэшКлючейПартийПеремещений.НайтиСтроки(ПоискКлючейПартий) Цикл
						
						КлючНаборПотребностиАналога = СтрокаТаблицыКэша.КлючНабор; 
						Прервать;
					
					КонецЦикла;
					
				Иначе
					
					КлючНоменклатура = Новый УникальныйИдентификатор;
					КлючПартия = СтрокаТаблицы.КлючПартия;
					
					ЗаполнитьЗначенияСвойств(ПоискКлючейПартий, СтрокаТаблицы, "Номенклатура, Характеристика, Склад, ЗаказНаПроизводство");
					ПоискКлючейПартий.КлючСвязиПеремещение = СтрокаТаблицы.КлючНоменклатура;
					
					Для Каждого СтрокаТаблицыКэша Из ТаблицаКэшКлючейПартийПеремещений.НайтиСтроки(ПоискКлючейПартий) Цикл
						
						КлючНаборПотребностиАналога = СтрокаТаблицыКэша.КлючНабор; 
						КлючНоменклатура = СтрокаТаблицыКэша.КлючНоменклатура;
						Прервать;
					
					КонецЦикла;
				
				КонецЕсли;
				
				Если РаспределеноИтого > 0 Тогда
				
					Если ПотребностьПолучатель <> Неопределено Тогда
						ПотребностьПолучатель.КлючНоменклатура = КлючНоменклатура;
					КонецЕсли;
				
					ПотребностьОтправитель = РезультатРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(ПотребностьОтправитель, СтрокаТаблицы);
					ПотребностьОтправитель.Склад = СтрокаТаблицы.Склад;
					ПотребностьОтправитель.Распределено = РаспределеноИтого;
					ПотребностьОтправитель.ТипЗаписи = ТипЗаписиРаспределениеЗапасовТребуетсяПотребление;
					ПотребностьОтправитель.КлючНоменклатура = КлючНоменклатура;
					ПотребностьОтправитель.КлючСвязиАналог = КлючНоменклатура;
					ПотребностьОтправитель.КлючПартия = КлючПартия;
					ПотребностьОтправитель.КлючНабор = КлючНаборПотребностиАналога;
					ПотребностьОтправитель.КлючНоменклатураПотребности = СтрокаТаблицы.КлючНоменклатура;
					
					СтрокаЗаполненияСвязей = СвязиАналогов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗаполненияСвязей, ПотребностьОтправитель);
				
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
	
	КонецЕсли;
	
	// Формирование записей по зацикливающимся потребностям
	Для каждого СтрокаРезультата Из РезультатРаспределенияНеОбеспечивать Цикл
	
		НоваяСтрока = РезультатРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
	
	КонецЦикла;
	
	РезультатРаспределения.Индексы.Добавить("ИндексСтроки, Номенклатура, Характеристика, РазрешениеНаЗамену");
	ПоискАналогов = Новый Структура("ИндексСтроки, Номенклатура, Характеристика, РазрешениеНаЗамену");
	
	// Заполнение поля КлючСвязиПеремещение для строк-аналогов
	Для каждого СтрокаЗаполненияСвязей Из СвязиАналогов Цикл
	
		ЗаполнитьЗначенияСвойств(ПоискАналогов, СтрокаЗаполненияСвязей);
		СтрокиРаспределения = РезультатРаспределения.НайтиСтроки(ПоискАналогов);
		
		Для каждого СтрокаРезультат Из СтрокиРаспределения Цикл
			
			Если ЗначениеЗаполнено(СтрокаРезультат.КлючНабор) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРезультат.КлючСвязиПеремещение = СтрокаЗаполненияСвязей.КлючНоменклатура;
			СтрокаРезультат.КлючСвязиАналог = СтрокаЗаполненияСвязей.КлючНоменклатура;
		
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ТипЗаписиРаспределениеЗапасовРезерв()

	Возврат 0;

КонецФункции

Функция ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение()

	Возврат 1;

КонецФункции

Функция ТипЗаписиРаспределениеЗапасовТребуетсяПотребление()

	Возврат 2;

КонецФункции 

Функция ТипЗаписиРаспределениеЗапасовЗакрытиеПотребности()

	Возврат 3;

КонецФункции 

Функция ТипЗаписиРаспределениеЗапасовЗамена()

	Возврат 4;

КонецФункции

Функция ТипЗаписиРаспределениеЗапасовНеОбеспечивать()

	Возврат 5;

КонецФункции

Функция РасчетноеКоличествоНоменклатуры(Норматив, КоэффициентПересчета, ДанныеУпаковки)

	РасчетноеКоличество = Норматив * КоэффициентПересчета
		* ДанныеУпаковки.Числитель / ДанныеУпаковки.Знаменатель;
			
	ТекущееКоличество = Цел(РасчетноеКоличество);
	Если РасчетноеКоличество > ТекущееКоличество Тогда
		ТекущееКоличество = ТекущееКоличество + Цел((РасчетноеКоличество - ТекущееКоличество) * 1000) / 1000;
	КонецЕсли;
	
	Возврат РасчетноеКоличество;

КонецФункции

Функция ГрафикТовара(График, Аналитика, Граница, Индекс, УсловияРасчета, ИзменитьАналитику = Ложь)
	
	Назначение = Аналитика.Назначение;
	
	Если ИзменитьАналитику Тогда
		Аналитика.Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	Список = График.НайтиСтроки(Аналитика);
	
	НетГрафика = Список.Количество() = 0;
	
	Если НетГрафика
		И Не ИзменитьАналитику И Не УсловияРасчета.Обособленно Тогда
		
		ГрафикТовара = ГрафикТовара(График, Аналитика, Граница, Индекс, УсловияРасчета, Истина);
		
	Иначе
		
		Если НетГрафика Тогда
			ГрафикТовара  = Неопределено;
			Индекс  = -1;
			Граница = -1;
		Иначе
			ГрафикТовара = Список[0];
			Индекс  = ГрафикТовара.Индекс;
			Граница = ГрафикТовара.Граница;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИзменитьАналитику Тогда
		Аналитика.Назначение = Назначение;
	КонецЕсли;
	
	Возврат ГрафикТовара;
	
КонецФункции

Функция СледующийГрафикТовара(ГрафикТовара, Аналитика, Граница, Индекс, УсловияРасчета)
	
	Если ГрафикТовара = Неопределено ИЛИ УсловияРасчета.Обособленно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ГрафикТовара.Назначение.Пустая() Тогда
		ГрафикТовара  = Неопределено;
		Индекс  = -1;
		Граница = -1;
		Возврат Ложь;
	КонецЕсли;
	
	ГрафикТовара = ГрафикТовара(ГрафикТовара.Владелец(), Аналитика, Граница, Индекс, УсловияРасчета, Истина);
	
	Возврат (ГрафикТовара <> Неопределено);
	
КонецФункции

Функция ЗапасДоступен(Выборка, Запас)
	
	Возврат Выборка.НомерОчереди > Запас.НомерОчереди
		Или (Выборка.НомерОчереди = Запас.НомерОчереди
			И Выборка.ПорядокНормативногоГрафика >= Запас.ПорядокНормативногоГрафика
			И Выборка.КонтрольОграниченияЗацикливания = 0);
	
КонецФункции

Процедура ПоместитьРезультатРаспределенияЗапасовВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, РезультатРаспределения, РассчитыватьИзменения)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустоеНазначение", Справочники.Назначения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("ТипЗаписиЗакрытиеПотребности", ТипЗаписиРаспределениеЗапасовЗакрытиеПотребности());
	Запрос.УстановитьПараметр("ТипЗаписиТребуетсяПеремещение", ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение());
	Запрос.УстановитьПараметр("ТипЗаписиТребуетсяПотребление", ТипЗаписиРаспределениеЗапасовТребуетсяПотребление());
	Запрос.УстановитьПараметр("ТипЗаписиРезерв", ТипЗаписиРаспределениеЗапасовРезерв());
	Запрос.УстановитьПараметр("ТипЗаписиЗамена", ТипЗаписиРаспределениеЗапасовЗамена());
	Запрос.УстановитьПараметр("ТипЗаписиРаспределениеЗапасовНеОбеспечивать", ТипЗаписиРаспределениеЗапасовНеОбеспечивать());
	Запрос.УстановитьПараметр("РассчитыватьИзменения", РассчитыватьИзменения);
	Запрос.Текст = ""
		+ ТекстЗапросаПоместитьТаблицуЗначенийВоВременнуюТаблицу("РезультатРаспределения", РезультатРаспределения.Колонки,,, "ИндексСтроки")
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ "ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	Таблица.КлючСвязиПеремещение КАК КлючСвязиПеремещение,
		|	Таблица.ЭтоПродукция КАК ЭтоПродукция,
		|	МАКСИМУМ(Таблица.Этап) КАК Этап,
		|	МАКСИМУМ(Таблица.ИндексСтроки) КАК ИндексСтроки,
		|	СУММА(Таблица.КОбеспечению) КАК КОбеспечению,
		|	СУММА(Таблица.Запланировано) КАК Запланировано,
		|	СУММА(Таблица.Заказано) КАК Заказано,
		|	СУММА(Таблица.РаспределеноИзНаличияНаСкладеДо) КАК РаспределеноИзНаличияНаСкладеДо,
		|	СУММА(Таблица.РаспределеноИзНаличияНаСкладеПосле) КАК РаспределеноИзНаличияНаСкладеПосле,
		|	СУММА(Таблица.КоличествоКПроизводству) КАК КоличествоКПроизводству,
		|	СУММА(Таблица.КОбеспечениюРазность) КАК КОбеспечениюРазность,
		|	СУММА(Таблица.ЗапланированоРазность) КАК ЗапланированоРазность,
		|	СУММА(Таблица.ЗамененоРазность) КАК ЗамененоРазность
		|ПОМЕСТИТЬ РасчетИзменений
		|ИЗ
		|	(ВЫБРАТЬ
		|		План.ИндексСтроки КАК ИндексСтроки,
		|		План.Номенклатура КАК Номенклатура,
		|		План.Характеристика КАК Характеристика,
		|		План.Склад КАК Склад,
		|		План.Назначение КАК Назначение,
		|		План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		План.Этап КАК Этап,
		|		ВЫБОР
		|			КОГДА План.ИсходнаяПотребность
		|			ТОГДА План.КлючНоменклатура
		|			ИНАЧЕ План.КлючСвязиПеремещение
		|		КОНЕЦ КАК КлючСвязиПеремещение,
		|		План.ЭтоПродукция КАК ЭтоПродукция,
		|		План.КОбеспечению КАК КОбеспечению,
		|		План.Заменено КАК Заменено,
		|		План.РаспределеноИзНаличияНаСкладе КАК РаспределеноИзНаличияНаСкладеДо,
		|		0 КАК РаспределеноИзНаличияНаСкладеПосле,
		|		План.Запланировано КАК КоличествоКПроизводству,
		|		План.Запланировано КАК Запланировано,
		|		План.Заказано КАК Заказано,
		|		ВЫБОР
		|			КОГДА План.ИсходнаяПотребность
		|			ТОГДА 0
		|			ИНАЧЕ План.КОбеспечению
		|		КОНЕЦ КАК КОбеспечениюРазность,
		|		План.ЗапланированоПереместить КАК ЗапланированоРазность,
		|		План.Заменено КАК ЗамененоРазность
		|	ИЗ
		|		НоменклатурныйПлан КАК План
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-1 КАК ИндексСтроки,
		|		Резервы.Номенклатура КАК Номенклатура,
		|		Резервы.Характеристика КАК Характеристика,
		|		Резервы.Склад КАК Склад,
		|		План.Назначение КАК Назначение,
		|		План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		План.Этап КАК Этап,
		|		ВЫБОР
		|			КОГДА Резервы.КлючСвязиАналог <> &ПустойИдентификатор // Для строк-аналогов поле заполняется при расчете обеспечения
		|			ТОГДА Резервы.КлючСвязиАналог
		|			ИНАЧЕ План.КлючНоменклатура
		|		КОНЕЦ                         КАК КлючСвязиПеремещение,
		|		План.ЭтоПродукция КАК ЭтоПродукция,
		|		0 КАК КОбеспечению,
		|		ВЫБОР
		|			КОГДА Резервы.ТипЗаписи = &ТипЗаписиЗамена
		|			ТОГДА -Резервы.Распределено
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Заменено,
		|		0 КАК РаспределеноИзНаличияНаСкладеДо,
		|		ВЫБОР
		|			КОГДА Резервы.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО
		|				И Резервы.ТипЗаписи = &ТипЗаписиРезерв
		|				ТОГДА Резервы.Распределено
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК РаспределеноИзНаличияНаСкладеПосле,
		|		ВЫБОР
		|			КОГДА Резервы.ТипЗаписи В (&ТипЗаписиЗакрытиеПотребности, &ТипЗаписиТребуетсяПеремещение)
		|			ТОГДА -Резервы.Распределено
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК КоличествоКПроизводству,
		|		0 КАК Запланировано,
		|		0 КАК Заказано,
		|		ВЫБОР
		|			КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПотребление
		|			ТОГДА -Резервы.Распределено
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК КОбеспечениюРазность,
		|		ВЫБОР
		|			КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПеремещение
		|			ТОГДА -Резервы.Распределено
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЗапланированоРазность,
		|		ВЫБОР
		|			КОГДА Резервы.ТипЗаписи = &ТипЗаписиЗамена
		|			ТОГДА -Резервы.Распределено
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЗамененоРазность
		|	ИЗ
		|		РезультатРаспределения КАК Резервы
		|			ЛЕВОЕ СОЕДИНЕНИЕ НоменклатурныйПлан КАК План
		|			ПО Резервы.ИндексСтроки = План.ИндексСтроки) КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Назначение,
		|	Таблица.ЗаказНаПроизводство,
		|	Таблица.Склад,
		|	Таблица.Характеристика,
		|	Таблица.КлючСвязиПеремещение,
		|	Таблица.Номенклатура,
		|	Таблица.ЭтоПродукция
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Назначение,
		|	ЗаказНаПроизводство
		|;
		|ВЫБРАТЬ
		|	РасчетИзменений.Номенклатура КАК Номенклатура,
		|	РасчетИзменений.Характеристика КАК Характеристика,
		|	РасчетИзменений.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	РасчетИзменений.КлючСвязиПеремещение КАК КлючСвязиПеремещение,
		|	РасчетИзменений.КОбеспечениюРазность <> 0
		|		ИЛИ РасчетИзменений.ЗапланированоРазность <> 0
		|		ИЛИ РасчетИзменений.ЗамененоРазность <> 0 КАК ЕстьИзменения
		|ПОМЕСТИТЬ ТаблицаИзменений
		|ИЗ
		|	РасчетИзменений КАК РасчетИзменений
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	План.Номенклатура,
		|	План.Характеристика,
		|	План.ЗаказНаПроизводство,
		|	План.КлючСвязиПотребности,
		|	ИСТИНА
		|ИЗ
		|	НоменклатурныйПлан КАК План
		|ГДЕ 
		|	План.ЭтоАналог И План.КлючСвязиПеремещение = &ПустойИдентификатор И План.КлючСвязиПотребности <> &ПустойИдентификатор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	ЗаказНаПроизводство,
		|	КлючСвязиПеремещение,
		|	ЕстьИзменения
		|;
		|
		|
		|ВЫБРАТЬ
		|
		|	План.ИндексСтроки КАК ИндексСтроки,
		|
		|	Резервы.Номенклатура          КАК Номенклатура,
		|	Резервы.Характеристика        КАК Характеристика,
		|	Резервы.Склад                 КАК Склад,
		|	План.Назначение               КАК Назначение,
		|	План.ЗаказНаПроизводство      КАК ЗаказНаПроизводство,
		|	Резервы.КлючНоменклатура      КАК КлючНоменклатура,
		|	Резервы.КлючПартия            КАК КлючПартия,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи В (&ТипЗаписиЗамена, &ТипЗаписиРезерв, &ТипЗаписиТребуетсяПотребление)
		|			И План.Склад = Резервы.Склад
		|			ТОГДА План.Этап
		|	КОНЕЦ                         КАК Этап,
		|	План.Подразделение            КАК Подразделение,
		|	План.НазначениеСтруктуры      КАК НазначениеСтруктуры,
		|	ВЫБОР
		|		КОГДА Резервы.КлючСвязиПеремещение <> &ПустойИдентификатор // Для строк-аналогов поле заполняется при расчете обеспечения
		|		ТОГДА Резервы.КлючСвязиПеремещение
		|		ИНАЧЕ План.КлючНоменклатура
		|	КОНЕЦ                         КАК КлючСвязиПеремещение,
		|	ВЫБОР
		|		КОГДА Резервы.КлючНабор <> &ПустойИдентификатор // Первичная потребность строки аналога
		|		ТОГДА &ПустойИдентификатор
		|		КОГДА Резервы.ТипЗаписи В (&ТипЗаписиТребуетсяПотребление, &ТипЗаписиТребуетсяПеремещение)
		|		ТОГДА Резервы.КлючПартия
		|		ИНАЧЕ &ПустойИдентификатор
		|	КОНЕЦ                         КАК КлючНабор,
		|	Резервы.КлючНабор КАК КлючНаборПотребностиАналога,
		|
		|	Резервы.ДатаПоступления    КАК ДатаПоступления,
		|	Резервы.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|
		|	Резервы.ТипЗаписи             КАК ТипЗаписи,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи В (&ТипЗаписиРезерв, &ТипЗаписиЗамена)
		|		ТОГДА &ПустойИдентификатор
		|		ИНАЧЕ План.КлючНоменклатура
		|	КОНЕЦ                         КАК КлючСвязиСтрокаСпецификации,
		|
		|	ISNULL(МестоПартииВСтруктуреЗаказа.Уровень, План.Уровень) КАК Уровень,
		|	ISNULL(МестоПартииВСтруктуреЗаказа.ДлительностьДоВыпуска, План.ДлительностьДоВыпуска) + Резервы.ДлительностьПеремещения КАК ДлительностьДоВыпуска, // берем по партии без учета этапа
		|	ISNULL(МестоПартииВСтруктуреЗаказа.ИдентификаторВГруппеИзделий, План.ИдентификаторВГруппеИзделий) КАК ИдентификаторВГруппеИзделий,
		|	ВЫБОР
		|		КОГДА МестоПартииВСтруктуреЗаказа.Партия ЕСТЬ НЕ NULL ТОГДА
		|			ЭтапВыпуска.Ссылка
		|		ИНАЧЕ
		|			NULL
		|	КОНЕЦ КАК ЭтапВыпуска,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЭтапВыпуска.ПартияПроизводства) КАК КлючПартияВыпуска,
		|	ВЫБОР
		|		КОГДА МестоПартииВСтруктуреЗаказа.Партия ЕСТЬ НЕ NULL ТОГДА
		|			ЭтапВыпуска.Подразделение
		|		ИНАЧЕ
		|			NULL
		|	КОНЕЦ КАК ПодразделениеВыпуска,
		|
		|	Резервы.РазрешениеНаЗамену КАК РазрешениеНаЗамену,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПотребление
		|			И Резервы.РазрешениеНаЗамену <> ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка)
		|			И Резервы.Склад = План.Склад
		|			ТОГДА Резервы.КоличествоНаЕдиницуПартииЗапуска
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоНаЕдиницуПартииЗапуска,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПотребление
		|			И Резервы.РазрешениеНаЗамену <> ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка)
		|			И Резервы.Склад = План.Склад
		|			ТОГДА План.Спецификация
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
		|	КОНЕЦ КАК Спецификация,
		|
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи = &ТипЗаписиЗамена
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Заменено,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПеремещение
		|		И ИСТИНА В
		|			(ВЫБРАТЬ
		|				ИСТИНА
		|			ИЗ
		|				ТаблицаИзменений КАК ТаблицаИзменений
		|			ГДЕ
		|				ТаблицаИзменений.Номенклатура = Резервы.Номенклатура
		|				И ТаблицаИзменений.Характеристика = Резервы.Характеристика
		|				И ТаблицаИзменений.ЗаказНаПроизводство = План.ЗаказНаПроизводство
		|				И (ТаблицаИзменений.КлючСвязиПеремещение = План.КлючНоменклатура 
		|					ИЛИ ТаблицаИзменений.КлючСвязиПеремещение = Резервы.КлючНоменклатура 
		|					ИЛИ ТаблицаИзменений.КлючСвязиПеремещение = Резервы.КлючСвязиПеремещение)
		|				И ТаблицаИзменений.ЕстьИзменения)
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Запланировано,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПотребление
		|			И ИСТИНА В
		|			(ВЫБРАТЬ
		|				ИСТИНА
		|			ИЗ
		|				ТаблицаИзменений КАК ТаблицаИзменений
		|			ГДЕ
		|				ТаблицаИзменений.Номенклатура = Резервы.Номенклатура
		|				И ТаблицаИзменений.Характеристика = Резервы.Характеристика
		|				И ТаблицаИзменений.ЗаказНаПроизводство = План.ЗаказНаПроизводство
		|				И (ТаблицаИзменений.КлючСвязиПеремещение = План.КлючНоменклатура 
		|					ИЛИ ТаблицаИзменений.КлючСвязиПеремещение = Резервы.КлючНоменклатура 
		|					ИЛИ ТаблицаИзменений.КлючСвязиПеремещение = Резервы.КлючСвязиПеремещение)
		|				И ТаблицаИзменений.ЕстьИзменения)
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Требуется,
		|	ВЫБОР
		|		КОГДА Резервы.ТипЗаписи = &ТипЗаписиРаспределениеЗапасовНеОбеспечивать
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеОбеспечивать,
		|
		|	ВЫБОР
		|		КОГДА МестоПартииВСтруктуреЗаказа.Партия ЕСТЬ НЕ NULL
		|				И Резервы.ТипЗаписи = &ТипЗаписиРезерв
		|				И Резервы.Назначение <> &ПустоеНазначение
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РаспределеноИзПартийОбособленно,
		|	ВЫБОР
		|		КОГДА МестоПартииВСтруктуреЗаказа.Партия ЕСТЬ НЕ NULL
		|				И Резервы.ТипЗаписи = &ТипЗаписиРезерв
		|			И Резервы.Назначение = &ПустоеНазначение 
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РаспределеноИзПартий,
		|	ВЫБОР
		|		КОГДА МестоПартииВСтруктуреЗаказа.Партия ЕСТЬ NULL
		|				И Резервы.ТипЗаписи = &ТипЗаписиРезерв
		|				И Резервы.Назначение <> &ПустоеНазначение
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РаспределеноИзЗапасовОбособленно,
		|	ВЫБОР
		|		КОГДА МестоПартииВСтруктуреЗаказа.Партия ЕСТЬ NULL
		|				И Резервы.ТипЗаписи = &ТипЗаписиРезерв
		|				И Резервы.Назначение = &ПустоеНазначение
		|			ТОГДА Резервы.Распределено
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РаспределеноИзЗапасов
		|
		|ПОМЕСТИТЬ РаспределениеЗапасов
		|ИЗ
		|	РезультатРаспределения КАК Резервы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатурныйПлан КАК План
		|		ПО Резервы.ИндексСтроки = План.ИндексСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапВыпуска
		|		ПО Резервы.ЗаказНаПоступление = ЭтапВыпуска.Ссылка
		|			И План.ЗаказНаПроизводство = ЭтапВыпуска.Распоряжение // выпуск по заказу
		|			И План.КлючПартия <> УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЭтапВыпуска.ПартияПроизводства) // исключаем промежуточные полуфабрикаты
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПартииВСтруктуреЗаказа КАК МестоПартииВСтруктуреЗаказа
		|		ПО ЭтапВыпуска.ПартияПроизводства = МестоПартииВСтруктуреЗаказа.Партия
		|
		|ГДЕ 
		|	Резервы.ТипЗаписи <> &ТипЗаписиЗакрытиеПотребности
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Назначение,
		|	ЗаказНаПроизводство
		|;
		|
		|УНИЧТОЖИТЬ РезультатРаспределения
		|;
		|";
		
	Запрос.УстановитьПараметр("РезультатРаспределения", РезультатРаспределения);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РассчитатьИзмененияИЗаписатьРезультатРаспределенияЗапасов(МенеджерВременныхТаблиц, ПараметрыРасчета)
	
	РассчитыватьИзменения = ПараметрыРасчета.РассчитыватьИзменения;
	ПустойКлючСвязи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	РазделительЗаписи = ?(РассчитыватьИзменения, Новый УникальныйИдентификатор, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ИспользуетсяГрафикПроизводства = УправлениеПроизводством.ИспользуетсяГрафикПроизводства();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РассчитыватьИзменения", РассчитыватьИзменения);
	Запрос.УстановитьПараметр("РазделительЗаписи", РазделительЗаписи);
	Запрос.УстановитьПараметр("РазделительЗаписиЗамены", Новый УникальныйИдентификатор);
	Запрос.УстановитьПараметр("ПустойКлючСвязи", ПустойКлючСвязи);
	Запрос.УстановитьПараметр("ТипЗаписиТребуетсяПеремещение", ТипЗаписиРаспределениеЗапасовТребуетсяПеремещение());
	Запрос.УстановитьПараметр("ТипЗаписиТребуетсяПотребление", ТипЗаписиРаспределениеЗапасовТребуетсяПотребление());
	Запрос.УстановитьПараметр("ТипЗаписиНеОбеспечивать", ТипЗаписиРаспределениеЗапасовНеОбеспечивать());
	Запрос.УстановитьПараметр("ТипЗаписиЗамена", ТипЗаписиРаспределениеЗапасовЗамена());
	Запрос.УстановитьПараметр("ИспользуетсяГрафикПроизводства", ИспользуетсяГрафикПроизводства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Номенклатура           КАК Номенклатура,
	|	Таблица.Характеристика         КАК Характеристика,
	|	Таблица.Склад                  КАК Склад,
	|	Таблица.Назначение             КАК Назначение,
	|	Таблица.ЗаказНаПроизводство    КАК ЗаказНаПроизводство,
	|	Таблица.КлючНоменклатура       КАК КлючНоменклатура,
	|	Таблица.КлючПартия             КАК КлючПартия,
	|	Таблица.ВидСтроки              КАК ВидСтроки,
	|	Таблица.ЗаказНаПоступление     КАК ЗаказНаПоступление,
	|	Таблица.ДатаПоступления        КАК ДатаПоступления,
	|	Таблица.РазрешениеНаЗамену     КАК РазрешениеНаЗамену,
	|	МАКСИМУМ(Таблица.КлючНабор)    КАК КлючНабор,
	|	МАКСИМУМ(Таблица.КлючНаборИсходный) КАК КлючНаборИсходный,
	|	МАКСИМУМ(Таблица.КлючНаборПотребностиАналога) КАК КлючНаборПотребностиАналога,
	|	МАКСИМУМ(Таблица.Спецификация) КАК Спецификация,
	|	МАКСИМУМ(Таблица.Этап) КАК Этап,
	|	МАКСИМУМ(Таблица.Подразделение) КАК Подразделение,
	|	МАКСИМУМ(Таблица.НазначениеСтруктуры) КАК НазначениеСтруктуры,
	|	МАКСИМУМ(Таблица.КлючСвязиСтрокаСпецификации)  КАК КлючСвязиСтрокаСпецификации,
	|	МАКСИМУМ(Таблица.КлючСвязиПеремещение) КАК КлючСвязиПеремещение,
	|	МАКСИМУМ(Таблица.Уровень) КАК Уровень,
	|	МАКСИМУМ(Таблица.ДлительностьДоВыпуска) КАК ДлительностьДоВыпуска,
	|	МАКСИМУМ(Таблица.ИдентификаторВГруппеИзделий) КАК ИдентификаторВГруппеИзделий,
	|	МАКСИМУМ(Таблица.КоличествоНаЕдиницуПартииЗапуска) КАК КоличествоНаЕдиницуПартииЗапуска,
	|	СУММА(Таблица.Заменено) КАК Заменено,
	|	СУММА(Таблица.НеОбеспечивать) КАК НеОбеспечивать,
	|	СУММА(Таблица.Требуется) КАК Требуется,
	|	СУММА(Таблица.Запланировано) КАК Запланировано,
	|	СУММА(Таблица.РаспределеноИзЗапасовОбособленно) КАК РаспределеноИзЗапасовОбособленно,
	|	СУММА(Таблица.РаспределеноИзЗапасов) КАК РаспределеноИзЗапасов,
	|	СУММА(Таблица.РаспределеноИзПартийОбособленно)  КАК РаспределеноИзПартийОбособленно,
	|	СУММА(Таблица.РаспределеноИзПартий) КАК РаспределеноИзПартий,
	|	МИНИМУМ(Таблица.НоваяЗапись) КАК НоваяЗапись,
	|	СГРУППИРОВАНОПО(Таблица.КлючНоменклатура) КАК ДетальнаяЗапись
	|	
	|ПОМЕСТИТЬ РезервыИзменения
	|ИЗ (
	|	
	|	ВЫБРАТЬ
	|
	|		ВЫБОР
	|			КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПеремещение
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение)
	|			КОГДА Резервы.ТипЗаписи В (&ТипЗаписиТребуетсяПотребление, &ТипЗаписиЗамена, &ТипЗаписиНеОбеспечивать)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Зарезервировано)
	|		КОНЕЦ КАК ВидСтроки,
	|
	|		Резервы.Номенклатура          КАК Номенклатура,
	|		Резервы.Характеристика        КАК Характеристика,
	|		Резервы.Склад                 КАК Склад,
	|		Резервы.Назначение            КАК Назначение,
	|		Резервы.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|		Резервы.КлючНоменклатура      КАК КлючНоменклатура,
	|		Резервы.КлючПартия            КАК КлючПартия,
	|		Резервы.Этап                  КАК Этап,
	|		Резервы.Подразделение         КАК Подразделение,
	|		Резервы.НазначениеСтруктуры   КАК НазначениеСтруктуры,
	|		Резервы.КлючСвязиПеремещение  КАК КлючСвязиПеремещение,
	|		Резервы.Уровень               КАК Уровень,
	|		Резервы.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|		Резервы.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|		Резервы.ЗаказНаПоступление    КАК ЗаказНаПоступление,
	|		Резервы.ДатаПоступления       КАК ДатаПоступления,
	|		Резервы.РазрешениеНаЗамену    КАК РазрешениеНаЗамену,
	|		Резервы.Спецификация          КАК Спецификация,
	|
	|		&ПустойКлючСвязи              КАК КлючНабор,
	|		Резервы.КлючНабор             КАК КлючНаборИсходный,
	|		Резервы.КлючНаборПотребностиАналога      КАК КлючНаборПотребностиАналога,
	|		Резервы.КлючСвязиСтрокаСпецификации      КАК КлючСвязиСтрокаСпецификации,
	|
	|		Резервы.Требуется                        КАК Требуется,
	|		Резервы.Запланировано                    КАК Запланировано,
	|		Резервы.РаспределеноИзЗапасовОбособленно КАК РаспределеноИзЗапасовОбособленно,
	|		Резервы.РаспределеноИзЗапасов            КАК РаспределеноИзЗапасов,
	|		0                                        КАК РаспределеноИзПартийОбособленно,
	|		0                                        КАК РаспределеноИзПартий,
	|		Резервы.Заменено                         КАК Заменено,
	|		Резервы.НеОбеспечивать                   КАК НеОбеспечивать,
	|		Резервы.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|
	|		ИСТИНА КАК НоваяЗапись
	|
	|	ИЗ
	|		РаспределениеЗапасов КАК Резервы
	|
	|	ГДЕ
	|		Резервы.РаспределеноИзЗапасов > 0 ИЛИ Резервы.РаспределеноИзЗапасовОбособленно > 0 ИЛИ Резервы.Запланировано > 0 
	|		ИЛИ Резервы.Требуется > 0 ИЛИ Резервы.Заменено > 0 ИЛИ Резервы.НеОбеспечивать > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|
	|		ВЫБОР
	|			КОГДА Резервы.ТипЗаписи = &ТипЗаписиТребуетсяПеремещение
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение)
	|			КОГДА Резервы.ТипЗаписи В (&ТипЗаписиТребуетсяПотребление, &ТипЗаписиЗамена)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката)
	|		КОНЕЦ КАК ВидСтроки,
	|
	|		Резервы.Номенклатура          КАК Номенклатура,
	|		Резервы.Характеристика        КАК Характеристика,
	|		Резервы.Склад                 КАК Склад,
	|		Резервы.Назначение            КАК Назначение,
	|		Резервы.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|		Резервы.КлючНоменклатура      КАК КлючНоменклатура,
	|		Резервы.КлючПартияВыпуска     КАК КлючПартия,
	|		Резервы.ЭтапВыпуска           КАК Этап,
	|		Резервы.ПодразделениеВыпуска  КАК Подразделение,
	|		Резервы.НазначениеСтруктуры   КАК НазначениеСтруктуры,
	|		&ПустойКлючСвязи              КАК КлючСвязиПеремещение,
	|		Резервы.Уровень               КАК Уровень,
	|		Резервы.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|		Резервы.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|		Резервы.ЗаказНаПоступление    КАК ЗаказНаПоступление,
	|		Резервы.ДатаПоступления       КАК ДатаПоступления,
	|		Резервы.РазрешениеНаЗамену    КАК РазрешениеНаЗамену,
	|		Резервы.Спецификация          КАК Спецификация,
	|
	|		&ПустойКлючСвязи              КАК КлючНабор,
	|		Резервы.КлючНабор             КАК КлючНаборИсходный,
	|		Резервы.КлючНаборПотребностиАналога      КАК КлючНаборПотребностиАналога,
	|		Резервы.КлючСвязиСтрокаСпецификации      КАК КлючСвязиСтрокаСпецификации,
	|		
	|		Резервы.Требуется                        КАК Требуется,
	|		Резервы.Запланировано                    КАК Запланировано,
	|
	|
	|		0                                        КАК РаспределеноИзЗапасовОбособленно,
	|		0                                        КАК РаспределеноИзЗапасов,
	|		Резервы.РаспределеноИзПартийОбособленно  КАК РаспределеноИзПартийОбособленно,
	|		Резервы.РаспределеноИзПартий             КАК РаспределеноИзПартий,
	|		Резервы.Заменено                         КАК Заменено,
	|		Резервы.НеОбеспечивать                   КАК НеОбеспечивать,
	|		Резервы.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|
	|		ИСТИНА КАК НоваяЗапись
	|
	|	ИЗ
	|		РаспределениеЗапасов КАК Резервы
	|	
	|	ГДЕ
	|		Резервы.РаспределеноИзПартий > 0 ИЛИ Резервы.РаспределеноИзПартийОбособленно > 0 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|
	|		Резервы.ВидСтроки КАК ВидСтроки,
	|	
	|		Резервы.Номенклатура          КАК Номенклатура,
	|		Резервы.Характеристика        КАК Характеристика,
	|		Резервы.Склад                 КАК Склад,
	|		Резервы.Назначение            КАК Назначение,
	|		Резервы.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|		Резервы.КлючНоменклатура      КАК КлючНоменклатура,
	|		Резервы.КлючПартия            КАК КлючПартия,
	|		Резервы.Этап                  КАК Этап,
	|		Резервы.Подразделение         КАК Подразделение,
	|		Резервы.НазначениеСтруктуры   КАК НазначениеСтруктуры,
	|		Резервы.КлючСвязиПеремещение  КАК КлючСвязиПеремещение,
	|		Резервы.Уровень               КАК Уровень,
	|		Резервы.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|		Резервы.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|		Резервы.ЗаказНаПоступление    КАК ЗаказНаПоступление,
	|		Резервы.ДатаПоступления       КАК ДатаПоступления,
	|		Резервы.РазрешениеНаЗамену    КАК РазрешениеНаЗамену,
	|		Резервы.Спецификация          КАК Спецификация,
	|		
	|		ВЫБОР
	|		КОГДА (Резервы.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Зарезервировано),
	|								ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката)))
	|				ИЛИ (Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление) И (Резервы.Заменено <> 0 ИЛИ Резервы.НеОбеспечивать <> 0))
	|		ТОГДА Резервы.КлючНабор
	|		ИНАЧЕ &ПустойКлючСвязи
	|		КОНЕЦ КАК КлючНабор,
	|		Резервы.КлючНабор             КАК КлючНаборИсходный,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения 
	|				И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|				И Резервы.РазрешениеНаЗамену <> ЗНАЧЕНИЕ(Документ.РазрешениеНаЗаменуМатериалов.ПустаяСсылка)
	|				И Резервы.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|				ТОГДА Резервы.КлючНабор
	|			ИНАЧЕ &ПустойКлючСвязи
	|		КОНЕЦ КАК КлючНаборПотребностиАналога,
	|		Резервы.КлючСвязиСтрокаСпецификации КАК КлючСвязиСтрокаСпецификации,
	|
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения 
	|				И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|				И Резервы.КлючСвязиПеремещение <> &ПустойКлючСвязи
	|				ТОГДА -Резервы.КОбеспечению
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Требуется,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение)
	|				ТОГДА -Резервы.Запланировано
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Запланировано,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				ТОГДА -Резервы.РаспределеноИзЗапасовОбособленно
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РаспределеноИзЗапасовОбособленно,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				ТОГДА -Резервы.РаспределеноИзЗапасов
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РаспределеноИзЗапасов,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				ТОГДА -Резервы.РаспределеноИзПартийОбособленно
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РаспределеноИзПартийОбособленно,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				ТОГДА -Резервы.РаспределеноИзПартий
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РаспределеноИзПартий,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				ТОГДА -Резервы.Заменено
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Заменено,
	|		ВЫБОР
	|			КОГДА &РассчитыватьИзменения
	|				И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|				И Резервы.КлючСвязиПеремещение <> &ПустойКлючСвязи
	|				ТОГДА -Резервы.НеОбеспечивать
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НеОбеспечивать,
	|		0     КАК КоличествоНаЕдиницуПартииЗапуска,
	|
	|		ЛОЖЬ КАК НоваяЗапись
	|	
	|	ИЗ
	|		РегистрСведений.СтруктураЗаказа КАК Резервы
	|	
	|	ГДЕ
	|		ИСТИНА В
	|			(ВЫБРАТЬ
	|				ИСТИНА
	|			ИЗ
	|				НоменклатурныйПлан КАК НоменклатурныйПлан
	|			ГДЕ
	|				НоменклатурныйПлан.Номенклатура = Резервы.Номенклатура
	|				И НоменклатурныйПлан.Характеристика = Резервы.Характеристика
	|				И НоменклатурныйПлан.Склад = Резервы.Склад
	|				И НоменклатурныйПлан.Назначение = Резервы.Назначение)
	|		И (ИСТИНА В
	|			(ВЫБРАТЬ
	|				ИСТИНА
	|			ИЗ
	|				ТаблицаИзменений КАК ТаблицаИзменений
	|			ГДЕ
	|				ТаблицаИзменений.Номенклатура = Резервы.Номенклатура
	|				И ТаблицаИзменений.Характеристика = Резервы.Характеристика
	|				И ТаблицаИзменений.ЗаказНаПроизводство = Резервы.ЗаказНаПроизводство
	|				И (ТаблицаИзменений.КлючСвязиПеремещение = Резервы.КлючНоменклатура ИЛИ ТаблицаИзменений.КлючСвязиПеремещение = Резервы.КлючСвязиПеремещение)
	|				И ТаблицаИзменений.ЕстьИзменения
	|				И Резервы.ВидСтроки В (
	|					ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение),
	|					ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)))
	|			
	|			ИЛИ Резервы.ВидСтроки В (
	|					ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Зарезервировано),
	|					ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката))
	|			ИЛИ (Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление) И (Резервы.Заменено <> 0 ИЛИ Резервы.НеОбеспечивать <> 0)))
	|
	|		И (Резервы.РаспределеноИзЗапасов <> 0
	|					ИЛИ Резервы.РаспределеноИзЗапасовОбособленно <> 0
	|					ИЛИ Резервы.РаспределеноИзПартий <> 0 
	|					ИЛИ Резервы.РаспределеноИзПартийОбособленно <> 0
	|					ИЛИ (Резервы.КОбеспечению <> 0 И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|							И Резервы.КлючСвязиПеремещение <> &ПустойКлючСвязи)
	|					ИЛИ (Резервы.Запланировано <> 0 И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение))
	|					ИЛИ Резервы.Заменено <> 0
	|					ИЛИ (Резервы.НеОбеспечивать <> 0 И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление)
	|							И Резервы.КлючСвязиПеремещение <> &ПустойКлючСвязи))
	|
	|) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО ГРУППИРУЮЩИМ НАБОРАМ (
	|
	|	(Таблица.Номенклатура,
	|	 Таблица.Характеристика,
	|	 Таблица.Склад,
	|	 Таблица.Назначение),
	|	(Таблица.Номенклатура,
	|	 Таблица.Характеристика,
	|	 Таблица.Склад,
	|	 Таблица.Назначение,
	|	 Таблица.ЗаказНаПроизводство,
	|	 Таблица.КлючНоменклатура,
	|	 Таблица.КлючПартия,
	|	 Таблица.ВидСтроки,
	|	 Таблица.ЗаказНаПоступление,
	|	 Таблица.ДатаПоступления,
	|	 Таблица.РазрешениеНаЗамену))
	|
	|ИМЕЮЩИЕ
	|	(НЕ &РассчитыватьИзменения
	|			ИЛИ СУММА(Таблица.РаспределеноИзЗапасов) <> 0
	|			ИЛИ СУММА(Таблица.РаспределеноИзЗапасовОбособленно) <> 0
	|			ИЛИ СУММА(Таблица.РаспределеноИзПартий) <> 0 
	|			ИЛИ СУММА(Таблица.РаспределеноИзПартийОбособленно) <> 0
	|			ИЛИ СУММА(Таблица.Требуется) <> 0
	|			ИЛИ СУММА(Таблица.Запланировано) <> 0
	|			ИЛИ СУММА(Таблица.Заменено) <> 0
	|			ИЛИ СУММА(Таблица.НеОбеспечивать) <> 0
	|			ИЛИ НЕ СГРУППИРОВАНОПО(Таблица.ЗаказНаПроизводство))
	|
	|ИНДЕКСИРОВАТЬ ПО НАБОРАМ
	|(
	|	(Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Назначение,
	|	ДетальнаяЗапись),
	|	(Номенклатура,
	|	Характеристика,
	|	КлючНабор,
	|	НоваяЗапись),
	|	(ЗаказНаПроизводство,
	|	ВидСтроки,
	|	НоваяЗапись)
	|)";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Порции.Номенклатура        КАК Номенклатура,
	|	Порции.Характеристика      КАК Характеристика,
	|	Порции.Склад               КАК Склад,
	|	Порции.Назначение          КАК Назначение,
	|	Порции.КлючНабор           КАК КлючНабор
	|ИЗ
	|	РезервыИзменения КАК Порции
	|ГДЕ
	|	НЕ Порции.ДетальнаяЗапись
	|;";
	ПорцииЗаписи = Запрос.Выполнить().Выгрузить();
	
	Если ПорцииЗаписи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ПорцииЗаписи.НайтиСтроки(Новый Структура("КлючНабор", ПустойКлючСвязи));
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.КлючНабор = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	ПоместитьТаблицуЗначенийВоВременнуюТаблицу(МенеджерВременныхТаблиц, "ПорцииЗаписи", ПорцииЗаписи,,, "Номенклатура,Характеристика,Склад,Назначение");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.КлючНабор КАК КлючНабор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПорцииЗаписи.КлючНабор КАК КлючНабор
	|	ИЗ
	|		ПорцииЗаписи КАК ПорцииЗаписи
	|	ГДЕ
	|		НЕ &РассчитыватьИзменения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыИзменения.КлючНаборИсходный КАК КлючНабор
	|	ИЗ
	|		РезервыИзменения КАК РезервыИзменения
	|	ГДЕ
	|		НЕ &РассчитыватьИзменения
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыИзменения.КлючНаборПотребностиАналога КАК КлючНабор
	|	ИЗ
	|		РезервыИзменения КАК РезервыИзменения
	|	ГДЕ
	|		НЕ &РассчитыватьИзменения
	|) КАК Таблица
	|;
	|ВЫБРАТЬ // запись ключей наборов в кэш
	|
	|	СвязанныеАналогиМатериалов.Номенклатура КАК Номенклатура,
	|	СвязанныеАналогиМатериалов.Характеристика КАК Характеристика,
	|	СвязанныеАналогиМатериалов.Идентификатор КАК Идентификатор,
	|	ИСТИНА КАК НоваяЗапись
	|
	|ИЗ
	|	СвязанныеАналогиМатериалов КАК СвязанныеАналогиМатериалов
	|ГДЕ 
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ВсеТовары КАК Товары
	|			ГДЕ
	|				Товары.Номенклатура = СвязанныеАналогиМатериалов.Номенклатура
	|				И Товары.Характеристика = СвязанныеАналогиМатериалов.Характеристика)
	|
	|	И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.КэшИдентификаторовСвязейНоменклатурыПоРазрешениямНаЗамену КАК Таблица
	|			ГДЕ
	|				Таблица.Номенклатура = СвязанныеАналогиМатериалов.Номенклатура
	|				И Таблица.Характеристика = СвязанныеАналогиМатериалов.Характеристика
	|				И Таблица.Идентификатор = СвязанныеАналогиМатериалов.Идентификатор)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Идентификатор КАК Идентификатор,
	|	ЛОЖЬ КАК НоваяЗапись
	|
	|ИЗ
	|	РегистрСведений.КэшИдентификаторовСвязейНоменклатурыПоРазрешениямНаЗамену КАК Таблица
	|ГДЕ 
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ВсеТовары КАК Товары
	|			ГДЕ
	|				Товары.Номенклатура = Таблица.Номенклатура
	|				И Товары.Характеристика = Таблица.Характеристика)
	|
	|	И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				СвязанныеАналогиМатериалов КАК СвязанныеАналогиМатериалов
	|			ГДЕ
	|				СвязанныеАналогиМатериалов.Номенклатура = Таблица.Номенклатура
	|				И СвязанныеАналогиМатериалов.Характеристика = Таблица.Характеристика
	|				И СвязанныеАналогиМатериалов.Идентификатор = Таблица.Идентификатор)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ // регистрация заданий к расчету графика для новых партий
	|
	|	Резервы.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Резервы.КлючПартия КАК КлючПартия
	|
	|ИЗ
	|	РезервыИзменения КАК Резервы
	|
	|ГДЕ
	|	&ИспользуетсяГрафикПроизводства
	|	И ИСТИНА НЕ В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК Таблица
	|			ГДЕ
	|				Таблица.ЗаказНаПроизводство = Резервы.ЗаказНаПроизводство
	|				И Таблица.СтатусГрафика = 0)
	|	И Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение)
	|	И Резервы.НоваяЗапись
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ // задания к расчету состояния обеспечения этапов
	|
	|	План.Этап КАК Этап
	|
	|ИЗ
	|	РасчетИзменений КАК План
	|
	|ГДЕ
	|	План.Этап ССЫЛКА Документ.ЭтапПроизводства2_2
	|		И План.РаспределеноИзНаличияНаСкладеДо <> План.РаспределеноИзНаличияНаСкладеПосле
	|		И (План.КОбеспечению > План.РаспределеноИзНаличияНаСкладеПосле
	|				И План.КОбеспечению <= План.РаспределеноИзНаличияНаСкладеДо
	|			ИЛИ План.КОбеспечению > План.РаспределеноИзНаличияНаСкладеДо
	|				И План.КОбеспечению <= План.РаспределеноИзНаличияНаСкладеПосле)
	|;
	|ВЫБРАТЬ
	|
	|	Резервы.Номенклатура          КАК Номенклатура,
	|	Резервы.Характеристика        КАК Характеристика,
	|	Резервы.Склад                 КАК Склад,
	|	Резервы.Назначение            КАК Назначение,
	|	Резервы.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
	|	Резервы.КлючНоменклатура      КАК КлючНоменклатура,
	|	Резервы.КлючПартия            КАК КлючПартия,
	|	Резервы.ВидСтроки             КАК ВидСтроки,
	|	Резервы.ЗаказНаПоступление    КАК ЗаказНаПоступление,
	|	Резервы.ДатаПоступления       КАК ДатаПоступления,
	|	Резервы.Этап                  КАК Этап,
	|	Резервы.Подразделение         КАК Подразделение,
	|	Резервы.НазначениеСтруктуры   КАК НазначениеСтруктуры,
	|	Резервы.КлючСвязиПеремещение  КАК КлючСвязиПеремещение,
	|	Резервы.КлючСвязиСтрокаСпецификации КАК КлючСвязиСтрокаСпецификации,
	|	Резервы.Уровень               КАК Уровень,
	|	Резервы.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
	|	Резервы.ИдентификаторВГруппеИзделий КАК ИдентификаторВГруппеИзделий,
	|	Резервы.КоличествоНаЕдиницуПартииЗапуска КАК КоличествоНаЕдиницуПартииЗапуска,
	|	Резервы.РазрешениеНаЗамену    КАК РазрешениеНаЗамену,
	|	Резервы.Спецификация          КАК Спецификация,
	|	
	|	ВЫБОР
	|		КОГДА Резервы.КлючНаборПотребностиАналога <> &ПустойКлючСвязи
	|		ТОГДА Резервы.КлючНаборПотребностиАналога
	|		КОГДА (Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление) И Резервы.Требуется <> 0
	|			ИЛИ Резервы.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение))
	|		ТОГДА Резервы.КлючПартия
	|		ИНАЧЕ ПорцииЗаписи.КлючНабор
	|	КОНЕЦ КАК КлючНабор,
	|
	|	Резервы.Требуется                        КАК КОбеспечению,
	|	Резервы.Запланировано                    КАК Запланировано,
	|	Резервы.РаспределеноИзЗапасовОбособленно КАК РаспределеноИзЗапасовОбособленно,
	|	Резервы.РаспределеноИзЗапасов            КАК РаспределеноИзЗапасов,
	|	Резервы.РаспределеноИзПартийОбособленно  КАК РаспределеноИзПартийОбособленно,
	|	Резервы.РаспределеноИзПартий             КАК РаспределеноИзПартий,
	|	Резервы.Заменено                         КАК Заменено,
	|	Резервы.НеОбеспечивать                   КАК НеОбеспечивать,
	|
	|	ВЫБОР
	|		КОГДА &РассчитыватьИзменения И НЕ Резервы.НоваяЗапись ТОГДА
	|			&РазделительЗаписи
	|		ИНАЧЕ
	|			&ПустойКлючСвязи
	|	КОНЕЦ КАК Разделитель,
	|
	|	&РассчитыватьИзменения И НЕ Резервы.НоваяЗапись КАК ДополнительнаяЗапись
	|	
	|ИЗ
	|	
	|	РезервыИзменения КАК Резервы
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорцииЗаписи КАК ПорцииЗаписи
	|	ПО Резервы.Номенклатура   = ПорцииЗаписи.Номенклатура
	|	 И Резервы.Характеристика = ПорцииЗаписи.Характеристика
	|	 И Резервы.Склад          = ПорцииЗаписи.Склад
	|	 И Резервы.Назначение     = ПорцииЗаписи.Назначение
	|	 И Резервы.ДетальнаяЗапись
	|
	|ГДЕ
	|	(&РассчитыватьИзменения
	|			ИЛИ Резервы.Запланировано <> 0
	|			ИЛИ Резервы.Требуется <> 0
	|			ИЛИ Резервы.Заменено <> 0
	|			ИЛИ Резервы.НеОбеспечивать <> 0
	|			ИЛИ Резервы.РаспределеноИзЗапасов <> 0
	|			ИЛИ Резервы.РаспределеноИзЗапасовОбособленно <> 0
	|			ИЛИ Резервы.РаспределеноИзПартий <> 0
	|			ИЛИ Резервы.РаспределеноИзПартийОбособленно <> 0)
	|;";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоПакетов = РезультатЗапроса.Количество();
	
	КлючиНаборы = РезультатЗапроса[КоличествоПакетов-5].Выгрузить();
	КэшКлючейСвязи = РезультатЗапроса[КоличествоПакетов-4].Выгрузить();
	ЗаданияКРасчетуГрафика = РезультатЗапроса[КоличествоПакетов-3].Выгрузить();
	НеактуальныеЭтапы = РезультатЗапроса[КоличествоПакетов-2].Выгрузить().ВыгрузитьКолонку(0);
	РезультатРасчета = РезультатЗапроса[КоличествоПакетов-1].Выгрузить();
	
	СчетчикОшибок = 1;
	Пока Истина Цикл
		
		НачатьТранзакцию();
		Попытка
		
#Область ЗаписьРаспределения
			Если РассчитыватьИзменения Тогда
				СтруктураЗаказа.ЗаполнитьИЗаписатьНаборЗаписей(РегистрыСведений.СтруктураЗаказа.СоздатьНаборЗаписей(), РезультатРасчета);
			Иначе
				
				НаборЗаписей = РегистрыСведений.СтруктураЗаказа.СоздатьНаборЗаписей();
				ПорцияЗаписиСтруктура = Новый Структура("КлючНабор", ПустойКлючСвязи);
				РезультатРасчета.Индексы.Добавить("КлючНабор");
				
				Для каждого СтрокаТаблицы Из КлючиНаборы Цикл
					
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.КлючНабор) Тогда
						Продолжить;
					КонецЕсли;
					
					ПорцияЗаписиСтруктура.КлючНабор = СтрокаТаблицы.КлючНабор;
				
					НаборЗаписей.Отбор.КлючНабор.Установить(ПорцияЗаписиСтруктура.КлючНабор);
					НаборЗаписей.Загрузить(РезультатРасчета.Скопировать(ПорцияЗаписиСтруктура));
					НаборЗаписей.Записать(Истина);
					НаборЗаписей.Очистить();	
					
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти

#Область ЗаписьКлючейВКэш
		ЗаписиКУдалению = КэшКлючейСвязи.Скопировать(Новый Структура("НоваяЗапись", Ложь));
		ЗаписиКДобавлению = КэшКлючейСвязи.Скопировать(Новый Структура("НоваяЗапись", Истина));
		Если ЗаписиКУдалению.Количество() > 0 Тогда
		
			Набор = РегистрыСведений.КэшИдентификаторовСвязейНоменклатурыПоРазрешениямНаЗамену.СоздатьНаборЗаписей();
			Набор.Отбор.Сбросить();
			Набор.Загрузить(ЗаписиКУдалению);
			Набор.Записать(РежимЗамещения.Удаление);
		
		КонецЕсли;
		
		Если ЗаписиКДобавлению.Количество() > 0 Тогда
		
			Набор = РегистрыСведений.КэшИдентификаторовСвязейНоменклатурыПоРазрешениямНаЗамену.СоздатьНаборЗаписей();
			Набор.Отбор.Сбросить();
			Набор.Загрузить(ЗаписиКДобавлению);
			Набор.Записать(РежимЗамещения.Слияние);
		
		КонецЕсли;
#КонецОбласти

#Область ПриИзмененииОбеспечения
			
			Если Не ИспользуетсяГрафикПроизводства Тогда
				РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.ДобавитьЗаданияИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц,
					"РезервыИзменения",
					"РезервыИзменения.ЗаказНаПроизводство",
					"NULL",
					"РезервыИзменения.КлючПартия",
					"РезервыИзменения.ВидСтроки В (ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката), 
					|	ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Перемещение))");
			Иначе
				
				Если ЗаданияКРасчетуГрафика.Количество() > 0 Тогда
					РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.ДобавитьЗадания(ЗаданияКРасчетуГрафика);
				КонецЕсли;
				
				УправлениеПроизводством.ПроверитьСрокиОбеспеченияЭтаповДинамическаяСтруктура(МенеджерВременныхТаблиц,
					"(&ТекстИмяТаблицы.Номенклатура,
					|	&ТекстИмяТаблицы.Характеристика,
					|	&ТекстИмяТаблицы.Склад,
					|	&ТекстИмяТаблицы.Назначение,
					|	&ТекстИмяТаблицы.ЗаказНаПроизводство,
					|	&ТекстИмяТаблицы.КлючНоменклатура,
					|	&ТекстИмяТаблицы.КлючПартия
					|) В
					|(ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Резервы.Номенклатура          КАК Номенклатура,
					|	Резервы.Характеристика        КАК Характеристика,
					|	Резервы.Склад                 КАК Склад,
					|	Резервы.Назначение            КАК Назначение,
					|	Резервы.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
					|	Резервы.КлючНоменклатура      КАК КлючНоменклатура,
					|	Резервы.КлючПартия            КАК КлючПартия
					|ИЗ
					|	РезервыИзменения КАК Резервы
					|ГДЕ
					|	Резервы.ДетальнаяЗапись)");
			КонецЕсли;
			
#КонецОбласти
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Если СчетчикОшибок < КоличествоПопытокЗаписи() Тогда
				ЗаписатьНеудачнуюПопыткуЗаписиВЖурналРегистрации(СчетчикОшибок, ТекстОшибки);
				СчетчикОшибок = СчетчикОшибок + 1;
				Продолжить;
			КонецЕсли;
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
		Прервать;
		
	КонецЦикла;
	
	Если НеактуальныеЭтапы.Количество() > 0 Тогда
		СостоянияДокументов.ДобавитьЗаданияКОтражениюСостоянияЗаказов(
			Неопределено,
			НеактуальныеЭтапы,
			"ДЕЙСТВИЕ_ОБНОВИТЬ_СОСТОЯНИЕ_ОБЕСПЕЧЕНИЯ",
			"СостоянияЭтаповПроизводства");
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьИПоместитьВКэшСпособыОбеспечения(МенеджерВременныхТаблиц, ИмяВременнойТаблицы = "НоменклатурныйПлан", УдалитьВТ = Ложь)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустаяСпецификация", Справочники.РесурсныеСпецификации.ПустаяСсылка());
	Запрос.Текст =
		"ВЫБРАТЬ
		|   
		|	МАКСИМУМ(План.ИндексСтроки) КАК ИндексСтрокиНоменклатурногоПлана,
		|	План.Номенклатура КАК Номенклатура,
		|	План.Характеристика КАК Характеристика,
		|	План.Склад КАК Склад,
		|	План.Назначение КАК Назначение,
		|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|
		|	МАКСИМУМ(План.ЭтоПродукция) КАК ЭтоПродукция,
		|
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
		|				ВЫБОР
		|					КОГДА План.СпецификацияПолуфабриката <> &ПустаяСпецификация
		|					ТОГДА План.СпецификацияПолуфабриката
		|				КОНЕЦ) > 1
		|		ТОГДА
		|			&ПустаяСпецификация
		|		ИНАЧЕ
		|			МАКСИМУМ(План.СпецификацияПолуфабриката)
		|	КОНЕЦ КАК Спецификация,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(План.СпецификацияПолуфабриката) <> &ПустаяСпецификация ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК Предопределенная,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(КэшНСИ.Спецификация) <> МАКСИМУМ(План.СпецификацияПолуфабриката)
		|			И МАКСИМУМ(КэшНСИ.Номенклатура ЕСТЬ НЕ NULL) ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК Заменить,
		|
		|	МАКСИМУМ(План.Спецификация) КАК СпецификацияРодитель,
		|	МАКСИМУМ(План.КлючСвязиСтрокаСпецификации) КАК КлючСвязиСтрокаСпецификацииРодитель
		|
		|ПОМЕСТИТЬ ИзмененныеСтроки
		|
		|ИЗ
		|	НоменклатурныйПлан КАК План
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КэшНСИСтруктурыЗаказа КАК КэшНСИ
		|	ПО План.Номенклатура        = КэшНСИ.Номенклатура
		|	 И План.Характеристика      = КэшНСИ.Характеристика
		|	 И План.Склад               = КэшНСИ.Склад
		|	 И План.Назначение          = КэшНСИ.Назначение
		|	 И План.ЗаказНаПроизводство = КэшНСИ.ЗаказНаПроизводство
		|
		|ГДЕ
		|	(План.Заказано + План.КОбеспечению) > 0
		|	 И (КэшНСИ.Номенклатура ЕСТЬ NULL
		|		ИЛИ КэшНСИ.Предопределенная
		|		ИЛИ План.СпецификацияПолуфабриката <> &ПустаяСпецификация)
		|
		|СГРУППИРОВАТЬ ПО
		|	План.Номенклатура,
		|	План.Характеристика,
		|	План.Склад,
		|	План.Назначение,
		|	План.ЗаказНаПроизводство
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(КэшНСИ.Номенклатура) ЕСТЬ NULL
		|	  ИЛИ ВЫБОР
		|			КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
		|				ВЫБОР
		|					КОГДА План.СпецификацияПолуфабриката <> &ПустаяСпецификация
		|					ТОГДА План.СпецификацияПолуфабриката
		|				КОНЕЦ) > 1
		|			ТОГДА &ПустаяСпецификация ИНАЧЕ МАКСИМУМ(План.СпецификацияПолуфабриката)
		|		КОНЕЦ <> МАКСИМУМ(КэшНСИ.Спецификация)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Назначение,
		|	ЗаказНаПроизводство
		|;
		|";

	Если ИмяВременнойТаблицы <> "НоменклатурныйПлан" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НоменклатурныйПлан", ИмяВременнойТаблицы);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Выгрузить()[0].Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
		"" + Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь) +
		"ВЫБРАТЬ
		|
		|	АвтоНомерЗаписи() КАК ИндексДанных,
		|	План.ИндексСтрокиНоменклатурногоПлана КАК ИндексСтрокиНоменклатурногоПлана,
		|
		|	План.Номенклатура КАК Номенклатура,
		|	План.Характеристика КАК Характеристика,
		|	План.Склад КАК Склад,
		|	План.Назначение КАК Назначение,
		|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|
		|	План.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|
		|	План.ЗаказНаПроизводство.Подразделение КАК ПодразделениеДиспетчер,
		|	План.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	План.ЗаказНаПроизводство.НачатьНеРанее КАК НачалоПроизводства,
		|
		|	План.Спецификация КАК Спецификация,
		|	План.Предопределенная КАК Предопределенная,
		|	План.Заменить КАК Заменить,
		|
		|	План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
		|	План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|		И План.ЭтоПродукция КАК ЭтоРазбираемоеИзделие,
		|
		|	ISNULL(ВыполняемыеРаботы.РемонтируемоеИзделиеНоменклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК РемонтируемоеИзделиеНоменклатура,
		|	ISNULL(ВыполняемыеРаботы.РемонтируемоеИзделиеХарактеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК РемонтируемоеИзделиеХарактеристика,
		|
		|	ВЫБОР
		|		КОГДА План.Предопределенная
		|				ИЛИ План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот)
		|					И ЕСТЬNULL(ВыполняемыеРаботы.ПроизводитсяВПроцессе, ЛОЖЬ) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
		|		ИНАЧЕ
		|			ISNULL(СпособыОбеспеченияПотребностей.ТипОбеспечения, ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка))
		|	КОНЕЦ КАК ТипОбеспечения,
		|	ВЫБОР
		|		КОГДА План.Предопределенная
		|				ИЛИ План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот)
		|					И ЕСТЬNULL(ВыполняемыеРаботы.ПроизводитсяВПроцессе, ЛОЖЬ) ТОГДА
		|			ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)
		|		ИНАЧЕ
		|			ISNULL(СпособыОбеспеченияПотребностей.Ссылка, ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка))
		|	КОНЕЦ КАК СпособОбеспечения,
		|
		|	ВЫБОР
		|		КОГДА План.Предопределенная
		|				ИЛИ План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот)
		|					И ЕСТЬNULL(ВыполняемыеРаботы.ПроизводитсяВПроцессе, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		КОГДА (План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка)
		|				ИЛИ План.ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|					И План.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|				И (План.ЗаказНаПроизводство.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|					ИЛИ ЕСТЬNULL(СпособыОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|						В (План.ЗаказНаПроизводство.Подразделение,
		|							НЕОПРЕДЕЛЕНО,
		|							ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)))
		|						И ЕСТЬNULL(СпособыОбеспеченияПотребностей.ТипОбеспечения,
		|						   ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
		|					И ЕСТЬNULL(СпособыОбеспеченияПотребностей.СпособПланированияПолуфабрикатов,
		|						   ЗНАЧЕНИЕ(Перечисление.СпособыПланированияПолуфабрикатов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияПолуфабрикатов.Автоматически)
		|					И План.Номенклатура.Качество В (ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый),
		|												ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		КОГДА ЕСТЬNULL(СпособыОбеспеченияПотребностей.ТипОбеспечения, ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
		|				И НЕ СпособыОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей В (
		|						План.Склад,
		|						НЕОПРЕДЕЛЕНО,
		|						ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Запланировать
		|
		|ПОМЕСТИТЬ СписокНоменклатуры
		|ИЗ
		|	ИзмененныеСтроки КАК План
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыполняемыеРаботы КАК ВыполняемыеРаботы
		|		ПО План.СпецификацияРодитель = ВыполняемыеРаботы.Ссылка
		|		 И План.КлючСвязиСтрокаСпецификацииРодитель = ВыполняемыеРаботы.КлючСвязи
		|		 И НЕ План.Предопределенная
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпособыОбеспеченияПотребностей
		|		ПО &ПодстановкаОсновногоСпособаОбеспечения
		|		 И НЕ План.Предопределенная
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИндексДанных
		|;";
	
	ПоляСоединения = "План.Номенклатура, План.Характеристика, План.Склад";
	ИмяПараметра = "ПодстановкаОсновногоСпособаОбеспечения";
	
	Запрос.Текст = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
		Запрос.Текст, ИмяПараметра, ПоляСоединения);
	
	Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	СписокНоменклатуры.ИндексДанных КАК ИндексДанных,
		|	СписокНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
		|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СписокНоменклатуры.Характеристика КАК Характеристика,
		|	СписокНоменклатуры.НачалоПроизводства КАК НачалоПроизводства,
		|	СписокНоменклатуры.ПодразделениеДиспетчер КАК ПодразделениеДиспетчер,
		|	СписокНоменклатуры.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	СписокНоменклатуры.РемонтируемоеИзделиеНоменклатура КАК РемонтируемоеИзделиеНоменклатура,
		|	СписокНоменклатуры.РемонтируемоеИзделиеХарактеристика КАК РемонтируемоеИзделиеХарактеристика,
		|	ВЫБОР
		|		КОГДА СписокНоменклатуры.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот) ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка)
		|	КОНЕЦ КАК ТипПроизводства
		|ПОМЕСТИТЬ ПроизводимаяНоменклатура
		|ИЗ
		|	СписокНоменклатуры КАК СписокНоменклатуры
		|
		|ГДЕ
		|	НЕ СписокНоменклатуры.Предопределенная
		|	И (СписокНоменклатуры.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка)
		|			ИЛИ СписокНоменклатуры.Запланировать
		|				И СписокНоменклатуры.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство))
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	План.ТипПроизводства КАК ТипПроизводства
		|ИЗ
		|	ПроизводимаяНоменклатура КАК План";
	
	ТипыПроизводства = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	Если ТипыПроизводства.Количество() = 0 Тогда 
		
		Запрос.Текст = // не нужен подбор спецификаций
			"ВЫБРАТЬ
			|	
			|	План.ИндексСтрокиНоменклатурногоПлана КАК ИндексСтрокиНоменклатурногоПлана,
			|	План.Номенклатура КАК Номенклатура,
			|	План.Характеристика КАК Характеристика,
			|	План.Склад КАК Склад,
			|	План.Назначение КАК Назначение,
			|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
			|
			|	План.Спецификация КАК Спецификация,
			|	План.Предопределенная КАК Предопределенная,
			|	План.Заменить КАК Заменить,
			|
			|	План.ЭтоРазбираемоеИзделие КАК ЭтоРазбираемоеИзделие,
			|
			|	План.ТипОбеспечения КАК ТипОбеспечения,
			|	План.СпособОбеспечения КАК СпособОбеспечения,
			|	План.СпособОбеспечения.ИсточникОбеспеченияПотребностей КАК ИсточникОбеспеченияПотребностей,
			|	План.Запланировать КАК Запланировать
			|
			|ИЗ
			|	СписокНоменклатуры КАК План
			|;
			|УНИЧТОЖИТЬ ИзмененныеСтроки;
			|УНИЧТОЖИТЬ ВтФорматыСкладов;
			|УНИЧТОЖИТЬ СписокНоменклатуры;
			|УНИЧТОЖИТЬ ПроизводимаяНоменклатура;
			|";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		КэшируемыеЗначения = РезультатЗапроса[0].Выгрузить();
		
	Иначе
		
		ТекстыПодбораСпецификаций = Новый Массив();
		
		ПараметрыЗапросаСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыТекстаЗапросаСпецификацийИзделий();
		ПараметрыЗапросаСпецификаций.ТолькоПриоритетные = Истина;
		ПараметрыЗапросаСпецификаций.ИмяВходнойТаблицы = "ПроизводимаяНоменклатура";
		ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы = "СпецификацииНоменклатуры";
		ПараметрыЗапросаСпецификаций.УничтожитьВременныеТаблицы = Истина;
		
		Если ТипыПроизводства.Найти(Перечисления.ТипыПроизводственныхПроцессов.Сборка) <> Неопределено Тогда
			
			ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификацийНаИзготовлениеСборку();
			
			ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы = "СпецификацииНоменклатуры_Сборка";
			
			Если МенеджерВременныхТаблиц.Таблицы.Найти(ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы) <> Неопределено Тогда
			
				ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы));
			
			КонецЕсли;
			
			ПараметрыЗапросаСпецификаций.УсловияОтбораВходящихДанных.Очистить();
			ПараметрыЗапросаСпецификаций.УсловияОтбораВходящихДанных.Добавить(
				"ПроизводимаяНоменклатура.ТипПроизводства = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка)");
			
			УправлениеДаннымиОбИзделиях.УстановитьПараметрыЗапросаСпецификацийИзделий(Запрос, ПараметрыВыбораСпецификаций);
			
			Запрос.Текст = УправлениеДаннымиОбИзделиях.ТекстЗапросаСпецификацийИзделий(
				ПараметрыЗапросаСпецификаций,
				ПараметрыВыбораСпецификаций);
			
			Запрос.Выполнить();
			
			// Ошибка платформы ПараметрыЗапросаСпецификаций.ДополнитьВыходнуюТаблицу = Истина;
			ТекстыПодбораСпецификаций.Добавить("ВЫБРАТЬ * ИЗ СпецификацииНоменклатуры_Сборка");
			
		КонецЕсли;
		
		Если ТипыПроизводства.Найти(Перечисления.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот) <> Неопределено Тогда
			
			ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификацийНаВыполнениеРемонтныхРабот();
			
			ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы = "СпецификацииНоменклатуры_ВыполнениеРемонтныхРабот";
			
			Если МенеджерВременныхТаблиц.Таблицы.Найти(ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы) <> Неопределено Тогда
			
				ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыЗапросаСпецификаций.ИмяВыходнойТаблицы));
			
			КонецЕсли;
			
			ПараметрыЗапросаСпецификаций.УсловияОтбораВходящихДанных.Очистить();
			ПараметрыЗапросаСпецификаций.УсловияОтбораВходящихДанных.Добавить(
				"ПроизводимаяНоменклатура.ТипПроизводства = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.ВыполнениеРемонтныхРабот)");
			
			УправлениеДаннымиОбИзделиях.УстановитьПараметрыЗапросаСпецификацийИзделий(Запрос, ПараметрыВыбораСпецификаций);
			
			Запрос.Текст = УправлениеДаннымиОбИзделиях.ТекстЗапросаСпецификацийИзделий(
				ПараметрыЗапросаСпецификаций,
				ПараметрыВыбораСпецификаций);
			
			Запрос.Выполнить();
			
			// Ошибка платформы ПараметрыЗапросаСпецификаций.ДополнитьВыходнуюТаблицу = Истина;
			ТекстыПодбораСпецификаций.Добавить("ВЫБРАТЬ * ИЗ СпецификацииНоменклатуры_ВыполнениеРемонтныхРабот");
			
		КонецЕсли;
		
		Запрос.Текст = 
			СтрЗаменить(
			"ВЫБРАТЬ
			|	Таблица.ИндексДанных КАК ИндексДанных,
			|	Таблица.Спецификация КАК Спецификация
			|ПОМЕСТИТЬ СпецификацииНоменклатуры
			|ИЗ
			|	ТекстСпецификацииНоменклатуры КАК Таблица
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ИндексДанных
			|;",
			"ТекстСпецификацииНоменклатуры",
			"(" + СтрСоединить(ТекстыПодбораСпецификаций, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()) + ")");
	
		Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	
			|	План.ИндексСтрокиНоменклатурногоПлана КАК ИндексСтрокиНоменклатурногоПлана,
			|	План.Номенклатура КАК Номенклатура,
			|	План.Характеристика КАК Характеристика,
			|	План.Склад КАК Склад,
			|	План.Назначение КАК Назначение,
			|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
			|
			|	ISNULL(СпецификацииНоменклатуры.Спецификация, План.Спецификация) КАК Спецификация,
			|	План.Предопределенная КАК Предопределенная,
			|	План.Заменить КАК Заменить,
			|
			|	План.ЭтоРазбираемоеИзделие КАК ЭтоРазбираемоеИзделие,
			|
			|	ВЫБОР
			|		КОГДА План.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.ПустаяСсылка)
			|			ТОГДА
			|				ВЫБОР КОГДА СпецификацииНоменклатуры.Спецификация ЕСТЬ NULL
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка)
			|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
			|				КОНЕЦ
			|			ИНАЧЕ План.ТипОбеспечения
			|	КОНЕЦ КАК ТипОбеспечения,
			|	План.СпособОбеспечения КАК СпособОбеспечения,
			|	План.СпособОбеспечения.ИсточникОбеспеченияПотребностей КАК ИсточникОбеспеченияПотребностей,
			|	ВЫБОР
			|		КОГДА СпецификацииНоменклатуры.Спецификация ЕСТЬ НЕ NULL ТОГДА
			|			ИСТИНА
			|		ИНАЧЕ
			|			План.Запланировать
			|	КОНЕЦ КАК Запланировать
			|
			|ИЗ
			|	СписокНоменклатуры КАК План
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
			|		ПО План.ИндексДанных = СпецификацииНоменклатуры.ИндексДанных
			|;
			|УНИЧТОЖИТЬ ИзмененныеСтроки;
			|УНИЧТОЖИТЬ ВтФорматыСкладов;
			|УНИЧТОЖИТЬ СписокНоменклатуры;
			|УНИЧТОЖИТЬ ПроизводимаяНоменклатура;
			|УНИЧТОЖИТЬ СпецификацииНоменклатуры;
			|";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет(); 
		КэшируемыеЗначения = РезультатЗапроса[1].Выгрузить();
		
	КонецЕсли;
	
	Замена = КэшируемыеЗначения.НайтиСтроки(Новый Структура("Заменить", Истина));
	
	Если Замена.Количество() > 0 Тогда
		РегистрыСведений.КэшНСИСтруктурыЗаказа.ЗаменитьКэшируемыеЗначения(Замена);
		УдалитьСтрокиИзТаблицы(КэшируемыеЗначения, Замена);
	КонецЕсли;
	
	РегистрыСведений.КэшНСИСтруктурыЗаказа.ЗаписатьКэшируемыеЗначения(КэшируемыеЗначения);
		
	ТаблицаКэшаПеремещений = КэшируемыеЗначения.Скопировать(Новый Структура("ТипОбеспечения, Запланировать", Перечисления.ТипыОбеспечения.Перемещение, Истина));
	
	Если ТаблицаКэшаПеремещений.Количество() > 0 Тогда
		
		ТекстОчистка = "";
		
		Если УдалитьВТ Тогда
		
			ТекстОчистка = "УНИЧТОЖИТЬ ИмяТаблицы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			ТекстОчистка = СтрЗаменить(ТекстОчистка, "ИмяТаблицы", ИмяВременнойТаблицы);	
		
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = ТекстОчистка + 
		"ВЫБРАТЬ
		|	Товары.ИндексСтрокиНоменклатурногоПлана КАК ИндексСтрокиНоменклатурногоПлана,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.ИсточникОбеспеченияПотребностей КАК Склад,
		|	Товары.Назначение КАК Назначение,
		|	Товары.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ПОМЕСТИТЬ ТаблицаКэшаПеремещений
		|ИЗ
		|	&ТаблицаКэшаПеремещений КАК Товары
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Назначение,
		|	ЗаказНаПроизводство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад КАК Склад,
		|	Товары.Назначение КАК Назначение,
		|	Товары.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	НоменклатурныйПлан.Заказано КАК Заказано,
		|	НоменклатурныйПлан.КОбеспечению КАК КОбеспечению,
		|	НоменклатурныйПлан.ИндексСтроки КАК ИндексСтроки,
		|	НоменклатурныйПлан.Спецификация КАК Спецификация,
		|	НоменклатурныйПлан.ЭтоПродукция ЭтоПродукция,
		|	НоменклатурныйПлан.КлючСвязиСтрокаСпецификации КАК КлючСвязиСтрокаСпецификации,
		|	НоменклатурныйПлан.СпецификацияПолуфабриката КАК СпецификацияПолуфабриката
		|ПОМЕСТИТЬ ПорцияРасчетаКэша
		|ИЗ
		|	ТаблицаКэшаПеремещений КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатурныйПлан КАК НоменклатурныйПлан
		|		ПО Товары.ИндексСтрокиНоменклатурногоПлана = НоменклатурныйПлан.ИндексСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаКэшаПеремещений";
		
		Запрос.УстановитьПараметр("ТаблицаКэшаПеремещений", ТаблицаКэшаПеремещений);
		
		Запрос.Выполнить();
		ПолучитьИПоместитьВКэшСпособыОбеспечения(МенеджерВременныхТаблиц, "ПорцияРасчетаКэша", Истина);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапланироватьПроизводство(ПараметрыРасчета, МенеджерВременныхТаблиц, ИмяВременнойТаблицы, НомерОчереди)
	
	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПустойИдентификатор", ПустойИдентификатор);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|
	|	План.Спецификация        КАК Спецификация,
	|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|
	|ИЗ
	|	ПланПроизводства КАК План
	|
	|ГДЕ
	|	План.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|
	|	План.Номенклатура        КАК Номенклатура,
	|	План.Характеристика      КАК Характеристика,
	|	План.Склад               КАК Склад,
	|	План.Назначение          КАК Назначение,
	|	План.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	План.ИдентификаторОшибки КАК ИдентификаторОшибки
	|
	|ИЗ
	|	ПланПроизводства КАК План
	|
	|ГДЕ
	|	План.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Производство)
	|		И План.ИдентификаторОшибки <> &ПустойИдентификатор
	|		И План.Спецификация = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|";
	
	Если ИмяВременнойТаблицы <> "ПланПроизводства" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланПроизводства", ИмяВременнойТаблицы);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// задания к расчету структуры заказа
	
	Если Не РезультатЗапроса[0].Пустой() Тогда
		РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации.ДобавитьЗаданияВКонецОчереди(РезультатЗапроса[0].Выгрузить(), НомерОчереди);
	КонецЕсли;
	
	// ошибки подбора спецификаций
	
	Если Не РезультатЗапроса[1].Пустой() Тогда
		
		Ошибки = РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		
		СтруктураОшибок = Новый Структура();
		СтруктураОшибок.Вставить("ТипОшибки", Перечисления.ТипыОшибокРасчетаСтруктурыЗаказаНаПроизводство.ОшибкаПодбораСпецификаций);
		СтруктураОшибок.Вставить("Ошибки", Ошибки);
		
		Протокол = Новый Структура("Номенклатура,Характеристика,Склад,Назначение,ЗаказНаПроизводство"); //@skip-warning
		
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			Ошибка = Ошибки.Добавить();
			ЗаполнитьЗначенияСвойств(Ошибка, Выборка, "ИдентификаторОшибки,ЗаказНаПроизводство");
			ЗаполнитьЗначенияСвойств(Протокол, Выборка);
			Ошибка.Протокол = Новый ХранилищеЗначения(Протокол, Новый СжатиеДанных(9));
		КонецЦикла;
		
		РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.ЗарегистрироватьОшибки(СтруктураОшибок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНаборЗаписейПоКлючу(КлючНабор) Экспорт
	
	НаборЗаписей = РегистрыСведений.СтруктураЗаказа.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.КлючНабор.Установить(КлючНабор);

	ЗаписатьНаборЗаписейВПопытке(НаборЗаписей, Истина);
	
КонецПроцедуры

Функция ДанныеОбАналогахДляРасчетаСтруктурыЗаказа(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	ТекстЗапросаМатериалыИАналоги = 
	"ВЫБРАТЬ
	|	СвязиМатериаловИАналогов.Разрешение КАК Разрешение,
	|	СвязиМатериаловИАналогов.Ссылка КАК Ссылка,
	|	СвязиМатериаловИАналогов.НомерСтроки КАК НомерСтроки,
	|	СвязиМатериаловИАналогов.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК ДанныеУпаковки,
	|	СвязиМатериаловИАналогов.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК КонтролироватьКратность,
	|	СвязиМатериаловИАналогов.Характеристика КАК Характеристика,
	|	СвязиМатериаловИАналогов.ПриоритетЗамены = ЗНАЧЕНИЕ(Перечисление.ПравилаЗаменыНаАналоги.ПриНаличииАналога) КАК ПриоритетныйАналог,
	|	СвязиМатериаловИАналогов.Упаковка КАК Упаковка,
	|	СвязиМатериаловИАналогов.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЕСТЬNULL(&ТекстКоэффициентУпаковки, 1) * СвязиМатериаловИАналогов.КоличествоУпаковок КАК Норматив,
	|	СвязиМатериаловИАналогов.МаксимальныйПриоритетОбластиДействия КАК МаксимальныйПриоритетОбластиДействия,
	|	СвязиМатериаловИАналогов.КлючСвязи КАК КлючСвязи,
	|	СвязиМатериаловИАналогов.ЭтоАналог КАК ЭтоАналог,
	|	ВЫБОР
	|		КОГДА СвязиМатериаловИАналогов.ПриоритетЗамены = ЗНАЧЕНИЕ(Перечисление.ПравилаЗаменыНаАналоги.ПриНаличииАналога)
	|			ТОГДА 1
	|		КОГДА СвязиМатериаловИАналогов.ПриоритетЗамены = ЗНАЧЕНИЕ(Перечисление.ПравилаЗаменыНаАналоги.ПриОтсутствииМатериала)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ КАК ПриоритетЗамены
	|ИЗ
	|	СвязиМатериаловИАналогов КАК СвязиМатериаловИАналогов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоАналог, 
	|	ПриоритетЗамены,
	|	МаксимальныйПриоритетОбластиДействия УБЫВ,
	|	Период УБЫВ,
	|	Разрешение,
	|	НомерСтроки"; // порядок аналогичен механизмам в модуле АналогиМатериалов (см. АналогиМатериалов.ТекстЗапросаРазрешенияПоПриоритетам)
	
	ТекстЗапросаМатериалыИАналоги = СтрЗаменить(ТекстЗапросаМатериалыИАналоги, "&ТекстКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"СвязиМатериаловИАналогов.Упаковка",
			"СвязиМатериаловИАналогов.Номенклатура"));
		
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("СвязиМатериаловИАналогов");
		
	ТекстЗапросаДанныеУпаковки = УправлениеДаннымиОбИзделиях.ТекстЗапросаДанныеУпаковок(ИменаТаблиц);
	
	МассивТекстов = Новый Массив;
	МассивТекстов.Добавить(ТекстЗапросаДанныеУпаковки);
	МассивТекстов.Добавить(ТекстЗапросаМатериалыИАналоги);
	
	ТекстЗапроса = СтрСоединить(МассивТекстов, ОбщегоНазначения.РазделительПакетаЗапросов());
				
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаРазрешений = МассивРезультатов[МассивРезультатов.ВГраница()].Выгрузить();
	
	ТаблицаДанныеУпаковок = МассивРезультатов[МассивРезультатов.ВГраница() - 1].Выгрузить();
	УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВНабореДанных(ТаблицаРазрешений, ТаблицаДанныеУпаковок);
	
	МатериалыИАналоги = ТаблицаРазрешений.СкопироватьКолонки();
	МатериалыИАналоги.Колонки.Добавить("Аналоги", Новый ОписаниеТипов("ТаблицаЗначений"));
	МатериалыИАналоги.Индексы.Добавить("Разрешение, Ссылка, КлючСвязи");
	
	ТаблицаАналогов = Новый ТаблицаЗначений;
	ТаблицаАналогов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаАналогов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаАналогов.Колонки.Добавить("ДанныеУпаковки", Новый ОписаниеТипов("ФиксированнаяСтруктура"));
	ТаблицаАналогов.Колонки.Добавить("ГрафикиТовара", Новый ОписаниеТипов("Массив"));
	ТаблицаАналогов.Колонки.Добавить("КлючНоменклатураАналог", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаАналогов.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	
	СтруктураПоиска = Новый Структура("Разрешение, Ссылка, КлючСвязи");
	
	Для каждого СтрокаРазрешения Из ТаблицаРазрешений Цикл
	
		Если СтрокаРазрешения.ЭтоАналог Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРазрешения);
			СтрокиМатериалов = МатериалыИАналоги.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаТаблицыМатериалов Из СтрокиМатериалов Цикл
			
				НоваяСтрока = СтрокаТаблицыМатериалов.Аналоги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРазрешения);
			
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока = МатериалыИАналоги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРазрешения);
			НоваяСтрока.Аналоги = ТаблицаАналогов.СкопироватьКолонки();
		
		КонецЕсли;
	
	КонецЦикла;
		
	Возврат МатериалыИАналоги;

КонецФункции

#КонецОбласти

#Область НСИ

Функция ПараметрыВыборкиДанныхСпецификации()
	
	ПараметрыВыборкиДанных = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных("ВыходныеИзделия,ВозвратныеОтходы,МатериалыИУслуги,Трудозатраты");
	
	ПараметрыВыборкиДанных.РассчитыватьПризнакЗапланироватьПроизводство = Истина; // ПроизводствоИзДавальческогоСырья
	ПараметрыВыборкиДанных.ОбъединитьМатериалыИВходящиеИзделия         = Истина;
	ПараметрыВыборкиДанных.ОбъединитьМатериалыИВыполняемыеРаботы       = Истина;
	ПараметрыВыборкиДанных.ПромежуточныеПолуфабрикаты                  = УправлениеДаннымиОбИзделияхКлиентСервер.ПромежуточныеПолуфабрикатыНеПолучать();
	ПараметрыВыборкиДанных.УчитыватьВероятностьБрака                   = Ложь;
	
	Возврат ПараметрыВыборкиДанных;
	
КонецФункции

Функция ДанныеСпецификации(Изделие, РазмерПартии, ДанныеСпецификаций)

	ДанныеСпецификации = ДанныеСпецификаций[Изделие.ИндексСтроки];
	
	Если ДанныеСпецификации = Неопределено Тогда
		
		Шаблон = НСтр("ru = 'Требуется дополнительное получение данных, кэш спецификаций не содержит данных нужной версии (%1 / %2) или содержит некорректные данные';
						|en = 'Additional data is required. The cache of the bills of materials does not contain data of the required version (%1 / %2) or contains incorrect data'");
		ТекстОшибки = СтрШаблон(Шаблон, Изделие.Спецификация, Изделие.ИдентификаторВерсииДанных);
		ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,Изделие.ЗаказНаПроизводство,
			ТекстОшибки);
		ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
		ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Изделие);
		ДанныеСпецификации = Справочники.РесурсныеСпецификации.ДанныеСпецификации(ДанныеПоНоменклатуре, ПараметрыВыборкиДанныхСпецификации())[0];
		ДанныеСпецификаций.Вставить(Изделие.ИндексСтроки, ДанныеСпецификации);
		
	КонецЕсли;
	
	ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
	ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Изделие);
	
	// расчет количества на партию выпуска, размер партии переведен в единицу основного изделия
	
	ПартияВыпуска = Справочники.РесурсныеСпецификации.ПартияВыпуска(
		РазмерПартии,
		Изделие.КоличествоОсновногоИзделияНаЕдиницуПартииЗапуска);
		
	Справочники.РесурсныеСпецификации.РассчитатьКоличествоНаПартиюВыпуска(
		ПартияВыпуска,
		ДанныеСпецификации,
		ДанныеПоНоменклатуре);
	
	Справочники.РесурсныеСпецификации.ОтметитьПромежуточныйВыпуск(ДанныеСпецификации, Истина);
	
	Возврат ДанныеСпецификации;
	
КонецФункции

#КонецОбласти

#Область МногопоточноеВыполнение

Процедура ВыполнитьПоток(НаименованиеЗадания, ИмяПроцедуры, ПараметрыПроцедуры, ПротоколРасчета)
	
	МестоВОчереди = ПолучитьМестоВОчередиРасчета(ПротоколРасчета);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Расчет структуры заказа: %1 (%2)';
																	|en = 'Order structure calculation: %1 (%2)'"), НаименованиеЗадания, МестоВОчереди + 1);
	ПараметрыВыполнения.ЗапуститьНеВФоне = НЕ ПротоколРасчета.ПараметрыРасчета.РаспараллеливатьРасчет;
	ПараметрыВыполнения.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	РезультатЗапуска = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Если РезультатЗапуска.Статус = "Выполняется" Тогда
		ПротоколРасчета.ОчередьРасчета[МестоВОчереди] = Новый Структура(
			"ИдентификаторЗадания,
			|АдресРезультата,
			|ПараметрыПроцедуры", РезультатЗапуска.ИдентификаторЗадания, РезультатЗапуска.АдресРезультата, ПараметрыПроцедуры);
		СохранитьПоток(РезультатЗапуска.ИдентификаторЗадания);
	Иначе
		Если РезультатЗапуска.Статус = "Выполнено" Тогда
			ЗаписатьРезультатВПротоколРасчета(ПротоколРасчета, РезультатЗапуска.АдресРезультата);
		КонецЕсли;
		Если РезультатЗапуска.Статус = "Ошибка" Тогда
			ЗаписатьОшибкуВПротоколРасчета(
				ПротоколРасчета, ПараметрыПроцедуры, РезультатЗапуска.КраткоеПредставлениеОшибки, РезультатЗапуска.ПодробноеПредставлениеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с потоками в памяти.

Функция ЕстьСвободныеПотоки(ПротоколРасчета)
	
	ЕстьСвободныеПотоки = Ложь;
	ОчередьРасчета = ПротоколРасчета.ОчередьРасчета;
	
	Для Индекс = -ОчередьРасчета.ВГраница() По 0 Цикл
		
		Если ОчередьРасчета[-Индекс] = Неопределено Тогда
			ЕстьСвободныеПотоки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьСвободныеПотоки;

КонецФункции

Функция ПолучитьМестоВОчередиРасчета(ПротоколРасчета)
	
	МестоВОчереди = 0;
	
	Если ПротоколРасчета.ПараметрыРасчета.РаспараллеливатьРасчет Тогда
		
		Если Не ЕстьСвободныеПотоки(ПротоколРасчета) Тогда ОжидатьЗавершениеРасчета(ПротоколРасчета, Ложь);
		КонецЕсли;
		
		МестоВОчереди = ПротоколРасчета.ОчередьРасчета.Найти(Неопределено);
		
	КонецЕсли;
	
	Возврат МестоВОчереди;
	
КонецФункции

Функция ОжидатьЗавершениеРасчета(ПротоколРасчета, ОжидатьЗавершениеРасчетаВсехПотоков = Истина)
	
	РасчетЗавершен = Ложь;
	ОчередьРасчета = ПротоколРасчета.ОчередьРасчета;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Не РасчетЗавершен Цикл
		
		АктивныеЗадания = Новый Массив();
		ЕстьЗавершенныеЗадания = Ложь;
		
		Для Поток = 0 По ОчередьРасчета.ВГраница() Цикл
			
			Если ОчередьРасчета[Поток] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаданиеВыполнено = ЗаданиеВыполнено(ПротоколРасчета, ОчередьРасчета[Поток]);
			
			Если Не ЗаданиеВыполнено Тогда
				
				АктивныеЗадания.Добавить(ОчередьРасчета[Поток].ИдентификаторЗадания);
				Продолжить;
				
			КонецЕсли;
			
			УдалитьИзВременногоХранилища(ОчередьРасчета[Поток].АдресРезультата);
			УдалитьПоток(ОчередьРасчета[Поток].ИдентификаторЗадания);
			
			ОчередьРасчета[Поток] = Неопределено;
			
			ЕстьЗавершенныеЗадания = Истина;
			
		КонецЦикла;
		
		РасчетЗавершен = (ЕстьЗавершенныеЗадания И Не ОжидатьЗавершениеРасчетаВсехПотоков) ИЛИ Не ЗначениеЗаполнено(АктивныеЗадания);
		
		Если Не РасчетЗавершен Тогда
			
			Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(АктивныеЗадания[0]);
			
			Если Задание <> Неопределено Тогда
				
				Задание.ОжидатьЗавершенияВыполнения(ПротоколРасчета.ПараметрыРасчета.ИнтервалПроверкиЗавершенияРасчета);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РасчетЗавершен;
	
КонецФункции

Функция ЗаданиеВыполнено(ПротоколРасчета, ОписаниеПотока)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ОписаниеПотока.ИдентификаторЗадания);
	
	Если Не Задание = Неопределено Тогда
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			ЗаписатьРезультатВПротоколРасчета(ПротоколРасчета, ОписаниеПотока.АдресРезультата);
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
			ЗаписатьОшибкуВПротоколРасчета(
				ПротоколРасчета, ОписаниеПотока.ПараметрыПроцедуры, КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с потоками в базе данных.

Процедура СохранитьПоток(ИдентификаторПотока)
	
	НаборЗаписей = РегистрыСведений.ПотокиРасчетаСтруктурыЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПотока.Установить(ИдентификаторПотока);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ИдентификаторПотока = ИдентификаторПотока;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьВсеПотоки()
	
	НаборЗаписей = РегистрыСведений.ПотокиРасчетаСтруктурыЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьПоток(ИдентификаторПотока)
	
	НаборЗаписей = РегистрыСведений.ПотокиРасчетаСтруктурыЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПотока.Установить(ИдентификаторПотока);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОтменитьВыполнениеВсехПотоков()
	
	Потоки = Потоки();
	
	Для Поток = 0 По Потоки.ВГраница() Цикл
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(Потоки[Поток]);
		
		УдалитьПоток(Потоки[Поток]);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Потоки()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Потоки.ИдентификаторПотока КАК ИдентификаторПотока
		|ИЗ
		|	РегистрСведений.ПотокиРасчетаСтруктурыЗаказа КАК Потоки";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Работа с ошибками.

Функция НайденыОшибкиПриРасчете(ПротоколРасчета, ПорцияРасчета, ТекущееДействие)
	
	БылиОшибки = ПротоколРасчета.ОшибкиРасчета.Количество() > 0;
	
	Если БылиОшибки
		И ПроверитьСтатистикуОшибок(ПротоколРасчета) Тогда
		
		ОшибкиРасчета = ПротоколРасчета.ОшибкиРасчета;
	
		СтруктураОшибок = Новый Структура();
		СтруктураОшибок.Вставить("ТипОшибки", ТекущееДействие.ПараметрыОбработкиОшибок.ТипОшибки);
		СтруктураОшибок.Вставить("Ошибки", Новый Массив());
		
		ПоляГруппировки = ТекущееДействие.ПараметрыОбработкиОшибок.ПоляГруппировки;
		
		Если ПоляГруппировки = "" Тогда
			ПоляГруппировки = ТекущееДействие.ПоляГруппировки;
		КонецЕсли;
		
		Если ПоляГруппировки = "" Тогда
			ПоляГруппировки = ТекущееДействие.ПоляВыборки;
		КонецЕсли;
		
		Для Индекс = -ОшибкиРасчета.Количество() + 1 По 0 Цикл
			
			ОписаниеОшибки = ОшибкиРасчета[-Индекс];
			
			НоваяПорцияРасчета = РазбитьНаПорции(
				ОписаниеОшибки.ПорцияРасчета,
				ТекущееДействие.ПоляВыборки,
				ПоляГруппировки,
				?(ТекущееДействие.КоличествоПорций = 1, 4, ТекущееДействие.КоличествоПорций),
				Ложь);
			
			Если НоваяПорцияРасчета.Количество() > 1 Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПорцияРасчета, НоваяПорцияРасчета);
			Иначе
				
				ЗаказНаПроизводство = РеквизитКоллекции(ОписаниеОшибки.ПорцияРасчета[0], "ЗаказНаПроизводство");
				
				Протокол = РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.ПротоколМакет();
				Протокол.Данные = ОписаниеОшибки.ПорцияРасчета;
				Протокол.ТекстСообщения = ОписаниеОшибки.ПодробноеПредставлениеОшибки;
				Протокол = Новый ХранилищеЗначения(Протокол, Новый СжатиеДанных(9));
				
				Ошибка = Новый Структура();
				Ошибка.Вставить("ИдентификаторОшибки", Новый УникальныйИдентификатор());
				Ошибка.Вставить("ЗаказНаПроизводство", ЗаказНаПроизводство);
				Ошибка.Вставить("КраткоеОписание", ОписаниеОшибки.КраткоеПредставлениеОшибки);
				Ошибка.Вставить("Протокол", Протокол);
				Ошибка.Вставить("БлокируетРасчет", Истина);
				
				СтруктураОшибок.Ошибки.Добавить(Ошибка); // неразрешимая ошибка
			
			КонецЕсли;
			
			ОшибкиРасчета.Удалить(-Индекс);
			
		КонецЦикла;
		
		Если СтруктураОшибок.Ошибки.Количество() > 0 Тогда
			РегистрыСведений.ПротоколРасчетаСтруктурыЗаказа.ЗарегистрироватьОшибки(СтруктураОшибок);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат БылиОшибки;
	
КонецФункции

Функция ПроверитьСтатистикуОшибок(ПротоколРасчета)

	Если ПротоколРасчета.ТекТакт > 1
		И ПротоколРасчета.Статистика.Количество() = ПротоколРасчета.Статистика.НайтиСтроки(Новый Структура("Статус", "Ошибка")).Количество() Тогда
		ВызватьИсключение НСтр("ru = 'Все запущенные потоки расчета завершились с ошибкой. Выполнение управляющего потока остановлено.';
								|en = 'All started calculation threads completed with an error. Execution of the thread of control is canceled.'");
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Протокола расчета.

Процедура ЗаписатьРезультатВПротоколРасчета(ПротоколРасчета, АдресРезультата)
	
	РезультатРасчета = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	НоваяЗапись = ПротоколРасчета.Статистика.Добавить();
	НоваяЗапись.НомерТакта = ПротоколРасчета.ТекТакт;
	НоваяЗапись.Статус = "Готово";
	
	Если Не РезультатРасчета = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяЗапись, РезультатРасчета);
	КонецЕсли;
	
	СократитьПротокол(ПротоколРасчета);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВПротоколРасчета(ПротоколРасчета, ПараметрыПроцедуры, КраткоеПредставлениеОшибки = "", ПодробноеПредставлениеОшибки = "")

	НоваяЗапись = ПротоколРасчета.Статистика.Добавить();
	НоваяЗапись.НомерТакта = ПротоколРасчета.ТекТакт;
	НоваяЗапись.Статус = "Ошибка";

	ОписаниеОшибки = Новый Структура();
	
	ОписаниеОшибки.Вставить("ПорцияРасчета", ПараметрыПроцедуры.ПорцияРасчета);
	ОписаниеОшибки.Вставить("КраткоеПредставлениеОшибки", КраткоеПредставлениеОшибки);
	ОписаниеОшибки.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	
	ПротоколРасчета.ОшибкиРасчета.Добавить(ОписаниеОшибки);
	
	СократитьПротокол(ПротоколРасчета);
	
КонецПроцедуры

Процедура СократитьПротокол(ПротоколРасчета)
	
	Если Не ПротоколРасчета.Статистика.Количество() > 200 Тогда
		Возврат;
	КонецЕсли;
	
	Сч = 1;
	
	Для каждого ЗаписьПротокола Из ПротоколРасчета.Статистика Цикл
	
		Если Сч > 100 Тогда
			Прервать;
		КонецЕсли;
		
		ПротоколРасчета.Статистика.Удалить(ЗаписьПротокола);
		Сч = Сч + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыРасчета

Функция ПараметрыРасчета() Экспорт
	
	Настройки = СтруктураЗаказаПовтИсп.СлужебныеНастройки();
	
	ПараметрыРасчета = Новый Структура();
	
	ПараметрыРасчета.Вставить("РаспараллеливатьРасчет", Настройки.РаспараллеливатьРасчет);
	ПараметрыРасчета.Вставить("КоличествоПотоков", ?(Настройки.РаспараллеливатьРасчет, Настройки.КоличествоПотоков, 1));
	
	ПараметрыРасчета.Вставить("ПорционнаяВыборка", Настройки.ПорционнаяВыборка);
	ПараметрыРасчета.Вставить("РазмерВыборки", Настройки.РазмерВыборки * ?(Настройки.РаспараллеливатьРасчет, Настройки.КоличествоПотоков, 1));
	
	ПараметрыРасчета.Вставить("МаксГлубинаРасчета", Настройки.МаксГлубинаРасчета);
	ПараметрыРасчета.Вставить("ИскатьЦиклыПосле", Настройки.ИскатьЦиклыПосле);
	
	ПараметрыРасчета.Вставить("ИнтервалПроверкиЗавершенияРасчета", 2);
	
	ПараметрыРасчета.Вставить("РассчитыватьИзменения", Настройки.РассчитыватьИзменения);
	ПараметрыРасчета.Вставить("РазрешитьПовтИспРассчитанныхДанных", Настройки.РазрешитьПовтИспРассчитанныхДанных);
	
	ПараметрыРасчета.Вставить("ДополнительныеПараметры", Настройки.ДополнительныеПараметры);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеНастройки

Функция СлужебныеНастройки(ПроверитьРежимЭксплуатации = Истина) Экспорт
	
	НастройкиРасчета = СтруктураЗаказа.СтандартныеНастройкиРасчетаСтруктурыЗаказа();
	
	УстановитьПривилегированныйРежим(Истина);
	Хранилище = Константы.НастройкиРасчетаСтруктурыЗаказаНаПроизводство.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Попытка
		
		ЗаполнитьЗначенияСвойств(НастройкиРасчета, Хранилище.Получить());
		
	Исключение
		
		ТекстОшибки = НСтр("ru = 'Не удалось получить параметры расчета структуры заказа на производство, значения будут приведены к настройкам по умолчанию';
							|en = 'Cannot get the calculation parameters of the production order structure, the values will be reset to the default settings'");
		
		ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,,
						ТекстОшибки);
						
		УстановитьСтандартныеНастройкиРасчетаСтруктурыЗаказа();
		
	КонецПопытки;
	
	Если ПроверитьРежимЭксплуатации И ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		НастройкиРасчета.РаспараллеливатьРасчет = Ложь;
		НастройкиРасчета.КоличествоПотоков      = 1;
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(НастройкиРасчета);
	
КонецФункции

Функция СтандартныеНастройкиРасчетаСтруктурыЗаказа() Экспорт
	
	НастройкиРасчета = Новый Структура;
	
	НастройкиРасчета.Вставить("РаспараллеливатьРасчет", Ложь);
	НастройкиРасчета.Вставить("КоличествоПотоков", 8);
	
	НастройкиРасчета.Вставить("РазрешитьПовтИспРассчитанныхДанных", Истина);
	
	НастройкиРасчета.Вставить("ПорционнаяВыборка", Истина);
	НастройкиРасчета.Вставить("РазмерВыборки", 1000);
	
	НастройкиРасчета.Вставить("МаксГлубинаРасчета", 125);
	НастройкиРасчета.Вставить("ИскатьЦиклыПосле", 25);
	
	НастройкиРасчета.Вставить("ПорционнаяЗапись", Истина);
	НастройкиРасчета.Вставить("КоличествоСтрокВНабореЗаписей", 100000); // РаспараллеливатьРасчет = Ложь
	
	НастройкиРасчета.Вставить("РассчитыватьИзменения", Истина);
	
	НастройкиРасчета.Вставить("ДополнительныеПараметры", "");
	
	Возврат НастройкиРасчета;
	
КонецФункции

Процедура ЗаписатьНастройкиРасчетаСтруктурыЗаказа(ЗначенияНастроек) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиРасчета = СтандартныеНастройкиРасчетаСтруктурыЗаказа();
	
	ЗаполнитьЗначенияСвойств(НастройкиРасчета, ЗначенияНастроек);
	
	Константы.НастройкиРасчетаСтруктурыЗаказаНаПроизводство.Установить(Новый ХранилищеЗначения(НастройкиРасчета));
	
КонецПроцедуры

Процедура ИнициализироватьНастройкиРасчетаСтруктурыЗаказа() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Хранилище = Константы.НастройкиРасчетаСтруктурыЗаказаНаПроизводство.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Хранилище = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСтандартныеНастройкиРасчетаСтруктурыЗаказа();
	
КонецПроцедуры

Процедура УстановитьСтандартныеНастройкиРасчетаСтруктурыЗаказа() Экспорт
	
	ЗначенияПараметров = СтандартныеНастройкиРасчетаСтруктурыЗаказа();
	
	ЗаписатьНастройкиРасчетаСтруктурыЗаказа(ЗначенияПараметров);
	
КонецПроцедуры

Функция ИнтервалПроверкиЗавершенияРасчета()
	
	Возврат 2;
	
КонецФункции

Функция КоличествоСтрокВНабореЗаписей() Экспорт
	
	Настройки = СтруктураЗаказаПовтИсп.СлужебныеНастройки();
	Возврат ?(Настройки.ПорционнаяЗапись, Настройки.КоличествоСтрокВНабореЗаписей, МаксимальноеКоличествоСтрокВНабореЗаписей());
	
КонецФункции

Функция МаксимальноеКоличествоСтрокВНабореЗаписей()
	
	Возврат 100000;
	
КонецФункции

Функция КоличествоПопытокЗаписи()
	
	Возврат ?(ТранзакцияАктивна(), 1, 3);

КонецФункции

#КонецОбласти

#Область ПротоколРасчета

Функция ПротоколРасчета()
	
	ПротоколРасчета = Новый Структура();
	
	ПротоколРасчета.Вставить("ТекТакт", 1);
	ПротоколРасчета.Вставить("НачалоРасчета", ТекущаяУниверсальнаяДатаВМиллисекундах());
	ПротоколРасчета.Вставить("ПараметрыРасчета", ПараметрыРасчета()); // кэш текущих значений параметров расчета
	ПротоколРасчета.Вставить("ОчередьРасчета", Новый Массив(ПротоколРасчета.ПараметрыРасчета.КоличествоПотоков));
	ПротоколРасчета.Вставить("ОшибкиРасчета", Новый Массив());
	ПротоколРасчета.Вставить("Статистика", Статистика());
	
	Возврат ПротоколРасчета;
	
КонецФункции

Функция Статистика()
	
	Статистика = Новый ТаблицаЗначений;
	
	Статистика.Колонки.Добавить("НомерТакта", Новый ОписаниеТипов("Число"));
	Статистика.Колонки.Добавить("ИдентификаторЗадания", Новый ОписаниеТипов("Число"));
	Статистика.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
	Статистика.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка"));
	Статистика.Колонки.Добавить("РазмерПорции", Новый ОписаниеТипов("Число"));
	Статистика.Колонки.Добавить("Длительность", Новый ОписаниеТипов("Число"));
	
	Возврат Статистика;
	
КонецФункции

Функция ЗамерыКода() Экспорт
	
	ЗамерыКода = Новый ТаблицаЗначений();
	
	ЗамерыКода.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(32)));
	ЗамерыКода.Колонки.Добавить("НомерТакта", Новый ОписаниеТипов("Число"));
	
	ЗамерыКода.Колонки.Добавить("НачалоРасчета", Новый ОписаниеТипов("Число"));
	ЗамерыКода.Колонки.Добавить("КонецРасчета", Новый ОписаниеТипов("Число"));
	
	ЗамерыКода.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	ЗамерыКода.Колонки.Добавить("Длительность", Новый ОписаниеТипов("Число"));
	
	Возврат ЗамерыКода;
	
КонецФункции

Функция НачатьЗамер(ИмяОперации, ПротоколРасчета) Экспорт
	
	ЗамерыКода = ПротоколРасчета.ЗамерыКода; // ТаблицаЗначений
	
	ЗамерКода = ЗамерыКода.Добавить();
	
	ЗамерКода.Операция = ИмяОперации;
	ЗамерКода.НачалоРасчета = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Возврат ЗамерКода;
	
КонецФункции

Функция ЗавершитьЗамер(ЗамерКода, КоличествоСтрок = 0) Экспорт
	
	ЗамерКода.КонецРасчета = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗамерКода.КоличествоСтрок = КоличествоСтрок;
	ЗамерКода.Длительность = (ЗамерКода.КонецРасчета - ЗамерКода.НачалоРасчета) / 1000;
	
	Возврат ЗамерКода.Владелец();
	
КонецФункции

Функция РасшифровкаПротоколаРасчетаПоЗамеруКода(Таблица)
	
	Итоги = Таблица.Скопировать(,"Операция,Длительность,КоличествоСтрок"); // ТаблицаЗначений
	Итоги.Свернуть("Операция", "Длительность,КоличествоСтрок");

	МассивСообщений = Новый Массив;
	МассивСообщений.Добавить(НСтр("ru = 'Протокол расчета';
									|en = 'Calculation protocol'"));
	
	Шаблон = НСтр("ru = '- %1, T: %2, N: %3';
					|en = '- %1, T: %2, N: %3'");
	
	Для каждого Итог Из Итоги Цикл
	
		ТекстСообщения = СтрШаблон(Шаблон, Итог.Операция, Итог.Длительность, Итог.КоличествоСтрок);
		МассивСообщений.Добавить(ТекстСообщения);
		
	КонецЦикла;
	
	ТекстСообщения = СтрСоединить(МассивСообщений, ";" + Символы.ПС);
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ЗаписатьПротоколРасчетаВЖурналРегистрации(ПротоколРасчета)
	
	ВремяВСекундах = Цел((ТекущаяУниверсальнаяДатаВМиллисекундах() - ПротоколРасчета.НачалоРасчета)/1000);
	
	Часы = Цел(ВремяВСекундах/3600);
	Минуты = Цел((ВремяВСекундах - Часы * 3600) / 60);
	Секунды = Макс(ВремяВСекундах - Часы * 3600 - Минуты * 60, 1);
	
	ПродолжительностьЧасы = ?(Часы = 0, "", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 час';
																										|en = '%1 h'"), Часы));
	ПродолжительностьМинуты = ?(Минуты = 0, "", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 мин';
																											|en = '%1 min'"), Минуты));
	ПродолжительностьСекунды = ?(Секунды = 0, "", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 сек';
																												|en = '%1 sec'"), Секунды));
	
	ПродолжительностьРасчета = ПродолжительностьЧасы + " " + ПродолжительностьМинуты + " " + ПродолжительностьСекунды;
	ПродолжительностьРасчета = СокрЛП(ПродолжительностьРасчета);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Завершен расчет, продолжительность %1';
									|en = 'Calculation is completed, duration %1'"), ПродолжительностьРасчета);
	
	Если ПротоколРасчета.Свойство("ЗамерыКода") Тогда
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + РасшифровкаПротоколаРасчетаПоЗамеруКода(ПротоколРасчета.ЗамерыКода);
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,,,
		ТекстСообщения);

КонецПроцедуры

Процедура ЗаписатьНеудачнуюПопыткуЗаписиВЖурналРегистрации(СчетчикОшибок, ТекстОшибки) Экспорт
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Неудачная попытка записи (%1): %2';
									|en = 'Unsuccessful attempt to write (%1): %2'"), СчетчикОшибок, ТекстОшибки);
	
	ЗаписьЖурналаРегистрации(СтруктураЗаказа.ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,,
		ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область Запись

Процедура ЗаполнитьИЗаписатьНаборЗаписей(
			НаборЗаписей,
			Таблица,
			Замещать = Ложь,
			ЕстьРазделитель = Ложь,
			КолонкиПоЗначению = Неопределено) Экспорт
	
	КоличествоСтрокВНабореЗаписей = КоличествоСтрокВНабореЗаписей();
	
	Если Замещать = Ложь
		И Таблица.Количество() > КоличествоСтрокВНабореЗаписей Тогда
		
		КоличествоСтрок = Таблица.Количество();
		
		ВсегоПорций = Окр(КоличествоСтрок/КоличествоСтрокВНабореЗаписей + 0.5, 0, 0);
		Делитель = Новый Массив(ВсегоПорций);
		
		Счетчик = 0;
		НомерПорции = 0;
		Для каждого Строка Из Таблица Цикл
			Если Счетчик >= КоличествоСтрокВНабореЗаписей Тогда
				Счетчик = 0;
				НомерПорции = НомерПорции + 1;
			КонецЕсли;
			Если Делитель[НомерПорции] = Неопределено Тогда
				РазмерПорции = Мин(КоличествоСтрокВНабореЗаписей, КоличествоСтрок - КоличествоСтрокВНабореЗаписей * НомерПорции);
				Делитель[НомерПорции] = Новый Массив(РазмерПорции);
			КонецЕсли;
			Делитель[НомерПорции][Счетчик] = Строка;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		Для каждого Строки Из Делитель Цикл
			ЗагрузитьСтрокиВНаборЗаписейСДопОбработкой(
				НаборЗаписей,
				Таблица,
				Строки,
				ЕстьРазделитель,
				КолонкиПоЗначению);
			ЗаписатьНаборЗаписейВПопытке(НаборЗаписей, Ложь);
		КонецЦикла;
		
	Иначе
		
		ЗагрузитьСтрокиВНаборЗаписейСДопОбработкой(
			НаборЗаписей,
			Таблица,,
			ЕстьРазделитель,
			КолонкиПоЗначению);
		ЗаписатьНаборЗаписейВПопытке(НаборЗаписей, Замещать);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСтрокиВНаборЗаписейСДопОбработкой(НаборЗаписей, Таблица, СписокСтрок = Неопределено, ЕстьРазделитель = Ложь, КолонкиПоЗначению = Неопределено) Экспорт
	
	Если ЕстьРазделитель Тогда
		РазделительЗаписи = Новый УникальныйИдентификатор();
	КонецЕсли;

	Если ЕстьРазделитель Или КолонкиПоЗначению <> Неопределено Тогда
		
		Коллекция = ?(СписокСтрок = Неопределено, Таблица, СписокСтрок);
		
		Для каждого Строка Из Коллекция Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
			
			Если ЕстьРазделитель Тогда
				НоваяЗапись.Разделитель = РазделительЗаписи;
			КонецЕсли;
			
			Если КолонкиПоЗначению <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(НоваяЗапись, КолонкиПоЗначению);
			КонецЕсли;
		
		КонецЦикла;
		
	Иначе
		
		Если СписокСтрок <> Неопределено Тогда
			
			НаборЗаписей.Загрузить(Таблица.Скопировать(СписокСтрок));
			
		Иначе
			
			НаборЗаписей.Загрузить(Таблица);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьНаборЗаписейВПопытке(НаборЗаписей, Замещать)
	
	СчетчикОшибок = 1;
	
	Пока Истина Цикл
		
		Попытка
			
			НаборЗаписей.Записать(Замещать);
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Если СчетчикОшибок < КоличествоПопытокЗаписи() Тогда
				ЗаписатьНеудачнуюПопыткуЗаписиВЖурналРегистрации(СчетчикОшибок, ТекстОшибки);
				СчетчикОшибок = СчетчикОшибок + 1;
				Продолжить;
			КонецЕсли;
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
		Прервать;
		
	КонецЦикла;
	
	НаборЗаписей.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСАналогами

Функция ТекстЗапросаАналогиМатериалов(Запрос)

	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("ИспользоватьПриАвтозаменеВЗаказах", "ИспользоватьПриАвтозаменеВЗаказах");
	СоответствиеПолей.Вставить("ПриоритетЗамены", "МассивЗначений");
	
	НастройкиПодбора = Новый Структура;
	НастройкиПодбора.Вставить("ТоварыВместеСПараметрами", Истина);
	НастройкиПодбора.Вставить("УчестьМногиеКоМногим", Ложь);
	НастройкиПодбора.Вставить("ПодбиратьВзаимозаменяемыеАналоги", Истина);
	НастройкиПодбора.Вставить("ОтборРазрешений", СоответствиеПолей);
	НастройкиПодбора.Вставить("ИмяВременнойТаблицаТовары", "ВТ_Источник");
	НастройкиПодбора.Вставить("ИмяВременнойТаблицы", "СвязиМатериаловИАналогов");
	
	ТекстЗапросаАналогов = АналогиМатериалов.ТекстЗапросаДанныеМатериаловИАналогов(НастройкиПодбора);
	Разделитель = ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстИсточникДанных = 
	"ВЫБРАТЬ
	|	Т.ИндексСтроки                                                КАК Ссылка,
	|
	|	Т.Номенклатура                                                КАК Номенклатура,
	|	Т.Характеристика                                              КАК Характеристика,
	|
	|	Т.ЗаказНаПроизводство.НачатьНеРанее                           КАК ДатаДействияРазрешений,
	|	Т.ЗаказНаПроизводство                                         КАК ЗаказНаПроизводство,
	|	ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)                  КАК ЗаказКлиента,
	|	Т.Подразделение                                               КАК Подразделение,
	|	Т.ЗаказНаПроизводство.НаправлениеДеятельности                 КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Справочник.ЭтапыПроизводства)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Справочник.ЭтапыПроизводства).Владелец.ОсновноеИзделиеНоменклатура
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Документ.ЭтапПроизводства2_2).Спецификация.ОсновноеИзделиеНоменклатура
	|	КОНЕЦ                КАК Изделие,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Справочник.ЭтапыПроизводства)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Справочник.ЭтапыПроизводства).Владелец.ОсновноеИзделиеХарактеристика
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Документ.ЭтапПроизводства2_2).Спецификация.ОсновноеИзделиеХарактеристика
	|	КОНЕЦ  КАК ХарактеристикаИзделия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Справочник.ЭтапыПроизводства)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Справочник.ЭтапыПроизводства).Владелец
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Документ.ЭтапПроизводства2_2).Спецификация
	|	КОНЕЦ                                                         КАК Спецификация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Справочник.ЭтапыПроизводства)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Справочник.ЭтапыПроизводства)
	|		КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Т.Этап КАК Документ.ЭтапПроизводства2_2).Этап
	|	КОНЕЦ                                                        КАК Этап
	|
	|ПОМЕСТИТЬ ВТ_Источник
	|ИЗ
	|	НоменклатурныйПлан КАК Т
	|
	|";
	
	МассивТекстов = Новый Массив;
	МассивТекстов.Добавить(ТекстИсточникДанных);
	МассивТекстов.Добавить(Разделитель);
	МассивТекстов.Добавить(ТекстЗапросаАналогов);
	МассивТекстов.Добавить(Разделитель);
	
	ТекстЗапроса = СтрСоединить(МассивТекстов);
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(Перечисления.ПравилаЗаменыНаАналоги.ПриНаличииАналога);
	МассивЗначений.Добавить(Перечисления.ПравилаЗаменыНаАналоги.ПриОтсутствииМатериала);
		
	Запрос.УстановитьПараметр("ИспользоватьПриАвтозаменеВЗаказах", Истина);
	Запрос.УстановитьПараметр("МассивЗначений", МассивЗначений);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область Прочее

// Разбивает исходную таблицу на порции
// 
// Параметры:
// 	Таблица - ТаблицаЗначений - исходная таблица
// 	ПоляВыборки - Строка - поля выборки
// 	ПоляГруппировки - Строка - поля группировки
// 	КоличествоПорций - Число - количество порций
// 	ТаблицаУпорядочена - Булево - призна, таблица упорядочена
// Возвращаемое значение:
// 	Массив - порции
//
Функция РазбитьНаПорции(Таблица, ПоляВыборки, ПоляГруппировки = "", КоличествоПорций = 1, ТаблицаУпорядочена = Истина)
	
	Результат = Новый Массив();
	
	Если КоличествоПорций > 1 Тогда
		
		РазмерПорции = Окр((Таблица.Количество() / КоличествоПорций) + 0.5, 0, 0);
		
		СписокГруппировок = СтрРазделить(ПоляГруппировки, ",");
		
		Если Не ТаблицаУпорядочена И ПоляГруппировки <> "" Тогда
			Таблица.Сортировать(ПоляГруппировки, Новый СравнениеЗначений);
		КонецЕсли;
		
		Таблица.Колонки.Добавить("Делитель", ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
		
		Делитель = 1;
		Сч = 0;
		Для каждого Строка Из Таблица Цикл
			Если Сч >= РазмерПорции
				И (ПоляГруппировки = "" ИЛИ ПоляГруппировки <> "" И ЕстьРазличияВКолонках(Таблица[Таблица.Индекс(Строка)-1], Строка, СписокГруппировок)) Тогда
				Делитель = Делитель + 1;
				Сч = 0;
			КонецЕсли;
			Строка.Делитель = Делитель;
			Сч = Сч + 1;
		КонецЦикла;
		
		Пока Делитель > 0 Цикл
			Результат.Добавить(Таблица.Скопировать(Новый Структура("Делитель", Делитель), ПоляВыборки));
			Делитель = Делитель - 1;
		КонецЦикла;
		
	ИначеЕсли Таблица.Количество() > 0 Тогда
		Результат.Добавить(Таблица);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура СоединитьТаблицы(Таблица, Таблица1)
	
	Для X = 0 По Таблица1.Количество() - 1 Цикл
		Таблица.Вставить(0);
	КонецЦикла;
	
	Для X = 0 По Таблица1.Колонки.Количество() - 1 Цикл 
		Таблица.ЗагрузитьКолонку(Таблица1.ВыгрузитьКолонку(X), X);
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьРазличияВКолонках(Строка1, Строка2, Колонки)
	
	ЕстьРазличия = Ложь;
	
	Для каждого Колонка Из Колонки Цикл
		
		Если Строка1[Колонка] <> Строка2[Колонка] Тогда 
			ЕстьРазличия = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьРазличия;
	
КонецФункции

Функция СравнитьЗначенияПолейКлюча(ПервоеЗначение, ВтороеЗначение, ПоляКлюча, СравнениеЗначений) Экспорт
	
	Результат = 0;
	
	Для Каждого Поле Из ПоляКлюча Цикл
		Результат = СравнениеЗначений.Сравнить(ПервоеЗначение[Поле], ВтороеЗначение[Поле]);
		Если Результат <> 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Функция СкопироватьКолонки(Колонки, КопируемыеКолонки = "", ИсключаемыеКолонки = "", ДобавляемыеКолонки = Неопределено) Экспорт
	
	НоваяТаблица = Новый ТаблицаЗначений();
	
	Для каждого Колонка из Колонки Цикл
		
		Если КопируемыеКолонки <> "" И СтрНайти(КопируемыеКолонки, Колонка.Имя) = 0 Или ИсключаемыеКолонки <> "" И СтрНайти(ИсключаемыеКолонки, Колонка.Имя) > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяТаблица.Колонки.Добавить(Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "NULL"));
		
	КонецЦикла;
	
	Если ДобавляемыеКолонки <> Неопределено Тогда
		
		Для каждого Колонка из ДобавляемыеКолонки Цикл
		
			НоваяТаблица.Колонки.Добавить(Колонка.Ключ, Колонка.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НоваяТаблица;

КонецФункции

Процедура СвернутьТаблицуИУдалитьНулевыеСтроки(Таблица, КолонкиГруппировки, КолонкиСуммирования)

	Ресурсы = СтрРазделить(КолонкиСуммирования, ",");
	
	ИзмененныеСтроки = Таблица.Скопировать(, КолонкиГруппировки + "," + КолонкиСуммирования); // ТаблицаЗначений
	ИзмененныеСтроки.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	Для Индекс = -ИзмененныеСтроки.Количество() + 1 По 0 Цикл
		
		ТекущаяСтрока = ИзмененныеСтроки[-Индекс];
		Удалить = Истина;
		
		Для каждого Ресурс Из Ресурсы Цикл
			
			Если ТекущаяСтрока[Ресурс] <> 0 Тогда
				Удалить = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Удалить Тогда
			ИзмененныеСтроки.Удалить(-Индекс);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиИзТаблицы(Таблица, Строки)
	
	Для каждого Строка Из Строки Цикл Таблица.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПривестиЗначение(ОписаниеТипов, Значение)

	Результат = ОписаниеТипов.ПривестиЗначение(Значение);
	Возврат Результат;
	
КонецФункции

Функция ИменаКолонокТаблицыСтрокой(ИсточникКолонок, ИсключаемыеКолонки = "") Экспорт
	
	Если ТипЗнч(ИсточникКолонок) = Тип("ТаблицаЗначений")
	 ИЛИ ТипЗнч(ИсточникКолонок) = Тип("РезультатЗапроса") Тогда
		Колонки = ИсточникКолонок.Колонки;
	Иначе
		Колонки = ИсточникКолонок;
	КонецЕсли;
	
	ИменаКолонок = "";
	СтруктураИсключаемыеКолонки = Новый Структура(ИсключаемыеКолонки);
	
	Для Каждого Колонка Из Колонки Цикл
		
		Если НЕ СтруктураИсключаемыеКолонки.Свойство(Колонка.Имя) Тогда
			ИменаКолонок = ИменаКолонок + ?(ИменаКолонок = "", "", ", ") + "%1" + Колонка.Имя;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИменаКолонок;
	
КонецФункции

Функция ТекстЗапросаПоместитьТаблицуЗначенийВоВременнуюТаблицу(ИмяВременнойТаблицы, Колонки, Знач ПоляТаблицы = "", Знач УсловиеОтбора = "", Знач ПоляИндексирования = "") Экспорт
	
	ТекстЗапроса = СтрЗаменить(
		"ВЫБРАТЬ
		|	&Поля
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	&ИмяВременнойТаблицы КАК Таблица
		|ГДЕ &УсловиеОтбора", "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	Если ПоляТаблицы = "" Тогда
		ПоляТаблицы = ИменаКолонокТаблицыСтрокой(Колонки);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Поля", СокрЛП(СтрЗаменить(ПоляТаблицы, "%1", Символы.ПС + "Таблица.")));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", ?(УсловиеОтбора = "", "ИСТИНА", УсловиеОтбора));
	
	Если ПоляИндексирования <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + " " + "ИНДЕКСИРОВАТЬ ПО" + " " + ПоляИндексирования;
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПоместитьТаблицуЗначенийВоВременнуюТаблицу(МенеджерВременныхТаблиц, ИмяВременнойТаблицы, Таблица, Знач ПоляТаблицы = "", Знач УсловиеОтбора = "", Знач ПоляИндексирования = "") Экспорт
	
	Колонки = Таблица.Колонки; // КоллекцияКолонокТаблицыЗначений
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		ТекстЗапросаПоместитьТаблицуЗначенийВоВременнуюТаблицу(ИмяВременнойТаблицы, Колонки, ПоляТаблицы, УсловиеОтбора, ПоляИндексирования);
	Запрос.УстановитьПараметр(ИмяВременнойТаблицы, Таблица);
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РеквизитКоллекции(Коллекция, ИмяРеквизита)
	
	СтруктураРеквизита = Новый Структура(ИмяРеквизита);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Коллекция);
	
	Возврат СтруктураРеквизита[ИмяРеквизита];

КонецФункции

Функция ЗначениеИзСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Значение = Соответствие[Ключ];
	
	Если Значение <> Неопределено Тогда
		Возврат Значение;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

Функция НайтиСтрокуПоЗначениюКолонкиВМассивеСтрок(МассивСтрок, ИмяКолонки, Значение)

	НайденнаяСтрока = Неопределено;
	
	Для каждого Строка Из МассивСтрок Цикл
	
		Если Строка[ИмяКолонки] <> Значение Тогда Продолжить;
		КонецЕсли;
		
		НайденнаяСтрока = Строка;
		Прервать;
		
	КонецЦикла;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

Функция СтруктураПоПолям(Коллекция, СписокПолей)

	Результат = Новый Структура(СписокПолей);
	ЗаполнитьЗначенияСвойств(Результат, Коллекция);
	Возврат Результат;

КонецФункции

Процедура СортироватьМассивСтрок(Массив, Колонка, lb, ub)
	
	X = lb;
	Y = ub;
	
	Граница = Массив[Цел((X + Y)/2)][Колонка]; // опорный элемент
	
	Пока X <= Y Цикл
		
		Пока Массив[X][Колонка] < Граница Цикл
			X = X + 1;
		КонецЦикла;
		
		Пока Массив[Y][Колонка] > Граница Цикл
			Y = Y - 1;
		КонецЦикла;
		
		Если X <= Y Тогда
			Буфер = Массив[X];
			Массив[X] = Массив[Y];
			Массив[Y] = Буфер;
			X = X + 1;
			Y = Y - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если lb < Y Тогда
		СортироватьМассивСтрок(Массив, Колонка, lb, Y);
	КонецЕсли;
	
	Если X < ub Тогда
		СортироватьМассивСтрок(Массив, Колонка, X, ub);
	КонецЕсли;
	
КонецПроцедуры

Функция ТипЧисло()
	
	Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Расчет структуры заказа на производство';
				|en = 'Production order structure calculation'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти

#КонецОбласти
