////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Внеоборотные активы".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует представление количества месяцев в виде строки "Х лет Х месяцев".
//
// Параметры:
//  КоличествоМесяцев	- Число		- Количество месяцев.
//  ЗаключитьВСкобки	- Булево	- Истина, если срок нужно заключить в скобки.
// 
// Возвращаемое значение:
//  Строка - расшифровка срока полезного использования в годах и месяцах.
//
Функция ПредставлениеКоличестваМесяцевСтрокой(КоличествоМесяцев, ЗаключитьВСкобки = Истина) Экспорт

	Если НЕ ЗначениеЗаполнено(КоличествоМесяцев) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧислоЛет = Цел(КоличествоМесяцев / 12);
	ЧислоМесяцев = (КоличествоМесяцев % 12);
	
	РасшифровкаСрокаПолезногоИспользования = "";
	
	Если ЧислоЛет <> 0 Тогда
		РасшифровкаСрокаПолезногоИспользования =
			СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 год;;%1 года;%1 лет;%1 года';
																			|en = ';%1 year;;%1 years;%1 years;%1 years'"), ЧислоЛет);
	КонецЕсли;
	
	Если ЧислоМесяцев <> 0 Тогда
		РасшифровкаСрокаПолезногоИспользования =
			РасшифровкаСрокаПолезногоИспользования
			+ ?(ЧислоЛет <> 0, " ", "")
			+ СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 месяц;;%1 месяца;%1 месяцев;%1 месяца';
																			|en = ';%1 month;;%1 month;%1 months;%1 months'"), ЧислоМесяцев);
	КонецЕсли;
	
	Если ЗаключитьВСкобки Тогда
		РасшифровкаСрокаПолезногоИспользования = "(" + РасшифровкаСрокаПолезногоИспользования + ")";
	КонецЕсли;
		
	Возврат РасшифровкаСрокаПолезногоИспользования;
	
КонецФункции

// Формирует представление срока в виде строки "Х лет Х месяцев Х дней".
// 
// Параметры:
// 	КоличествоЛет - Число -
// 	КоличествоМесяцев - Число -
// 	КоличествоДней - Число -
// Возвращаемое значение:
// 	Строка - 
Функция ПредставлениеСрокаСтрокой(Знач КоличествоЛет, Знач КоличествоМесяцев, Знач КоличествоДней) Экспорт

	Если КоличествоЛет + КоличествоМесяцев + КоличествоДней = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	РасшифровкаСрокаПолезногоИспользования =
		?(КоличествоЛет <> 0, СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 год;;%1 года;%1 лет;%1 года';
																							|en = ';%1 year;;%1 years;%1 years;%1 years'"), КоличествоЛет), "")
		+ ?(КоличествоЛет <> 0 И КоличествоМесяцев <> 0, " ", "")
		+ ?(КоличествоМесяцев <> 0, СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 месяц;;%1 месяца;%1 месяцев;%1 месяца';
																									|en = ';%1 month;;%1 month;%1 months;%1 months'"), КоличествоМесяцев), "")
		+ ?(КоличествоЛет + КоличествоМесяцев <> 0 И КоличествоДней <> 0, " ", "")
		+ ?(КоличествоДней <> 0, СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня';
																								|en = ';%1 day;;%1 day;%1 days;%1 day'"), КоличествоДней), "");
	
	Возврат РасшифровкаСрокаПолезногоИспользования;

КонецФункции

// Формирует представление срока в виде строки "с 01.01.2020 по 31.12.2020 (Х лет Х месяцев Х дней)".
// 
// Параметры:
// 	КоличествоЛет - Число -
// 	КоличествоМесяцев - Число -
// 	КоличествоДней - Число -
// 	ДатаНачала - Дата -
// 	ТолькоПросмотр - Булево - 
// Возвращаемое значение:
// 	ФорматированнаяСтрока - 
Функция ПредставлениеСрокаФорматированнойСтрокой(Знач КоличествоЛет, Знач КоличествоМесяцев, Знач КоличествоДней, Знач ДатаНачала, Знач ТолькоПросмотр) Экспорт
	
	СтрокиЗаголовкаСрока = Новый Массив;
	
	Если КоличествоЛет + КоличествоМесяцев + КоличествоДней = 0
		И НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		
		СтрокиЗаголовкаСрока.Добавить(НСтр("ru = '<не указан>';
											|en = '<not specified>'"));
	
	ИначеЕсли КоличествоЛет + КоличествоМесяцев + КоличествоДней > 0 Тогда
		
		ДатаОкончания = ДатаОкончанияПоСроку(ДатаНачала, КоличествоЛет, КоличествоМесяцев, КоличествоДней);
					 
		ТекстЗаголовка = СтрШаблон(НСтр("ru = 'с %1 по %2';
										|en = 'from %1 to %2'"), Формат(ДатаНачала, "ДЛФ=D;"), Формат(ДатаОкончания, "ДЛФ=D;"));
		СтрокиЗаголовкаСрока.Добавить(ТекстЗаголовка);
				
		ТекстЗаголовка = ПредставлениеСрокаСтрокой(
							КоличествоЛет,
							КоличествоМесяцев,
							КоличествоДней);
							
		СтрокиЗаголовкаСрока.Добавить(" (");
		СтрокиЗаголовкаСрока.Добавить(ТекстЗаголовка);
		СтрокиЗаголовкаСрока.Добавить(")");
			
	Иначе
		
		ТекстЗаголовка = СтрШаблон(НСтр("ru = 'с %1';
										|en = 'from %1'"), Формат(ДатаНачала, "ДЛФ=D;"));
		СтрокиЗаголовкаСрока.Добавить(ТекстЗаголовка);
		
	КонецЕсли;
	
	ТекстСсылки = ?(НЕ ТолькоПросмотр, "#Редактировать", "");
	
	Возврат  Новый ФорматированнаяСтрока(СтрокиЗаголовкаСрока,,,, ТекстСсылки);
	
КонецФункции

// Расчитывает дату окончания по сроку.
// 
// Параметры:
// 	ДатаНачала - Дата - 
// 	СрокЛет - Число - 
// 	СрокМес - Число - 
// 	СрокДней - Число - 
// 	ПроверитьСрок - Булево -
// 	
// Возвращаемое значение:
// 	Дата - Дата окончания.
Функция ДатаОкончанияПоСроку(ДатаНачала, СрокЛет, СрокМес, СрокДней, ПроверитьСрок = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала)
		ИЛИ ПроверитьСрок И СрокЛет = 0 И СрокМес = 0 И СрокДней = 0 Тогда
		Возврат '000101010000';
	КонецЕсли;
	
	ДатаОкончания = НачалоДня(ДатаНачала);
	
	Если СрокЛет <> 0 Тогда
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, СрокЛет * 12);
		Если ДатаНачала = КонецМесяца(ДатаНачала) Тогда
			ДатаОкончания = КонецМесяца(ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
	
	Если СрокМес <> 0 Тогда
		ДатаОкончания = ДобавитьМесяц(ДатаОкончания, СрокМес);
		Если ДатаНачала = КонецМесяца(ДатаНачала) Тогда
			ДатаОкончания = КонецМесяца(ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
	
	Если СрокДней <> 0 Тогда
		ДатаОкончания = ДатаОкончания + 86400 * СрокДней;
	КонецЕсли;
	
	ДатаОкончания = Макс(ДатаОкончания - 86400, ДатаНачала);
	
	Возврат ДатаОкончания;
	
КонецФункции

// Рассчитывает срок по периоду.
// Считается, что между 01.01.2021 и 02.01.2021 срок равен двум дням.
// 
// Параметры:
// 	ДатаНачала - Дата - 
// 	ДатаОкончания - Дата - 
// 	СрокЛет - Число - 
// 	СрокМес - Число - 
// 	СрокДней - Число -
// 
Процедура РассчитатьСрокПоПериоду(ДатаНачала, ДатаОкончания, СрокЛет, СрокМес, СрокДней) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) 
		ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания)
		ИЛИ ДатаНачала > ДатаОкончания Тогда
		Возврат;
	КонецЕсли;
	
	СрокЛет = 0;
	НачалоСледующейДаты = ДобавитьМесяц(ДатаНачала, 12) - 86400;
	Пока НачалоСледующейДаты <= ДатаОкончания Цикл
		СрокЛет = СрокЛет + 1;
		НачалоСледующейДаты = ДобавитьМесяц(НачалоСледующейДаты, 12);
	КонецЦикла;
	
	СрокМес = 0;
	НачалоСледующейДаты = ДобавитьМесяц(ДатаНачала, 12 * СрокЛет + 1) - 86400;
	ЭтоКонецМесяца = (КонецДня(НачалоСледующейДаты) = КонецМесяца(НачалоСледующейДаты));
	Пока НачалоСледующейДаты <= ДатаОкончания Цикл
		СрокМес = СрокМес + 1;
		НачалоСледующейДаты = ДобавитьМесяц(НачалоСледующейДаты, 1);
		Если ЭтоКонецМесяца Тогда
			НачалоСледующейДаты = НачалоДня(КонецМесяца(НачалоСледующейДаты));
		КонецЕсли;
	КонецЦикла;
	
	СрокДней = 0;
	НачалоСледующейДаты = ДобавитьМесяц(ДатаНачала, 12 * СрокЛет + СрокМес);
	Пока НачалоСледующейДаты <= ДатаОкончания Цикл
		СрокДней = СрокДней + 1;
		НачалоСледующейДаты = НачалоСледующейДаты + 86400;
	КонецЦикла;
	
КонецПроцедуры

// Форматирует строку в соответствии с заданным шаблоном.
// Возможные значения тегов в шаблоне:
// - <b> Строка </b> - выделяет строку жирным шрифтом.
// - <a href = "Ссылка"> Строка </a> - добавляет гиперссылку.
// Например, "Минимальная версия программы <b>1.1</b>. <a href = "Обновление">Обновите</a> программу.".
//
// Параметры:
//  СтрокаСТегами - Строка - строка, содержащая теги форматирования.
//
// Возвращаемое значение:
//  ФорматированнаяСтрока - преобразованная строка.
//
Функция ФорматированнаяСтрока(Знач СтрокаСТегами) Экспорт
	
	НаборСтрок = Новый Массив;
	
	ТекущийШрифт  = Неопределено;
	ТекущийЦвет   = Неопределено;
	ТекущийФон    = Неопределено;
	ТекущаяСсылка = Неопределено;
	
	ФрагментыСтроки = СтрРазделить(СтрокаСТегами, "<", Истина);
	Для каждого Фрагмент Из ФрагментыСтроки Цикл
		
		ТелоСтроки = "";
		ПозицияТэг = СтрНайти(Фрагмент, ">");
		
		Если ПозицияТэг = 0 Тогда
			ТелоСтроки = Фрагмент;
			
		ИначеЕсли СтрНачинаетсяС(Фрагмент, "/") Тогда
			ТелоСтроки = Сред(Фрагмент, ПозицияТэг + 1);
			
			ТекущийШрифт  = Неопределено;
			ТекущийЦвет   = Неопределено;
			ТекущийФон    = Неопределено;
			ТекущаяСсылка = Неопределено;
			
		Иначе
			
			ОписаниеТэга = Лев(Фрагмент, ПозицияТэг - 1);
			ПервыйПробел = СтрНайти(ОписаниеТэга, " ");
			
			Если ПервыйПробел > 0 Тогда
				ИмяТега = СокрЛП(Лев(ОписаниеТэга, ПервыйПробел));
				
				ОписаниеАтрибутов = Сред(ОписаниеТэга, ПервыйПробел + 1);
				ОписаниеАтрибутов = СтрЗаменить(ОписаниеАтрибутов , """", "'");
				
				ПозицияРавно = СтрНайти(ОписаниеАтрибутов, "=");
				Пока ПозицияРавно > 0 Цикл
					
					ИмяАтрибута = СокрЛП(Лев(ОписаниеАтрибутов, ПозицияРавно - 1));
					ПозицияПерваяКавычка = СтрНайти(ОписаниеАтрибутов, "'",, ПозицияРавно + 1);
					Если ПозицияПерваяКавычка = 0 Тогда
						ПозицияПерваяКавычка = ПозицияРавно;
					КонецЕсли;
					ПозицияВтораяКавычка = СтрНайти(ОписаниеАтрибутов, "'",, ПозицияПерваяКавычка + 1);
					Если ПозицияВтораяКавычка = 0 Тогда
						ПозицияВтораяКавычка = СтрДлина(ОписаниеАтрибутов) + 1;
					КонецЕсли;
					ЗначениеАтрибута  = СокрЛП(Сред(ОписаниеАтрибутов, ПозицияПерваяКавычка + 1,  ПозицияВтораяКавычка - ПозицияПерваяКавычка - 1));
					
					Если СтрСравнить(ИмяАтрибута, "href") = 0 И СтрСравнить(ИмяТега, "a") = 0 Тогда
						ТекущаяСсылка = ЗначениеАтрибута;
					ИначеЕсли СтрСравнить(ИмяАтрибута, "src") = 0 И СтрСравнить(ИмяТега, "img") = 0 Тогда
						НаборСтрок.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок[ЗначениеАтрибута], ТекущийШрифт, ТекущийЦвет, ТекущийФон, ТекущаяСсылка));
					КонецЕсли;
					
					ОписаниеАтрибутов = Сред(ОписаниеАтрибутов, ПозицияВтораяКавычка + 1);
					ПозицияРавно = СтрНайти(ОписаниеАтрибутов, "=");
					
				КонецЦикла;
			Иначе
				ИмяТега = ОписаниеТэга;
			КонецЕсли;
			
			Если ИмяТега = "b" Тогда
				ТекущийШрифт = Новый Шрифт(,, Истина,,,,);
			КонецЕсли;
			
			ТелоСтроки = Сред(Фрагмент, ПозицияТэг + 1);
			
		КонецЕсли;
		
		ТелоСтроки = СтрЗаменить(ТелоСтроки, "&lt;", "<");
		Если СтрДлина(ТелоСтроки) > 0 Тогда
			НаборСтрок.Добавить(Новый ФорматированнаяСтрока(ТелоСтроки, ТекущийШрифт, ТекущийЦвет, ТекущийФон, ТекущаяСсылка));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(НаборСтрок);
	
КонецФункции

// Определяет доступные варианты распределения расходов на основании порядка учета.
// Если доступны все варианты, то возвращается пустой массив.
// 
// Параметры:
//  ПорядокУчета - ПеречислениеСсылка.ПорядокПогашенияСтоимостиОС,
//  			ПеречислениеСсылка.ПорядокУчетаСтоимостиВнеоборотныхАктивов	 - Порядок учета.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВариантыРаспределенияРасходов - Доступные варианты распределения расходов
Функция ДоступныеВариантыРаспределенияРасходов(ПорядокУчета) Экспорт
	
	ПорядокСписания = Новый Массив;
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НеПриниматьКУчетуВключитьВРасходы"));
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислитьАмортизациюПриПринятииКУчету"));
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриПринятииКУчету"));
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.СписыватьПриПринятииКУчету"));
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету"));
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы"));
	
	//++ Локализация
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету"));
	ПорядокСписания.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокСписанияНИОКРНУ.ПриПринятииКУчету"));
	//-- Локализация
	
	ВариантыРаспределенияРасходов = Новый Массив;
	
	Если ПорядокСписания.Найти(ПорядокУчета) <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ВариантыРаспределенияРасходов,
			ДоступныеВариантыРаспределенияРасходовПриСписании());
		
	КонецЕсли; 
	
	Возврат ВариантыРаспределенияРасходов;
	
КонецФункции

// Доступные варианты распределения расходов при списании.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВариантыРаспределенияРасходов -  Доступные варианты распределения расходов при списании
Функция ДоступныеВариантыРаспределенияРасходовПриСписании() Экспорт
	
	ВариантыРаспределенияРасходов = Новый Массив;
	
	ВариантыРаспределенияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности"));
	ВариантыРаспределенияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаРасходыТекущегоПериода"));
	ВариантыРаспределенияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НеРаспределять"));
	ВариантыРаспределенияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы"));
	
	Возврат ВариантыРаспределенияРасходов;
	
КонецФункции

// Заполняет реквизиты по способу отражения расходов.
// 
// Параметры:
//  СпособОтраженияРасходов - СправочникСсылка.СпособыОтраженияРасходов - Способ отражения расходов
// 	СтатьяРасходов - ПланВидовХарактеристикСсылка.СтатьиРасходов - Статья
// 	АналитикаРасходов - ЛюбаяСсылка - Аналитика
// 	Подразделение - СправочникСсылка.СтруктураПредприятия - Подразделение
// 	НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности -Направление деятельности
// 	ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета - Булево
// 
Процедура ЗаполнитьПоСпособуОтраженияРасходов(СпособОтраженияРасходов, СтатьяРасходов, АналитикаРасходов, Подразделение, НаправлениеДеятельности, ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета) Экспорт

	Если НЕ ЗначениеЗаполнено(СпособОтраженияРасходов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСпособаОтраженияРасходов = ВнеоборотныеАктивыВызовСервера.ПараметрыСпособаОтраженияРасходов(СпособОтраженияРасходов);
	
	СтатьяРасходов = ПараметрыСпособаОтраженияРасходов.СтатьяРасходов;
	АналитикаРасходов = ПараметрыСпособаОтраженияРасходов.АналитикаРасходов;
	Подразделение = ПараметрыСпособаОтраженияРасходов.Подразделение;
	НаправлениеДеятельности = ПараметрыСпособаОтраженияРасходов.НаправлениеДеятельности;
	ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета = ПараметрыСпособаОтраженияРасходов.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;
	
КонецПроцедуры

// Настраивает элементы формы по способу отражения расходов.
// 
// Параметры:
//  СпособОтраженияРасходов - СправочникСсылка.СпособыОтраженияРасходов - Способ отражения расходов
// 	Форма - ФормаКлиентскогоПриложения - Форма
// 	ИменаПолей - Массив из Строка - Имена полей
// 
Процедура НастроитьЭлементыПоСпособуОтраженияРасходов(СпособОтраженияРасходов, Форма, Знач ИменаПолей) Экспорт

	Если ЗначениеЗаполнено(СпособОтраженияРасходов) Тогда
		ТекстПредупреждения = НСтр("ru = 'При изменении будет очищен способ отражения расходов';
									|en = 'If you change it, the expense record method will be cleared'");
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.Отображать;
	Иначе
		ТекстПредупреждения = "";
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;

	ИменаПолей = СтрЗаменить(ИменаПолей, " ", "");
	ИменаПолей = СтрЗаменить(ИменаПолей, Символы.ПС, "");
	СписокПолей = СтрРазделить(ИменаПолей, ",");
	Для Каждого ИмяПоля Из СписокПолей Цикл
		ПолеФормы = Форма.Элементы[ИмяПоля];
		ПолеФормы.ПредупреждениеПриРедактировании = ТекстПредупреждения;
		ПолеФормы.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупреждения;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет заголовок элемента или скрывает элемент, если заголовок пустой.
// 
// Параметры:
// 	ЭлементФормы - ДекорацияФормы - Элемент формы.
// 	ЗаголовокЭлемента - Массив, Неопределено - Массив строк для формирования заголовка элемента.
Процедура ЗаполнитьСведенияЭлемента(ЭлементФормы, ЗаголовокЭлемента) Экспорт

	Если ЗаголовокЭлемента <> Неопределено И ЗаголовокЭлемента.Количество() <> 0 Тогда
		ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(ЗаголовокЭлемента);
		ЭлементФормы.Видимость = Истина;
	Иначе
		ЭлементФормы.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры

// Добавляет в табличную часть выбранные ОС / НМА.
//
// Параметры:
//  ТабличнаяЧасть		 - ДанныеФормыКоллекция	 - Табличная часть основных средств.
//  ИмяРеквизита		 - Строка				 - Имя реквизита табличной части.
//  ВыбранноеЗначение	 - Массив				 - Выбранные основные средства (параметр события ОбработкаВыбора).
// 
// Возвращаемое значение:
//  Массив - Список добавленных строк.
//
Функция ОбработкаВыбораЭлемента(ТабличнаяЧасть, ИмяРеквизита, ВыбранноеЗначение) Экспорт

	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДобавленныеСтроки = Новый Массив;
	Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл
		СтруктураПоиска = Новый Структура(ИмяРеквизита, ЭлементМассива);
		СписокСтрок = ТабличнаяЧасть.НайтиСтроки(СтруктураПоиска);
		Если СписокСтрок.Количество() = 0 Тогда
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			НоваяСтрока[ИмяРеквизита] = ЭлементМассива;
			ДобавленныеСтроки.Добавить(НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДобавленныеСтроки;

КонецФункции

Функция ЗначениеСвойстваРеквизитаОбъекта(ИмяРеквизита, Свойство, ПараметрыРеквизитовОбъекта) Экспорт

	Для каждого ПараметрыРеквизита Из ПараметрыРеквизитовОбъекта Цикл
		Если ПараметрыРеквизита.ИмяРеквизита = ИмяРеквизита И ПараметрыРеквизита.Свойство = Свойство Тогда
			Возврат ПараметрыРеквизита.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет или удаляет из списка значение.
// 
// Параметры:
// 	СписокВыбора - СписокЗначений из Произвольный - Свойство "СписокВыбора" элемента формы.
// 	Видимость - Булево - Истина, если значение должно быть видно.
// 	Значение - Произвольный - Значение списка, которое нужно показать или скрыть.
// 	Представление - Строка - Представление значения.
// 	Позиция - Число, Неопределено - Позиция в списке выбора.
Процедура УстановитьВидимостьЗначенияСпискаВыбора(СписокВыбора, Видимость, Значение, Представление= "", Позиция = Неопределено) Экспорт

	ЭлементСписка = СписокВыбора.НайтиПоЗначению(Значение);
	
	Если Видимость Тогда
		
		Если ЭлементСписка = Неопределено Тогда
			Если Позиция <> Неопределено Тогда
				СписокВыбора.Вставить(Позиция, Значение, Представление);
			Иначе
				СписокВыбора.Добавить(Значение, Представление);
			КонецЕсли;
		Иначе
			ЭлементСписка.Представление = Представление;
		КонецЕсли;
		 
	ИначеЕсли ЭлементСписка <> Неопределено Тогда
		
		СписокВыбора.Удалить(ЭлементСписка);
		
	КонецЕсли; 

КонецПроцедуры

Процедура УстановитьПредставлениеЗначенияСпискаВыбора(СписокВыбора, ЗначениеЭлемента, ПредставлениеЭлемента) Экспорт
	
	ЭлементСписка = СписокВыбора.НайтиПоЗначению(ЗначениеЭлемента);
	Если ЭлементСписка <> Неопределено Тогда
		ЭлементСписка.Представление = ПредставлениеЭлемента;
	КонецЕсли;
	
КонецПроцедуры

// 
// Параметры:
//  Объект - ДокументОбъект.ПринятиеКУчетуОС2_4 - 
//  ВспомогательныеРеквизиты - Структура - 
// 
// Возвращаемое значение:
//  Структура - 
//
Функция ПараметрыПринятияКУчетуОС(Объект, ВспомогательныеРеквизиты) Экспорт

	ПараметрыПринятияКУчетуОС = ПараметрыПринятияКУчетуОСИВводаОстатков(Объект, ВспомогательныеРеквизиты);	

	//
	ФактическаяСтоимость =
		Объект.ВидАналитикиКапитализацииРасходов =  ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства")
		И Объект.ЧастичныйВводВЭксплуатацию 
		ИЛИ Объект.ОтражатьВБУ
			И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена")
		ИЛИ Объект.ОтражатьВУпрУчете
			И Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
		ИЛИ НЕ ВспомогательныеРеквизиты.ЕстьУчетСебестоимости
		ИЛИ Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации");

	//
	СтоимостьБУДоступна = 
		Объект.ОтражатьВБУ
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка"));
	
	//
	СтоимостьУУДоступна = 
		Объект.ОтражатьВУпрУчете
		И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают)
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислениеАмортизацииИлиСписаниеНаРасходы")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
			
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		?(Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды"),
			ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииАрендаРегл = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету"),
			ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииОСРегл = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету"));
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииБУ = 
		Объект.ОтражатьВБУ
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость;
	
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		?(Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды"),
			ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииАренда = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету"),
			ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииОС = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету"));
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииУУ = 
		Объект.ОтражатьВУпрУчете
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость;
	
	//
	ПараметрыПринятияКУчетуОС.Вставить("ФактическаяСтоимость", ФактическаяСтоимость);
	ПараметрыПринятияКУчетуОС.Вставить("СтоимостьУУДоступна", СтоимостьУУДоступна);
	ПараметрыПринятияКУчетуОС.Вставить("СтоимостьБУДоступна", СтоимостьБУДоступна);
	ПараметрыПринятияКУчетуОС.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииБУ", ТребуетсяСтоимостьДляРасчетаАмортизацииБУ);
	ПараметрыПринятияКУчетуОС.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииУУ", ТребуетсяСтоимостьДляРасчетаАмортизацииУУ);
	ПараметрыПринятияКУчетуОС.Вставить("ТребуетсяСтоимостьДляНачисленияНалога", Ложь);
	
	ПринятиеКУчетуОСКлиентСерверЛокализация.ДополнитьПараметрыПринятияКУчетуОС(
		Объект, ВспомогательныеРеквизиты, ПараметрыПринятияКУчетуОС);
	
	Возврат ПараметрыПринятияКУчетуОС;
	
КонецФункции

Функция ПараметрыПринятияКУчетуУзловКомпонентовАмортизации(Объект, ВспомогательныеРеквизиты) Экспорт
	
	ДоступныПараметрыАмортизацииБУ = 
		(Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка"))
		И ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
	ДоступныПараметрыАмортизацииУУ = 
		(Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"))
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
	
	ДоступноОтражениеРасходовУУ = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету"));
			
	ДоступноОтражениеРасходовБУ = 
		ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка"));
			
	АмортизацияБУДоступна = 
		Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
		И ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
	АмортизацияУУДоступна = 
		(Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету"))
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
	
	ПоНаработке = 
		Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
		ИЛИ Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции");
		
	ПараметрыПринятияКУчету = Новый Структура;
	ПараметрыПринятияКУчету.Вставить("ДоступныПараметрыАмортизацииБУ", ДоступныПараметрыАмортизацииБУ);
	ПараметрыПринятияКУчету.Вставить("ДоступныПараметрыАмортизацииУУ", ДоступныПараметрыАмортизацииУУ);
	ПараметрыПринятияКУчету.Вставить("ДоступноОтражениеРасходовУУ", ДоступноОтражениеРасходовУУ);
	ПараметрыПринятияКУчету.Вставить("ДоступноОтражениеРасходовБУ", ДоступноОтражениеРасходовБУ);
	ПараметрыПринятияКУчету.Вставить("АмортизацияУУДоступна", АмортизацияУУДоступна);
	ПараметрыПринятияКУчету.Вставить("АмортизацияБУДоступна", АмортизацияБУДоступна);
	ПараметрыПринятияКУчету.Вставить("ПоНаработке", ПоНаработке);
	
	СтоимостьБУДоступна = Объект.ОтражатьВРеглУчете;

	СтоимостьУУДоступна = 
		Объект.ОтражатьВУпрУчете 
		И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
	ПараметрыПринятияКУчету.Вставить("СтоимостьУУДоступна", СтоимостьУУДоступна);
	ПараметрыПринятияКУчету.Вставить("СтоимостьБУДоступна", СтоимостьБУДоступна);
	
	Возврат ПараметрыПринятияКУчету;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ПринятиеКУчетуНМА2_4 - 
//  ВспомогательныеРеквизиты - Структура - 
// 
// Возвращаемое значение:
//  Структура - 
// 
Функция ПараметрыПринятияКУчетуНМА(Объект, ВспомогательныеРеквизиты) Экспорт

	ПараметрыПринятияКУчету = ПараметрыПринятияКУчетуНМАИВводаОстатков(Объект, ВспомогательныеРеквизиты);	

	//
	ФактическаяСтоимость =
		Объект.ОтражатьВБУ
			И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
		ИЛИ Объект.ОтражатьВУпрУчете
			И Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
		ИЛИ НЕ ВспомогательныеРеквизиты.ЕстьУчетСебестоимости
		ИЛИ Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуНМАпоИнвентаризации");
		
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииНМАРегл = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииБУ = 
		Объект.ОтражатьВБУ
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость;
	
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииНМА = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииУУ = 
		Объект.ОтражатьВУпрУчете
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость;
					
	ПараметрыПринятияКУчету.Вставить("ПоИнвентаризации", Ложь);
	ПараметрыПринятияКУчету.Вставить("ФактическаяСтоимость", ФактическаяСтоимость);
	ПараметрыПринятияКУчету.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииБУ", ТребуетсяСтоимостьДляРасчетаАмортизацииБУ);
	ПараметрыПринятияКУчету.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииУУ", ТребуетсяСтоимостьДляРасчетаАмортизацииУУ);
	
	ПринятиеКУчетуНМАКлиентСерверЛокализация.ДополнитьПараметрыПринятияКУчетуНМА(Объект, ВспомогательныеРеквизиты, ПараметрыПринятияКУчету);
	
	Возврат ПараметрыПринятияКУчету;

КонецФункции

Функция ПараметрыВводаОстатковОС(Объект, ВспомогательныеРеквизиты) Экспорт

	ПараметрыВводаОстатков = ПараметрыПринятияКУчетуОСИВводаОстатков(Объект, ВспомогательныеРеквизиты);
	
	ПараметрыВводаОстатков.Вставить("ДоступныПараметрыУчета", ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
	ПараметрыВводаОстатков.Вставить("ДействуетНачислениеИзноса", Ложь);
	
	ВводОстатковВнеоборотныхАктивовКлиентСерверЛокализация.ДополнитьПараметрыВводаОстатковОС(
		Объект, ВспомогательныеРеквизиты, ПараметрыВводаОстатков);

	Возврат ПараметрыВводаОстатков;

КонецФункции

Функция ПараметрыВводаОстатковНМА(Объект, ВспомогательныеРеквизиты) Экспорт
	
	ПараметрыВводаОстатков = ПараметрыПринятияКУчетуНМАИВводаОстатков(Объект, ВспомогательныеРеквизиты);
	
	ПараметрыВводаОстатков.Вставить("ДоступныПараметрыУчета", ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);

	ВводОстатковВнеоборотныхАктивовКлиентСерверЛокализация.ДополнитьПараметрыВводаОстатковНМА(
		Объект, ВспомогательныеРеквизиты, ПараметрыВводаОстатков);
	
	Возврат ПараметрыВводаОстатков;

КонецФункции

Функция ПараметрыОбъединенияОС(Объект, ВспомогательныеРеквизиты) Экспорт

	ПараметрыОбъединенияОС = ПараметрыПринятияКУчетуОСИВводаОстатков(Объект, ВспомогательныеРеквизиты);	
	
	Возврат ПараметрыОбъединенияОС;
	
КонецФункции

Функция ПараметрыМодернизацииОС(Объект, ВспомогательныеРеквизиты) Экспорт
	
	ПараметрыДокумента = Новый Структура();
	
	ФактическаяСтоимость =
		Объект.ВидАналитикиКапитализацииРасходов =  ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства")
		И Объект.ЧастичнаяМодернизация;
		
	// 
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииОСРегл = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииБУ = 
		Объект.ОтражатьВБУ
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость
		И НЕ Объект.СписатьЗатратыНаМодернизацию;
	
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииОС = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииУУ = 
		Объект.ОтражатьВУпрУчете
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость
		И НЕ Объект.СписатьЗатратыНаМодернизацию;
	
	//
	ТребуетсяСтоимостьДляНачисленияНалога = Ложь;
	
	//++ Локализация
	ТребуетсяСтоимостьДляНачисленияНалога = 
		Объект.ОтражатьВБУ
		И ВспомогательныеРеквизиты.МожетНачислятьсяНалогНаИмущество
		И НЕ Объект.СписатьЗатратыНаМодернизацию;
	//-- Локализация
		
	ПараметрыДокумента.Вставить("ФактическаяСтоимость", ФактическаяСтоимость);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииБУ", ТребуетсяСтоимостьДляРасчетаАмортизацииБУ);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииУУ", ТребуетсяСтоимостьДляРасчетаАмортизацииУУ);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляНачисленияНалога", ТребуетсяСтоимостьДляНачисленияНалога);
	
	Возврат ПараметрыДокумента;
	
КонецФункции

Функция ПараметрыОтнесенияОтклоненийВСтоимостьОС(Объект, ВспомогательныеРеквизиты) Экспорт
	
	ПараметрыДокумента = Новый Структура();
	
	ФактическаяСтоимость = Ложь;
		
	// 
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииОСРегл = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииБУ = 
		Объект.ОтражатьВБУ
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость
		И НЕ Объект.СписатьОтклоненияНаРасходы;
	
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииОС = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииУУ = 
		Объект.ОтражатьВУпрУчете
		И АмортизацияНачисляетсяСДатыПринятияКУчету
		И НЕ ФактическаяСтоимость
		И НЕ Объект.СписатьОтклоненияНаРасходы;
	
	//
	ТребуетсяСтоимостьДляНачисленияНалога = Ложь;
	
	//++ Локализация
	ТребуетсяСтоимостьДляНачисленияНалога = 
		Объект.ОтражатьВБУ
		И ВспомогательныеРеквизиты.МожетНачислятьсяНалогНаИмущество
		И НЕ Объект.СписатьОтклоненияНаРасходы;
	//-- Локализация
		
	ПараметрыДокумента.Вставить("ФактическаяСтоимость", ФактическаяСтоимость);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииБУ", ТребуетсяСтоимостьДляРасчетаАмортизацииБУ);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииУУ", ТребуетсяСтоимостьДляРасчетаАмортизацииУУ);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляНачисленияНалога", ТребуетсяСтоимостьДляНачисленияНалога);
	
	Возврат ПараметрыДокумента;
	
КонецФункции

Функция ПараметрыУлучшенияНМА(Объект, ВспомогательныеРеквизиты) Экспорт
	
	ПараметрыДокумента = Новый Структура();
	
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииНМАРегл = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииБУ = 
		Объект.ОтражатьВРеглУчете
		И АмортизацияНачисляетсяСДатыПринятияКУчету;
	
	//
	АмортизацияНачисляетсяСДатыПринятияКУчету = 
		ВспомогательныеРеквизиты.НастройкиУчетныхПолитик.ПорядокНачисленияАмортизацииНМА = ПредопределенноеЗначение("Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету");
		
	ТребуетсяСтоимостьДляРасчетаАмортизацииУУ = 
		Объект.ОтражатьВУпрУчете
		И АмортизацияНачисляетсяСДатыПринятияКУчету;
	
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииБУ", ТребуетсяСтоимостьДляРасчетаАмортизацииБУ);
	ПараметрыДокумента.Вставить("ТребуетсяСтоимостьДляРасчетаАмортизацииУУ", ТребуетсяСтоимостьДляРасчетаАмортизацииУУ);
	
	Возврат ПараметрыДокумента;
	
КонецФункции

Функция ЗаполнитьРеквизитыВЗависимостиОтСвойств_ОбъединениеОС(Объект, ПараметрыРеквизитовОбъекта) Экспорт

	ИзмененныеРеквизиты = Новый Массив;
	
	Для каждого ПараметрыРеквизита Из ПараметрыРеквизитовОбъекта Цикл
		
		Если НЕ ЗначениеЗаполнено(ПараметрыРеквизита.ИмяРеквизита)
			ИЛИ СтрРазделить(ПараметрыРеквизита.ИмяРеквизита, ".").ВГраница() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Действие = ОчиститьИлиЗаполнить(Объект, ПараметрыРеквизита);
		
		Если НЕ ЗначениеЗаполнено(Действие) Тогда
			Продолжить;
		КонецЕсли;
		
		#Область СтраницаУчет
		
		Если ПараметрыРеквизита.ИмяРеквизита = "НачислятьАмортизациюУУ" Тогда
			Объект[ПараметрыРеквизита.ИмяРеквизита] = ?(Действие = "Заполнить", Истина, Ложь);
			ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ПорядокУчетаУУ"
			И Действие = "Заполнить" Тогда
			Объект[ПараметрыРеквизита.ИмяРеквизита] = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию");
			ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "МетодНачисленияАмортизацииУУ"
			И Действие = "Заполнить" Тогда
			Объект[ПараметрыРеквизита.ИмяРеквизита] = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный");
			ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
		КонецЕсли;
		
		#КонецОбласти
		
		#Область СтраницаОтражениеРасходов
		
		Если ПараметрыРеквизита.ИмяРеквизита = "СтатьяРасходовУУ" Тогда
			Если Действие = "Очистить" Тогда
				Объект.СтатьяРасходовУУ = Неопределено;
				Объект.АналитикаРасходовУУ = Неопределено;
				ИзмененныеРеквизиты.Добавить("СтатьяРасходовУУ");
				ИзмененныеРеквизиты.Добавить("АналитикаРасходовУУ");
			КонецЕсли;
		КонецЕсли;
		
		#КонецОбласти
		
		ВнеоборотныеАктивыКлиентСерверЛокализация.ЗаполнитьРеквизитыВЗависимостиОтСвойств_ОбъединениеОС(
			Объект, ПараметрыРеквизита, Действие, ИзмененныеРеквизиты);
		
	КонецЦикла; 
	
	Возврат СтрСоединить(ИзмененныеРеквизиты, ",");
	
КонецФункции

// Устанавливает видимость элемента.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
// 	ИмяЭлемента - Строка -
// 	ИменаРеквизитовДанныеФлаг - Структура -
// 	ИмяТЧ - Строка -
// 	СтруктураИзмененныхРеквизитов- Структура - 
Процедура УстановитьВидимостьТекущегоЗначенияПараметраПриИзмененииПараметров(Форма, ИмяЭлемента, ИменаРеквизитовДанныеФлаг, ИмяТЧ, СтруктураИзмененныхРеквизитов) Экспорт

	Если СтруктураИзмененныхРеквизитов.Количество() = 0 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПоказатьТекущиеЗначения") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство(ИменаРеквизитовДанныеФлаг.ИмяРеквизитаФлаг) Тогда
			
		ЭлементФормы = Форма.Элементы[?(ИмяЭлемента = Неопределено, ИмяТЧ + ИменаРеквизитовДанныеФлаг.ИмяРеквизита, ИмяЭлемента)];
		ЭлементФормы.Видимость = Форма.Объект[ИменаРеквизитовДанныеФлаг.ИмяРеквизитаФлаг] И Форма.ПоказатьТекущиеЗначения;
			
	КонецЕсли;

КонецПроцедуры

Функция ИменаРеквизитовДанныеФлаг(ИмяРеквизита, ИмяРеквизитаФлаг) Экспорт
	
	ИментаРеквизитовДанныеФлаг = Новый Структура;
	ИментаРеквизитовДанныеФлаг.Вставить("ИмяРеквизита", ИмяРеквизита);
	ИментаРеквизитовДанныеФлаг.Вставить("ИмяРеквизитаФлаг", ИмяРеквизитаФлаг);
	
	Возврат ИментаРеквизитовДанныеФлаг; 
	
КонецФункции

// Копирует свойство структуры.
// 
// Параметры:
//  Источник - Структура - Источник
//  Приемник - Структура, ФиксированнаяСтруктура - Приемник
//  ИмяСвойства - Строка - Имя свойства
//  ЗначениеПоУмолчанию - Неопределено - Значение по умолчанию (если не указано, то поле не будет добавлено, если его нет в источнике)
Процедура КопироватьСвойствоСтруктуры(Источник, Приемник, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	ПутьКПараметру = СтрРазделить(ИмяСвойства, ".");
	Если ПутьКПараметру.Количество() = 3 Тогда
		ЗначениеСвойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник, ПутьКПараметру[2], ЗначениеПоУмолчанию);
	ИначеЕсли ПутьКПараметру.Количество() = 2 Тогда
		ЗначениеСвойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник, ПутьКПараметру[1], ЗначениеПоУмолчанию);
	Иначе
		ЗначениеСвойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник, ИмяСвойства, ЗначениеПоУмолчанию);
	КонецЕсли;
	
	Если ЗначениеСвойства = Неопределено
		И ЗначениеПоУмолчанию = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСвойствоСтруктуры(ИмяСвойства, ЗначениеСвойства, Приемник);
	
КонецПроцедуры

// Копирует свойство структуры.
// 
// Параметры:
//  ИмяСвойства - Строка - Имя свойства
//  ЗначениеСвойства - Произвольный - Значение свойства
//  Приемник - Структура, ФиксированнаяСтруктура - Приемник
Процедура УстановитьСвойствоСтруктуры(ИмяСвойства, ЗначениеСвойства, Приемник) Экспорт

	ПутьКСвойству = СтрРазделить(ИмяСвойства, ".");
	
	Если ТипЗнч(Приемник) = Тип("ФиксированнаяСтруктура")
		ИЛИ Приемник = Неопределено Тогда
		
		НовыеСвойства = Новый Структура(Приемник);

		Если ПутьКСвойству.Количество() = 3 Тогда
			НовыеСвойства[ПутьКСвойству[0]][ПутьКСвойству[1]].Вставить(ПутьКСвойству[2], ЗначениеСвойства);
		ИначеЕсли ПутьКСвойству.Количество() = 2 Тогда
			НовыеСвойства[ПутьКСвойству[0]].Вставить(ПутьКСвойству[1], ЗначениеСвойства);
		Иначе
			НовыеСвойства.Вставить(ИмяСвойства, ЗначениеСвойства);
		КонецЕсли;
		
		Приемник = Новый ФиксированнаяСтруктура(НовыеСвойства);
		
	Иначе

		Если ПутьКСвойству.Количество() = 3 Тогда
			Приемник[ПутьКСвойству[0]][ПутьКСвойству[1]].Вставить(ПутьКСвойству[2], ЗначениеСвойства);
		ИначеЕсли ПутьКСвойству.Количество() = 2 Тогда
			Приемник[ПутьКСвойству[0]].Вставить(ПутьКСвойству[1], ЗначениеСвойства);
		Иначе
			Приемник.Вставить(ИмяСвойства, ЗначениеСвойства);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

// Формирует список значений колонки таблицы.
// 
// Параметры:
//  Таблица - ТаблицаЗначений, ДанныеФормыКоллекция - Таблица
//  ИмяКолонки - Строка - Имя колонки
// 
// Возвращаемое значение:
//  Массив -
//
Функция ЗначенияКолонкиТаблицы(Таблица, ИмяКолонки) Экспорт
	
	Результат = Новый Массив();
	
	Для Каждого Элемент Из Таблица Цикл
		Если ЗначениеЗаполнено(Элемент[ИмяКолонки]) Тогда
			Результат.Добавить(Элемент[ИмяКолонки]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ОпределениеСвойствЗависимыхРеквизитовОбъекта

// 
// Параметры:
//  Объект - ДокументОбъект.ПринятиеКУчетуОС2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ПринятиеКУчетуОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыПринятияКУчетуОС = ПараметрыПринятияКУчетуОС(Объект, ВспомогательныеРеквизиты);
	
	ПринятиеКУчетуОСКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов(
		Объект, ВспомогательныеРеквизиты, ПараметрыПринятияКУчетуОС, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	ДатаДокумента = Объект.Дата;
	
	#Область Основное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС")
			И ВспомогательныеРеквизиты.ИспользоватьОбъектыСтроительства;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидАналитикиКапитализацииРасходов", 
			"ВидАналитикиРасходовОсновныеСредства", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидАналитикиКапитализацииРасходов", 
			"ВидАналитикиРасходовОбъектыСтроительства", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъектСтроительства", 
			"ОбъектСтроительства", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЧастичныйВводВЭксплуатацию", 
			"ЧастичныйВводВЭксплуатацию", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		//
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды");
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Договор", 
			"Договор", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
		//
		ЗначениеСвойства = 
			(Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации")
				ИЛИ Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДокументОснование", 
			"ДокументОснование", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДокументНаОсновании", 
			"ДокументНаОсновании", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидАналитикиКапитализацииРасходов")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС")
			ИЛИ Объект.ВидАналитикиКапитализацииРасходов <> ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЧастичныйВводВЭксплуатацию", 
			"ЧастичныйВводВЭксплуатацию", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидАналитикиКапитализацииРасходов")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидАналитикиКапитализацииРасходов <> ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъектСтроительства", 
			"ОбъектСтроительства", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВариантПримененияЦелевогоФинансирования")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"АвтоОтметкаНезаполненного", 
			ПараметрыПринятияКУчетуОС.НаправлениеДеятельностиОбязательно, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли; 
	
	Если СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.РежимИсправленияСПрошлойДаты;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантДоначисленияАмортизации", 
			"ВариантДоначисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = НЕ Объект.РежимИсправленияСПрошлойДаты;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчету", 
			"ДатаПринятияКУчету", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	#Область ОС
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчетуОС.СтоимостьБУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ЛиквидационнаяСтоимостьРегл", 
			"ОСЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = ПараметрыПринятияКУчетуОС.СтоимостьУУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ЛиквидационнаяСтоимость", 
			"ОСЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
				
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ПоказательНаработки", 
			"ОСПоказательНаработки", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСПоказательНаработкиЕдиницаИзмерения", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ОбъемНаработки", 
			"ОСОбъемНаработки", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ГруппаОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АмортизационнаяГруппа")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НедвижимоеИмущество")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоначислитьАмортизациюЗаПрошлыйПериод")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидАналитикиКапитализацииРасходов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЧастичныйВводВЭксплуатацию")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуОС.СтоимостьБУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьБУ", 
			"ОССтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуОС.СтоимостьБУДоступна
			И (ПараметрыПринятияКУчетуОС.ТребуетсяСтоимостьДляРасчетаАмортизацииБУ
				ИЛИ ПараметрыПринятияКУчетуОС.ФактическаяСтоимость
				ИЛИ Объект.РежимИсправленияСПрошлойДаты
				ИЛИ ПараметрыПринятияКУчетуОС.ТребуетсяСтоимостьДляНачисленияНалога
					И (ВспомогательныеРеквизиты.УплачиваютсяАвансыПоНалогуНаИмущество
							И КонецМесяца(ДатаДокумента) = КонецКвартала(ДатаДокумента)
						ИЛИ КонецМесяца(ДатаДокумента) = КонецГода(ДатаДокумента)));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьБУ", 
			"ОССтоимостьБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуОС.СтоимостьУУДоступна;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьУУ", 
			"ОССтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуОС.СтоимостьУУДоступна
			И (ПараметрыПринятияКУчетуОС.ТребуетсяСтоимостьДляРасчетаАмортизацииУУ
				ИЛИ ПараметрыПринятияКУчетуОС.ФактическаяСтоимость
				ИЛИ Объект.РежимИсправленияСПрошлойДаты);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьУУ", 
			"ОССтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчета
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииБУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииБУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииБУ,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииБУ, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ",
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				И ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииБУ);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииУУ
							И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
								ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = (ПараметрыПринятияКУчетуОС.ДоступныПараметрыАмортизацииУУ
							И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
		
	#КонецОбласти
	
	#Область ОтражениеРасходов
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуОС.ДоступноОтражениеРасходовБУ
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НеПриниматьКУчетуВключитьВРасходы");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовБУ", 
			"СпособОтраженияРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			(ПараметрыПринятияКУчетуОС.ДоступноОтражениеРасходовУУ
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУУ", 
			"СпособОтраженияРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчетуОС.СтатьяРасходовУУОбязательна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			(ПараметрыПринятияКУчетуОС.ДоступноОтражениеРасходовУУ
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы"))
			И ПараметрыПринятияКУчетуОС.СтатьяРасходовУУОбязательна;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ;

		ИмяСвойства = ?( 
			НЕ ЗначениеСвойства
			И НЕ ПараметрыПринятияКУчетуОС.СтатьяРасходовУУОбязательна,
			"ТолькоПросмотр",
			"ТолькоПросмотрБезОтметкиНезаполненного");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			ИмяСвойства, 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ЕстьСвязанныеОрганизации 
			И (ПараметрыПринятияКУчетуОС.ДоступноОтражениеРасходовБУ 
				ИЛИ ПараметрыПринятияКУчетуОС.ДоступноОтражениеРасходовНУ
				ИЛИ ПараметрыПринятияКУчетуОС.ДоступноОтражениеРасходовУУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПередаватьРасходыВДругуюОрганизацию",
			"ПередаватьРасходыВДругуюОрганизацию", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПередаватьРасходыВДругуюОрганизацию") 
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов",
			"ОрганизацияПолучательРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ПередаватьРасходыВДругуюОрганизацию, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
		
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ПринятиеКУчетуУзловКомпонентовАмортизации, ДанныеФормыСтруктура - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ПринятиеКУчетуУзловКомпонентовАмортизации(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыПринятияКУчету = ПараметрыПринятияКУчетуУзловКомпонентовАмортизации(Объект, ВспомогательныеРеквизиты);
	
	Если ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"АвтоОтметкаНезаполненного", 
			Ложь, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли; 

	#Область КомпонентыАмортизации
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчету.СтоимостьБУДоступна;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КомпонентыАмортизации.СтоимостьБУ", 
			"КомпонентыАмортизацииСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КомпонентыАмортизации.ЛиквидационнаяСтоимостьРегл", 
			"КомпонентыАмортизацииЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчету.СтоимостьУУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КомпонентыАмортизации.СтоимостьУУ", 
			"КомпонентыАмортизацииСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КомпонентыАмортизации.ЛиквидационнаяСтоимость", 
			"КомпонентыАмортизацииЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КомпонентыАмортизации.ПоказательНаработки", 
			"КомпонентыАмортизацииПоказательНаработки", 
			"Видимость", 
			ПараметрыПринятияКУчету.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"КомпонентыАмортизацииПоказательНаработкиЕдиницаИзмерения", 
			"Видимость", 
			ПараметрыПринятияКУчету.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КомпонентыАмортизации.ОбъемНаработки", 
			"КомпонентыАмортизацииОбъемНаработки", 
			"Видимость", 
			ПараметрыПринятияКУчету.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчету.ДоступныПараметрыАмортизацииБУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			(Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				И ПараметрыПринятияКУчету.ДоступныПараметрыАмортизацииБУ);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ",
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчету.ДоступныПараметрыАмортизацииУУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчету.ДоступныПараметрыАмортизацииУУ
			И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчету.ДоступныПараметрыАмортизацииУУ
			И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка");
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
		
	#КонецОбласти
	
	#Область СтраницаОтражениеРасходов
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчету.ДоступноОтражениеРасходовБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчету.ДоступноОтражениеРасходовУУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ПринятиеКУчетуУзловКомпонентовАмортизации(
		Объект, ВспомогательныеРеквизиты, ПараметрыПринятияКУчету, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.СписаниеОС2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_СписаниеОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаСоответствуетСписываемомуОС")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.АналитикаСоответствуетСписываемомуОС;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходов", 
			"АналитикаРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходов")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов")
			И ЗначениеЗаполнено(Объект.СтатьяРасходов);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаСоответствуетСписываемомуОС", 
			"АналитикаСоответствуетСписываемомуОС", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СуммаСписанияБУ", 
			"ОССуммаСписанияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете 
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное")
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СуммаСписанияУУ", 
			"ОССуммаСписанияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОС.Количество() > 1;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПриходуемыеМЦОсновноеСредство", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПриходуемыеМЦ.ОсновноеСредство", 
			"ПриходуемыеМЦОсновноеСредство", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ЛиквидационнаяСтоимостьРегл", 
			"ОСЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное")
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ЛиквидационнаяСтоимость", 
			"ОСЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеОСЧастичное");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РежимИсправленияСПрошлойДаты", 
			"РежимИсправленияСПрошлойДаты", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаСписания", 
			"ДатаСписания", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.РежимИсправленияСПрошлойДаты;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаСписания", 
			"ДатаСписания", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеРасходов", 
			"ПодразделениеРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиРасходов", 
			"НаправлениеДеятельностиРасходов", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_СписаниеОС(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ИзменениеПараметровОС2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ИзменениеПараметровОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	#Область Основное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.РежимИсправленияСПрошлойДаты;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачалоДействия", 
			"НачалоДействия", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
		
	#Область УчетБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУФлаг", 
			"НачислятьАмортизациюБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУФлаг", 
			"МетодНачисленияАмортизацииБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУФлаг", 
			"СрокИспользованияБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УказанОстаточныйСрокБУ", 
			"УказанОстаточныйСрокБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУФлаг", 
			"КоэффициентУскоренияБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачислятьАмортизациюБУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ",
			"ТолькоПросмотр", 
			НЕ Объект.НачислятьАмортизациюБУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ",
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.МетодНачисленияАмортизацииБУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КоэффициентУскоренияБУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.КоэффициентУскоренияБУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("СрокИспользованияБУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.СрокИспользованияБУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УказанОстаточныйСрокБУ", 
			"УказанОстаточныйСрокБУ", 
			"ТолькоПросмотр", 
			НЕ Объект.СрокИспользованияБУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	#Область УчетУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("НачислятьАмортизациюУУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"ТолькоПросмотр", 
			НЕ Объект.НачислятьАмортизациюУУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУФлаг",
			"НачислятьАмортизациюУУФлаг",
			"Видимость",
			Объект.ОтражатьВУпрУчете,
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.МетодНачисленияАмортизацииУУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУФлаг", 
			"МетодНачисленияАмортизацииУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СрокИспользованияУУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.СрокИспользованияУУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУФлаг", 
			"СрокИспользованияУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УказанОстаточныйСрокУУ", 
			"УказанОстаточныйСрокУУ", 
			"ТолькоПросмотр", 
			НЕ Объект.СрокИспользованияУУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УказанОстаточныйСрокУУ", 
			"УказанОстаточныйСрокУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КоэффициентУскоренияУУФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"ТолькоПросмотр", 
			НЕ Объект.КоэффициентУскоренияУУФлаг, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУФлаг", 
			"КоэффициентУскоренияУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОтражатьВУпрУчете ИЛИ Объект.ОтражатьВБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработки", 
			"ПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработкиФлаг", 
			"ПоказательНаработкиФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработкиФлаг", 
			"ОбъемНаработкиФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ГруппаФинансовогоУчетаФлаг")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ГруппаФинансовогоУчета", 
			"ГруппаФинансовогоУчета", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ГруппаФинансовогоУчетаФлаг, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиФлаг")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности",
			"НаправлениеДеятельности",
			"ТолькоПросмотр", 
			НЕ Объект.НаправлениеДеятельностиФлаг,
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПоказательНаработкиФлаг")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработки",
			"ПоказательНаработки",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			НЕ Объект.ПоказательНаработкиФлаг,
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОбъемНаработкиФлаг")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки",
			"ОбъемНаработки",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			НЕ Объект.ОбъемНаработкиФлаг, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	// При изменении параметров только в налоговом учете, изменение ЕГДС не имеет смысла.
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		Если (Объект.ОтражатьВБУ = Ложь И Объект.ОтражатьВУпрУчете = Ложь)
			И (Объект.ОтражатьВНУ И Объект.ОтражатьВРеглУчете) Тогда // Изменение параметров только в налоговом учете.
			ВидимостьЕГДС = Ложь;
		Иначе 														// Все прочие варианты изменения параметров.
			ВидимостьЕГДС = Истина;
		КонецЕсли;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕГДС",
			"ЕГДС",
			"Видимость",
			ВидимостьЕГДС,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕГДСФлаг",
			"ЕГДСФлаг",
			"Видимость",
			ВидимостьЕГДС,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область УчетОбщее
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимость", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьФлаг", 
			"ЛиквидационнаяСтоимостьФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЛиквидационнаяСтоимостьФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимость", 
			"ЛиквидационнаяСтоимость", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ЛиквидационнаяСтоимостьФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОтражатьВБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРеглФлаг", 
			"ЛиквидационнаяСтоимостьРеглФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЛиквидационнаяСтоимостьРеглФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ЛиквидационнаяСтоимостьРеглФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Амортизация
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражениеАмортизационныхРасходовФлаг")
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства = НЕ Объект.ОтражениеАмортизационныхРасходовФлаг;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Амортизация",
			"Амортизация",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходов",
			"СпособОтраженияРасходов",
			"ТолькоПросмотр",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"АмортизацияСтатьяРасходовБезРазбиения",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"ПереключательАмортизацияБезРазбиения",
			"ТолькоПросмотр",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражениеАмортизационныхРасходовФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПереключательАмортизацияБезРазбиения")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБезРазбиения")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.Амортизация.Количество() = 0
			ИЛИ Объект.Амортизация[0].ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияПодразделениеБезРазбиения", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаправлениеДеятельностиБезРазбиения", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражениеАмортизационныхРасходовФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПереключательАмортизацияБезРазбиения")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АмортизацияПередаватьРасходыВДругуюОрганизациюБезРазбиения")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.Амортизация.Количество() = 0
			ИЛИ НЕ Объект.Амортизация[0].ПередаватьРасходыВДругуюОрганизацию;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"АмортизацияОрганизацияПолучательРасходовБезРазбиения",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
		
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ИзменениеПараметровОС(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.МодернизацияОС2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_МодернизацияОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ДатаДокумента = Объект.Дата;
	
	ПараметрыМодернизацииОС = ПараметрыМодернизацииОС(Объект, ВспомогательныеРеквизиты);

	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_МодернизацияОС(
		Объект, ВспомогательныеРеквизиты, ПараметрыМодернизацииОС, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	#Область СтраницаОсновное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СписатьЗатратыНаМодернизацию")
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства = 
			НЕ Объект.СписатьЗатратыНаМодернизацию;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РежимИсправленияСПрошлойДаты", 
			"РежимИсправленияСПрошлойДаты", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаМодернизации", 
			"ДатаМодернизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьЗатратыНаМодернизацию")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.РежимИсправленияСПрошлойДаты;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаМодернизации", 
			"ДатаМодернизации", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.РежимИсправленияСПрошлойДаты
			И НЕ Объект.СписатьЗатратыНаМодернизацию;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантДоначисленияАмортизации", 
			"ВариантДоначисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидАналитикиКапитализацииРасходов")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = (Объект.ВидАналитикиКапитализацииРасходов <> ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъектСтроительства", 
			"ОбъектСтроительства", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЧастичнаяМодернизация", 
			"ЧастичнаяМодернизация", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ИспользоватьОбъектыСтроительства;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидАналитикиКапитализацииРасходов", 
			"ВидАналитикиРасходовОсновныеСредства", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидАналитикиКапитализацииРасходов", 
			"ВидАналитикиРасходовОбъектыСтроительства", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъектСтроительства", 
			"ОбъектСтроительства", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЧастичнаяМодернизация", 
			"ЧастичнаяМодернизация", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СтраницаОсновныеСредства
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидАналитикиКапитализацииРасходов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЧастичнаяМодернизация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьЗатратыНаМодернизацию")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьБУ", 
			"ОССтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И (ПараметрыМодернизацииОС.ТребуетсяСтоимостьДляРасчетаАмортизацииБУ
				ИЛИ ПараметрыМодернизацииОС.ФактическаяСтоимость
				ИЛИ Объект.РежимИсправленияСПрошлойДаты
				ИЛИ ПараметрыМодернизацииОС.ТребуетсяСтоимостьДляНачисленияНалога
					И (ВспомогательныеРеквизиты.УплачиваютсяАвансыПоНалогуНаИмущество
							И КонецМесяца(ДатаДокумента) = КонецКвартала(ДатаДокумента)
						ИЛИ КонецМесяца(ДатаДокумента) = КонецГода(ДатаДокумента)));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьБУ", 
			"ОССтоимостьБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьУУ", 
			"ОССтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
					И ПараметрыМодернизацииОС.ТребуетсяСтоимостьДляРасчетаАмортизацииУУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают
					И ПараметрыМодернизацииОС.ТребуетсяСтоимостьДляРасчетаАмортизацииБУ
				ИЛИ ПараметрыМодернизацииОС.ФактическаяСтоимость
				ИЛИ Объект.РежимИсправленияСПрошлойДаты);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьУУ", 
			"ОССтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
		
	#Область СтраницаУчет
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СписатьЗатратыНаМодернизацию")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.СписатьЗатратыНаМодернизацию;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовСписанияЗатрат", 
			"СтатьяРасходовСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовСписанияЗатрат", 
			"АналитикаРасходовСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеСписанияЗатрат", 
			"ПодразделениеСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиСписанияЗатрат", 
			"НаправлениеДеятельностиСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьЗатратыНаМодернизацию")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеСписанияЗатрат", 
			"ПодразделениеСписанияЗатрат", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиСписанияЗатрат", 
			"НаправлениеДеятельностиСписанияЗатрат", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СтраницаДополнительно
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВариантПримененияЦелевогоФинансирования")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьЗатратыНаМодернизацию")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"Видимость", 
			ВспомогательныеРеквизиты.НаправлениеДеятельностиОбязательно, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли; 
	
	#КонецОбласти
	
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ОтнесениеОтклоненийВСтоимостьОС, ДанныеФормыСтруктура - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ОтнесениеОтклоненийВСтоимостьОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыДокумента = ПараметрыОтнесенияОтклоненийВСтоимостьОС(Объект, ВспомогательныеРеквизиты);

	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ОтнесениеОтклоненийВСтоимостьОС(
		Объект, ВспомогательныеРеквизиты, ПараметрыДокумента, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	#Область СтраницаОсновное
	
	Если ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ИспользоватьОбъектыСтроительства;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидАналитикиКапитализацииРасходов", 
			"ВидАналитикиРасходовОсновныеСредства", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВидАналитикиКапитализацииРасходов", 
			"ВидАналитикиРасходовОбъектыСтроительства", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъектСтроительства", 
			"ОбъектСтроительства", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидАналитикиКапитализацииРасходов")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = (Объект.ВидАналитикиКапитализацииРасходов <> ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъектСтроительства", 
			"ОбъектСтроительства", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СписатьОтклоненияНаРасходы")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			НЕ Объект.СписатьОтклоненияНаРасходы;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантДоначисленияАмортизации", 
			"ВариантДоначисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СтраницаОсновныеСредства
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьОтклоненияНаРасходы")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И НЕ Объект.СписатьОтклоненияНаРасходы;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СуммаБУ", 
			"ОССуммаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И НЕ Объект.СписатьОтклоненияНаРасходы
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СуммаУУ", 
			"ОССуммаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СтраницаУчет
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СписатьОтклоненияНаРасходы")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.СписатьОтклоненияНаРасходы;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовСписанияЗатрат", 
			"СтатьяРасходовСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовСписанияЗатрат", 
			"АналитикаРасходовСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеСписанияЗатрат", 
			"ПодразделениеСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиСписанияЗатрат", 
			"НаправлениеДеятельностиСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьОтклоненияНаРасходы")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаСписанияЗатрат;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеСписанияЗатрат", 
			"ПодразделениеСписанияЗатрат", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиСписанияЗатрат", 
			"НаправлениеДеятельностиСписанияЗатрат", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СтраницаДополнительно
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВариантПримененияЦелевогоФинансирования")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СписатьОтклоненияНаРасходы")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"Видимость", 
			ВспомогательныеРеквизиты.НаправлениеДеятельностиОбязательно, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли; 
	
	#КонецОбласти
	
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ПереоценкаОС2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ПереоценкаОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьУУ", 
			"ОССтоимостьУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьБУ", 
			"ОССтоимостьБУ", 
			"Видимость", 
			Объект.ОтражатьВРеглУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеРасходов", 
			"ПодразделениеРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиРасходов", 
			"НаправлениеДеятельностиРасходов", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиДоходовСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиДоходовСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеДоходов", 
			"ПодразделениеДоходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиДоходов", 
			"НаправлениеДеятельностиДоходов", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.РазукомплектацияОС, ДанныеФормыСтруктура - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_РазукомплектацияОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	#Область ПараметрыБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтоимостьБУ", 
			"СтоимостьБУ", 
			"Видимость", 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ГрафикАмортизации", 
			"ГрафикАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации")
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				ИЛИ Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации")
			И Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка");
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ",
			"КоэффициентУскоренияБУ",
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете 
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтоимостьУУ", 
			"СтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации")
			И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации")
			И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка");
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ",
			"КоэффициентУскоренияУУ",
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;

	#КонецОбласти
	
	#Область ОбщиеПараметры
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = НЕ ВспомогательныеРеквизиты.ВалютыСовпадают И ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			Или ВспомогательныеРеквизиты.ОтражатьВУпрУчете И Не ВспомогательныеРеквизиты.ОтражатьВРеглУчете;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ЗначениеСвойства = ВспомогательныеРеквизиты.ОтражатьВРеглУчете И ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			Или ВспомогательныеРеквизиты.ОтражатьВРеглУчете И Не ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
			ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
			И ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработки", 
			"ПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыделениеУзловКомпонентовАмортизации");
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ГруппаФинансовогоУчета",
			"ГруппаФинансовогоУчета",
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;
	
	#КонецОбласти

	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_РазукомплектацияОС(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ВводОстатковВнеоборотныхАктивов2_4, ДанныеФормыСтруктура - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	ПараметрыРеквизитовОбъекта = Неопределено;
	
	Если ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковОсновныхСредств")
		ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуОС")
		ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуПредметовЛизингаНаБалансе")
		ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковАрендованныхОСНаБалансе") Тогда
		
		ПараметрыРеквизитовОбъекта = ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_ОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты);
		
	ИначеЕсли ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковНМАиРасходовНаНИОКР") Тогда
		
		ПараметрыРеквизитовОбъекта = ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_НМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты);
		
	ИначеЕсли ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковВзаиморасчетовПоДоговорамАренды") Тогда
		
		ПараметрыРеквизитовОбъекта = ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_РасчетыПоАренде(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ПринятиеКУчетуНМА2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ПринятиеКУчетуНМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыПринятияКУчетуНМА = ПараметрыПринятияКУчетуНМА(Объект, ВспомогательныеРеквизиты);
		
	ПринятиеКУчетуНМАКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов(
		Объект, ПараметрыПринятияКУчетуНМА, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	#Область Основное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуНМА.СтоимостьБУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуНМА.СтоимостьБУДоступна
			И (ПараметрыПринятияКУчетуНМА.ТребуетсяСтоимостьДляРасчетаАмортизацииБУ
				ИЛИ ПараметрыПринятияКУчетуНМА.ФактическаяСтоимость);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуНМА.СтоимостьУУДоступна;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуНМА.СтоимостьУУДоступна
			И (ПараметрыПринятияКУчетуНМА.ТребуетсяСтоимостьДляРасчетаАмортизацииУУ
				ИЛИ ПараметрыПринятияКУчетуНМА.ФактическаяСтоимость);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчетуНМА.СтоимостьБУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчетуНМА.СтоимостьУУДоступна;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимость", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ВариантПримененияЦелевогоФинансирования") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"АвтоОтметкаНезаполненного", 
			ПараметрыПринятияКУчетуНМА.НаправлениеДеятельностиОбязательно, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ",
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			И Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентБУ", 
			"КоэффициентБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОтражатьВУпрУчете;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		Или СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуНМА.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			ПараметрыПринятияКУчетуНМА.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			ПараметрыПринятияКУчетуНМА.ДоступныПараметрыАмортизацииУУ, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуНМА.ДоступныПараметрыАмортизацииУУ
			И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.Линейный")
				ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
		//
		ЗначениеСвойства = Объект.ОтражатьВУпрУчете
			И Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			И Объект.МетодНачисленияАмортизацииУУ =
				ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		Или СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		Или СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		Или СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		Или СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		Или СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		Или СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ПараметрыПринятияКУчетуНМА.ПоНаработке, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОтражениеРасходовБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ПараметрыПринятияКУчетуНМА.ДоступноОтражениеРасходовБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовБУ", 
			"СпособОтраженияРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОтражениеРасходовУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыПринятияКУчетуНМА.ДоступноОтражениеРасходовУУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУУ", 
			"СпособОтраженияРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете 
			И ПараметрыПринятияКУчетуНМА.СтатьяРасходовУУОбязательна;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыПринятияКУчетуНМА.ДоступноОтражениеРасходовУУ
			И ПараметрыПринятияКУчетуНМА.СтатьяРасходовУУОбязательна;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ;

		ИмяСвойства = ?( 
			НЕ ЗначениеСвойства
			И НЕ ПараметрыПринятияКУчетуНМА.СтатьяРасходовУУОбязательна,
			"ТолькоПросмотр",
			"ТолькоПросмотрБезОтметкиНезаполненного");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			ИмяСвойства, 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	#Область ОтражениеРасходовПрочее
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПередаватьРасходыВДругуюОрганизацию") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ПередаватьРасходыВДругуюОрганизацию;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов", 
			"Доступность", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов", 
			"ТолькоПросмотр", 
			Не ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ЕстьСвязанныеОрганизации;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПередаватьРасходыВДругуюОрганизацию", 
			"ПередаватьРасходыВДругуюОрганизацию",
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов",
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
	
	#КонецОбласти
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.СписаниеНМА2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_СписаниеНМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаСоответствуетСписываемомуНМА")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.АналитикаСоответствуетСписываемомуНМА;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходов", 
			"АналитикаРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходов")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов")
			И ЗначениеЗаполнено(Объект.СтатьяРасходов);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаСоответствуетСписываемомуНМА", 
			"АналитикаСоответствуетСписываемомуНМА", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		Или СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		Или СтруктураИзмененныхРеквизитов.Свойство("Организация")
		Или СтруктураИзмененныхРеквизитов.Свойство("Дата")
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете 
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеНМАЧастичное")
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СуммаСписанияУУ", 
			"НМАСуммаСписанияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		Или СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеНМАЧастичное");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СуммаСписанияБУ", 
			"НМАСуммаСписанияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеНМАЧастичное");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.ЛиквидационнаяСтоимостьРегл", 
			"НМАЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеНМАЧастичное")
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.ЛиквидационнаяСтоимость", 
			"НМАЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеРасходов", 
			"ПодразделениеРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиРасходов", 
			"НаправлениеДеятельностиРасходов", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_СписаниеНМА(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ПереоценкаНМА2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ПереоценкаНМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьУУ", 
			"НМАСтоимостьУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьБУ", 
			"НМАСтоимостьБУ", 
			"Видимость", 
			Объект.ОтражатьВРеглУчете, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеРасходов", 
			"ПодразделениеРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиРасходов", 
			"НаправлениеДеятельностиРасходов", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиДоходовСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиДоходовСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеДоходов", 
			"ПодразделениеДоходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиДоходов", 
			"НаправлениеДеятельностиДоходов", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ПеремещениеНМА2_4 - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ПеремещениеНМА(Объект, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"Организация", 
			"ВидимостьЭлемента", 
			НЕ ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОрганизацияСдатчик", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучатель", 
			"ОрганизацияПолучатель", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ИзменениеПараметровНМА2_4 - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ИзменениеПараметровНМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	#Область СтраницаОсновное
	
	Если ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДокументОснование", 
			"ДокументОснование", 
			"Видимость", 
			ЗначениеЗаполнено(Объект.ДокументОснование), 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		Или СтруктураИзмененныхРеквизитов.Свойство("Организация")
		Или СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
		// ПорядокУчетаБУ
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУФлаг", 
			"ПорядокУчетаБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		// МетодНачисленияАмортизацииБУ
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУФлаг", 
			"МетодНачисленияАмортизацииБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		// СрокИспользованияБУ
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУФлаг", 
			"СрокИспользованияБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		// КоэффициентБУ
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентБУ", 
			"КоэффициентБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентБУФлаг", 
			"КоэффициентБУФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУФлаг")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ПорядокУчетаБУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУФлаг")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.МетодНачисленияАмортизацииБУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СрокИспользованияБУФлаг")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.СрокИспользованияБУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КоэффициентБУФлаг")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентБУ", 
			"КоэффициентБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.КоэффициентБУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУФлаг", 
			"ПорядокУчетаУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ПорядокУчетаУУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУФлаг", 
			"МетодНачисленияАмортизацииУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.МетодНачисленияАмортизацииУУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		Или ОбновитьВсе Тогда

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУФлаг", 
			"СрокИспользованияУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СрокИспользованияУУФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.СрокИспользованияУУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		Или ОбновитьВсе Тогда

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУФлаг", 
			"КоэффициентУскоренияУУФлаг", 
			"Видимость", 
			Объект.ОтражатьВУпрУчете, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("КоэффициентУскоренияУУФлаг") 
		Или ОбновитьВсе Тогда

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.КоэффициентУскоренияУУФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОбщиеПараметры
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		Или СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОтражатьВУпрУчете ИЛИ Объект.ОтражатьВБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработкиФлаг", 
			"ОбъемНаработкиФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ГруппаФинансовогоУчетаФлаг")
		Или ОбновитьВсе Тогда

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ГруппаФинансовогоУчета",
			"ГруппаФинансовогоУчета",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			НЕ Объект.ГруппаФинансовогоУчетаФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОбъемНаработкиФлаг")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки",
			"ОбъемНаработки",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			НЕ Объект.ОбъемНаработкиФлаг,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиФлаг")
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности",
			"НаправлениеДеятельности",
			"ТолькоПросмотр",
			НЕ Объект.НаправлениеДеятельностиФлаг,
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимость", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьФлаг", 
			"ЛиквидационнаяСтоимостьФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЛиквидационнаяСтоимостьФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимость", 
			"ЛиквидационнаяСтоимость", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ЛиквидационнаяСтоимостьФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		Или ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ОтражатьВБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРеглФлаг", 
			"ЛиквидационнаяСтоимостьРеглФлаг", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЛиквидационнаяСтоимостьРеглФлаг") 
		Или ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ЛиквидационнаяСтоимостьРеглФлаг, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	// При изменении параметров только в налоговом учете, изменение ЕГДС не имеет смысла.
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		Если (Объект.ОтражатьВБУ = Ложь И Объект.ОтражатьВУпрУчете = Ложь)
			 И (Объект.ОтражатьВНУ И Объект.ОтражатьВРеглУчете) Тогда // Изменение параметров только в налоговом учете.
			 	ВидимостьЕГДС = Ложь;
		Иначе 														// Все прочие варианты изменения параметров.
				ВидимостьЕГДС = Истина;
		КонецЕсли;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕГДС",
			"ЕГДС",
			"Видимость",
			ВидимостьЕГДС,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕГДСФлаг",
			"ЕГДСФлаг",
			"Видимость",
			ВидимостьЕГДС,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Амортизация
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражениеАмортизационныхРасходовФлаг")
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства = НЕ Объект.ОтражениеАмортизационныхРасходовФлаг;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Амортизация", 
			"Амортизация", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходов",
			"СпособОтраженияРасходов",
			"ТолькоПросмотр",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"АмортизацияСтатьяРасходовБезРазбиения",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"ПереключательАмортизацияБезРазбиения",
			"ТолькоПросмотр",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражениеАмортизационныхРасходовФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПереключательАмортизацияБезРазбиения")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБезРазбиения")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.Амортизация.Количество() = 0
			ИЛИ Объект.Амортизация[0].ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияПодразделениеБезРазбиения", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаправлениеДеятельностиБезРазбиения", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражениеАмортизационныхРасходовФлаг")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПереключательАмортизацияБезРазбиения")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АмортизацияПередаватьРасходыВДругуюОрганизациюБезРазбиения")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.Амортизация.Количество() = 0
			ИЛИ НЕ Объект.Амортизация[0].ПередаватьРасходыВДругуюОрганизацию;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"АмортизацияОрганизацияПолучательРасходовБезРазбиения",
			"ТолькоПросмотрБезОтметкиНезаполненного",
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ИзменениеПараметровНМА(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
		
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.РеализацияУслугПрочихАктивов, ДанныеФормыСтруктура - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_РеализацияУслугПрочихАктивов(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_РеализацияУслугПрочихАктивов(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
		
	//++ НЕ УТ
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") Тогда
		
		ЗначениеСвойства = (Объект.ХозяйственнаяОперация 
								= ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияУслугПоАренде"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Доходы.АрендныйКомпонентДоговора", 
			"ДоходыАрендныйКомпонентДоговора", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Доходы.ПредметАренды", 
			"ДоходыПредметАренды", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	КонецЕсли;
	//-- НЕ УТ
		
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.ОбъединениеОС - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ОбъединениеОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыОбъединенияОС = ПараметрыОбъединенияОС(Объект, ВспомогательныеРеквизиты);
	
	#Область Основное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = (Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС"));
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъединениеОднотипныхОС", 
			"ОбъединениеОднотипныхОС", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо 
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА 
			И НЕ Объект.ОбъединениеОднотипныхОС;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо 
			И ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииБУ
			И НЕ Объект.ОбъединениеОднотипныхОС;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияБУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо 
			И НЕ Объект.ОбъединениеОднотипныхОС 
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ",
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			Объект.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо 
			И Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
			И ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииБУ
			И НЕ Объект.ОбъединениеОднотипныхОС;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ ОбновитьВсе Тогда
		    
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И (НЕ Объект.ОбъединениеОднотипныхОС 
					И ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииБУ
					И (Объект.МетодНачисленияАмортизацииБУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
						ИЛИ Объект.МетодНачисленияАмортизацииБУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега"))
				ИЛИ Объект.ОбъединениеОднотипныхОС
					И НЕ ВспомогательныеРеквизиты.ПоНаработкеБУ
					И ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииБУ);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияОстаточныйБУ",
			"",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	    //
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И НЕ Объект.ОбъединениеОднотипныхОС 
			И ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииБУ
			И (Объект.МетодНачисленияАмортизацииБУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
					ИЛИ Объект.МетодНачисленияАмортизацииБУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега"));
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйБУ",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйБУРасшифровка",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
	    //
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И Объект.ОбъединениеОднотипныхОС 
			И ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииБУ
			И НЕ ВспомогательныеРеквизиты.ПоНаработкеБУ
			И ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииБУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйБУ_ОбъединениеОднотипныхОС",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйБУРасшифровка_ОбъединениеОднотипныхОС",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете 
			И НЕ Объект.ОбъединениеОднотипныхОС;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ 
			И НЕ Объект.ОбъединениеОднотипныхОС;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокИспользованияУУРасшифровка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ
							И НЕ Объект.ОбъединениеОднотипныхОС
							И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
								ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ
							И НЕ Объект.ОбъединениеОднотипныхОС
							И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка");
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ ОбновитьВсе Тогда
		    
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И (НЕ Объект.ОбъединениеОднотипныхОС 
					И ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ
					И Объект.МетодНачисленияАмортизацииУУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
				ИЛИ Объект.ОбъединениеОднотипныхОС
					И НЕ ВспомогательныеРеквизиты.ПоНаработкеУУ
					И ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииУУ);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияОстаточныйУУ",
			"",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И НЕ Объект.ОбъединениеОднотипныхОС 
			И ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ
			И Объект.МетодНачисленияАмортизацииУУ <> ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйУУ",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйУУРасшифровка",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И Объект.ОбъединениеОднотипныхОС 
			И ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииУУ
			И НЕ ВспомогательныеРеквизиты.ПоНаработкеУУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйУУ_ОбъединениеОднотипныхОС",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"СрокИспользованияОстаточныйУУРасшифровка_ОбъединениеОднотипныхОС",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПараметрыУчетаОбщие
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС") 
			И НЕ Объект.ОбъединениеОднотипныхОС;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ГруппаФинансовогоУчета", 
			"ГруппаФинансовогоУчета", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И НЕ Объект.ОбъединениеОднотипныхОС
			И НЕ ВспомогательныеРеквизиты.ВалютыСовпадают;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимостьВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС") 
			И НЕ Объект.ОбъединениеОднотипныхОС;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимостьРеглВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И (НЕ Объект.ОбъединениеОднотипныхОС 
					И ПараметрыОбъединенияОС.ПоНаработке
					И (ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ ИЛИ ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииБУ)
				ИЛИ Объект.ОбъединениеОднотипныхОС
					И (ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииУУ ИЛИ ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииБУ)
					И (ВспомогательныеРеквизиты.ПоНаработкеУУ ИЛИ ВспомогательныеРеквизиты.ПоНаработкеБУ));
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработкиОстаточный",
			"",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
		//
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И НЕ Объект.ОбъединениеОднотипныхОС 
			И (ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииУУ ИЛИ ПараметрыОбъединенияОС.ДоступныПараметрыАмортизацииБУ)
			И ПараметрыОбъединенияОС.ПоНаработке;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"ОбъемНаработкиОстаточный",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
	
		//
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И Объект.ОбъединениеОднотипныхОС 
			И (ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииУУ ИЛИ ВспомогательныеРеквизиты.ДоступныПараметрыАмортизацииБУ)
			И (ВспомогательныеРеквизиты.ПоНаработкеУУ ИЛИ ВспомогательныеРеквизиты.ПоНаработкеБУ);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"ОбъемНаработкиОстаточный_ОбъединениеОднотипныхОС",
			"Видимость",
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыОбъединенияОС.ПоНаработке
							И НЕ Объект.ОбъединениеОднотипныхОС;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработки", 
			"ПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПоказательНаработкиЕдиницаИзмерения", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"Видимость", 
			НЕ Объект.ОбъединениеОднотипныхОС, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если ОбновитьВсе Тогда
		
		Если НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
			ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
				"НаправлениеДеятельности", 
				"НаправлениеДеятельности", 
				"АвтоотметкаНезаполненного", 
				Ложь, 
				ПараметрыРеквизитовОбъекта);
		КонецЕсли; 
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОтражениеРасходов
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо 
			И НЕ Объект.ОбъединениеОднотипныхОС
			И (ПараметрыОбъединенияОС.ДоступноОтражениеРасходовБУ 
				ИЛИ ПараметрыОбъединенияОС.ДоступноОтражениеРасходовНУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовБУ", 
			"СпособОтраженияРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.ОтражатьВУпрУчете 
			И ПараметрыОбъединенияОС.ДоступноОтражениеРасходовУУ
			И НЕ Объект.ОбъединениеОднотипныхОС;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУУ", 
			"СпособОтраженияРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыОбъединенияОС.СтатьяРасходовУУОбязательна
			И НЕ Объект.ОбъединениеОднотипныхОС;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыОбъединенияОС.ДоступноОтражениеРасходовУУ
			И ПараметрыОбъединенияОС.СтатьяРасходовУУОбязательна;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ;

		ИмяСвойства = ?( 
			НЕ ЗначениеСвойства
			И НЕ ПараметрыОбъединенияОС.СтатьяРасходовУУОбязательна,
			"ТолькоПросмотр",
			"ТолькоПросмотрБезОтметкиНезаполненного");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			ИмяСвойства, 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОсновноеСредство") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВРеглУчете
			И Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОбъединениеОС")
			И ВспомогательныеРеквизиты.ИспользуетсяЦФ;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяДоходов", 
			"СтатьяДоходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаДоходов", 
			"АналитикаДоходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ЕстьСвязанныеОрганизации 
			И НЕ Объект.ОбъединениеОднотипныхОС
			И (ПараметрыОбъединенияОС.ДоступноОтражениеРасходовБУ 
				ИЛИ ПараметрыОбъединенияОС.ДоступноОтражениеРасходовНУ
				ИЛИ ПараметрыОбъединенияОС.ДоступноОтражениеРасходовУУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПередаватьРасходыВДругуюОрганизацию",
			"ПередаватьРасходыВДругуюОрганизацию", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПередаватьРасходыВДругуюОрганизацию") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОбъединениеОднотипныхОС")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			НЕ Объект.ПередаватьРасходыВДругуюОрганизацию 
			И НЕ Объект.ОбъединениеОднотипныхОС;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов",
			"ОрганизацияПолучательРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ОбъединениеОС(
		Объект, ВспомогательныеРеквизиты, ПараметрыОбъединенияОС, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.КорректировкаСтоимостиИАмортизацииОС - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_КорректировкаСтоимостиИАмортизацииОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если Объект.ПараметрыЗаПериод.Количество() <> 0 Тогда
		МетодНачисленияАмортизацииУУ = Объект.ПараметрыЗаПериод[0].МетодНачисленияАмортизацииУУ;
	Иначе
		МетодНачисленияАмортизацииУУ = Неопределено;
	КонецЕсли;
	
	ЭтоКорректировкаНаНачалоГода = 
		НачалоДня(Объект.Дата) = НачалоГода(Объект.Дата)
		И НЕ Объект.ВключаетАмортизациюТекущегоМесяца;
	
	ДоступныПараметрыЗаПериод = 
		Объект.РежимИсправленияСПрошлойДаты
		И Объект.ВидИмущества <> ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное");
	
	ДоступнаСуммаУпр =
		ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
		ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают;
			
	ДоступнаСуммаРегл =
		НЕ ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо_ЗаПериод
		ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
		
	КорректировкаСтоимостиБУ = 
		Объект.ОтражатьВБУ
		И Объект.КорректировкаСтоимости
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
		
	КорректировкаСтоимостиУУ =
		Объект.ОтражатьВУпрУчете
		И Объект.КорректировкаСтоимости
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
	
	КорректировкаСтоимостиНУ = 
		Объект.ОтражатьВНУ
		И Объект.КорректировкаСтоимости
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
		
	КорректировкаАмортизацииУУ =
		Объект.ОтражатьВУпрУчете
		И Объект.КорректировкаАмортизации
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
		И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				И НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
	
	КорректировкаАмортизацииБУ =
		Объект.ОтражатьВБУ
		И Объект.КорректировкаАмортизации
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
	
	КорректировкаАмортизацииНУ =
		Объект.ОтражатьВНУ
		И Объект.КорректировкаАмортизации
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
	
	КорректировкаПервоначальнойСтоимостиБУ = 
		Объект.ОтражатьВБУ
		И Объект.КорректировкаПервоначальнойСтоимости
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
		
	КорректировкаПервоначальнойСтоимостиУУ = 
		Объект.ОтражатьВУпрУчете
		И Объект.КорректировкаПервоначальнойСтоимости
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное");
		
	КорректировкаПараметровРасчетаАмортизацииБУ = 
		Объект.ОтражатьВБУ
		И Объект.КорректировкаПараметровРасчетаАмортизации
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
		И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
		И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6;
		
	КорректировкаПараметровРасчетаАмортизацииУУ = 
		Объект.ОтражатьВУпрУчете
		И Объект.КорректировкаПараметровРасчетаАмортизации
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
		И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
		И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл");
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода")
		ИЛИ ОбновитьВсе Тогда
		
		ЕстьМетодПропорциональноОбъемуБУ = Ложь;
		ЕстьМетодУменьшаемогоОстаткаБУ = Ложь;
		
		Для Каждого ДанныеСтроки Из Объект.ПараметрыЗаПериодБУ Цикл
			
			Если ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции") Тогда
				ЕстьМетодПропорциональноОбъемуБУ = Истина;
			ИначеЕсли ДанныеСтроки.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка") Тогда
				ЕстьМетодУменьшаемогоОстаткаБУ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	#Область СтраницаОсновное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.ВидИмущества <> ПредопределенноеЗначение("Перечисление.ВидыИмущества.Арендованное");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РежимИсправленияСПрошлойДаты", 
			"РежимИсправленияСПрошлойДаты", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачалоПериода", 
			"НачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачалоПериода", 
			"НачалоПериода", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.РежимИсправленияСПрошлойДаты, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.КорректировкаСтоимости;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУвеличенияСтоимости", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияСтоимости", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияСтоимостиСторно", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.КорректировкаАмортизации;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУвеличенияАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВключаетАмортизациюТекущегоМесяца", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("УточнениеПериода")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И НЕ Объект.УточнениеПериода;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РаздельнаяКорректировкаТекущегоИПрошлогоПериодов", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РаздельнаяКорректировкаТекущегоИПрошлогоПериодов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("УточнениеПериода")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов
			И НЕ Объект.УточнениеПериода;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияАмортизацииСторно", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И (КонецДня(Объект.Дата) = КонецГода(Объект.Дата)
				ИЛИ Объект.УточнениеПериода <> 0);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УточнениеПериода", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	#КонецОбласти
		
	#Область СтраницаОС
	
	#Область БУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПервоначальнойСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПараметровРасчетаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РаздельнаяКорректировкаТекущегоИПрошлогоПериодов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизацииЗаПериод")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьБУ", 
			"", 
			"Видимость", 
			КорректировкаСтоимостиБУ, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			КорректировкаАмортизацииБУ 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
				ИЛИ НЕ ЭтоКорректировкаНаНачалоГода);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ПервоначальнаяСтоимостьБУ", 
			"", 
			"Видимость", 
			КорректировкаПервоначальнойСтоимостиБУ, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			КорректировкаАмортизацииБУ 
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов
			И НЕ Объект.КорректировкаАмортизацииЗаПериод;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияНаНачалоГодаБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьДляВычисленияАмортизацииБУ", 
			"ОССтоимостьДляВычисленияАмортизацииБУ", 
			"Видимость", 
			КорректировкаПараметровРасчетаАмортизацииБУ И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьБУ", 
			"ОтметкаНезаполненного", 
			НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА И КорректировкаСтоимостиБУ, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ПоказатьПолеОтдельно = 
			НЕ ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьБУ", 
			"Видимость", 
			КорректировкаСтоимостиБУ И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииБУ
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И НЕ ПоказатьПолеОтдельно 
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
				ИЛИ НЕ ЭтоКорректировкаНаНачалоГода);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			КорректировкаАмортизацииБУ 
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод
			И НЕ ПоказатьПолеОтдельно;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияНаНачалоГодаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСПервоначальнаяСтоимостьБУ", 
			"Видимость", 
			КорректировкаПервоначальнойСтоимостиБУ И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьБУ_Отдельно", 
			"Видимость", 
			КорректировкаСтоимостиБУ И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			КорректировкаАмортизацииБУ
			И НЕ Объект.КорректировкаАмортизацииЗаПериод
			И ПоказатьПолеОтдельно 
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
					ИЛИ НЕ ЭтоКорректировкаНаНачалоГода);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияБУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			КорректировкаСтоимостиБУ
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
			И ПоказатьПолеОтдельно;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияНаНачалоГодаБУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСПервоначальнаяСтоимостьБУ_Отдельно", 
			"Видимость", 
			КорректировкаПервоначальнойСтоимостиБУ И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьБУ", 
			"ОтметкаНезаполненного", 
			НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА И КорректировкаСтоимостиБУ, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	#КонецОбласти
	
	#Область УУ
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПервоначальнойСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПараметровРасчетаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РаздельнаяКорректировкаТекущегоИПрошлогоПериодов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизацииЗаПериод")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьУУ", 
			"", 
			"Видимость", 
			КорректировкаСтоимостиУУ, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииУУ 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
				ИЛИ НЕ ЭтоКорректировкаНаНачалоГода);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииУУ 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.АмортизацияНаНачалоГодаУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ПервоначальнаяСтоимостьУУ", 
			"", 
			"Видимость", 
			КорректировкаПервоначальнойСтоимостиУУ, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ПоказатьПолеОтдельно = 
			НЕ Объект.ОтражатьВРеглУчете
			ИЛИ НЕ ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьУУ", 
			"Видимость", 
			КорректировкаСтоимостиУУ И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииУУ
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И НЕ ПоказатьПолеОтдельно 
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
				ИЛИ НЕ ЭтоКорректировкаНаНачалоГода);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииУУ 
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И НЕ ПоказатьПолеОтдельно;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияНаНачалоГодаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСПервоначальнаяСтоимостьУУ", 
			"Видимость", 
			КорректировкаПервоначальнойСтоимостиУУ И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОССтоимостьУУ_Отдельно", 
			"Видимость", 
			КорректировкаСтоимостиУУ И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииУУ 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И ПоказатьПолеОтдельно 
			И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
					ИЛИ НЕ ЭтоКорректировкаНаНачалоГода);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияУУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			КорректировкаАмортизацииУУ 
			И НЕ Объект.КорректировкаАмортизацииЗаПериод 
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов 
			И ПоказатьПолеОтдельно;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСАмортизацияНаНачалоГодаУУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСПервоначальнаяСтоимостьУУ_Отдельно", 
			"Видимость", 
			КорректировкаПервоначальнойСтоимостиУУ И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			КорректировкаПараметровРасчетаАмортизацииУУ 
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл")
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьДляВычисленияАмортизацииУУ", 
			"ОССтоимостьДляВычисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
						
	КонецЕсли;
	
	#КонецОбласти
		
	#КонецОбласти

	#Область ПараметрыБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо_ЗаПериод
			И ДоступныПараметрыЗаПериод;
								
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыЗаПериодБУ", 
			"ПараметрыЗаПериодБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
						
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияБУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияПР", 
			"Видимость", 
			ЗначениеСвойства И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияПРВалюта", 
			"Видимость", 
			ЗначениеСвойства И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ДоступныПараметрыЗаПериод;
					
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДатаВводаВЭксплуатациюБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПрименениеЦелевогоФинансирования")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ДоступныПараметрыЗаПериод
			И Объект.ПрименениеЦелевогоФинансирования;
					
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияЦФНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияЦФНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияПРЦФНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияПРЦФНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУАмортизацияЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУСтоимостьЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУСтоимостьПРЦФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУАмортизацияЦФИзменение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУАмортизацияПРЦФИзменение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ДоступныПараметрыЗаПериод
			И НЕ ВспомогательныеРеквизиты.ПрименяетсяФСБУ6_ЗаПериод;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУСтоимостьДляВычисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУПРДляВычисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ДоступныПараметрыЗаПериод
			И ВспомогательныеРеквизиты.ПрименяетсяФСБУ6_ЗаПериод
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"ПараметрыЗаПериодБУЛиквидационнаяСтоимость", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"",
			"ПараметрыЗаПериодБУДатаИзмененияПараметровБУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачалоПериода")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ДоступныПараметрыЗаПериод
			И ЕстьМетодУменьшаемогоОстаткаБУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУКоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ДоступныПараметрыЗаПериод
			И ЕстьМетодПропорциональноОбъемуБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУОбъемВыработкиНаНачалоМесяца", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУОбъемВыработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУОбъемПродукцииРаботДляВычисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодБУПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
	
	#КонецОбласти
		
	#Область ПараметрыУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И ДоступныПараметрыЗаПериод;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыЗаПериод", 
			"ПараметрыЗаПериод", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаВводаВЭксплуатациюУУ", 
			"ДатаВводаВЭксплуатациюУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогАмортизацияУУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаУпр;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаРегл;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаУпр
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодСтоимостьДляВычисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаРегл
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодСтоимостьДляВычисленияАмортизацииРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И ДоступныПараметрыЗаПериод
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамМУ");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодДатаИзмененияПараметровУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ПараметрыЗаПериод")
		ИЛИ ОбновитьВсе Тогда
		
		ЕстьМетодУменьшаемогоОстаткаБУ = Ложь;
		ЕстьМетодПоНаработке = Ложь;
		Для Каждого ДанныеСтроки Из Объект.ПараметрыЗаПериод Цикл
			
			Если ДанныеСтроки.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка") Тогда
				ЕстьМетодУменьшаемогоОстаткаБУ = Истина;
			КонецЕсли;
			
			Если ДанныеСтроки.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции") Тогда
				ЕстьМетодПоНаработке = Истина;
			КонецЕсли;

			Если ЕстьМетодУменьшаемогоОстаткаБУ И ЕстьМетодПоНаработке Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеСвойства = 
			ЕстьМетодУменьшаемогоОстаткаБУ
			И ДоступныПараметрыЗаПериод;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодКоэффициентУскорения", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ЕстьМетодУменьшаемогоОстаткаБУ
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл")
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаРегл;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СтоимостьРеглНаНачалоГодаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СтоимостьРеглНаНачалоГодаУУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияРеглНаНачалоГодаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияРеглНаНачалоГодаУУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		//
		ЗначениеСвойства = 
			ЕстьМетодУменьшаемогоОстаткаБУ
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл") 
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаУпр;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СтоимостьНаНачалоГодаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СтоимостьНаНачалоГодаУУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаНачалоГодаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаНачалоГодаУУВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = ЕстьМетодПоНаработке;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодОбъемВыработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодОбъемВыработкиНаНачалоМесяца", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодОбъемПродукцииРаботДляВычисленияАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если ОбновитьВсе Тогда
		
		ЗначениеСвойства = ДоступнаСуммаРегл;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодАмортизацияРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодАмортизацияРеглИзменение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = ДоступнаСуммаУпр;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодАмортизация", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ПараметрыЗаПериодАмортизацияИзменение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияНаНачалоПериода
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			Объект.ОтражатьВУпрУчете 
			И ДоступныПараметрыЗаПериод
			И ДоступнаСуммаУпр;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РежимИсправленияСПрошлойДаты")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			Объект.ОтражатьВБУ 
			И ДоступныПараметрыЗаПериод;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияРеглНаНачалоПериода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"АмортизацияРеглНаНачалоПериодаВалюта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СтраницаРасходыИДоходы
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеИзмененияСтоимостиНУЗаСчетПР")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			(КорректировкаСтоимостиБУ 
				ИЛИ КорректировкаСтоимостиНУ
					И НЕ Объект.ОтражениеИзмененияСтоимостиНУЗаСчетПР 
				ИЛИ КорректировкаСтоимостиУУ)
			И Объект.ОтражениеУвеличенияСтоимости;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеСтоимости", 
			"ПодразделениеУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеИзмененияСтоимостиНУЗаСчетПР")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			(КорректировкаСтоимостиБУ 
				ИЛИ КорректировкаСтоимостиНУ 
					И НЕ Объект.ОтражениеИзмененияСтоимостиНУЗаСчетПР 
				ИЛИ КорректировкаСтоимостиУУ)
			И Объект.ОтражениеУменьшенияСтоимости;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУменьшениеСтоимости", 
			"СпособОтраженияРасходовУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеСтоимости", 
			"ПодразделениеУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ОтражениеУвеличенияАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУвеличениеАмортизации", 
			"СпособОтраженияРасходовУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеАмортизации", 
			"ПодразделениеУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизацииСторно")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.ОтражениеУменьшенияАмортизацииСторно;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУменьшениеАмортизацииТекущегоГода", 
			"СпособОтраженияРасходовУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Собственное")
			И Объект.ОтражениеУменьшенияАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизации", 
			"ПодразделениеУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидИмущества")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУвеличенияСтоимости
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеСтоимости", 
			"ПодразделениеУвеличениеСтоимости", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеСтоимости", 
			"ПодразделениеУменьшениеСтоимости", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУвеличенияАмортизации
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеАмортизации", 
			"ПодразделениеУвеличениеАмортизации", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизации", 
			"ПодразделениеУменьшениеАмортизации", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремииСторно")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаАмортизационнаяПремия")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.ОтражатьВНУ 
			И Объект.КорректировкаАмортизационнойПремии
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаАмортизационнаяПремия;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеАмортизационнаяПремия", 
			"ПодразделениеАмортизационнаяПремия", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиАмортизационнаяПремия", 
			"НаправлениеДеятельностиАмортизационнаяПремия", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремии")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизационнойПремииСторно")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизационнойПремии")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ОтражатьВНУ 
			И Объект.КорректировкаАмортизационнойПремии
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизационнойПремии;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизационнойПремии", 
			"ПодразделениеУменьшениеАмортизационнойПремии", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизационнойПремии", 
			"НаправлениеДеятельностиУменьшениеАмортизационнойПремии", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	КорректировкаСтоимостиИАмортизацииОСКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

// 
// Параметры:
//  Объект - ДокументОбъект.КорректировкаСтоимостиИАмортизацииНМА - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_КорректировкаСтоимостиИАмортизацииНМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ЭтоНМА = (Объект.ВидОбъектовУчета = ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив"));
	
	ЭтоКорректировкаНаНачалоГода = (НачалоДня(Объект.Дата) = НачалоГода(Объект.Дата));
	
	#Область СтраницаОсновное
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДокументОснование")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДокументОснование", 
			"ДокументОснование", 
			"Видимость", 
			ЗначениеЗаполнено(Объект.ДокументОснование), 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектовУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидОбъектовУчета = ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив");
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КорректировкаАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектовУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидОбъектовУчета = ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.НематериальныйАктив")
			И (КонецДня(Объект.Дата) = КонецГода(Объект.Дата)
				И Объект.УточнениеПериода);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УточнениеПериода", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.КорректировкаСтоимости;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУвеличенияСтоимости", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияСтоимости", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияСтоимостиСторно", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = Объект.КорректировкаАмортизации;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУвеличенияАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			ИЛИ Объект.КорректировкаСтоимости
				И НЕ ЭтоНМА;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВключаетАмортизациюТекущегоМесяца", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("УточнениеПериода")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И НЕ Объект.УточнениеПериода;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РаздельнаяКорректировкаТекущегоИПрошлогоПериодов", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РаздельнаяКорректировкаТекущегоИПрошлогоПериодов")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("УточнениеПериода")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов
			И НЕ Объект.УточнениеПериода;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОтражениеУменьшенияАмортизацииСторно", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
		
	#Область СтраницаНМА
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектовУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаПервоначальнойСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ ОбновитьВсе Тогда
		
		#Область УУ
		
		ЗначениеСвойства = 
			Объект.КорректировкаСтоимости 
			И Объект.ОтражатьВУпрУчете 
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
					И НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ПоказатьПолеОтдельно = 
			НЕ Объект.ОтражатьВРеглУчете
			ИЛИ НЕ ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАСтоимостьУУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.КорректировкаПервоначальнойСтоимости 
			И Объект.ОтражатьВУпрУчете 
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
					И НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.ПервоначальнаяСтоимостьУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАПервоначальнаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
					
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАПервоначальнаяСтоимостьУУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И ЭтоНМА 
			И Объект.ОтражатьВУпрУчете 
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
					И НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.АмортизацияУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияУУ", 
			"Видимость", 
			ЗначениеСвойства И НЕ ПоказатьПолеОтдельно И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияУУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И ПоказатьПолеОтдельно И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.АмортизацияНаНачалоГодаУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияНаНачалоГодаУУ", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияНаНачалоГодаУУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		#КонецОбласти
		
		#Область БУ
		
		ПоказатьПолеОтдельно = 
			НЕ ВспомогательныеРеквизиты.ПлательщикНалогаНаПрибыль
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
			
		ЗначениеСвойства = 
			Объект.КорректировкаСтоимости
			И Объект.ОтражатьВБУ;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАСтоимостьБУ", 
			"ОтметкаНезаполненного", 
			НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА И ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАСтоимостьБУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.КорректировкаПервоначальнойСтоимости
			И Объект.ОтражатьВБУ;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.ПервоначальнаяСтоимостьБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАПервоначальнаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМАПервоначальнаяСтоимостьБУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И ЭтоНМА
			И Объект.ОтражатьВБУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.АмортизацияБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияБУ", 
			"Видимость", 
			ЗначениеСвойства И НЕ ПоказатьПолеОтдельно И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияБУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И ПоказатьПолеОтдельно И (НЕ Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов ИЛИ НЕ ЭтоКорректировкаНаНачалоГода), 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.АмортизацияНаНачалоГодаБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияНаНачалоГодаБУ", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов И НЕ ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НМААмортизацияНаНачалоГодаБУ_Отдельно", 
			"Видимость", 
			ЗначениеСвойства И Объект.РаздельнаяКорректировкаТекущегоИПрошлогоПериодов И ПоказатьПолеОтдельно, 
			ПараметрыРеквизитовОбъекта);
			
		#КонецОбласти
			
	КонецЕсли;
	
	#КонецОбласти
		
	#Область СтраницаРасходыИДоходы
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияСтоимости")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУвеличенияСтоимости;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеСтоимости", 
			"ПодразделениеУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУвеличениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУменьшениеСтоимости", 
			"СпособОтраженияРасходовУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеСтоимости", 
			"ПодразделениеУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеСтоимости", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияАмортизации")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУвеличенияАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУвеличениеАмортизации", 
			"СпособОтраженияРасходовУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеАмортизации", 
			"ПодразделениеУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУвеличениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизацииСторно")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.ОтражениеУменьшенияАмортизацииСторно;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУменьшениеАмортизацииТекущегоГода", 
			"СпособОтраженияРасходовУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеАмортизацииТекущегоГода", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства =
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизации", 
			"ПодразделениеУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации", 
			"ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ДекорацияУменьшениеАмортизации", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУвеличенияСтоимости
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеСтоимости;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеСтоимости", 
			"ПодразделениеУвеличениеСтоимости", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"НаправлениеДеятельностиУвеличениеСтоимости", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияСтоимости")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаСтоимости
			И Объект.ОтражениеУменьшенияСтоимости
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеСтоимости;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеСтоимости", 
			"ПодразделениеУменьшениеСтоимости", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"НаправлениеДеятельностиУменьшениеСтоимости", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУвеличенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУвеличенияАмортизации
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУвеличениеАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУвеличениеАмортизации", 
			"ПодразделениеУвеличениеАмортизации", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"НаправлениеДеятельностиУвеличениеАмортизации", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизацииТекущегоГода;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"ПодразделениеУменьшениеАмортизацииТекущегоГода", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"НаправлениеДеятельностиУменьшениеАмортизацииТекущегоГода", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("КорректировкаАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражениеУменьшенияАмортизации")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.КорректировкаАмортизации
			И Объект.ОтражениеУменьшенияАмортизации
			И Объект.ПараметрыРасходовСовпадаютСДаннымиУчетаУменьшениеАмортизации;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУменьшениеАмортизации", 
			"ПодразделениеУменьшениеАмортизации", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"НаправлениеДеятельностиУменьшениеАмортизации", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
		
	КорректировкаСтоимостиИАмортизацииНМАКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов(
		Объект, ВспомогательныеРеквизиты, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

Функция ЗаполнитьРеквизитыВЗависимостиОтСвойств_ИзменениеПараметровОС(Объект, ПараметрыРеквизитовОбъекта) Экспорт

	ИзмененныеРеквизиты = Новый Массив;
	
	Для каждого ПараметрыРеквизита Из ПараметрыРеквизитовОбъекта Цикл
		
		Если ПараметрыРеквизита.Свойство = "Видимость" И ПараметрыРеквизита.Значение = Ложь
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотр" И ПараметрыРеквизита.Значение = Истина
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотрБезОтметкиНезаполненного" И ПараметрыРеквизита.Значение = Истина Тогда
			Действие = "Очистить";
		ИначеЕсли ПараметрыРеквизита.Свойство = "Видимость" И ПараметрыРеквизита.Значение = Истина
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотр" И ПараметрыРеквизита.Значение = Ложь
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотрБезОтметкиНезаполненного" И ПараметрыРеквизита.Значение = Ложь Тогда
			Действие = "Заполнить";
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ОтражениеАмортизационныхРасходовФлаг" Тогда
			Если Действие = "Очистить" Тогда
				Объект.Амортизация.Очистить();
				ИзмененныеРеквизиты.Добавить("Амортизация");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ОтражениеАмортизационнойПремииФлаг" Тогда
			Если Действие = "Очистить" Тогда
				Объект.АмортизационнаяПремия.Очистить();
				ИзмененныеРеквизиты.Добавить("АмортизационнаяПремия");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ОтражениеИмущественныхНалоговФлаг" Тогда
			Если Действие = "Очистить" Тогда
				Объект.ИмущественныеНалоги.Очистить();
				ИзмененныеРеквизиты.Добавить("ИмущественныеНалоги");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ИзмененныеРеквизиты, ",");

КонецФункции

Функция ЗаполнитьРеквизитыВЗависимостиОтСвойств_МодернизацияОС(Объект, ПараметрыРеквизитовОбъекта) Экспорт

	ИзмененныеРеквизиты = Новый Массив;
	
	Для каждого ПараметрыРеквизита Из ПараметрыРеквизитовОбъекта Цикл
		
		Если ПараметрыРеквизита.Свойство = "Видимость" И ПараметрыРеквизита.Значение = Ложь
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотр" И ПараметрыРеквизита.Значение = Истина
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотрБезОтметкиНезаполненного" И ПараметрыРеквизита.Значение = Истина Тогда
			Действие = "Очистить";
		ИначеЕсли ПараметрыРеквизита.Свойство = "Видимость" И ПараметрыРеквизита.Значение = Истина
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотр" И ПараметрыРеквизита.Значение = Ложь
			ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотрБезОтметкиНезаполненного" И ПараметрыРеквизита.Значение = Ложь Тогда
			Действие = "Заполнить";
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "НаправлениеДеятельности" Тогда
			
			Если Действие = "Очистить" Тогда
				Объект[ПараметрыРеквизита.ИмяРеквизита] = Неопределено;
				ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат СтрСоединить(ИзмененныеРеквизиты, ",");

КонецФункции

// 
// Параметры:
// 	Объект - СправочникОбъект.ОбъектыЭксплуатации - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - 
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ОбъектыЭксплуатации(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ОбъектыЭксплуатации(
		Объект, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ТипОС")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.ОбъектЭксплуатации")
			ИЛИ Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.КапитальноеВложение");

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаСведений", 
			"ДатаСведений", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Расположение", 
			"Расположение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЭксплуатирующееПодразделение", 
			"ЭксплуатирующееПодразделение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ШифрПоЕНАОФ", 
			"ШифрПоЕНАОФ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.ОбъектЭксплуатации")
			Или Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.Узел");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаВыпуска", 
			"ДатаВыпуска", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЗаводскойНомер", 
			"ЗаводскойНомер", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Изготовитель", 
			"Изготовитель", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Класс", 
			"Класс", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Модель", 
			"Модель", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НомерПаспорта", 
			"НомерПаспорта", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РемонтирующееПодразделение", 
			"РемонтирующееПодразделение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СерийныйНомер", 
			"СерийныйНомер", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияЗарплаты", 
			"СпособОтраженияЗарплаты", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходов", 
			"СтатьяРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ТипОС <> ПредопределенноеЗначение("Перечисление.ТипыОС.ГрупповоеОС");

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ИнвентарныйНомер", 
			"ИнвентарныйНомер", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.ОбъектЭксплуатации")
			И ВспомогательныеРеквизиты.ИспользоватьУчетДрагоценныхМатериалов;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДрагоценныеМатериалы", 
			"ДрагоценныеМатериалы", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);		
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"КлассификацияДМ4", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);		
		
		//
		ЗначениеСвойства = 
			(Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.ОбъектЭксплуатации")
				Или Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.Узел"))
			И ВспомогательныеРеквизиты.ИспользоватьУправлениеРемонтами;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Статус", 
			"Статус", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);		
		
		//
		ЗначениеСвойства = 
			Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.ОбъектЭксплуатации")
			И ВспомогательныеРеквизиты.ИспользоватьУправлениеРемонтами
			И ВспомогательныеРеквизиты.ИспользоватьПроизводство;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РабочиеЦентры", 
			"РабочиеЦентры", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Класс")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ТипОС")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ТипОС = ПредопределенноеЗначение("Перечисление.ТипыОС.ОбъектЭксплуатации")
			И ВспомогательныеРеквизиты.ИспользуютсяПодклассы;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Подкласс", 
			"Подкласс", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
// 	Объект - СправочникОбъект.СпособыОтраженияРасходов - 
// 	ИзмененныеРеквизиты - Строка - 
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_СпособыОтраженияРасходов(Объект, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Подразделение", 
			"Подразделение", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельности", 
			"НаправлениеДеятельности", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
// 	Объект - ДокументОбъект.УлучшениеНМА - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - 
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_УлучшениеНМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;

	ПараметрыУлучшенияНМА = ПараметрыУлучшенияНМА(Объект, ВспомогательныеРеквизиты);

	#Область СтраницаНМА
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ
			И (ПараметрыУлучшенияНМА.ТребуетсяСтоимостьДляРасчетаАмортизацииБУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ЕстьУчетСебестоимости);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьБУ", 
			"НМАСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
					И ПараметрыУлучшенияНМА.ТребуетсяСтоимостьДляРасчетаАмортизацииУУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают
					И ПараметрыУлучшенияНМА.ТребуетсяСтоимостьДляРасчетаАмортизацииБУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ЕстьУчетСебестоимости);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьУУ", 
			"НМАСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
			
	#КонецОбласти

	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_УлучшениеНМА(
		Объект, ВспомогательныеРеквизиты, ПараметрыУлучшенияНМА, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
			
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
// 	Объект - ДокументОбъект.ИнвентаризацияОС - 
// 	ИзмененныеРеквизиты - Строка - 
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ИнвентаризацияОС(Объект, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ИнвентаризацияОС");
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МОЛ", 
			"МОЛ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.МОЛ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ДействиеБУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ДействиеНУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.ДействиеУУ", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСДействиеПредставление", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МОЛ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ИнвентаризацияОС")
			И НЕ ЗначениеЗаполнено(Объект.МОЛ);
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОСМОЛ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьПоДаннымУчетаУУ", 
			"ОССтоимостьПоДаннымУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьФактическаяУУ", 
			"ОССтоимостьФактическаяУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьФактическаяУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьПоДаннымУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьПоДаннымУчетаБУ", 
			"ОССтоимостьПоДаннымУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьФактическаяБУ", 
			"ОССтоимостьФактическаяБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьФактическаяБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьПоДаннымУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВНУ;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьПоДаннымУчетаНУ", 
			"ОССтоимостьПоДаннымУчетаНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОС.СтоимостьФактическаяНУ", 
			"ОССтоимостьФактическаяНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьФактическаяНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьПоДаннымУчетаНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

// 
// Параметры:
// 	Объект - ДокументОбъект.ИнвентаризацияНМА - 
// 	ИзмененныеРеквизиты - Строка - 
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_ИнвентаризацияНМА(Объект, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВНУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ОтражатьВУпрУчете;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьПоДаннымУчетаУУ", 
			"НМАСтоимостьПоДаннымУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьФактическаяУУ", 
			"НМАСтоимостьФактическаяУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьФактическаяУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьПоДаннымУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВБУ;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьПоДаннымУчетаБУ", 
			"НМАСтоимостьПоДаннымУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьФактическаяБУ", 
			"НМАСтоимостьФактическаяБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьФактическаяБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьПоДаннымУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ОтражатьВНУ;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьПоДаннымУчетаНУ", 
			"НМАСтоимостьПоДаннымУчетаНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НМА.СтоимостьФактическаяНУ", 
			"НМАСтоимостьФактическаяНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьФактическаяНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ИтогСтоимостьПоДаннымУчетаНУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

#КонецОбласти

#Область Налоги

Функция МинимальнаяДатаРегистрации(Объект) Экспорт

	ДатаРегистрации = '000101010000';
	
	Для каждого ДанныеСтроки Из Объект.ОС Цикл
		Если ДанныеСтроки.ДатаРегистрации = '000101010000' Тогда
			ДатаРегистрации = ?(ДатаРегистрации <> '000101010000', Мин(Объект.Дата, ДатаРегистрации), Объект.Дата);
		Иначе
			ДатаРегистрации = ?(ДатаРегистрации <> '000101010000', Мин(ДанныеСтроки.ДатаРегистрации, ДатаРегистрации), ДанныеСтроки.ДатаРегистрации);
		КонецЕсли;
	КонецЦикла; 
	
	Если ДатаРегистрации = '000101010000' Тогда
		ДатаРегистрации = Объект.Дата;
	КонецЕсли; 

	Возврат ДатаРегистрации;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДействияВыполняемыеПриИзмененииРеквизитов

Процедура ПриИзмененииРеквизитов_ПринятиеКУчетуОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты) Экспорт

	Если НЕ ЗначениеЗаполнено(ИзмененныеРеквизиты) Тогда
		Возврат; 
	КонецЕсли; 
	
	СписокРеквизитов = СтрРазделить(ИзмененныеРеквизиты, ",");
	
	// ВАЖНО: Порядок имеет значение!
	
	Если СписокРеквизитов.Найти("Организация") <> Неопределено Тогда
		Если НЕ ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо Тогда
			Объект.ОтражатьВРеглУчете = Истина;
			Объект.ОтражатьВУпрУчете = Истина;
			СписокРеквизитов.Добавить("ОтражатьВРеглУчете");
			СписокРеквизитов.Добавить("ОтражатьВУпрУчете");
		КонецЕсли;
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ХозяйственнаяОперация") <> Неопределено
		ИЛИ СписокРеквизитов.Найти("ВидАналитикиКапитализацииРасходов") <> Неопределено Тогда
	
		Если Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС")
			ИЛИ Объект.ВидАналитикиКапитализацииРасходов <> ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства") Тогда
			Объект.ЧастичныйВводВЭксплуатацию = Ложь;
			СписокРеквизитов.Добавить("ЧастичныйВводВЭксплуатацию");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ХозяйственнаяОперация") <> Неопределено Тогда
		
		Если Объект.ЧастичныйВводВЭксплуатацию
			И (Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации")
				ИЛИ Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды")) Тогда
			Объект.ЧастичныйВводВЭксплуатацию = Ложь;
			СписокРеквизитов.Добавить("ЧастичныйВводВЭксплуатацию");
		КонецЕсли;
		
		Если Объект.ВидАналитикиКапитализацииРасходов = ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОбъектСтроительства")
			И (Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации")
				ИЛИ Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды")) Тогда
			Объект.ВидАналитикиКапитализацииРасходов = ПредопределенноеЗначение("Перечисление.ВидыАналитикиКапитализацииРасходов.ОсновныеСредства");
			СписокРеквизитов.Добавить("ВидАналитикиКапитализацииРасходов");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено
		И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
		
		Объект.НачислятьАмортизациюБУ = 
			Объект.ОтражатьВБУ
			И Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию");
		
		СписокРеквизитов.Добавить("НачислятьАмортизациюБУ");
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено Тогда
		Объект.НачислятьАмортизациюУУ = Объект.ОтражатьВУпрУчете;
		СписокРеквизитов.Добавить("НачислятьАмортизациюУУ");
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено И НЕ Объект.ОтражатьВРеглУчете
		ИЛИ СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено И НЕ Объект.ОтражатьВУпрУчете Тогда
		
		Для каждого СтрокаТаблицы Из Объект.ОС Цикл
			Если НЕ Объект.ОтражатьВРеглУчете Тогда
				СтрокаТаблицы.СтоимостьБУ = 0;
				СтрокаТаблицы.СтоимостьНУ = 0;
				СтрокаТаблицы.СтоимостьПР = 0;
			КонецЕсли; 
			Если НЕ Объект.ОтражатьВУпрУчете Тогда
				СтрокаТаблицы.СтоимостьУУ = 0;
				СтрокаТаблицы.ЛиквидационнаяСтоимость = 0;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	ПринятиеКУчетуОСКлиентСерверЛокализация.ПриИзмененииРеквизитов(Объект, ВспомогательныеРеквизиты, СписокРеквизитов);
	
	ИзмененныеРеквизиты = СтрСоединить(СписокРеквизитов, ",");
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитов_ПринятиеКУчетуУзловКомпонентовАмортизации(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты) Экспорт

	Если НЕ ЗначениеЗаполнено(ИзмененныеРеквизиты) Тогда
		Возврат; 
	КонецЕсли; 
	
	СписокРеквизитов = СтрРазделить(ИзмененныеРеквизиты, ",");
	
	// ВАЖНО: Порядок имеет значение!
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено
		И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
		
		Объект.НачислятьАмортизациюБУ = Объект.ОтражатьВРеглУчете;
		СписокРеквизитов.Добавить("НачислятьАмортизациюБУ");
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено Тогда
		Объект.НачислятьАмортизациюУУ = Объект.ОтражатьВУпрУчете;
		СписокРеквизитов.Добавить("НачислятьАмортизациюУУ");
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено И НЕ Объект.ОтражатьВРеглУчете
		ИЛИ СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено И НЕ Объект.ОтражатьВУпрУчете Тогда
		
		Для каждого СтрокаТаблицы Из Объект.КомпонентыАмортизации Цикл
			Если НЕ Объект.ОтражатьВРеглУчете Тогда
				СтрокаТаблицы.СтоимостьБУ = 0;
			КонецЕсли; 
			Если НЕ Объект.ОтражатьВУпрУчете Тогда
				СтрокаТаблицы.СтоимостьУУ = 0;
				СтрокаТаблицы.ЛиквидационнаяСтоимость = 0;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	ИзмененныеРеквизиты = СтрСоединить(СписокРеквизитов, ",");
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитов_МодернизацияОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты) Экспорт

	Если НЕ ЗначениеЗаполнено(ИзмененныеРеквизиты) Тогда
		Возврат; 
	КонецЕсли; 
	
	СписокРеквизитов = СтрРазделить(ИзмененныеРеквизиты, ",");
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ПриИзмененииРеквизитов_МодернизацияОС(Объект, ВспомогательныеРеквизиты, СписокРеквизитов);
	
	ИзмененныеРеквизиты = СтрСоединить(СписокРеквизитов, ",");
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитов_ОтнесениеОтклоненийВСтоимостьОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты) Экспорт

	Если НЕ ЗначениеЗаполнено(ИзмененныеРеквизиты) Тогда
		Возврат; 
	КонецЕсли; 
	
	СписокРеквизитов = СтрРазделить(ИзмененныеРеквизиты, ",");
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ПриИзмененииРеквизитов_ОтнесениеОтклоненийВСтоимостьОС(Объект, ВспомогательныеРеквизиты, СписокРеквизитов);
	
	ИзмененныеРеквизиты = СтрСоединить(СписокРеквизитов, ",");
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитов_ОбъединениеОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты) Экспорт

	Если НЕ ЗначениеЗаполнено(ИзмененныеРеквизиты) Тогда
		Возврат; 
	КонецЕсли; 
	
	СписокРеквизитов = СтрРазделить(ИзмененныеРеквизиты, ",");
	
	// ВАЖНО: Порядок имеет значение!
	
	Если СписокРеквизитов.Найти("ХозяйственнаяОперация") <> Неопределено Тогда
	
		Если Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПрисоединениеОС") Тогда
			Объект.ОбъединениеОднотипныхОС = Истина;
			СписокРеквизитов.Добавить("ОбъединениеОднотипныхОС");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено
		И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
		
		Объект.НачислятьАмортизациюБУ = Объект.ОтражатьВРеглУчете;
		Объект.НачислятьАмортизациюНУ = Объект.ОтражатьВРеглУчете;
		СписокРеквизитов.Добавить("НачислятьАмортизациюБУ");
		СписокРеквизитов.Добавить("НачислятьАмортизациюНУ");
	КонецЕсли;
	
	Если СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено Тогда
		Объект.НачислятьАмортизациюУУ = Объект.ОтражатьВУпрУчете;
		СписокРеквизитов.Добавить("НачислятьАмортизациюУУ");
	КонецЕсли;
	
	ОбъединениеОСКлиентСерверЛокализация.ПриИзмененииРеквизитов(Объект, ВспомогательныеРеквизиты, СписокРеквизитов);
	
	ИзмененныеРеквизиты = СтрСоединить(СписокРеквизитов, ",");
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитов_КорректировкаСтоимостиИАмортизацииОС(Форма, ВспомогательныеРеквизиты, ИзмененныеРеквизиты) Экспорт

	Если НЕ ЗначениеЗаполнено(ИзмененныеРеквизиты) Тогда
		Возврат; 
	КонецЕсли;
	
	Объект = Форма.Объект;

	СписокРеквизитов = СтрРазделить(ИзмененныеРеквизиты, ",");
	
	Если СписокРеквизитов.Найти("ОтражатьВРеглУчете") <> Неопределено
		ИЛИ СписокРеквизитов.Найти("ОтражатьВУпрУчете") <> Неопределено
		ИЛИ СписокРеквизитов.Найти("ВидИмущества") <> Неопределено Тогда
	
		Если Объект.ОтражатьВРеглУчете
			И НЕ Объект.ОтражатьВУпрУчете Тогда
			
			Форма.ТекущиеПараметры = "БУ";
			СписокРеквизитов.Добавить("ТекущиеПараметры");
			
		ИначеЕсли Объект.ОтражатьВУпрУчете
			И НЕ Объект.ОтражатьВРеглУчете Тогда
				
			Форма.ТекущиеПараметры = "УУ";
			СписокРеквизитов.Добавить("ТекущиеПараметры");
			
		КонецЕсли;
		
	КонецЕсли;
	
	КорректировкаСтоимостиИАмортизацииОСКлиентСерверЛокализация.ПриИзмененииРеквизитов(Форма, ВспомогательныеРеквизиты, СписокРеквизитов);
	
	ИзмененныеРеквизиты = СтрСоединить(СписокРеквизитов, ",");
	
КонецПроцедуры
 
Функция ЗаполнитьРеквизитыВЗависимостиОтСвойств_ВводОстатков(Объект, ПараметрыРеквизитовОбъекта) Экспорт

	ИзмененныеРеквизиты = Новый Массив;
	
	Для каждого ПараметрыРеквизита Из ПараметрыРеквизитовОбъекта Цикл
		
		Действие = ОчиститьИлиЗаполнить(Объект, ПараметрыРеквизита);
		
		Если НЕ ЗначениеЗаполнено(Действие) Тогда
			Продолжить;
		КонецЕсли;
		
		#Область СтраницаАмортизация
		
		Если ПараметрыРеквизита.ИмяРеквизита = "НачислятьАмортизациюБУ"
			ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НачислятьАмортизациюНУ"
			ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НачислятьАмортизациюУУ" Тогда
				Объект[ПараметрыРеквизита.ИмяРеквизита] = ?(Действие = "Заполнить", Истина, Ложь);
			ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ГрафикАмортизации" Тогда
			Если Действие = "Очистить" Тогда
				Объект[ПараметрыРеквизита.ИмяРеквизита] = Неопределено;
				ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);
			КонецЕсли; 
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ВключитьАмортизационнуюПремиюВСоставРасходов" Тогда
			Если Действие = "Очистить" Тогда
				Объект.ВключитьАмортизационнуюПремиюВСоставРасходов = Ложь;
				Объект.СуммаКапитальныхВложенийВключаемыхВРасходыНУ = 0;
				ИзмененныеРеквизиты.Добавить("ВключитьАмортизационнуюПремиюВСоставРасходов");
				ИзмененныеРеквизиты.Добавить("СуммаКапитальныхВложенийВключаемыхВРасходыНУ");
			КонецЕсли; 
		КонецЕсли;
		
		#КонецОбласти
		
		#Область СтраницаСтоимость
		Если Действие = "Очистить" 
			И (ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьБУ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьНУ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьПР"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьВР"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьУУ"
			
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьБУЦФ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьНУЦФ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьПРЦФ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "ТекущаяСтоимостьВРЦФ"
				
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияБУ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияНУ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияВР"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияПР"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияУУ"
				
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияБУЦФ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияНУЦФ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияПРЦФ"
				ИЛИ ПараметрыРеквизита.ИмяРеквизита = "НакопленнаяАмортизацияВРЦФ") Тогда

			Объект[ПараметрыРеквизита.ИмяРеквизита] = 0;
			ИзмененныеРеквизиты.Добавить(ПараметрыРеквизита.ИмяРеквизита);

		КонецЕсли;
		
		#КонецОбласти
		
		#Область СтраницаОтражениеРасходов
		
		Если ПараметрыРеквизита.ИмяРеквизита = "СтатьяРасходовБУ" Тогда
			Если Действие = "Очистить" Тогда
				Объект.СтатьяРасходовБУ = Неопределено;
				Объект.АналитикаРасходовБУ = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "СтатьяРасходовУУ" Тогда
			Если Действие = "Очистить" Тогда
				Объект.СтатьяРасходовУУ = Неопределено;
				Объект.АналитикаРасходовУУ = Неопределено;
				ИзмененныеРеквизиты.Добавить("СтатьяРасходовУУ");
				ИзмененныеРеквизиты.Добавить("АналитикаРасходовУУ");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "СтатьяРасходовНалог" Тогда
			Если Действие = "Очистить" Тогда
				Объект.СтатьяРасходовНалог = Неопределено;
				Объект.АналитикаРасходовНалог = Неопределено;
				ИзмененныеРеквизиты.Добавить("СтатьяРасходовНалог");
				ИзмененныеРеквизиты.Добавить("АналитикаРасходовНалог");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "СтатьяДоходов" Тогда
			Если Действие = "Очистить" Тогда
				Объект.СтатьяДоходов = Неопределено;
				Объект.АналитикаДоходов = Неопределено;
				ИзмененныеРеквизиты.Добавить("СтатьяДоходов");
				ИзмененныеРеквизиты.Добавить("АналитикаДоходов");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "СтатьяРасходовАмортизационнойПремии" Тогда
			Если Действие = "Очистить" Тогда
				Объект.СтатьяРасходовАмортизационнойПремии = Неопределено;
				Объект.АналитикаРасходовАмортизационнойПремии = Неопределено;
				ИзмененныеРеквизиты.Добавить("СтатьяРасходовАмортизационнойПремии");
				ИзмененныеРеквизиты.Добавить("АналитикаРасходовАмортизационнойПремии");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыРеквизита.ИмяРеквизита = "ПередаватьРасходыВДругуюОрганизацию" Тогда
			Если Действие = "Очистить" Тогда
				Объект.ПередаватьРасходыВДругуюОрганизацию = Ложь;
				Объект.ОрганизацияПолучательРасходов = Неопределено;
				ИзмененныеРеквизиты.Добавить("ПередаватьРасходыВДругуюОрганизацию");
				ИзмененныеРеквизиты.Добавить("ОрганизацияПолучательРасходов");
			КонецЕсли;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЦикла; 
	
	Возврат СтрСоединить(ИзмененныеРеквизиты, ",");
	
КонецФункции

Функция ОчиститьИлиЗаполнить(Объект, ПараметрыРеквизита) Экспорт

	Если НЕ ЗначениеЗаполнено(ПараметрыРеквизита.ИмяРеквизита) Тогда
		Возврат "";
	КонецЕсли;
	
	ЭтоБулево = ТипЗнч(Объект[ПараметрыРеквизита.ИмяРеквизита]) = Тип("Булево");
	
	Действие = "";
	
	Если ((ПараметрыРеквизита.Свойство = "Видимость" ИЛИ ПараметрыРеквизита.Свойство = "ВидимостьЭлемента") И ПараметрыРеквизита.Значение = Ложь
			ИЛИ (ПараметрыРеквизита.Свойство = "ТолькоПросмотр" ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотрБезОтметкиНезаполненного")
					И ПараметрыРеквизита.Значение = Истина)
		И (НЕ ЭтоБулево И ЗначениеЗаполнено(Объект[ПараметрыРеквизита.ИмяРеквизита]) 
			ИЛИ ЭтоБулево И Объект[ПараметрыРеквизита.ИмяРеквизита] = Истина) Тогда
		
		Действие = "Очистить";
	ИначеЕсли ((ПараметрыРеквизита.Свойство = "Видимость" ИЛИ ПараметрыРеквизита.Свойство = "ВидимостьЭлемента") И ПараметрыРеквизита.Значение = Истина
				ИЛИ (ПараметрыРеквизита.Свойство = "ТолькоПросмотр" ИЛИ ПараметрыРеквизита.Свойство = "ТолькоПросмотрБезОтметкиНезаполненного")
						И ПараметрыРеквизита.Значение = Ложь)
			И (НЕ ЭтоБулево И НЕ ЗначениеЗаполнено(Объект[ПараметрыРеквизита.ИмяРеквизита])
				ИЛИ ЭтоБулево И Объект[ПараметрыРеквизита.ИмяРеквизита] = Ложь) Тогда
			
		Действие = "Заполнить";
	КонецЕсли;

	Возврат Действие;
	
КонецФункции

Функция ПриИзмененииПорядкаУчетаБУ_ОС(Объект, СлужебныеПараметрыФормы = Неопределено, ЕстьПорядокУчетаНУ = Истина) Экспорт

	ИзмененныеРеквизиты = "ПорядокУчетаБУ";
	
	Если Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.МетодНачисленияАмортизацииБУ) Тогда
			Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный");
			ИзмененныеРеквизиты = ИзмененныеРеквизиты + ",МетодНачисленияАмортизацииБУ";
		КонецЕсли;
		 
	КонецЕсли; 
	
	Если Объект.ПорядокУчетаБУ <> ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена") 
		И Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена") Тогда
			
		Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию");
		ИзмененныеРеквизиты = ИзмененныеРеквизиты + ",ПорядокУчетаУУ";
	
	ИначеЕсли Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена") 
		И Объект.ПорядокУчетаУУ <> ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена") Тогда
			
		Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена");
		ИзмененныеРеквизиты = ИзмененныеРеквизиты + ",ПорядокУчетаУУ";
	КонецЕсли;
	
	ИзмененныеРеквизиты = 
		ИзмененныеРеквизиты
		+ ВнеоборотныеАктивыКлиентСерверЛокализация.ПриИзмененииПорядкаУчетаБУ_ОС(Объект, СлужебныеПараметрыФормы, ЕстьПорядокУчетаНУ);
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции

Функция ПриИзмененииПорядкаУчетаУУ_ОС(Объект, СлужебныеПараметрыФормы = Неопределено, ЕстьПорядокУчетаНУ = Истина) Экспорт

	ИзмененныеРеквизиты = "";
	
	Если Объект.ПорядокУчетаУУ <> ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена") 
		И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена") Тогда
			
		Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации");
		ИзмененныеРеквизиты = ПриИзмененииПорядкаУчетаБУ_ОС(Объект, СлужебныеПараметрыФормы, ЕстьПорядокУчетаНУ) + "," + ИзмененныеРеквизиты;
		
	ИначеЕсли Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена") 
		И Объект.ПорядокУчетаБУ <> ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена") Тогда
			
		Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена");
		ИзмененныеРеквизиты = ПриИзмененииПорядкаУчетаБУ_ОС(Объект, СлужебныеПараметрыФормы, ЕстьПорядокУчетаНУ) + "," + ИзмененныеРеквизиты;
		
	КонецЕсли;
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции
 
Функция ПриИзмененииПорядкаУчетаБУ_НМА(Объект, СлужебныеПараметрыФормы = Неопределено, ЕстьПорядокУчетаНУ = Истина) Экспорт

	ИзмененныеРеквизиты = "ПорядокУчетаБУ";
	
	Если Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.МетодНачисленияАмортизацииБУ) Тогда
			Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.Линейный");
			ИзмененныеРеквизиты = ИзмененныеРеквизиты + ",МетодНачисленияАмортизацииБУ";
		КонецЕсли;
		 
	КонецЕсли; 
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции

Функция ПриИзмененииПорядкаУчетаУУ_НМА(Объект, СлужебныеПараметрыФормы = Неопределено, ЕстьПорядокУчетаНУ = Истина) Экспорт

	ИзмененныеРеквизиты = "ПорядокУчетаУУ";
	
	Если Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.МетодНачисленияАмортизацииБУ) Тогда
			Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.Линейный");
			ИзмененныеРеквизиты = ИзмененныеРеквизиты + ",МетодНачисленияАмортизацииУУ";
		КонецЕсли;
		 
	КонецЕсли; 
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ОпределениеСвойствЗависимыхРеквизитовОбъекта

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_ОС(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "")

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыВводаОстатковОС = ПараметрыВводаОстатковОС(Объект, ВспомогательныеРеквизиты);
	
	ПоНаработкеУУ = (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции"));
	
	ТипыДоговоровПоФСБУ25 = УчетАрендованныхОСКлиентСервер.ТипыДоговоровДоходнойАренды();
	ПереданоВФинАренду = (ТипыДоговоровПоФСБУ25.Найти(ВспомогательныеРеквизиты.ТипДоговораПередачиВАренду) <> Неопределено);
	
	СтоимостьБУДоступна = (Объект.ПорядокУчетаБУ <> ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриПринятииКУчету"));

	ЭтоАренда =	
		ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковАрендованныхОСНаБалансе")
		ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуПредметовЛизингаНаБалансе");
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") Тогда
		СтруктураИзмененныхРеквизитов.Вставить("ДоступныПараметрыУчета");
	КонецЕсли;
	
	#Область ПараметрыУчета
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РасчетыМеждуОрганизациямиАрендатор")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			(ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуОС")
				ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуПредметовЛизингаНаБалансе"))
			И ВспомогательныеРеквизиты.РасчетыМеждуОрганизациямиАрендатор
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеАрендатора", 
			"ПодразделениеАрендатора", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МОЛАрендатора", 
			"МОЛАрендатора", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("РасчетыМеждуОрганизациямиАрендатор")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = (ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуОС")
								ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуПредметовЛизингаНаБалансе"))
							И (ВспомогательныеРеквизиты.РасчетыМеждуОрганизациямиАрендатор
								ИЛИ ВспомогательныеРеквизиты.Дата < ВспомогательныеРеквизиты.ДатаНачалаУчета);
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЗалоговаяСтоимость", 
			"ЗалоговаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = (ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуОС")
								ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуПредметовЛизингаНаБалансе"))
							И ВспомогательныеРеквизиты.РасчетыМеждуОрганизациямиАрендатор
							И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЗалоговаяСтоимость", 
			"ЗалоговаяСтоимость", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		// Для поддержки переноса данных
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС <> Неопределено
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС.РаздельныйУчетВНАПоНалогообложениюНДС;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантРаздельногоУчетаНДС", 
			"", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС <> Неопределено
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС.РаздельныйУчетВНАПоНалогообложениюНДС;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантРаздельногоУчетаНДС", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли; 
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчетуБУ", 
			"ДатаПринятияКУчетуБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчетуУУ", 
			"ДатаПринятияКУчетуУУ", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		//
		ЗначениеСвойства =
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета 
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МОЛ", 
			"МОЛ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АдресМестонахождения", 
			"АдресМестонахождения", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если ОбновитьВсе Тогда
		
		Если НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
			
			ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
				"НаправлениеДеятельности", 
				"НаправлениеДеятельности", 
				"АвтоОтметкаНезаполненного", 
				Ложь, 
				ПараметрыРеквизитовОбъекта);
				
		КонецЕсли; 
		
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ЭтоАренда
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Договор", 
			"Договор", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ХозяйственнаяОперация")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуОС")
				ИЛИ ВспомогательныеРеквизиты.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПереданныхВАрендуПредметовЛизингаНаБалансе");
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Подразделение", 
			"Подразделение", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Стоимость
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоговорПередачиВАренду")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПрименениеЦелевогоФинансирования")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			(ПереданоВФинАренду ИЛИ НЕ СтоимостьБУДоступна)
			И (ВспомогательныеРеквизиты.ОтражатьВБУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьБУ", 
			"ТекущаяСтоимостьБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияБУ", 
			"НакопленнаяАмортизацияБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства =
			ПереданоВФинАренду
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияУУ", 
			"НакопленнаяАмортизацияУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьБУ", 
			"ТекущаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.ОтражатьВБУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И НЕ ПереданоВФинАренду
			И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияУУ", 
			"НакопленнаяАмортизацияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ОтражатьВБУ;
						
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияБУ", 
			"НакопленнаяАмортизацияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьОтличается", 
			"ПервоначальнаяСтоимостьОтличается", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПервоначальнаяСтоимостьОтличается")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.ПервоначальнаяСтоимостьОтличается;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненногоБезОчистки", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненногоБезОчистки", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПервоначальнаяСтоимостьОтличается")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ПервоначальнаяСтоимостьОтличается
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете 
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область События
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И НЕ ПереданоВФинАренду;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьИзменениеПараметровАмортизацииБУ", 
			"ЕстьИзменениеПараметровАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаИзмененияПараметровБУ", 
			"ДатаИзмененияПараметровБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.ЕстьИзменениеПараметровАмортизацииБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаИзмененияПараметровБУ", 
			"ДатаИзмененияПараметровБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И НЕ ПереданоВФинАренду;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьИзменениеПараметровАмортизацииУУ", 
			"ЕстьИзменениеПараметровАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаИзмененияПараметровУУ", 
			"ДатаИзмененияПараметровУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.ЕстьИзменениеПараметровАмортизацииУУ 
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл")
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтоимостьДляВычисленияАмортизацииУУ", 
			"СтоимостьДляВычисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.ЕстьИзменениеПараметровАмортизацииУУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаИзмененияПараметровУУ", 
			"ДатаИзмененияПараметровУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И НЕ ПереданоВФинАренду;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьРезервПереоценкиРегл", 
			"ЕстьРезервПереоценкиРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиАмортизацииРегл", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиСтоимостиРегл", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			НЕ ПереданоВФинАренду
			И (ВспомогательныеРеквизиты.ОтражатьВУпрУчете
					И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
				ИЛИ НЕ ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
					И ВспомогательныеРеквизиты.ОтражатьВУУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьРезервПереоценки", 
			"ЕстьРезервПереоценки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"РезервПереоценкиЗнак", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиСтоимости", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.Дата < ВспомогательныеРеквизиты.ДатаНачалаУчета);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДокументВводаВЭксплуатациюУУ", 
			"ДокументВводаВЭксплуатациюУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			НЕ Объект.ЕстьИзменениеПараметровАмортизацииБУ
			И НЕ Объект.ЕстьИзменениеПараметровАмортизацииУУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СобытиеМодернизация", 
			"СобытиеМодернизация", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СобытиеПринятиеКУчету", 
			"СобытиеПринятиеКУчету", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СобытиеМодернизация", 
			"СобытиеМодернизация", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииБУ 
				ИЛИ ПараметрыВводаОстатковОС.ДействуетНачислениеИзноса);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ЕстьИзменениеПараметровАмортизацииБУ 
			И Не ПараметрыВводаОстатковОС.ПоНаработке
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУОстаточный", 
			"СрокИспользованияБУОстаточный", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ЕстьИзменениеПараметровАмортизацииБУ 
			И ПараметрыВводаОстатковОС.ПоНаработке
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработкиОстаточныйБУ", 
			"ОбъемНаработкиОстаточныйБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			Объект.ЕстьИзменениеПараметровАмортизацииБУ 
			И ПараметрыВводаОстатковОС.ПоНаработке
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработкиОстаточныйБУ", 
			"ОбъемНаработкиОстаточныйБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
			И ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
		 	ВспомогательныеРеквизиты.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования"))
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ 
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И Объект.ЕстьИзменениеПараметровАмортизацииУУ 
			И НЕ ПоНаработкеУУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУОстаточный", 
			"СрокИспользованияУУОстаточный", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ 
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И Объект.ЕстьИзменениеПараметровАмортизацииУУ 
			И ПоНаработкеУУ
			И ВспомогательныеРеквизиты.ПорядокУчетаВНА = ПредопределенноеЗначение("Перечисление.ПорядокУчетаВНА.ПоСтандартамРегл");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработкиОстаточныйУУ", 
			"ОбъемНаработкиОстаточныйУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
					ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка");
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	#КонецОбласти
	
	#Область АмортизацияОбщие
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ПоНаработке
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработки", 
			"ПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОтражениеРасходов
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовБУ", 
			"СпособОтраженияРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовБУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУУ", 
			"СпособОтраженияРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.СтатьяРасходовУУОбязательна
			И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ПараметрыВводаОстатковОС.СтатьяРасходовУУОбязательна;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ;

		ИмяСвойства = ?( 
			НЕ ЗначениеСвойства
			И НЕ(ПараметрыВводаОстатковОС.СтатьяРасходовУУОбязательна
				И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
				И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета),
			"ТолькоПросмотр",
			"ТолькоПросмотрБезОтметкиНезаполненного");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			ИмяСвойства, 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ЕстьСвязанныеОрганизации 
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовБУ
					ИЛИ ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовНУ
					ИЛИ ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовУУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПередаватьРасходыВДругуюОрганизацию", 
			"ПередаватьРасходыВДругуюОрганизацию", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПередаватьРасходыВДругуюОрганизацию") 
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов",
			"ОрганизацияПолучательРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ПередаватьРасходыВДругуюОрганизацию,
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	ВводОстатковВнеоборотныхАктивовКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_ОС(
		Объект, ВспомогательныеРеквизиты, ПараметрыВводаОстатковОС, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_НМА(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "")

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыВводаОстатковНМА = ПараметрыВводаОстатковНМА(Объект, ВспомогательныеРеквизиты);
	ПараметрыВводаОстатковНМА.Вставить("ДоступныПараметрыУчета", ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
	
	АмортизацияУУДоступна = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") Тогда
		СтруктураИзмененныхРеквизитов.Вставить("ДоступныПараметрыУчета");
	КонецЕсли;

	#Область ПараметрыУчетаБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчетуБУ", 
			"ДатаПринятияКУчетуБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;
	
	#КонецОбласти
				
	#Область ПараметрыУчетаУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчетуУУ", 
			"ДатаПринятияКУчетуУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	
	КонецЕсли;

	#КонецОбласти

	#Область ПараметрыУчетаОбщие
	
	Если ОбновитьВсе Тогда
		
		Если НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
			
			ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
				"НаправлениеДеятельности", 
				"НаправлениеДеятельности", 
				"АвтоОтметкаНезаполненного", 
				Ложь, 
				ПараметрыРеквизитовОбъекта);
				
		КонецЕсли; 
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПриобретения", 
			"ДатаПриобретения", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимостьРегл", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства =
			ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета 
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЛиквидационнаяСтоимость", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		// Для поддержки переноса данных
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС <> Неопределено
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС.РаздельныйУчетВНАПоНалогообложениюНДС;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантРаздельногоУчетаНДС", 
			"", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВРеглУчете
			И ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС <> Неопределено
			И ВспомогательныеРеквизиты.ПараметрыУчетнойПолитикиНастройкиУчетаНДС.РаздельныйУчетВНАПоНалогообложениюНДС;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВариантРаздельногоУчетаНДС", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли; 
	
	#КонецОбласти
										
	#Область Стоимость
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВБУ
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьБУ", 
			"ТекущаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.ОтражатьВБУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектаУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР")
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА 
					И ПараметрыВводаОстатковНМА.АмортизацияБУДоступна
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА 
					И АмортизацияУУДоступна);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияБУ", 
			"НакопленнаяАмортизацияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектаУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			(Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР")
					И АмортизацияУУДоступна
				ИЛИ НЕ ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
					И ВспомогательныеРеквизиты.ОтражатьВУпрУчете)
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияУУ", 
			"НакопленнаяАмортизацияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ПервоначальнаяСтоимостьОтличается")
		ИЛИ ОбновитьВсе Тогда
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ПервоначальнаяСтоимостьОтличается, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ Объект.ПервоначальнаяСтоимостьОтличается, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьБУ", 
			"ТекущаяСтоимостьБУ", 
			"АвтоОтметкаНезаполненного", 
			НЕ Объект.ПервоначальнаяСтоимостьОтличается И НЕ Объект.ПрименениеЦелевогоФинансирования, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПервоначальнаяСтоимостьОтличается")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			НЕ Объект.ПервоначальнаяСтоимостьОтличается
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			Объект.ПервоначальнаяСтоимостьОтличается
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьОтличается", 
			"ПервоначальнаяСтоимостьОтличается", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СобытияБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектаУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР");
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьУлучшениеНМАБУ", 
			"ЕстьУлучшениеНМАБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПоследнегоУлучшенияБУ", 
			"ДатаПоследнегоУлучшенияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР");
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьРезервПереоценкиРегл", 
			"ЕстьРезервПереоценкиРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"РезервПереоценкиРеглЗнак", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"РезервПереоценкиСтоимостиРеглСумма", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"РезервПереоценкиАмортизацииРеглСумма", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//	
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ 
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиАмортизацииРегл", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиСтоимостиРегл", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЕстьУлучшениеНМАБУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.ЕстьУлучшениеНМАБУ;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПоследнегоУлучшенияБУ", 
			"ДатаПоследнегоУлучшенияБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	КонецЕсли;

	#КонецОбласти
	
	#Область СобытияУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ВидОбъектаУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР")
			И ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьУлучшениеНМАУУ", 
			"ЕстьУлучшениеНМАУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПоследнегоУлучшенияУУ", 
			"ДатаПоследнегоУлучшенияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//	
		ЗначениеСвойства = 
			Объект.ВидОбъектаУчета <> ПредопределенноеЗначение("Перечисление.ВидыОбъектовУчетаНМА.РасходыНаНИОКР")
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ЕстьРезервПереоценки", 
			"ЕстьРезервПереоценки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиАмортизации", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"РезервПереоценкиСтоимости", 
			"", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.Дата < ВспомогательныеРеквизиты.ДатаНачалаУчета);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДокументПринятияКУчетуУУ", 
			"ДокументПринятияКУчетуУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ЕстьУлучшениеНМАУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.ЕстьУлучшениеНМАУУ;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПоследнегоУлучшенияУУ", 
			"ДатаПоследнегоУлучшенияУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьУлучшениеНМАБУ") 
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И Объект.ЕстьУлучшениеНМАБУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУОстаточный", 
			"СрокИспользованияБУОстаточный", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			(Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка"));
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ",
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка")
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентБУ", 
			"КоэффициентБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьУлучшениеНМАУУ") 
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И Объект.ЕстьУлучшениеНМАУУ;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУОстаточный", 
			"СрокИспользованияУУОстаточный", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииУУ
							И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.Линейный")
								ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.УменьшаемогоОстатка")
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияПрочее
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ПоНаработке
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	#КонецОбласти
	
	#Область ОтражениеДоходовИРасходов
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовБУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовБУ", 
			"СпособОтраженияРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		// Для поддержки переноса данных
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовБУ
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУУ", 
			"СпособОтраженияРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете 
			И ПараметрыВводаОстатковНМА.СтатьяРасходовУУОбязательна;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовУУ
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И ПараметрыВводаОстатковНМА.СтатьяРасходовУУОбязательна;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ;

		ИмяСвойства = ?( 
			НЕ ЗначениеСвойства
			И НЕ(ПараметрыВводаОстатковНМА.СтатьяРасходовУУОбязательна
				И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
				И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета),
			"ТолькоПросмотр",
			"ТолькоПросмотрБезОтметкиНезаполненного");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			ИмяСвойства, 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ЕстьСвязанныеОрганизации 
			И ПараметрыВводаОстатковНМА.ДоступныПараметрыУчета
			И (ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовБУ 
				ИЛИ ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовНУ 
				ИЛИ ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовУУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПередаватьРасходыВДругуюОрганизацию", 
			"ПередаватьРасходыВДругуюОрганизацию", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов", 
			"ОрганизацияПолучательРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПередаватьРасходыВДругуюОрганизацию") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ЕстьСвязанныеОрганизации
			И Объект.ПередаватьРасходыВДругуюОрганизацию
			И (ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовБУ 
				ИЛИ ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовНУ 
				ИЛИ ПараметрыВводаОстатковНМА.ДоступноОтражениеРасходовУУ);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОрганизацияПолучательРасходов",
			"ОрганизацияПолучательРасходов", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			НЕ ЗначениеСвойства, ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
		
	#КонецОбласти
	
	ВводОстатковВнеоборотныхАктивовКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_НМА(
		Объект, ВспомогательныеРеквизиты, ПараметрыВводаОстатковНМА, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_РасчетыПоАренде(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "")

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	РеквизитыДоговора = ВспомогательныеРеквизиты.РеквизитыДоговора;
	
	УчетНаБалансе = 
		ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018
		ИЛИ РеквизитыДоговора.Балансодержатель = ПредопределенноеЗначение("Перечисление.БалансодержательПредметовАренды.Арендатор")
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Договор);
	
	#Область СтраницаОстаткиРасчетов
	
	#Область АрендныеОбязательства
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУиНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			УчетНаБалансе
			И (ВспомогательныеРеквизиты.ОтражатьВБУиНУ
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АрендныеОбязательстваОстаток", 
			"АрендныеОбязательстваОстаток", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АрендныеОбязательстваОстатокРегл", 
			"АрендныеОбязательстваОстатокРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			УчетНаБалансе
			И (ВспомогательныеРеквизиты.ОтражатьВУУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АрендныеОбязательстваОстатокУпр", 
			"АрендныеОбязательстваОстатокУпр", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область УслугиПоАренде
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУиНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства = 
			(ВспомогательныеРеквизиты.ОтражатьВБУиНУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УслугаПоАрендеОстаток", 
			"УслугаПоАрендеОстаток", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УслугаПоАрендеОстатокРегл", 
			"УслугаПоАрендеОстатокРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			(ВспомогательныеРеквизиты.ОтражатьВУУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"УслугаПоАрендеОстатокУпр", 
			"УслугаПоАрендеОстатокУпр", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	#КонецОбласти
	
	#Область ВыкупнаяСтоимость
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУиНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = 
			УчетНаБалансе
			И РеквизитыДоговора.ЕстьВыкупПредметовАренды
			И (ВспомогательныеРеквизиты.ОтражатьВБУиНУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВыкупнаяСтоимостьОстаток", 
			"ВыкупнаяСтоимостьОстаток", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВыкупнаяСтоимостьОстатокРегл", 
			"ВыкупнаяСтоимостьОстатокРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			УчетНаБалансе
			И РеквизитыДоговора.ЕстьВыкупПредметовАренды
			И (ВспомогательныеРеквизиты.ОтражатьВУУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ВыкупнаяСтоимостьОстатокУпр", 
			"ВыкупнаяСтоимостьОстатокУпр", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	#КонецОбласти

	#Область НДС
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУиНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор") 
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			УчетНаБалансе
			И (ВспомогательныеРеквизиты.ОтражатьВБУиНУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НДСОстаток", 
			"НДСОстаток", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НДСОстатокРегл", 
			"НДСОстатокРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			УчетНаБалансе
			И (ВспомогательныеРеквизиты.ОтражатьВУУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НДСОстатокУпр", 
			"НДСОстатокУпр", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	#КонецОбласти
	
	#Область Проценты
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВБУиНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор") 
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018
			И (ВспомогательныеРеквизиты.ОтражатьВБУиНУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПроцентыОстаток", 
			"ПроцентыОстаток", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПроцентыОстатокРегл", 
			"ПроцентыОстатокРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018
			И (ВспомогательныеРеквизиты.ОтражатьВУУ 
				ИЛИ ВспомогательныеРеквизиты.ОтражатьВОперативномУчете);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПроцентыОстатокУпр", 
			"ПроцентыОстатокУпр", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	#КонецОбласти
	
	#КонецОбласти
	
	#Область СтраницаРасчетыПоДоговору
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = ВспомогательныеРеквизиты.ОтражатьВОперативномУчете;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаУслугПоАренде", 
			"СуммаУслугПоАренде", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаНДС", 
			"СуммаНДС", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПервогоПлатежа", 
			"ДатаПервогоПлатежа", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтавкаНДС", 
			"СтавкаНДС", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПериодичностьОплат", 
			"ПериодичностьОплат", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПериодичностьНачислений", 
			"ПериодичностьНачислений", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СуммаУслугПоАрендеВалюта", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СуммаНДСВалюта", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СрокАренды", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаНачалаАренды", 
			"", 
			"ОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.РеквизитыДоговора.ЕстьОбеспечительныйПлатеж;
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаОбеспечительногоПлатежа", 
			"СуммаОбеспечительногоПлатежа", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПервогоОбеспечительногоПлатежа", 
			"ДатаПервогоОбеспечительногоПлатежа", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СуммаОбеспечительногоПлатежаВалюта", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.РеквизитыДоговора.ЕстьВыкупПредметовАренды;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаВыкупаПредметовАренды", 
			"СуммаВыкупаПредметовАренды", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаВыкупа", 
			"ДатаВыкупа", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"СуммаВыкупаПредметовАрендыВалюта", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПериодичностьОплат") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И Объект.ПериодичностьОплат <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОплатаУслугиПоАренде", 
			"ОплатаУслугиПоАренде", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ОплатаУслугиПоАрендеВалюта", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПериодичностьНачислений") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И Объект.ПериодичностьНачислений <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислениеУслугиПоАренде", 
			"НачислениеУслугиПоАренде", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"НачислениеУслугиПоАрендеВалюта", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаУслугПоАренде", 
			"СуммаУслугПоАренде", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПервогоПлатежа", 
			"ДатаПервогоПлатежа", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтавкаНДС", 
			"СтавкаНДС", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ГрафикОплатУслуг", 
			"ГрафикОплатУслуг", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ГрафикНачисленияУслуг", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаПроцентов", 
			"СуммаПроцентов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ГрафикНачисленияПроцентов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтоимостьПредметовАренды", 
			"СтоимостьПредметовАренды", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПроцентнаяСтавка", 
			"ПроцентнаяСтавка", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Договор") 
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.РеквизитыДоговора.ЕстьОбеспечительныйПлатеж
			И ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаОбеспечительногоПлатежа", 
			"СуммаОбеспечительногоПлатежа", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПервогоОбеспечительногоПлатежа", 
			"ДатаПервогоОбеспечительногоПлатежа", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И ВспомогательныеРеквизиты.РеквизитыДоговора.ЕстьВыкупПредметовАренды
			И ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СуммаВыкупаПредметовАренды", 
			"СуммаВыкупаПредметовАренды", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаВыкупа", 
			"ДатаВыкупа", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПериодичностьОплат") 
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И Объект.ПериодичностьОплат <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная")
			И ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОплатаУслугиПоАренде", 
			"ОплатаУслугиПоАренде", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НачислениеУслугиПоАренде") 
		ИЛИ ОбновитьВсе Тогда
	
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВОперативномУчете
			И Объект.НачислениеУслугиПоАренде <> ПредопределенноеЗначение("Перечисление.ПериодичностьГрафика.Произвольная")
			И ВспомогательныеРеквизиты.ИспользуетсяУчетАрендыПоФСБУ25_2018;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислениеУслугиПоАренде", 
			"НачислениеУслугиПоАренде", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
		
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_УзлыКомпоненты(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;
	
	ПараметрыВводаОстатковОС = ПараметрыВводаОстатковОС(Объект, ВспомогательныеРеквизиты);
	
	ПоНаработкеУУ = (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции"));
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВОперативномУчете") Тогда
		СтруктураИзмененныхРеквизитов.Вставить("ДоступныПараметрыУчета");
	КонецЕсли;
	
	#Область ПараметрыУчета
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчетуБУ", 
			"ДатаПринятияКУчетуБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаБУ", 
			"ПорядокУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПорядокУчетаУУ", 
			"ПорядокУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ДатаПринятияКУчетуУУ", 
			"ДатаПринятияКУчетуУУ", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимостьРегл", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		//
		ЗначениеСвойства =
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета 
			И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"", 
			"ЛиквидационнаяСтоимость", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если ОбновитьВсе Тогда
		
		Если НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА Тогда
			
			ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
				"НаправлениеДеятельности", 
				"НаправлениеДеятельности", 
				"АвтоОтметкаНезаполненного", 
				Ложь, 
				ПараметрыРеквизитовОбъекта);
				
		КонецЕсли; 
		
	КонецЕсли;
		
	#КонецОбласти
	
	#Область Стоимость
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВБУ
			ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьБУ", 
			"ТекущаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.ОтражатьВБУ
				ИЛИ НЕ ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТекущаяСтоимостьУУ", 
			"ТекущаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И (ВспомогательныеРеквизиты.ВедетсяРегламентированныйУчетВНА
				ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияУУ", 
			"НакопленнаяАмортизацияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ОтражатьВБУ;
						
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НакопленнаяАмортизацияБУ", 
			"НакопленнаяАмортизацияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьОтличается", 
			"ПервоначальнаяСтоимостьОтличается", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПервоначальнаяСтоимостьОтличается")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ Объект.ПервоначальнаяСтоимостьОтличается;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"ТолькоПросмотрБезОтметкиНезаполненногоБезОчистки", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьБУ", 
			"ПервоначальнаяСтоимостьБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненногоБезОчистки", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПервоначальнаяСтоимостьОтличается")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			Объект.ПервоначальнаяСтоимостьОтличается
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете 
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПервоначальнаяСтоимостьУУ", 
			"ПервоначальнаяСтоимостьУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область События
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СобытиеПринятиеКУчету", 
			"СобытиеПринятиеКУчету", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияБУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ЕстьИзменениеПараметровАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииБУ 
				ИЛИ ПараметрыВводаОстатковОС.ДействуетНачислениеИзноса);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюБУ", 
			"НачислятьАмортизациюБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииБУ", 
			"МетодНачисленияАмортизацииБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
			Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
			И ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииБУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияБУ", 
			"КоэффициентУскоренияБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства =
		 	ВспомогательныеРеквизиты.ОтражатьВБУ
			И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			И (Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка")
				Или Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования"))
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
				
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияБУ", 
			"СрокИспользованияБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияУУ
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"ВидимостьЭлемента", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
			
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И (Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Линейный")
					ИЛИ Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка"));
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СрокИспользованияУУ", 
			"СрокИспользованияУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НачислятьАмортизациюУУ", 
			"НачислятьАмортизациюУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"МетодНачисленияАмортизацииУУ", 
			"МетодНачисленияАмортизацииУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыАмортизацииУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка");
							
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"КоэффициентУскоренияУУ", 
			"КоэффициентУскоренияУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
											
	КонецЕсли;
	
	#КонецОбласти
	
	#Область АмортизацияОбщие
	
	Если СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("МетодНачисленияАмортизацииУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ПоНаработке
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПоказательНаработки", 
			"ПоказательНаработки", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ОбъемНаработки", 
			"ОбъемНаработки", 
			"Видимость", 
			ЗначениеСвойства,
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОтражениеРасходов
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовБУ;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовБУ", 
			"АналитикаРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовБУ", 
			"СпособОтраженияРасходовБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовБУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовБУ", 
			"СтатьяРасходовБУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"АналитикаРасходовУУ", 
			"АналитикаРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СпособОтраженияРасходовУУ", 
			"СпособОтраженияРасходовУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВУпрУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаБУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаНУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПорядокУчетаУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Дата") 
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ДоступныПараметрыУчета") 
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.СтатьяРасходовУУОбязательна
			И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета;
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"СтатьяРасходовУУ", 
			"СтатьяРасходовУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		//
		ЗначениеСвойства = 
			ПараметрыВводаОстатковОС.ДоступноОтражениеРасходовУУ
			И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета
			И ПараметрыВводаОстатковОС.СтатьяРасходовУУОбязательна;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаБУ;

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеБУ", 
			"ПодразделениеБУ", 
			"ТолькоПросмотрБезОтметкиНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиБУ", 
			"НаправлениеДеятельностиБУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СпособОтраженияРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("АналитикаРасходовУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("ПодразделениеУУ")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("НаправлениеДеятельностиУУ")
		ИЛИ ОбновитьВсе Тогда

		ЗначениеСвойства = 
			Объект.ПодразделениеИНаправлениеДеятельностиСовпадаютСДаннымиУчетаУУ;

		ИмяСвойства = ?( 
			НЕ ЗначениеСвойства
			И НЕ(ПараметрыВводаОстатковОС.СтатьяРасходовУУОбязательна
				И (ВспомогательныеРеквизиты.Дата >= ВспомогательныеРеквизиты.ДатаНачалаУчета)
				И ПараметрыВводаОстатковОС.ДоступныПараметрыУчета),
			"ТолькоПросмотр",
			"ТолькоПросмотрБезОтметкиНезаполненного");
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ПодразделениеУУ", 
			"ПодразделениеУУ", 
			ИмяСвойства, 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"НаправлениеДеятельностиУУ", 
			"НаправлениеДеятельностиУУ", 
			"ТолькоПросмотр", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;

	#КонецОбласти
	
	ВводОстатковВнеоборотныхАктивовКлиентСерверЛокализация.ДополнитьЗначенияСвойствЗависимыхРеквизитов_ВводОстатков_УзлыКомпоненты(
		Объект, ВспомогательныеРеквизиты, ПараметрыВводаОстатковОС, СтруктураИзмененныхРеквизитов, ПараметрыРеквизитовОбъекта);
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

#КонецОбласти

#Область Инвентаризация

Процедура ЗаполнитьДанныеУчетаВСтрокеИнвентаризацииОС(ДанныеСтроки, ДанныеУчета, ПараметрыИнвентаризации, ЭтоЧтениеОбъекта, ЗаполнитьСлужебныеРеквизиты, ИспользуетсяУправлениеВНА_2_4) Экспорт

	Если ДанныеУчета <> Неопределено Тогда
		
		Если НЕ ЭтоЧтениеОбъекта Тогда
			
			Если ДанныеУчета.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ИнвентаризацияНезавершенногоСтроительства") Тогда
				
				ДанныеСтроки.НаличиеПоДаннымУчета = Истина;
			
			ИначеЕсли ДанныеУчета.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ИнвентаризацияВложенийВОС") Тогда
				
				ДанныеСтроки.НаличиеПоДаннымУчета = Истина;
				
			Иначе
				
				ДанныеСтроки.НаличиеПоДаннымУчета = 
					ЗначениеЗаполнено(ДанныеУчета.ОрганизацияПоДаннымУчета)
					И ДанныеУчета.ОрганизацияПоДаннымУчета = ПараметрыИнвентаризации.Организация
					И ДанныеУчета.ПодразделениеПоДаннымУчета = ПараметрыИнвентаризации.Подразделение
					И (НЕ ЗначениеЗаполнено(ПараметрыИнвентаризации.МОЛ)
							И (ДанныеУчета.МОЛПоДаннымУчета = ДанныеСтроки.МОЛ
								ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.МОЛ))
						ИЛИ ЗначениеЗаполнено(ПараметрыИнвентаризации.МОЛ)
							И ДанныеУчета.МОЛПоДаннымУчета = ПараметрыИнвентаризации.МОЛ);
							
			КонецЕсли; 
			
			Если ДанныеСтроки.НаличиеПоДаннымУчета Тогда
				ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = ДанныеУчета.СтоимостьПоДаннымУчетаБУ;
				ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = ДанныеУчета.СтоимостьПоДаннымУчетаНУ;
				ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = ДанныеУчета.СтоимостьПоДаннымУчетаУУ;
			Иначе
				ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = 0;
				ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = 0;
				ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = 0;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ЗаполнитьСлужебныеРеквизиты Тогда
			ДанныеСтроки.ОрганизацияПоДаннымУчета = ДанныеУчета.ОрганизацияПоДаннымУчета;
			ДанныеСтроки.ПодразделениеПоДаннымУчета = ДанныеУчета.ПодразделениеПоДаннымУчета;
			ДанныеСтроки.МОЛПоДаннымУчета = ДанныеУчета.МОЛПоДаннымУчета;
			ДанныеСтроки.ОрганизацииВзаимосвязаны = ДанныеУчета.ОрганизацииВзаимосвязаны;
			ДанныеСтроки.ПолученоВАренду = ДанныеУчета.ПолученоВАренду;
			ДанныеСтроки.Договор = ДанныеУчета.Договор;
			ДанныеСтроки.ИнвентарныйНомер = ДанныеУчета.ИнвентарныйНомер;
			ДанныеСтроки.Код = ДанныеУчета.Код;
		КонецЕсли; 
		
	Иначе
		
		Если НЕ ЭтоЧтениеОбъекта Тогда
			ДанныеСтроки.НаличиеПоДаннымУчета = Ложь;
			ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = 0;
			ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = 0;
			ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = 0;
		КонецЕсли; 
		
		Если ЗаполнитьСлужебныеРеквизиты Тогда
			ДанныеСтроки.ОрганизацияПоДаннымУчета = Неопределено;
			ДанныеСтроки.ПодразделениеПоДаннымУчета = Неопределено;
			ДанныеСтроки.МОЛПоДаннымУчета = Неопределено;
			ДанныеСтроки.ОрганизацииВзаимосвязаны = Ложь;
			ДанныеСтроки.ПолученоВАренду = Ложь;
			ДанныеСтроки.Договор = Неопределено;
			ДанныеСтроки.ИнвентарныйНомер = "";
			ДанныеСтроки.Код = "";
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьДанныеУчетаВСтрокеИнвентаризацииНМА(ДанныеСтроки, ДанныеУчета, ПараметрыИнвентаризации) Экспорт

	ДанныеСтроки.НаличиеПоДаннымУчета = Ложь;

	Если ДанныеУчета <> Неопределено Тогда
		
		ДанныеСтроки.НаличиеПоДаннымУчета = 
			ЗначениеЗаполнено(ДанныеУчета.Организация)
			И ДанныеУчета.Организация = ПараметрыИнвентаризации.Организация
			И ДанныеУчета.Подразделение = ПараметрыИнвентаризации.Подразделение;
		
		Если ДанныеСтроки.НаличиеПоДаннымУчета Тогда
			ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = ДанныеУчета.СтоимостьПоДаннымУчетаБУ;
			ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = ДанныеУчета.СтоимостьПоДаннымУчетаНУ;
			ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = ДанныеУчета.СтоимостьПоДаннымУчетаУУ;
		КонецЕсли;
			
	КонецЕсли; 
	
	Если НЕ ДанныеСтроки.НаличиеПоДаннымУчета Тогда
		ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = 0;
		ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = 0;
		ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = 0;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьДействиеНаОснованииИнвентаризацииОС(ДанныеСтроки, Объект, ИспользуетсяВНА24) Экспорт
	
	ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПустаяСсылка");
	ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПустаяСсылка");
	ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПустаяСсылка");

	Если ДанныеСтроки.НаличиеПоДаннымУчета 
		И НЕ ДанныеСтроки.НаличиеФактическое Тогда
		
		Если ДанныеСтроки.ПолученоВАренду Тогда
			
			Если ТипЗнч(ДанныеСтроки.Договор) = Тип("СправочникСсылка.ДоговорыАренды") Тогда
				
				Если Объект.ОтражатьВБУ Тогда
					ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПрекращениеДоговораАренды");
				КонецЕсли;
				
				Если Объект.ОтражатьВНУ Тогда
					ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПрекращениеДоговораАренды");
				КонецЕсли;
				
				Если Объект.ОтражатьВУпрУчете Тогда
					ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПрекращениеДоговораАренды");
				КонецЕсли;
				
			Иначе
				
				ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ВыбытиеАрендованныхОС");
				
			КонецЕсли;
		
		Иначе
		
			Если Объект.ОтражатьВБУ Тогда
				ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
			КонецЕсли;
			
			Если Объект.ОтражатьВНУ Тогда
				ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
			КонецЕсли;
			
			Если Объект.ОтражатьВУпрУчете Тогда
				ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ДанныеСтроки.НаличиеПоДаннымУчета 
		И ДанныеСтроки.НаличиеФактическое Тогда
			
		Если ДанныеСтроки.СтоимостьПоДаннымУчетаБУ <> ДанныеСтроки.СтоимостьФактическаяБУ
			И ДанныеСтроки.СтоимостьПоДаннымУчетаБУ <> 0
			И ДанныеСтроки.СтоимостьФактическаяБУ <> 0
			И НЕ ДанныеСтроки.ПолученоВАренду Тогда
		
			ДанныеСтроки.ДействиеБУ = 
				?(ИспользуетсяВНА24, 
				ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Переоценка"),
				ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание"));
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяБУ = 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаБУ <> 0
			И Объект.ОтражатьВБУ
			И (Объект.ОтражатьВНУ ИЛИ Объект.ОтражатьВУпрУчете)
			И НЕ ДанныеСтроки.ПолученоВАренду
			И ИспользуетсяВНА24 Тогда
		
			ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяБУ <> 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = 0
			И ДанныеСтроки.ОрганизацияПоДаннымУчета = Объект.Организация
			И Объект.ОтражатьВБУ
			И ИспользуетсяВНА24 Тогда
		
			ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
		
		КонецЕсли;
		
		Если ДанныеСтроки.СтоимостьПоДаннымУчетаНУ <> ДанныеСтроки.СтоимостьФактическаяНУ
			И ДанныеСтроки.СтоимостьПоДаннымУчетаНУ <> 0
			И ДанныеСтроки.СтоимостьФактическаяНУ <> 0
			И НЕ ИспользуетсяВНА24
			И НЕ ДанныеСтроки.ПолученоВАренду Тогда
		
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяНУ = 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаНУ <> 0
			И Объект.ОтражатьВНУ
			И (Объект.ОтражатьВБУ ИЛИ Объект.ОтражатьВУпрУчете)
			И НЕ ДанныеСтроки.ПолученоВАренду
			И ИспользуетсяВНА24 Тогда
		
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяНУ <> 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = 0
			И ДанныеСтроки.ОрганизацияПоДаннымУчета = Объект.Организация
			И Объект.ОтражатьВНУ
			И ИспользуетсяВНА24 Тогда
		
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
		
		КонецЕсли;
		
		Если ДанныеСтроки.СтоимостьПоДаннымУчетаУУ <> ДанныеСтроки.СтоимостьФактическаяУУ
			И ДанныеСтроки.СтоимостьПоДаннымУчетаУУ <> 0
			И ДанныеСтроки.СтоимостьФактическаяУУ <> 0
			И НЕ ДанныеСтроки.ПолученоВАренду Тогда
		
			ДанныеСтроки.ДействиеУУ = 
				?(ИспользуетсяВНА24, 
				ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Переоценка"),
				ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание"));
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяУУ = 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаУУ <> 0
			И Объект.ОтражатьВУпрУчете
			И (Объект.ОтражатьВБУ ИЛИ Объект.ОтражатьВНУ)
			И НЕ ДанныеСтроки.ПолученоВАренду
			И ИспользуетсяВНА24 Тогда
		
			ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяУУ <> 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = 0
			И ДанныеСтроки.ОрганизацияПоДаннымУчета = Объект.Организация
			И Объект.ОтражатьВУпрУчете
			И ИспользуетсяВНА24 Тогда
		
			ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
		
		КонецЕсли;
		
	ИначеЕсли НЕ ДанныеСтроки.НаличиеПоДаннымУчета
		И ДанныеСтроки.НаличиеФактическое Тогда
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ОрганизацияПоДаннымУчета) Тогда
			
			Если Объект.ОтражатьВБУ Тогда
				ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
			КонецЕсли;
			
			Если Объект.ОтражатьВНУ Тогда
				ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
			КонецЕсли;
			
			Если Объект.ОтражатьВУпрУчете Тогда
				ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
			КонецЕсли;
			
		Иначе
			
			Если ДанныеСтроки.ОрганизацияПоДаннымУчета <> Объект.Организация
				ИЛИ ДанныеСтроки.ПодразделениеПоДаннымУчета <> Объект.Подразделение
				ИЛИ НЕ ЗначениеЗаполнено(Объект.МОЛ)
					И ДанныеСтроки.МОЛПоДаннымУчета <> ДанныеСтроки.МОЛ
					И ЗначениеЗаполнено(ДанныеСтроки.МОЛ)
				ИЛИ ЗначениеЗаполнено(Объект.МОЛ)
					И ДанныеСтроки.МОЛПоДаннымУчета <> Объект.МОЛ Тогда
			
				Если Объект.ОтражатьВБУ Тогда
					ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Перемещение");
				КонецЕсли;
				
				Если Объект.ОтражатьВНУ <> 0 Тогда
					ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Перемещение");
				КонецЕсли;
				
				Если Объект.ОтражатьВУпрУчете <> 0 Тогда
					ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Перемещение");
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДействиеНаОснованииИнвентаризацииНМА(ДанныеСтроки, Объект, ДанныеУчета) Экспорт
	
	ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПустаяСсылка");
	ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПустаяСсылка");
	ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПустаяСсылка");

	Если ДанныеСтроки.НаличиеПоДаннымУчета 
		И НЕ ДанныеСтроки.НаличиеФактическое Тогда
		
		Если Объект.ОтражатьВБУ Тогда
			ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		КонецЕсли;
		
		Если Объект.ОтражатьВНУ Тогда
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		КонецЕсли;
		
		Если Объект.ОтражатьВУпрУчете Тогда
			ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		КонецЕсли;
		
	ИначеЕсли ДанныеСтроки.НаличиеПоДаннымУчета 
		И ДанныеСтроки.НаличиеФактическое Тогда
			
		Если ДанныеСтроки.СтоимостьПоДаннымУчетаБУ <> ДанныеСтроки.СтоимостьФактическаяБУ
			И ДанныеСтроки.СтоимостьПоДаннымУчетаБУ <> 0
			И ДанныеСтроки.СтоимостьФактическаяБУ <> 0 Тогда
		
			ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Переоценка");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяБУ = 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаБУ <> 0
			И Объект.ОтражатьВБУ
			И (Объект.ОтражатьВНУ ИЛИ Объект.ОтражатьВУпрУчете) Тогда
		
			ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяБУ <> 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаБУ = 0
			И ДанныеУчета <> Неопределено
			И ДанныеУчета.Организация = Объект.Организация
			И Объект.ОтражатьВБУ Тогда
		
			ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
		
		КонецЕсли;
		
		Если ДанныеСтроки.СтоимостьПоДаннымУчетаНУ <> ДанныеСтроки.СтоимостьФактическаяНУ
			И ДанныеСтроки.СтоимостьПоДаннымУчетаНУ <> 0
			И ДанныеСтроки.СтоимостьФактическаяНУ <> 0 Тогда
		
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяНУ = 0
			И Объект.ОтражатьВНУ
			И (Объект.ОтражатьВБУ ИЛИ Объект.ОтражатьВУпрУчете) Тогда
		
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяНУ <> 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаНУ = 0
			И ДанныеУчета <> Неопределено
			И ДанныеУчета.Организация = Объект.Организация Тогда
		
			ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
		
		КонецЕсли;
		
		Если ДанныеСтроки.СтоимостьПоДаннымУчетаУУ <> ДанныеСтроки.СтоимостьФактическаяУУ
			И ДанныеСтроки.СтоимостьПоДаннымУчетаУУ <> 0
			И ДанныеСтроки.СтоимостьФактическаяУУ <> 0 Тогда
		
			ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Переоценка");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяУУ = 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаУУ <> 0
			И Объект.ОтражатьВУпрУчете
			И (Объект.ОтражатьВБУ ИЛИ Объект.ОтражатьВНУ) Тогда
		
			ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Списание");
		
		ИначеЕсли ДанныеСтроки.СтоимостьФактическаяУУ <> 0
			И ДанныеСтроки.СтоимостьПоДаннымУчетаУУ = 0
			И ДанныеУчета <> Неопределено
			И ДанныеУчета.Организация = Объект.Организация Тогда
		
			ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
		
		КонецЕсли;
		
	ИначеЕсли НЕ ДанныеСтроки.НаличиеПоДаннымУчета
		И ДанныеСтроки.НаличиеФактическое Тогда
		
		Если ДанныеУчета = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеУчета.Организация) Тогда
			
			Если Объект.ОтражатьВБУ Тогда
				ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
			КонецЕсли;
			
			Если Объект.ОтражатьВНУ Тогда
				ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
			КонецЕсли;
			
			Если Объект.ОтражатьВУпрУчете Тогда
				ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.ПринятиеКУчету");
			КонецЕсли;
			
		Иначе
			
			Если ДанныеУчета <> Неопределено
				И (ДанныеУчета.Организация <> Объект.Организация
					ИЛИ ДанныеУчета.Подразделение <> Объект.Подразделение) Тогда
			
				Если Объект.ОтражатьВБУ Тогда
					ДанныеСтроки.ДействиеБУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Перемещение");
				КонецЕсли;
				
				Если Объект.ОтражатьВНУ <> 0 Тогда
					ДанныеСтроки.ДействиеНУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Перемещение");
				КонецЕсли;
				
				Если Объект.ОтражатьВУпрУчете <> 0 Тогда
					ДанныеСтроки.ДействиеУУ = ПредопределенноеЗначение("Перечисление.ДействияНаОснованииИнвентаризации.Перемещение");
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПредставлениеДействия(ДанныеСтроки, Форма) Экспорт
	
	Объект = Форма.Объект;

	ДанныеСтроки.ДействиеПредставление = "";
	
	Если (НЕ ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ)
			ИЛИ НЕ Объект.ОтражатьВБУ)
		И (НЕ ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ)
			ИЛИ НЕ Объект.ОтражатьВНУ)
		И (НЕ ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ)
			ИЛИ НЕ Объект.ОтражатьВУпрУчете) Тогда
			
		Возврат;
	КонецЕсли;
	
	ДействиеПредставление = "";
	
	Если (ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииБУ)
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ))
		И (ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииНУ)
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ))
		И (ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииУУ)
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ)) Тогда
		
		ОбщийДокумент = ОбщийДокумент(ДанныеСтроки);
		
		Если ОбщийДокумент <> Неопределено Тогда
			
			ДействиеПредставление = Строка(ОбщийДокумент);
			
		Иначе	
			
			ДействиеПредставление = НСтр("ru = 'Все документы оформлены';
										|en = 'All documents are registered'");
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииБУ)
		ИЛИ ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииНУ)
		ИЛИ ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииУУ) Тогда
			
		ДействиеПредставление = НСтр("ru = 'Документы оформлены частично';
									|en = 'The documents are partially registered'");
			 	
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ)
		ИЛИ ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ)
		ИЛИ ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ) Тогда
			
		Действие = ОбщееДействие(ДанныеСтроки);
		
		Если Действие <> Неопределено Тогда
			
			ДействиеПредставление = Строка(Действие);
			
		Иначе	
			
			ДействиеПредставление = НСтр("ru = 'Документы не оформлены';
										|en = 'The documents are not registered'");
			
		КонецЕсли;
			 	
	КонецЕсли;
	
	ДанныеСтроки.ДействиеПредставление = ДействиеПредставление;
	
КонецПроцедуры

Функция ОбщееДействие(ДанныеСтроки)
	
	Действие = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ) Тогда
		
		ДействиеОбщее = ПервоеЗначениеОбщее(
			ДанныеСтроки.ДействиеБУ, 
			ДанныеСтроки.ДействиеНУ, 
			ДанныеСтроки.ДействиеУУ, 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ));
				
		Если ДействиеОбщее Тогда
			Действие = ДанныеСтроки.ДействиеБУ;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ) Тогда
		
		ДействиеОбщее = ПервоеЗначениеОбщее(
			ДанныеСтроки.ДействиеНУ, 
			ДанныеСтроки.ДействиеБУ, 
			ДанныеСтроки.ДействиеУУ, 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ));
		
		Если ДействиеОбщее Тогда
			Действие = ДанныеСтроки.ДействиеНУ;
		КонецЕсли;

	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ) Тогда
		
		ДействиеОбщее = ПервоеЗначениеОбщее(
			ДанныеСтроки.ДействиеУУ, 
			ДанныеСтроки.ДействиеБУ, 
			ДанныеСтроки.ДействиеНУ, 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ));

		Если ДействиеОбщее Тогда
			Действие = ДанныеСтроки.ДействиеУУ;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Действие;
	
КонецФункции

Функция ОбщийДокумент(ДанныеСтроки)
	
	ДокументНаОсновании = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииБУ) Тогда
		
		ДокументОбщий = ПервоеЗначениеОбщее(
			ДанныеСтроки.ДокументНаОснованииБУ, 
			ДанныеСтроки.ДокументНаОснованииНУ, 
			ДанныеСтроки.ДокументНаОснованииУУ, 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ));
				
		Если ДокументОбщий Тогда
			ДокументНаОсновании = ДанныеСтроки.ДокументНаОснованииБУ;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииНУ) Тогда
		
		ДокументОбщий = ПервоеЗначениеОбщее(
			ДанныеСтроки.ДокументНаОснованииНУ, 
			ДанныеСтроки.ДокументНаОснованииБУ, 
			ДанныеСтроки.ДокументНаОснованииУУ, 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ));
		
		Если ДокументОбщий Тогда
			ДокументНаОсновании = ДанныеСтроки.ДокументНаОснованииНУ;
		КонецЕсли;

	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ДокументНаОснованииУУ) Тогда
		
		ДокументОбщий = ПервоеЗначениеОбщее(
			ДанныеСтроки.ДокументНаОснованииУУ, 
			ДанныеСтроки.ДокументНаОснованииБУ, 
			ДанныеСтроки.ДокументНаОснованииНУ, 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеУУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеБУ), 
			ЗначениеЗаполнено(ДанныеСтроки.ДействиеНУ));

		Если ДокументОбщий Тогда
			ДокументНаОсновании = ДанныеСтроки.ДокументНаОснованииУУ;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументНаОсновании;
	
КонецФункции

Функция ПервоеЗначениеОбщее(Значение1, Значение2, Значение3, ИспользоватьЗначение1, ИспользоватьЗначение2, ИспользоватьЗначение3)
	
	Если НЕ ЗначениеЗаполнено(Значение1)
		И НЕ ЗначениеЗаполнено(Значение2)
		И НЕ ЗначениеЗаполнено(Значение3) Тогда
		
		Возврат Истина;
	КонецЕсли;

	Результат =
		ЗначениеЗаполнено(Значение1)
		И ИспользоватьЗначение1
		И (Значение1 = Значение2
				И Значение1 = Значение3
			ИЛИ Значение1 = Значение2
				И (НЕ ИспользоватьЗначение3
					ИЛИ НЕ ЗначениеЗаполнено(Значение3))
			ИЛИ Значение1 = Значение3
				И (НЕ ИспользоватьЗначение2
					ИЛИ НЕ ЗначениеЗаполнено(Значение2))
			ИЛИ НЕ ИспользоватьЗначение2
				И НЕ ИспользоватьЗначение3
			ИЛИ НЕ ЗначениеЗаполнено(Значение2)
				И НЕ ЗначениеЗаполнено(Значение3));
				
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПараметрыПринятияКУчетуОСИВводаОстатков(Объект, ВспомогательныеРеквизиты)

	ДоступныПараметрыАмортизацииБУ = 
		(Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка"))
		И ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
		
	//
	ДоступныПараметрыАмортизацииУУ = 
		(Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"))
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
	//								
	ДоступноОтражениеРасходовБУ = 
		ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислитьАмортизациюПриПринятииКУчету")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка"));
			
	//		
	ДоступноОтражениеРасходовУУ = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
			
	//
	АмортизацияУУДоступна = 
		(Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
				ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету"))
			И ВспомогательныеРеквизиты.ОтражатьВУпрУчете;
							
	//		
	АмортизацияБУДоступна = 
		(Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислитьАмортизациюПриПринятииКУчету"))
		И ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо;
	
	//
	ПоНаработке = 
		Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
		ИЛИ Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции")
		ИЛИ Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.ПоЕНАОФНа1000кмПробега");
		
	//
	СтатьяРасходовУУОбязательна = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете 
		И (НЕ ДоступноОтражениеРасходовБУ 
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы")
			ИЛИ ЗначениеЗаполнено(Объект.СтатьяРасходовУУ)
			ИЛИ ЗначениеЗаполнено(Объект.АналитикаРасходовУУ)
			ИЛИ ЗначениеЗаполнено(Объект.ПодразделениеУУ)
			ИЛИ ЗначениеЗаполнено(Объект.НаправлениеДеятельностиУУ));
		
	//
	ПараметрыПринятияКУчетуОС = Новый Структура;
	ПараметрыПринятияКУчетуОС.Вставить("ДоступныПараметрыАмортизацииБУ", ДоступныПараметрыАмортизацииБУ);
	ПараметрыПринятияКУчетуОС.Вставить("ДоступныПараметрыАмортизацииУУ", ДоступныПараметрыАмортизацииУУ);
	ПараметрыПринятияКУчетуОС.Вставить("ДоступноОтражениеРасходовБУ", ДоступноОтражениеРасходовБУ);
	ПараметрыПринятияКУчетуОС.Вставить("ДоступноОтражениеРасходовУУ", ДоступноОтражениеРасходовУУ);
	ПараметрыПринятияКУчетуОС.Вставить("ДоступноОтражениеРасходовНУ", Ложь);
	ПараметрыПринятияКУчетуОС.Вставить("АмортизацияУУДоступна", АмортизацияУУДоступна);
	ПараметрыПринятияКУчетуОС.Вставить("АмортизацияБУДоступна", АмортизацияБУДоступна);
	ПараметрыПринятияКУчетуОС.Вставить("ПоНаработке", ПоНаработке);
	ПараметрыПринятияКУчетуОС.Вставить("НаправлениеДеятельностиОбязательно", Ложь);
	ПараметрыПринятияКУчетуОС.Вставить("СтатьяРасходовУУОбязательна", СтатьяРасходовУУОбязательна);
	
	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьПараметрыПринятияКУчетуОСИВводаОстатков(
		Объект, ВспомогательныеРеквизиты, ПараметрыПринятияКУчетуОС);
	
	Возврат ПараметрыПринятияКУчетуОС;

КонецФункции

Функция ПараметрыПринятияКУчетуНМАИВводаОстатков(Объект, ВспомогательныеРеквизиты)
	
	//
	ДоступныПараметрыАмортизацииБУ = 
		ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
		
	ДоступныПараметрыАмортизацииУУ = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
									
	ДоступноОтражениеРасходовБУ = 
		ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
	
	ДоступноОтражениеРасходовУУ = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
									
	ПоНаработке = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
			И Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			И Объект.МетодНачисленияАмортизацииУУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции")
		ИЛИ ВспомогательныеРеквизиты.ОтражатьВБУ
			И Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			И Объект.МетодНачисленияАмортизацииБУ = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииНМА.ПропорциональноОбъемуПродукции");
				
	СтоимостьБУДоступна = 
		ВспомогательныеРеквизиты.ОтражатьВБУ
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
	
	//
	СтоимостьУУДоступна = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете
		И (ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
			ИЛИ НЕ ВспомогательныеРеквизиты.ВалютыСовпадают)
		И (Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеНачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислениеАмортизацииИлиСписаниеНаРасходы")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислитьАмортизациюПриПринятииКУчету")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.АмортизацияНачислена")
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
				
	АмортизацияБУДоступна = 
		ВспомогательныеРеквизиты.ОтражатьВБУ
		И ВспомогательныеРеквизиты.РеглУчетВНАВедетсяНезависимо
		И (Объект.ПорядокУчетаБУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаНУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию")
			ИЛИ Объект.ПорядокУчетаНУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.ПустаяСсылка"));
			
	СтатьяРасходовУУОбязательна = 
		ВспомогательныеРеквизиты.ОтражатьВУпрУчете 
		И (НЕ ДоступноОтражениеРасходовБУ
			ИЛИ Объект.ПорядокУчетаУУ = ПредопределенноеЗначение("Перечисление.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НеПриниматьКУчетуВключитьВРасходы")
			ИЛИ ЗначениеЗаполнено(Объект.СтатьяРасходовУУ)
			ИЛИ ЗначениеЗаполнено(Объект.АналитикаРасходовУУ)
			ИЛИ ЗначениеЗаполнено(Объект.ПодразделениеУУ)
			ИЛИ ЗначениеЗаполнено(Объект.НаправлениеДеятельностиУУ));
	
	ПараметрыПринятияКУчетуНМА = Новый Структура;
	ПараметрыПринятияКУчетуНМА.Вставить("ДоступныПараметрыАмортизацииБУ", ДоступныПараметрыАмортизацииБУ);
	ПараметрыПринятияКУчетуНМА.Вставить("ДоступныПараметрыАмортизацииУУ", ДоступныПараметрыАмортизацииУУ);
	ПараметрыПринятияКУчетуНМА.Вставить("ДоступноОтражениеРасходовБУ", ДоступноОтражениеРасходовБУ);
	ПараметрыПринятияКУчетуНМА.Вставить("ДоступноОтражениеРасходовУУ", ДоступноОтражениеРасходовУУ);
	ПараметрыПринятияКУчетуНМА.Вставить("АмортизацияБУДоступна", АмортизацияБУДоступна);
	ПараметрыПринятияКУчетуНМА.Вставить("СтатьяРасходовУУОбязательна", СтатьяРасходовУУОбязательна);
	ПараметрыПринятияКУчетуНМА.Вставить("ПоНаработке", ПоНаработке);
	ПараметрыПринятияКУчетуНМА.Вставить("НаправлениеДеятельностиОбязательно", Ложь);
	ПараметрыПринятияКУчетуНМА.Вставить("СтоимостьУУДоступна", СтоимостьУУДоступна);
	ПараметрыПринятияКУчетуНМА.Вставить("СтоимостьБУДоступна", СтоимостьБУДоступна);

	ВнеоборотныеАктивыКлиентСерверЛокализация.ДополнитьПараметрыПринятияКУчетуНМАИВводаОстатков(
		Объект, ВспомогательныеРеквизиты, ПараметрыПринятияКУчетуНМА);

	Возврат ПараметрыПринятияКУчетуНМА;
		
КонецФункции

// Добавляет описание ошибки.
// 
// Параметры:
//  СписокОшибок - Массив из Структура - Список ошибок
//  ТекстСообщения - Строка - Текст сообщения
//  Поле - Строка - Поле
//  ПутьКДанным - Строка - Путь к данным
//	ЕстьОшибки - Булево -
Процедура ДобавитьОписаниеОшибки(СписокОшибок, ТекстСообщения, Поле = Неопределено, ПутьКДанным = Неопределено, ЕстьОшибки = Ложь) Экспорт
	
	ЕстьОшибки = Истина;
	
	ОписаниеОшибки = Новый Структура;
	ОписаниеОшибки.Вставить("ТекстСообщения", ТекстСообщения);
	ОписаниеОшибки.Вставить("Поле", Поле);
	ОписаниеОшибки.Вставить("ПутьКДанным", ПутьКДанным);

	СписокОшибок.Добавить(ОписаниеОшибки);
	
КонецПроцедуры

// Добавляет к строке наименование валюты.
// 
// Параметры:
// 	ИсходнаяСтрока - Строка -
// 	ПредставлениеВалюты - Строка -
// 	
// Возвращаемое значение:
// 	Строка - Строка с валютой.
Функция ДобавитьКСтрокеВалюту(ИсходнаяСтрока, ПредставлениеВалюты) Экспорт
	Возврат ?(ЗначениеЗаполнено(ПредставлениеВалюты), СтрШаблон(ИсходнаяСтрока + " (%1)", ПредставлениеВалюты), ИсходнаяСтрока);
КонецФункции

// Представление поля с валютой.
// 
// Параметры:
//  ПредставлениеБезУчета - Строка - 
//  Представление - Строка - 
//  РеглУчетВНАВедетсяНезависимо - Булево - 
//  ВалютыСовпадают - Булево - 
//  ПредставлениеВалюты - Строка - 
// 
// Возвращаемое значение:
//  Строка - Представление поля с валютой
Функция ПредставлениеПоляСВалютой(ПредставлениеБезУчета, Представление, РеглУчетВНАВедетсяНезависимо, ВалютыСовпадают, ПредставлениеВалюты) Экспорт
	
	Если НЕ РеглУчетВНАВедетсяНезависимо
		И ВалютыСовпадают Тогда
			
		ПредставлениеПоляСВалютой = ПредставлениеБезУчета;
		
	Иначе
		
		ПредставлениеПоляСВалютой = ДобавитьКСтрокеВалюту(Представление, ПредставлениеВалюты);
			
	КонецЕсли; 
	
	Возврат ПредставлениеПоляСВалютой;
	
КонецФункции

#КонецОбласти

#КонецОбласти
