#Область СлужебныеПроцедурыИФункции

// Устанавливает статус для указанных карт исследования товаров.
//
// Параметры:
//   ВыделенныеСсылки - Массив Из СправочникСсылка.КартыИсследованияТоваров	 - ссылки на карты исследования товаров, для которых необходимо изменить статус
//   ЗначениеСтатуса - Строка - новое значение статуса карт исследования товаров
//
// Возвращаемое значение:
//   Число - количество обработанных карт исследования товаров
Функция УстановитьСтатусКартИсследованияТоваров(ВыделенныеСсылки, ЗначениеСтатуса) Экспорт

	НовыйСтатус = Перечисления.СтатусыКартыИсследованияТоваров[ЗначениеСтатуса];
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КартыИсследованияТоваров.Ссылка,
	|	КартыИсследованияТоваров.Наименование,
	|	КартыИсследованияТоваров.ПометкаУдаления,
	|	КартыИсследованияТоваров.Статус,
	|	КОЛИЧЕСТВО(КартыИсследованияТоваровТовары.НомерСтроки) КАК Количество
	|ИЗ
	|	Справочник.КартыИсследованияТоваров КАК КартыИсследованияТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыИсследованияТоваров.Товары КАК КартыИсследованияТоваровТовары
	|		ПО КартыИсследованияТоваров.Ссылка = КартыИсследованияТоваровТовары.Ссылка
	|ГДЕ
	|	КартыИсследованияТоваров.Статус <> &НовыйСтатус
	|	И КартыИсследованияТоваров.Ссылка В (&ВыделенныеСсылки)
	|СГРУППИРОВАТЬ ПО
	|	КартыИсследованияТоваров.Ссылка,
	|	КартыИсследованияТоваров.Наименование,
	|	КартыИсследованияТоваров.ПометкаУдаления,
	|	КартыИсследованияТоваров.Статус";
	
	Запрос.УстановитьПараметр("ВыделенныеСсылки", ВыделенныеСсылки);
	Запрос.УстановитьПараметр("НовыйСтатус",      НовыйСтатус);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	КоличествоОбработанных = 0;
	
	Если НовыйСтатус = Перечисления.СтатусыКартыИсследованияТоваров.Черновик Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр(
				"ru = 'Нельзя изменить статус помеченной на удаление карты исследования товаров ""%1"".';
				|en = 'Cannot change status of the ""%1"" goods research sheet because it is marked for deletion.'"),
				Выборка.Наименование);

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
			Продолжить;
		КонецЕсли;

		Если НовыйСтатус = Перечисления.СтатусыКартыИсследованияТоваров.Действует Тогда

			Если Выборка.Количество = 0 Тогда

				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр(
				"ru = 'Нельзя изменить статус на ""Действует"" с незаданной областью применения для карты исследования товаров ""%1"".';
				|en = 'Cannot change the status to ""Valid"" with an unspecified scope for the ""%1"" goods research sheet.'"),
					Выборка.Наименование);

				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
				Продолжить;
			КонецЕсли;

		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.КартыИсследованияТоваров");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();

			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();

			Если НовыйСтатус = Перечисления.СтатусыКартыИсследованияТоваров.Черновик Тогда
				ПараметрыПроверки = Новый Структура("Объект", Выборка.Ссылка);
				Справочники.КартыИсследованияТоваров.ПроверитьИспользованиеОбъекта(ПараметрыПроверки, АдресХранилища);
				ЕстьСсылки = ПолучитьИзВременногоХранилища(АдресХранилища);
				Если ЕстьСсылки Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Карта исследования товаров ""%1"" используется. Установка статуса ""Действует"" допускается только в форме карты исследования товаров.';
							|en = 'The ""%1"" goods research sheet is in use. You can set the ""Valid"" status only in the goods research sheet form.'"),
						СпрОбъект.Наименование);

					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			СпрОбъект.Статус = НовыйСтатус;
			Если СпрОбъект.ПроверитьЗаполнение() Тогда
				СпрОбъект.Записать();
				КоличествоОбработанных = КоличествоОбработанных + 1;
			КонецЕсли;
			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат КоличествоОбработанных;

КонецФункции

#КонецОбласти
