#Область ПрограммныйИнтерфейс

// Выполняет обработку навигационной ссылки открытия формы, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма, из обработчика события которой происходит вызов процедуры.
//	НавигационнаяСсылкаФорматированнойСтроки - Строка - строка навигационной ссылки
//	СтандартнаяОбработка - Булево - признак стандартной обработки события
//
Процедура ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	//++ Локализация

	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	Настройка = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТ
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьИсториюИзмененийНастроекСчетовУчета" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("АналитикаУчета", Форма.Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
		ОткрытьФорму("РегистрСведений.ПорядокОтраженияНаСчетахУчета.Форма.ФормаНастройки", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор);
		
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьРабочееМестоНастроекСчетовУчета" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИмяОткрываемойФормы = "Обработка.НастройкаОтраженияДокументовВРеглУчете.Форма.ФормаНастройки";
		ОткрытьФормуНастройкиСПроверкойЗаписи(ИмяОткрываемойФормы, Форма);
		
	КонецЕсли;
	
	//-- НЕ УТ

	//-- Локализация
	
КонецПроцедуры

// Выполняет обработку закрытия формы настройки счетов учета.
// Вызывается в обработчике ОбработкаОповещения() формы объекта.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта
// 	ИмяСобытия - Строка - Имя события оповещения
// 	Параметр - Произвольный - Параметр оповещения 
//
Процедура ЗаконченаНастройкаСчетовУчета(Форма, ИмяСобытия, Параметр) Экспорт
	//++ Локализация

	//++ НЕ УТ
	ДанныеНастройкиСчетовУчета = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если ИмяСобытия = "ЗаконченаНастройкаСчетовУчета" И Параметр = Форма.Объект.Ссылка
		И ДанныеНастройкиСчетовУчета <> Неопределено И ДанныеНастройкиСчетовУчета.ИспользуетсяНастройкаИсключений Тогда
		РазделУчета = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоНастройкам(ДанныеНастройкиСчетовУчета);
		Форма.НастройкаСчетовУчета_Ссылка = НастройкаСчетовУчетаСлужебныйВызовСервера.СсылкаНастройкаСчетовУчета(Параметр, РазделУчета);
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
КонецПроцедуры

// Выполняет обработку навигационной ссылки открытия формы настройки счетов.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта
// 	НавигационнаяСсылка - Строка - Навигационная ссылка
// 	СтандартнаяОбработка - Булево - флаг СтандартнаяОбработка события
//
Процедура ОбработкаНавигационнойСсылкиНастройкаСчетовУчета(Форма, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	//++ Локализация

	//++ НЕ УТ
	СтандартнаяОбработка = Ложь;
	ИмяОткрываемойФормы = ?(НавигационнаяСсылка = "ОткрытьНастройкуСчетовУчета",
		"РегистрСведений.ПорядокОтраженияНаСчетахУчета.Форма.ФормаНастройкиДинамически",
		"Обработка.НастройкаОтраженияДокументовВРеглУчете.Форма.ФормаНастройки");
	ОткрытьФормуНастройкиСПроверкойЗаписи(ИмяОткрываемойФормы, Форма);
	//-- НЕ УТ

	//-- Локализация
КонецПроцедуры

// Выполняет обработку изменения счетов учета аналитики учета.
// 
// Параметры:
// 	Элемент - ПолеФормы - Элемент (поле ввода) настройки счета учета
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки
//
Процедура ПриИзменении(Элемент, Форма) Экспорт
	//++ Локализация
	Настройка = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//++ НЕ УТ
	ИмяЭлемента = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(Элемент.Имя);
	ИмяЭлементаСПрефиксом = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(Элемент.Имя, Истина);
	ТипЭлемента = НастройкаСчетовУчетаКлиентСервер.ПрефиксЭлементаНастройки(ИмяЭлементаСПрефиксом);
	ЭтоЭлементНастройки = СтрНачинаетсяС(ИмяЭлементаСПрефиксом, ТипЭлемента);
	ИмяЭлемента = ?(ТипЭлемента = "СчетУчета", ИмяЭлемента, ИмяЭлементаСПрефиксом);
	Если НастройкаСчетовУчетаКлиентСервер.СчетИспользуетСубконто(ИмяЭлемента) И ТипЭлемента = "СчетУчета" Тогда
		НастройкаСчетовУчетаКлиентСервер.УстановитьСвойстваЭлементовНастройкиСчетовУчета(Форма);
	КонецЕсли;
	Если Настройка.СворачиваемыеГруппы Тогда
		Если ИмяЭлемента = "НастройкаСворачиваемостиГрупп" Тогда
			ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(Настройка, "", "НастройкаСворачиваемостиГрупп", "Команда");
			ОбработкаСворачиваемостиГрупп(Форма[ИмяРеквизита], Элемент.Родитель);
		КонецЕсли;
		// Возможно это счет, если это так обновим заголовок его группы:
		РазделУчета = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоИмениСчета(ИмяЭлемента);
		Если РазделУчета = Неопределено И НЕ ЭтоЭлементНастройки Тогда
			Возврат;
		КонецЕсли;
		ГруппаСчетаУчета = НастройкаСчетовУчетаКлиентСервер.ГруппаСчетаУчета(ИмяЭлемента, РазделУчета, Настройка, "СчетУчета");
		Если ГруппаСчетаУчета <> Неопределено Тогда
			ГруппаНаФорме = Форма.Элементы.Найти(НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНаФорме(Настройка,, ГруппаСчетаУчета.ИмяГруппы, "Группа"));
			Если ГруппаНаФорме <> Неопределено Тогда
				ГруппаНаФорме.ЗаголовокСвернутогоОтображения = ГруппаНаФорме.Заголовок + НастройкаСчетовУчетаКлиентСервер.ДопПредставлениеГруппы(Форма, ГруппаСчетаУчета.ИмяГруппы);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Настройка.Свойство("ИзмененныеДанные") И ЭтоЭлементНастройки Тогда
		НастройкаСчетовУчетаКлиентСервер.ОбновитьИзмененныеДанные(ИмяЭлемента, Настройка.ИзмененныеДанные);
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
КонецПроцедуры

// Выполняет обработку начала выбора настройки счетов учета.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки
// 	Элемент - ПолеФормы - Элемент (поле ввода) настройки счета учета
// 	ДанныеВыбора - Массив из СправочникСсылка - то что выбирается
// 	СтандартнаяОбработка - Булево - признак необходимости выполнения стандартной обработки
// 	ОбработчикЗакрытия - ОписаниеОповещения - обработчик, который надо вызывать при завершении выбора.
//
Процедура НачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ОбработчикЗакрытия = Неопределено) Экспорт
	//++ Локализация
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	Настройка = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//++ НЕ УТ
	
	Настройка = Форма.КэшДанныхМеханизмов.НастройкаСчетовУчета;

	ИмяЭлементаНастройки = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(Элемент.Имя);
	Если ИмяЭлементаНастройки = "ПредставлениеПериода" Тогда
		СтандартнаяОбработка = Ложь;
		ОбработчикЗакрытия = ?(ОбработчикЗакрытия <> Неопределено, ОбработчикЗакрытия,
			Новый ОписаниеОповещения("ПредставлениеПериодаНачалоВыбораЗавершение", ЭтотОбъект, Форма));
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НачалоПериода", Настройка.Период);
		ПараметрыФормы.Вставить("КонецПериода", Настройка.Период);
		ПараметрыФормы.Вставить("ВыборКварталов", Ложь);
		Если Настройка.Блокировка.Используется Тогда
			ПараметрыФормы.Вставить("ОграничениеСнизу", Макс(Настройка.Блокировка.ДатаБлокировкиМесяца, Настройка.Блокировка.ДатаЗапрета));
		КонецЕсли;
		
		ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор,,,
			ОбработчикЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		СтандартнаяОбработка = Ложь;
		Раздел = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоНастройкам(Настройка);

		ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(Настройка, Раздел, ИмяЭлементаНастройки, "Субконто");

		Статья = ?(Настройка.Свойство("НастройкаПоОдному"), Форма.Запись[ИмяРеквизита], Форма[ИмяРеквизита]);
		НачалоВыбораСубконто_ОткрытьФормуВыбораСтатьи(Элемент, Настройка.ОбщиеРеквизиты.ВидыПрочихДоходовРасходов, Статья);
	КонецЕсли;
	//-- НЕ УТ
	
	//-- Локализация
КонецПроцедуры

// Выполняет обработку начала выбора настройки счетов учета.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки
// 	Элемент - ПолеФормы - Элемент (поле ввода) настройки счета учета
// 	Направление - Число - шаг регулирования
// 	СтандартнаяОбработка - Булево - признак необходимости выполнения стандартной обработки
//
Процедура Регулирование(Форма, Элемент, Направление, СтандартнаяОбработка) Экспорт
	//++ Локализация
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	Настройка = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//++ НЕ УТ
	СтандартнаяОбработка = Ложь;
	Настройка = Форма.КэшДанныхМеханизмов.НастройкаСчетовУчета;
	Настройка.Период = ?(ЗначениеЗаполнено(Настройка.Период), Настройка.Период, ОбщегоНазначенияКлиент.ДатаСеанса());
	ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(Настройка, "", "ПредставлениеПериода", "НастройкаПериода");
	ДатаЗапрета = Макс(Настройка.Блокировка.ДатаБлокировкиМесяца, Настройка.Блокировка.ДатаЗапрета);
	Если НачалоМесяца(ДобавитьМесяц(Настройка.Период, Направление)) < ДатаЗапрета Тогда
		Текст = НСтр("ru = 'Не доступно изменение настроек счетов учета ранее установленной ""%1"" (%2)';
					|en = 'Cannot change the ledger account settings of the previously set ""%1"" (%2)'");
		НаименованиеДаты = ?(ДатаЗапрета = Настройка.Блокировка.ДатаБлокировкиМесяца, НСтр("ru = 'Дата блокировки закрытия месяца';
																							|en = 'Month-end closing lock date'"), НСтр("ru = 'Дата запрета изменения';
																																			|en = 'Period-end closing date'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(Текст, НаименованиеДаты, ДатаЗапрета), , Элемент.Имя, ИмяРеквизита);
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, Настройка.Период, Форма[ИмяРеквизита]);
	
	Форма[ИмяРеквизита] = Формат(Настройка.Период, НСтр("ru = 'ДФ=''ММММ гггг''; ДП=''С начала учета''';
														|en = 'DF=''MMMM yyyy''; DE=''From accounting start'''"));
	
	РазрешитьРедактированиеСчетовУчета(Форма);
	//-- НЕ УТ
	
	//-- Локализация
КонецПроцедуры

// Выполняет обработку очистки настройки счетов учета.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки
// 	Элемент - ПолеФормы - Элемент (поле ввода) настройки счета учета
// 	СтандартнаяОбработка - Булево - признак необходимости выполнения стандартной обработки
//
Процедура Очистка(Форма, Элемент, СтандартнаяОбработка) Экспорт
	//++ Локализация
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	Настройка = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//++ НЕ УТ
	СтандартнаяОбработка = Ложь;
	Настройка = Форма.КэшДанныхМеханизмов.НастройкаСчетовУчета;
	ИсходныйПериод = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Запись"), Форма.Запись.Период, ОбщегоНазначенияКлиент.ДатаСеанса());
	Настройка.Период = ИсходныйПериод;
	ИмяРеквизитаПредставлениеПериода = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(Настройка, "", "ПредставлениеПериода", "НастройкаПериода");
	Форма[ИмяРеквизитаПредставлениеПериода] = Формат(ИсходныйПериод, НСтр("ru = 'ДФ=''ММММ гггг''; ДП=''С начала учета''';
																			|en = 'DF=''MMMM yyyy''; DE=''From accounting start'''"));
	
	РазрешитьРедактированиеСчетовУчета(Форма);
	//-- НЕ УТ
	
	//-- Локализация
КонецПроцедуры

// Выполняет команду вывода / скрытия элементов настройки долгосрочных счетов учета на форме.
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - Форма в которой расположена команда;
//  Команда	- КомандаФормы - Команда, которую нужно выполнить.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда) Экспорт
	
	//++ Локализация
	Настройка = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//++ НЕ УТ
	ИмяКоманды = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(Команда.Имя);
	
	Если ИмяКоманды = "ПоказыватьДолгосрочныеСчета" Тогда
		
		Настройка.ОбщиеРеквизиты.ПоказыватьДолгосрочныеСчета = Не Настройка.ОбщиеРеквизиты.ПоказыватьДолгосрочныеСчета;
		НастройкаСчетовУчетаКлиентСервер.УстановитьСвойстваЭлементовНастройкиСчетовУчета(Форма);
		
	КонецЕсли;
	
	Если ИмяКоманды = "РазрешитьРедактированиеСчетовУчета" Тогда
		
		ОповещениеРазблокированиеРеквизитовЗакрытие = Новый ОписаниеОповещения("РазрешитьРедактированиеРеквизитовЗавершение", ЭтотОбъект, Форма);
		ПараметрыФормы = Новый Структура("РедактированиеРазрешено", Настройка.Блокировка.ОтключенаПользователем);
		Если Настройка.Свойство("НастройкаПоОдному") И ЗначениеЗаполнено(Форма.Запись.Организация) Тогда
			ПараметрыФормы.Вставить("Организация", Форма.Запись.Организация);
		КонецЕсли;
		ОткрытьФорму("Обработка.НастройкаОтраженияДокументовВРеглУчете.Форма.РазблокированиеРеквизитов",
			ПараметрыФормы, ЭтотОбъект, , , , ОповещениеРазблокированиеРеквизитовЗакрытие, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
		
	КонецЕсли;
	
	Если ИмяКоманды = "ИсторияИзмененийСчета" Тогда
		
		Если ТипЗнч(Форма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			ИмяСчета = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(Форма.ТекущийЭлемент.ТекущийЭлемент.Имя);
			ПараметрыОткрытияФормы = Новый Структура("АналитикаУчета, Организация, МестоУчета");
			ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Форма.ТекущийЭлемент.ТекущиеДанные);
			ПараметрыОткрытияФормы.Вставить("ИмяВидаСчета", ИмяСчета);
		ИначеЕсли ТипЗнч(Форма.ТекущийЭлемент) = Тип("ПолеФормы") Тогда
			ИмяСчета = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(Форма.ТекущийЭлемент.Имя);
			Отбор = Новый Структура("АналитикаУчета", Форма.Объект.Ссылка);
			
			ПараметрыФормы = Новый Структура("Отбор", Отбор);
			ПараметрыФормы.Вставить("ИмяВидаСчета", ИмяСчета);
			
			ОткрытьФорму("РегистрСведений.ПорядокОтраженияНаСчетахУчета.Форма.ФормаНастройки", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
	//-- НЕ УТ

	//-- Локализация
	
КонецПроцедуры

#Область НастройкаСчетовУчетаПрочихОпераций

//++ НЕ УТ

// Возвращает параметры, передаваемые общей форме НастройкаСчетовУчетаОперации при открытии.
// 
// Возвращаемое значение:
//  Структура - Описание:
//  * Период - Дата - Дата совершаемой операции
//  * ДанныеНастройки - см. НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета
//  * НастройкаСчетовУчета - Неопределено, СправочникСсылка.НастройкиСчетовУчетаПрочихОпераций, ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов - редактируемая настройка счетов учета или настройка счетов по умолчанию
//  * ТолькоПросмотр - Булево - Признак ограничения интерактивного редактирования настройки счетов учета
//  * КонтекстНастройки - см. НастройкаСчетовУчетаКлиентСервер.КонтекстНастройки
//  * ИсточникиПодбораСубконто - СписокЗначений из Тип - Список источников автоматического подбора субконто
//      Значение - Тип - Тип источника автоматического подбора субконто (Например, Тип("СправочникСсылка.ФизическиеЛица"))
//      Представление - Строка - Путь к данным источника, (Например, "Объект.Начисление.ФизическоеЛицо").
//  * СчетаУчетаВНастройкахПроводок - Неопределено, Булево - При открытии формы для статей активов и пассивов содержит признак указания счетов МФУ в настройках проводок
//
Функция ПараметрыФормыНастройкиСчетовУчета() Экспорт
	
	ПараметрыФормыНастройки = Новый Структура;
	ПараметрыФормыНастройки.Вставить("Период", ОбщегоНазначенияКлиент.ДатаСеанса());
	ПараметрыФормыНастройки.Вставить("ДанныеНастройки", НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета());
	ПараметрыФормыНастройки.Вставить("НастройкаСчетовУчета", Неопределено);
	ПараметрыФормыНастройки.Вставить("ТолькоПросмотр", Ложь);
	ПараметрыФормыНастройки.Вставить("КонтекстНастройки", Новый Структура());
	ПараметрыФормыНастройки.Вставить("ИсточникиПодбораСубконто", Новый СписокЗначений());
	ПараметрыФормыНастройки.Вставить("СчетаУчетаВНастройкахПроводок", Неопределено);
	
	Возврат ПараметрыФормыНастройки;
	
КонецФункции

//-- НЕ УТ

// Вызывается в обработчике "Нажатие" гиперссылки элемента настройки.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки.
// 	Элемент - ПолеФормы - Элемент настройки.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
// 	Оповещение - ОписаниеОповещения - Описание оповещения, которое необходимо выполнить после окончания настройки.
//
Процедура ПриНажатии(Форма, Элемент, СтандартнаяОбработка, Оповещение = Неопределено) Экспорт
	
	//++ НЕ УТ
	
	ДанныеНастройкиСчетовУчета = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если ДанныеНастройкиСчетовУчета = Неопределено ИЛИ Не ДанныеНастройкиСчетовУчета.ДоступнаНастройкаСчетовУчета Тогда
		Возврат;
	КонецЕсли;
	
	ИндексПараметров = Неопределено;
	Если НЕ ДанныеНастройкиСчетовУчета.СоответствиеПараметровНастройкиЭлементамФормы.Свойство(Элемент.Имя, ИндексПараметров) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыНастройки = ДанныеНастройкиСчетовУчета.МассивПараметровНастройки.Получить(ИндексПараметров);
	
	СтандартнаяОбработка = Ложь;
	
	ТаблицаФормы = ОбщегоНазначенияУТКлиентСервер.ТаблицаФормыЭлемента(Элемент);
	Если ТаблицаФормы <> Неопределено Тогда
		ИдентификаторСтроки = ТаблицаФормы.ТекущаяСтрока;
	КонецЕсли;
	
	КонтекстНастройки = НастройкаСчетовУчетаКлиентСервер.ДанныеПоПути(Форма, ПараметрыНастройки.ПутьКДанным, ИдентификаторСтроки);
	Если ТипЗнч(КонтекстНастройки) = Тип("ДанныеФормыКоллекция") Тогда
		// Редактируем таблицу в режиме "Без разбиения"
		КонтекстНастройки = КонтекстНастройки[0];
		СлужебныйКонтекст = КонтекстНастройки;
		ИдентификаторСтроки = КонтекстНастройки.ПолучитьИдентификатор();
	ИначеЕсли ТипЗнч(КонтекстНастройки) = Тип("ДанныеФормыСтруктура")
		ИЛИ ТипЗнч(КонтекстНастройки) = Тип("ФормаКлиентскогоПриложения") Тогда
		СлужебныйКонтекст = Форма;
	Иначе
		СлужебныйКонтекст = КонтекстНастройки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыНастройки.Представление)
		И СлужебныйКонтекст[ПараметрыНастройки.Представление] = НастройкаСчетовУчетаКлиентСервер.ТекстГиперссылкиНастройкаСчетовНеТребуется() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаУникальна = Истина;
	
	ДанныеПоПути = НастройкаСчетовУчетаКлиентСервер.ДанныеПоПути(Форма, ПараметрыНастройки.ПутьКДанным);
	Если ТипЗнч(ДанныеПоПути) = Тип("ДанныеФормыКоллекция")
		И ЗначениеЗаполнено(КонтекстНастройки[ПараметрыНастройки.НастройкаСчетовУчета]) Тогда
		Для Каждого ЭлементКоллекции Из ДанныеПоПути Цикл
			Если ЭлементКоллекции[ПараметрыНастройки.НастройкаСчетовУчета] = КонтекстНастройки[ПараметрыНастройки.НастройкаСчетовУчета]
				И ЭлементКоллекции.ПолучитьИдентификатор() <> КонтекстНастройки.ПолучитьИдентификатор() Тогда
				НастройкаУникальна = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыФормыНастройки = ПараметрыФормыНастройкиСчетовУчета();
	ПараметрыФормыНастройки.ТолькоПросмотр = Форма.ТолькоПросмотр;
	ПараметрыФормыНастройки.КонтекстНастройки = НастройкаСчетовУчетаКлиентСервер.КонтекстНастройки(Форма, ПараметрыНастройки, ИдентификаторСтроки);
	ПараметрыФормыНастройки.ИсточникиПодбораСубконто = ПараметрыНастройки.ИсточникиПодбораСубконто;
	
	Если НастройкаУникальна Тогда
		ПараметрыФормыНастройки.НастройкаСчетовУчета = КонтекстНастройки[ПараметрыНастройки.НастройкаСчетовУчета];
	КонецЕсли;
	
	ДанныеНастройки = ДанныеНастройкиСчетовУчета.НастройкиСчетовУчета[КонтекстНастройки[ПараметрыНастройки.НастройкаСчетовУчета]];
	Если ДанныеНастройки <> Неопределено Тогда
		ПараметрыФормыНастройки.ДанныеНастройки = ДанныеНастройки;
	КонецЕсли;
	
	Если СтрНачинаетсяС(ПараметрыНастройки.ПутьКДанным, "Объект")
	И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма["Объект"], "Дата") Тогда
		ПараметрыФормыНастройки.Период = Форма["Объект"]["Дата"];
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ДополнительныеПараметры.Вставить("ИмяЭлементаНастройки", Элемент.Имя);
	ДополнительныеПараметры.Вставить("ПараметрыНастройки", ПараметрыНастройки);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", Оповещение);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаОтраженияОперацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.НастройкаСчетовУчетаОперации", ПараметрыФормыНастройки, Форма, , , , ОписаниеОповещения); 
	
	//-- НЕ УТ
	
КонецПроцедуры

// Вызывается в обработчике "ПриНачалеРедактирования" таблицы формы.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки.
// 	ТаблицаФормы - ТаблицаФормы - Редактируемая таблица формы.
// 	НоваяСтрока - ДанныеФормыЭлементКоллекции - Новая строка в редактируемой таблице формы. Используется при программном копировании и несовпадении с текущими данными таблицы
// 	ПутьКДанным - Строка - Путь к данным настройки счетов. Используется, когда настройка не выведена на форму и в параметрах настройки отсутствуют элементы формы.
//
Процедура ПриКопированииСтроки(Форма, ТаблицаФормы, НоваяСтрока = Неопределено, ПутьКДанным = Неопределено) Экспорт

	//++ НЕ УТ
	
	ДанныеНастройкиСчетовУчета = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета"); // см. НастройкаСчетовУчетаКлиентСервер.НовыеДанныеНастройкиСчетовУчета
	Если ДанныеНастройкиСчетовУчета = Неопределено ИЛИ Не ДанныеНастройкиСчетовУчета.ДоступнаНастройкаСчетовУчета Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ПараметрыНастройки Из ДанныеНастройкиСчетовУчета.МассивПараметровНастройки Цикл
		Если ПутьКДанным <> Неопределено И ПутьКДанным = ПараметрыНастройки.ПутьКДанным Тогда
			СкопироватьНастройкуСчетовУчета(ДанныеНастройкиСчетовУчета, ПараметрыНастройки, ТаблицаФормы, НоваяСтрока);
		Иначе
			Для Каждого ЭлементФормы Из ПараметрыНастройки.ЭлементыФормы Цикл
				Если ТаблицаФормы = ОбщегоНазначенияУТКлиентСервер.ТаблицаФормыЭлемента(Форма.Элементы[ЭлементФормы]) Тогда
					СкопироватьНастройкуСчетовУчета(ДанныеНастройкиСчетовУчета, ПараметрыНастройки, ТаблицаФормы, НоваяСтрока);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//-- НЕ УТ
	
КонецПроцедуры

//Предназначена для обработки таблицы формы, не связанной с табличной частью объекта.
// Вызывается в обработчике формы ПередЗаписью().
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма.
//
Процедура ПередЗаписьюНаКлиенте(Форма) Экспорт
	
	ДанныеНастройкиСчетовУчета = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	Если ДанныеНастройкиСчетовУчета = Неопределено ИЛИ Не ДанныеНастройкиСчетовУчета.ДоступнаНастройкаСчетовУчета Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаСчетовУчетаКлиентСервер.ОчиститьНеактуальныеНастройкиОтраженияВДанныхФормы(Форма, ДанныеНастройкиСчетовУчета.МассивПараметровНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаВыбораСубконто

// Обработка проводок при изменении организации.
// 
// Параметры:
//  Проводка - РегистрБухгалтерииЗапись - Проводка
//  ТипыСвязанныеСОрганизацией - ОписаниеТипов - Описание типов
//  ДтКт - Строка - Дт или Кт
Процедура ОбработкаПроводокПриИзмененииОрганизации(Проводка, ТипыСвязанныеСОрганизацией, ДтКт = "")  Экспорт
	
	Для Инд = 1 По 3 Цикл
		ЗначениеСубконто = Проводка["Субконто" + ДтКт + Инд];
		Если ЗначениеЗаполнено(ЗначениеСубконто)
			И ТипыСвязанныеСОрганизацией.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(ЗначениеСубконто));
			ОписаниеТипаСубконто = Новый ОписаниеТипов(МассивТипов);
			Проводка["СубконтоДт" + Инд] = ОписаниеТипаСубконто.ПривестиЗначение(Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Проводка["Подразделение" + ДтКт]) Тогда
		Проводка["Подразделение" + ДтКт] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаТаблицы, Организация, ДтКт = "")  Экспорт
	
	ШаблонПоля = "Субконто" + ДтКт + "%Индекс%";
	ПараметрыДокумента = НастройкаСчетовУчетаКлиентСервер.ПараметрыВыбораСубконто(Организация, СтрокаТаблицы, ШаблонПоля, "Счет" + ДтКт);
	НастройкаСчетовУчетаКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаТаблицы, ШаблонПоля, ШаблонПоля, ПараметрыДокумента);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//++ НЕ УТ

//++ Локализация

Процедура ОткрытьФормуНастройкиСПроверкойЗаписи(ИмяФормы, ФормаВладелец) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ФормаВладелец.Объект.Ссылка) ИЛИ ФормаВладелец.Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Открытие формы настройки возможно только после записи объекта. Записать?';
							|en = 'The setting form can be opened only when the item is recorded. Record?'");
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ИмяФормы", ИмяФормы);
		ДополнительныеПараметры.Вставить("ФормаВладелец", ФормаВладелец);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуСПроверкойЗаписиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АналитикаУчета", ФормаВладелец.Объект.Ссылка);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры

Процедура ОткрытьФормуСПроверкойЗаписиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОткрыватьФорму = Ложь;
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Попытка
			ФормаВладелец = ДополнительныеПараметры.ФормаВладелец;
			ОткрыватьФорму = ФормаВладелец.Записать();
		Исключение
			ПоказатьПредупреждение(,НСтр("ru = 'Не удалось выполнить запись объекта';
										|en = 'Cannot record the item'"));
		КонецПопытки;
	КонецЕсли;
	
	Если ОткрыватьФорму Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АналитикаУчета", ФормаВладелец.Объект.Ссылка);
		ОткрытьФорму(ДополнительныеПараметры.ИмяФормы, ПараметрыФормы, ДополнительныеПараметры.ФормаВладелец);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредставлениеПериодаНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйПериод <> Неопределено Тогда
		
		Настройка = ДополнительныеПараметры.КэшДанныхМеханизмов.НастройкаСчетовУчета;
		Настройка.Период = ВыбранныйПериод.НачалоПериода;
		ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(Настройка, "", "ПредставлениеПериода", "НастройкаПериода");
		ДополнительныеПараметры[ИмяРеквизита] = Формат(Настройка.Период, НСтр("ru = 'ДФ=''ММММ гггг''; ДП=''С начала учета''';
																				|en = 'DF=''MMMM yyyy''; DE=''From accounting start'''"));
		
		ЗаполнитьЗначенияНастроекСчетовУчета(ДополнительныеПараметры);
		
		РазрешитьРедактированиеСчетовУчета(ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РазрешитьРедактированиеРеквизитовЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройка = ДополнительныеПараметры.КэшДанныхМеханизмов.НастройкаСчетовУчета;
	Настройка.Блокировка.ОтключенаПользователем = Результат = Истина;
	ИмяЭлементаНаФорме = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНаФорме(Настройка, "", "РазрешитьРедактированиеСчетовУчета", "Команда");
	ДополнительныеПараметры.Элементы[ИмяЭлементаНаФорме].Пометка = Результат = Истина;
	РазрешитьРедактированиеСчетовУчета(ДополнительныеПараметры);
	
КонецПроцедуры

//-- Локализация

//-- НЕ УТ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТ

//++ Локализация

Процедура ОбработкаСворачиваемостиГрупп(ЗначениеСворачиваемости, ГруппаНастройкиСчетовУчета)
	
	Для каждого ПодчиненнаяГруппа Из ГруппаНастройкиСчетовУчета.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ПодчиненнаяГруппа) = Тип("ГруппаФормы") И ПодчиненнаяГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая Тогда
			Если ПодчиненнаяГруппа.Скрыта() И ЗначениеСворачиваемости = "ПоказатьВсе" Тогда
				ПодчиненнаяГруппа.Показать();
			ИначеЕсли Не ПодчиненнаяГруппа.Скрыта() И ЗначениеСворачиваемости = "СвернутьВсе" Тогда
				ПодчиненнаяГруппа.Скрыть();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура НачалоВыбораСубконто_ОткрытьФормуВыбораСтатьи(Элемент, ВидыПрочихДоходовРасходов, ТекущееЗначение)
	
	ПараметрыФормы = Новый Структура;
	Статья = ?(ЗначениеЗаполнено(ТекущееЗначение), ТекущееЗначение, ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка"));
	ПараметрыФормы.Вставить("Статья", Статья);
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиРасходов", Истина));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиДоходов", Истина));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидПрочихДоходовИРасходов", ВидыПрочихДоходовРасходов));
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	ПараметрыФормы.Вставить("ПараметрыВыбора", ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// Устанавливает возможность редактирования настройки счетов, в зависимости от отработки соответствующей команды.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки.
//
Процедура РазрешитьРедактированиеСчетовУчета(Форма)
	
	Настройки = Форма.КэшДанныхМеханизмов.НастройкаСчетовУчета;
	
	РазрешеноРедактирование = Настройки.Блокировка.РазрешеноРедактирование;
	Настройки.Блокировка.РазрешеноРедактирование = Настройки.Период > Настройки.Блокировка.ПоследняяДатаОтражения ИЛИ Настройки.Блокировка.ОтключенаПользователем;
	Если РазрешеноРедактирование = Настройки.Блокировка.РазрешеноРедактирование Тогда
		Возврат;
	КонецЕсли;
		
	Если Настройки.РедактированиеВСписке Тогда
		// Для списка используется условное оформление
		Возврат;
	КонецЕсли;
	
	Если Настройки.Свойство("НастройкаПоОдному") Тогда
		СтруктураИзмерений = НастройкаСчетовУчетаКлиентСервер.ИнициализироватьСтруктуруИзмеренийРегистра();
		СтруктураИзмерений.Вставить("ВидСчета");
		СтруктураИзмерений.Вставить("СчетУчета");
		Для каждого Измерение Из СтруктураИзмерений Цикл
			Форма.Элементы[Измерение.Ключ].ТолькоПросмотр = Не Настройки.Блокировка.РазрешеноРедактирование;
		КонецЦикла;
	Иначе
		
		ТекущийРазделУчета = ?(Настройки.РазбитьПоРазделамЭлементы, НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоНастройкам(Настройки), Неопределено); // Для номенклатуры все настройки счетов выведены в общем на форму, поэтому управление просмотром необходимо установить для всех разделов
		
		Для каждого НастройкаРаздела Из Настройки.НастройкиРазделов Цикл
			
			Если НастройкаРаздела.Ключ <> ТекущийРазделУчета И ТекущийРазделУчета <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			АктуальныеЭлементыНастройки = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(НастройкаРаздела.Значение.ЭлементыНастройки);
			Для каждого ЭлементНастройки Из АктуальныеЭлементыНастройки Цикл
				ТипЭлемента = НастройкаСчетовУчетаКлиентСервер.ПрефиксЭлементаНастройки(ЭлементНастройки);
				ИмяЭлементаНастройки = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНастройкиПоИмениЭлементаФормы(ЭлементНастройки);
				ИмяЭлементаНаФорме = НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНаФорме(Настройки, НастройкаРаздела.Ключ, ИмяЭлементаНастройки, ТипЭлемента);
				ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(Настройки, НастройкаРаздела.Ключ, ИмяЭлементаНастройки, ТипЭлемента);
				ТолькоПросмотр = ЗначениеЗаполнено(Форма[ИмяРеквизита]) И Не Настройки.Блокировка.РазрешеноРедактирование;
				Форма.Элементы[ИмяЭлементаНаФорме].ТолькоПросмотр = ТолькоПросмотр;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияНастроекСчетовУчета(Форма)
	
	Настройка = Форма.КэшДанныхМеханизмов.НастройкаСчетовУчета;
		
	Если Настройка.РедактированиеВСписке Тогда
		// Для списка используется собственное заполнение
		Возврат;
	КонецЕсли;
		
	Если Настройка.Свойство("НастройкаПоОдному") Тогда
		// Для формы регистра сведений нет необходимости в изменении заданных счетов, так как она открыта для конкретной записи регистра
		Возврат;
	КонецЕсли;
	
	СчетаУчета = Новый Массив;
	МассивГруппДляОбновления = Новый Массив;
	
	Для каждого НастройкаРаздела Из Настройка.НастройкиРазделов Цикл
		СчетаРаздела = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(НастройкаРаздела.Значение.ЭлементыНастройки);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчета, СчетаРаздела, Истина);
	КонецЦикла;
	СтруктураЗначений = НастройкаСчетовУчетаСлужебныйВызовСервера.СтруктураЗначенийПоАналитикеУчета(Форма.Объект.Ссылка, СчетаУчета, Настройка.Период);
	Для каждого ЗначениеНастройкиУчета Из СтруктураЗначений Цикл
		ИмяРеквизитаНаФорме = Настройка.ПрефиксПутиКДанным + ЗначениеНастройкиУчета.Ключ;
		Префикс = НастройкаСчетовУчетаКлиентСервер.ПрефиксЭлементаНастройки(ЗначениеНастройкиУчета.Ключ);
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаНаФорме) Тогда
			Если Настройка.СворачиваемыеГруппы И Форма[ИмяРеквизитаНаФорме] <> ЗначениеНастройкиУчета.Значение Тогда
				ИмяЭлемента = СтрЗаменить(ЗначениеНастройкиУчета.Ключ, Префикс + "_", "");
				РазделУчета = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоИмениСчета(ИмяЭлемента);
				ГруппаСчетаУчета = НастройкаСчетовУчетаКлиентСервер.ГруппаСчетаУчета(ИмяЭлемента, РазделУчета, Настройка, Префикс);
				Если ГруппаСчетаУчета <> Неопределено И МассивГруппДляОбновления.Найти(ГруппаСчетаУчета.ИмяГруппы) = Неопределено Тогда
					МассивГруппДляОбновления.Добавить(ГруппаСчетаУчета.ИмяГруппы);
				КонецЕсли;
			КонецЕсли;
			Форма[ИмяРеквизитаНаФорме] = ЗначениеНастройкиУчета.Значение;
			Если Префикс = "Долгосрок" И ЗначениеЗаполнено(ЗначениеНастройкиУчета.Значение) Тогда
				Настройка.ОбщиеРеквизиты.ПоказыватьДолгосрочныеСчета = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Настройка.Свойство("ИзмененныеДанные") И ЗначениеЗаполнено(Настройка.ИзмененныеДанные) Тогда
		Настройка.ИзмененныеДанные = "";
		Форма.Модифицированность = Ложь;
	КонецЕсли;
	Для каждого Группа Из МассивГруппДляОбновления Цикл
		ГруппаНаФорме = Форма.Элементы.Найти(НастройкаСчетовУчетаКлиентСервер.ИмяЭлементаНаФорме(Настройка,, Группа, "Группа"));
		Если ГруппаНаФорме <> Неопределено Тогда
			ГруппаНаФорме.ЗаголовокСвернутогоОтображения = ГруппаНаФорме.Заголовок + НастройкаСчетовУчетаКлиентСервер.ДопПредставлениеГруппы(Форма, Группа);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//-- Локализация

Процедура НастройкаОтраженияОперацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ПараметрыНастройки = ДополнительныеПараметры.ПараметрыНастройки;
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	
	ДанныеНастройкиСчетовУчета = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "НастройкаСчетовУчета");
	ДанныеНастройкиСчетовУчета.НастройкиСчетовУчета.Вставить(Результат.НастройкаСчетовУчета, Результат.ДанныеНастройки);
	
	КонтекстНастройки = НастройкаСчетовУчетаКлиентСервер.ДанныеПоПути(Форма, ПараметрыНастройки.ПутьКДанным, ИдентификаторСтроки);
	Если ТипЗнч(КонтекстНастройки) = Тип("ДанныеФормыКоллекция") Тогда
		Для каждого СтрокаТаблицы Из КонтекстНастройки Цикл
			Если ЗначениеЗаполнено(ПараметрыНастройки.СтатьяАктивовПассивов) Тогда
				СтрокаТаблицы[ПараметрыНастройки.СтатьяАктивовПассивов] = Результат.СтатьяАктивовПассивов;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПараметрыНастройки.АналитикаАктивовПассивов) Тогда
				СтрокаТаблицы[ПараметрыНастройки.АналитикаАктивовПассивов] = Результат.АналитикаАктивовПассивов;
			КонецЕсли;
			СтрокаТаблицы[ПараметрыНастройки.НастройкаСчетовУчета] = Результат.НастройкаСчетовУчета;
			Представление = НастройкаСчетовУчетаКлиентСервер.ПредставлениеНастройкиОтражения(СтрокаТаблицы, ПараметрыНастройки, ДанныеНастройкиСчетовУчета);
			СтрокаТаблицы[ПараметрыНастройки.Представление] = Представление;
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ПараметрыНастройки.СтатьяАктивовПассивов) Тогда
			КонтекстНастройки[ПараметрыНастройки.СтатьяАктивовПассивов] = Результат.СтатьяАктивовПассивов;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыНастройки.АналитикаАктивовПассивов) Тогда
			КонтекстНастройки[ПараметрыНастройки.АналитикаАктивовПассивов] = Результат.АналитикаАктивовПассивов;
		КонецЕсли;
		КонтекстНастройки[ПараметрыНастройки.НастройкаСчетовУчета] = Результат.НастройкаСчетовУчета;
		Представление = НастройкаСчетовУчетаКлиентСервер.ПредставлениеНастройкиОтражения(КонтекстНастройки, ПараметрыНастройки, ДанныеНастройкиСчетовУчета);
		Если ТипЗнч(КонтекстНастройки) = Тип("ДанныеФормыЭлементКоллекции") Тогда
			КонтекстНастройки[ПараметрыНастройки.Представление] = Представление;
		Иначе
			Форма[ПараметрыНастройки.Представление] = Представление;
		КонецЕсли;
	КонецЕсли;
	
	ДоходыИРасходыКлиентСервер.СтатьяАналитикаДоходовРасходовПриИзменении(Форма, ПараметрыНастройки.ПутьКДанным);
	
	Форма.Модифицированность = Истина;
	Форма.ОбновитьОтображениеДанных();
	
	Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьНастройкуСчетовУчета(ДанныеНастройкиСчетовУчета, ПараметрыНастройки, ТаблицаФормы, НоваяСтрока)
	
	Если НоваяСтрока = Неопределено Тогда
		ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	Иначе
		ТекущиеДанные = НоваяСтрока;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[ПараметрыНастройки.НастройкаСчетовУчета]) Тогда
		ДанныеНастройки = ДанныеНастройкиСчетовУчета.НастройкиСчетовУчета[ТекущиеДанные[ПараметрыНастройки.НастройкаСчетовУчета]];
		НоваяНастройка = НастройкаСчетовУчетаСлужебныйВызовСервера.СсылкаНовогоЭлементаНастройкиСчетовУчета();
		ТекущиеДанные[ПараметрыНастройки.НастройкаСчетовУчета] = НоваяНастройка;
		ДанныеНастройкиСчетовУчета.НастройкиСчетовУчета.Вставить(НоваяНастройка, ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ДанныеНастройки));
	КонецЕсли;
	
КонецПроцедуры

//-- НЕ УТ

#КонецОбласти
