#Область ПрограммныйИнтерфейс

// Открытый набор корректировок.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Открытый набор корректировок
Функция ОткрытыйНаборКорректировок(Знач Организация) Экспорт
	
	Возврат Справочники.КорректировкиПрошлыхПериодовНУ.ОткрытыйНаборКорректировок(Организация);
		
КонецФункции

// Открытые наборы корректировок.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Открытые наборы корректировок
Функция ОткрытыеНаборыКорректировок() Экспорт
		
	Возврат Справочники.КорректировкиПрошлыхПериодовНУ.ОткрытыеНаборыКорректировок();
	
КонецФункции

// Актуальные закрытые наборы корректировок.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Открытые наборы корректировок
Функция АктуальныеЗакрытыеНаборыКорректировок() Экспорт
		
	Возврат Справочники.КорректировкиПрошлыхПериодовНУ.АктуальныеЗакрытыеНаборыКорректировок();
	
КонецФункции

// Актуальный закрытый набор корректировок.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Актуальный закрытый набор корректировок
Функция АктуальныйЗакрытыйНаборКорректировок(Знач Организация) Экспорт
		
	Возврат Справочники.КорректировкиПрошлыхПериодовНУ.АктуальныйЗакрытыйНаборКорректировок(Организация);
	
КонецФункции

// Наборы корректировок по дате подписи декларации.
// 
// Параметры:
//  ДатаПодписи - Дата - Дата подписи
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Наборы корректировок по дате подписи декларации
Функция НаборыКорректировокПоДатеПодписиДекларации(Знач ДатаПодписи, Знач Организация) Экспорт
	
	Возврат Справочники.КорректировкиПрошлыхПериодовНУ.НаборыКорректировокПоДатеПодписиДекларации(ДатаПодписи, Организация);
	
КонецФункции

// Последний закрытый набор корректировок по дате подписи декларации.
// 
// Параметры:
//  ДатаПодписи - Дата - Дата подписи
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Последний закрытый набор корректировок по дате подписи декларации
Функция ПоследнийЗакрытыйНаборКорректировокПоДатеПодписиДекларации(Знач ДатаПодписи, Знач Организация) Экспорт
	
	Возврат Справочники.КорректировкиПрошлыхПериодовНУ.ПоследнийЗакрытыйНаборКорректировокПоДатеПодписиДекларации(ДатаПодписи, Организация);
	
КонецФункции

// Состояние сдачи деклараций наборов.
// 
// Параметры:
//  НаборыКорректировок - Массив из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Наборы корректировок
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Состояние сдачи деклараций наборов:
//   * Ключ - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * Значение - Булево - Все отчета набора сданы
Функция СостояниеСдачиДекларацийНаборов(НаборыКорректировок) Экспорт
	
	СостояниеСдачиДекларацийНаборов = Новый Соответствие;
	
	ДекларацииНаборов = ДекларацииНаборов(НаборыКорректировок);
	
	ВсеДекларации = Новый Массив;
	
	Для Каждого ДанныеДекларации Из ДекларацииНаборов Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеДекларации, ДанныеДекларации.Значение);	
	КонецЦикла;
	
	СостояниеСдачиОтчетов = ИнтерфейсыВзаимодействияБРО.СостояниеСдачиОтчетов(ВсеДекларации);
	
	Для Каждого Набор Из НаборыКорректировок Цикл
		СданыВсеДекларацииНабора = Истина;
		
		Декларации = ДекларацииНаборов.Получить(Набор);		
		
		Если Декларации <> Неопределено 
			И ВсеДекларацииНабораСформированы(Декларации) Тогда
			
			Для Каждого Декларация Из Декларации Цикл
				ОтчетСдан = СостояниеСдачиОтчетов.Получить(Декларация);
				
				Если ОтчетСдан = Неопределено 
					ИЛИ НЕ ОтчетСдан Тогда
					СданыВсеДекларацииНабора = Ложь;
				КонецЕсли;	

			КонецЦикла;
			
		Иначе
			СданыВсеДекларацииНабора = Ложь;	
		КонецЕсли;
		
		СостояниеСдачиДекларацийНаборов.Вставить(Набор, СданыВсеДекларацииНабора);
	КонецЦикла;
	
	Возврат СостояниеСдачиДекларацийНаборов;
	
КонецФункции

// Все декларации по набору сданы.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Булево - Все декларации по набору сданы
Функция ВсеДекларацииПоНаборуСданы(Знач НаборКорректировок) Экспорт
	
	ВсеДекларацииПоНаборуСданы = Ложь;
	
	Если НЕ ЗначениеЗаполнено(НаборКорректировок) Тогда
		Возврат ВсеДекларацииПоНаборуСданы;	
	КонецЕсли;
	
	НаборыКорректировок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаборКорректировок);
	СостояниеСдачиДеклараций = СостояниеСдачиДекларацийНаборов(НаборыКорректировок);
	
	ВсеДекларацииСданы = СостояниеСдачиДеклараций.Получить(НаборКорректировок);
	Если ВсеДекларацииСданы <> Неопределено
		И ВсеДекларацииСданы Тогда
		ВсеДекларацииПоНаборуСданы = Истина;
	КонецЕсли;
		
	Возврат ВсеДекларацииПоНаборуСданы;
	
КонецФункции

// Данные деклараций набора корректировок.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные деклараций набора корректировок:
//   * НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - 
//   * КодМестаПредставления - Строка - 
//   * ОтчетныйПериод - Дата - 
//   * Декларация - ДокументСсылка.РегламентированныйОтчет - 
//   * ДекларацияНеАктуальна - Булево - 
Функция ДанныеДекларацийНабораКорректировок(Знач НаборКорректировок) Экспорт

	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ДанныеДекларацийНабораКорректировок(НаборКорректировок);
	
КонецФункции

// Данные деклараций набора корректировок.
// 
// Параметры:
//  НаборыКорректировок - Массив Из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Наборы корректировок
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные деклараций набора корректировок:
//   * НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - 
//   * КодМестаПредставления - Строка - 
//   * ОтчетныйПериод - Дата - 
//   * Декларация - ДокументСсылка.РегламентированныйОтчет - 
//   * ДекларацияНеАктуальна - Булево - 
Функция ДанныеДекларацийНаборовКорректировок(Знач НаборыКорректировок) Экспорт

	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ДанныеДекларацийНаборовКорректировок(НаборыКорректировок);
	
КонецФункции

// Параметры записи декларации.
// 
// Возвращаемое значение:
//  Структура - Параметры записи декларации:
//   * НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - 
//   * КодМестаПредставления - Строка - 
//   * ОтчетныйПериод - Дата -
//   * Декларация - ДокументСсылка.РегламентированныйОтчет - 
//   * ДекларацияНеАктуальна - Булево -  
Функция ПараметрыЗаписиДекларации() Экспорт
	
	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ПараметрыЗаписиДекларации();
		
КонецФункции

// Записать данные декларации по набору.
// 
// Параметры:
//  ПараметрыЗаписиДекларации - Структура - См. ПараметрыЗаписиДекларации()
Процедура ЗаписатьДанныеДекларацииПоНабору(ПараметрыЗаписиДекларации) Экспорт
	
	РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ЗаписатьДанныеДекларацииПоНабору(ПараметрыЗаписиДекларации);
		
КонецПроцедуры

// Очистить декларацию по набору.
// 
// Параметры:
//  ПараметрыЗаписиДекларации - Структура - См. ПараметрыЗаписиДекларации()
Процедура ОчиститьДекларациюПоНабору(ПараметрыЗаписиДекларации) Экспорт
	
	РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ОчиститьДекларациюПоНабору(ПараметрыЗаписиДекларации);
		
КонецПроцедуры

// Данные деклараций по декларации.
// 
// Параметры:
//  Декларация - ДокументСсылка.РегламентированныйОтчет - 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные деклараций по декларации:
//   * НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - 
//   * КодМестаПредставления - Строка - 
//   * ОтчетныйПериод - Дата - 
Функция ДанныеДекларацийПоДекларации(Знач Декларация) Экспорт
	
	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ДанныеДекларацийПоДекларации(Декларация);
	
КонецФункции

// Записать декларацию.
// 
// Параметры:
//  ПараметрыЗаписиДекларации - Структура - См. ПараметрыЗаписиДекларации()
Процедура ЗаписатьДекларацию(ПараметрыЗаписиДекларации) Экспорт
	
	РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ЗаписатьДекларацию(ПараметрыЗаписиДекларации);
		
КонецПроцедуры

// Уточненная декларация.
// 
// Параметры:
//  ПараметрыЗаписиДекларации - Структура - См. ПараметрыЗаписиДекларации()
// 
// Возвращаемое значение:
//  ДокументСсылка.РегламентированныйОтчет - Уточненная декларация
Функция УточненнаяДекларация(ПараметрыЗаписиДекларации) Экспорт
	
	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.УточненнаяДекларация(ПараметрыЗаписиДекларации);
	
КонецФункции

// Декларации наборов.
// 
// Параметры:
//  НаборыКорректировок - Массив из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Наборы корректировок
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Декларации наборов:
//   * Ключ - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * Значение - Массив из ДокументСсылка.РегламентированныйОтчет - 
Функция ДекларацииНаборов(НаборыКорректировок) Экспорт
	
	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ДекларацииНаборов(НаборыКорректировок);
	
КонецФункции

// Данные деклараций наборов корректировок по отбору.
// 
// Параметры:
//  НаборыКорректировок - Массив Из СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Наборы корректировок
//  Отбор - ТаблицаЗначений:
//   * РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - 
//   * КодМестаПредставления - Строка - 
//   * ОтчетныйПериод - Дата - 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные деклараций набора корректировок:
//   * НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - 
//   * РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - 
//   * КодМестаПредставления - Строка - 
//   * ОтчетныйПериод - Дата - 
//   * Декларация - ДокументСсылка.РегламентированныйОтчет - 
//   * ДекларацияНеАктуальна - Булево - 
Функция ДанныеДекларацийНаборовКорректировокПоОтбору(НаборыКорректировок, Отбор) Экспорт
	
	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ДанныеДекларацийНаборовКорректировокПоОтбору(НаборыКорректировок, Отбор);
	
КонецФункции

// Декларации набора.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.РегламентированныйОтчет - Декларации набора
Функция ДекларацииНабора(Знач НаборКорректировок) Экспорт

	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.ДекларацииНабора(НаборКорректировок);
	
КонецФункции

// Количество деклараций к формированию.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Число - Количество деклараций к формированию
Функция КоличествоДекларацийКФормированию(Знач НаборКорректировок) Экспорт
	
	Возврат РегистрыСведений.УточненныеДекларацииПоНалогуНаПрибыль.КоличествоДекларацийКФормированию(НаборКорректировок);
	
КонецФункции

// Параметры последнего набора расчета по дате подписи.
// 
// Возвращаемое значение:
//  Структура - Параметры последнего набора расчета по дате подписи:
// * Организация - СправочникСсылка.Организации - 
// * МесяцРасчета - Дата - 
// * ДатаНачалаПодготовкиДекларации - Дата - 
// * ПолноеИмяРегистраРасчета - Строка - 
Функция ПараметрыПоследнегоНабораРасчетаПоДатеПодписи() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Параметры.Вставить("МесяцРасчета", Дата(1, 1, 1));
	Параметры.Вставить("ДатаНачалаПодготовкиДекларации", Дата(1, 1, 1));
	Параметры.Вставить("ПолноеИмяРегистраРасчета", "");
	
	Возврат Параметры;
	
КонецФункции

// Последний набор расчета по дате подписи декларации.
// 
// Параметры:
//  ПараметрыПоследнегоНабораРасчета - Структура - См. ПараметрыПоследнегоНабораРасчетаПоДатеПодписи()
// 
// Возвращаемое значение:
//  СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Последний набор расчета по дате подписи декларации
Функция ПоследнийНаборРасчетаПоДатеПодписиДекларации(ПараметрыПоследнегоНабораРасчета) Экспорт
	
	ПоследнийНабор = Справочники.КорректировкиПрошлыхПериодовНУ.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПараметрыПоследнегоНабораРасчета.МесяцРасчета));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПараметрыПоследнегоНабораРасчета.МесяцРасчета));
	Запрос.УстановитьПараметр("Организация", ПараметрыПоследнегоНабораРасчета.Организация);
	Запрос.УстановитьПараметр("ДатаНачалаПодготовкиДекларации", КонецДня(ПараметрыПоследнегоНабораРасчета.ДатаНачалаПодготовкиДекларации));
	
	Запрос.Текст = ТекстЗапроса_ПоследнийНаборРасчетаПоДатеПодписиДекларации(ПараметрыПоследнегоНабораРасчета.ПолноеИмяРегистраРасчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийНабор = Выборка.НаборКорректировок;
	КонецЕсли;
	
	Возврат ПоследнийНабор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создать временную таблицу деклараций организации.
// 
// Параметры:
//  МенеджерВТ - МенеджерВременныхТаблиц - Менеджер ВТ
//  Организация - СправочникСсылка.Организации - Организация
//  НачалоПериодаОтчета - Дата - Начало периода отчета
//  КонецПериодаОтчета - Дата - Конец периода отчета
Процедура СоздатьВТ_ДекларацииОрганизации(МенеджерВТ, Организация, НачалоПериодаОтчета, 
	КонецПериодаОтчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапроса_ДекларацииОрганизации();
		
	СтруктураПараметров = РасчетНалогаНаПрибыль.ПараметрыРасчета();    
	СтруктураПараметров.Организация = Организация;
	СтруктураПараметров.НачалоПериода = НачалоПериодаОтчета;
	СтруктураПараметров.КонецПериода = КонецДня(КонецПериодаОтчета);
	
	ТаблицаНалоговойБазы = РасчетНалогаНаПрибыль.СуммыНалоговойБазыВРазрезеВариантовНалогообложения(СтруктураПараметров);
	Запрос.УстановитьПараметр("ТаблицаНалоговойБазы", ТаблицаНалоговойБазы);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонецПериодаОтчета));
	Запрос.УстановитьПараметр("ОсновнаяРегистрацияВНалоговомОргане", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "РегистрацияВНалоговомОргане"));
		
	Запрос.Выполнить();
	
КонецПроцедуры

// Данные корректировки расчетов по налогам.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Структура - Данные корректировки расчетов по налогам:
// * Документ - ДокументСсылка.КорректировкаРасчетовПоНалогам - 
// * СуммаКорректировки - Число - 
Функция ДанныеКорректировкиРасчетовПоНалогам(Знач НаборКорректировок) Экспорт
	
	ДанныеКорректировкиРасчетовПоНалогам = ПустыеДанныеКорректировкиРасчетовПоНалогам();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРасчетовПоНалогам.Ссылка КАК Документ,
	|	КорректировкаРасчетовПоНалогам.СуммаДокумента КАК СуммаКорректировки
	|ИЗ
	|	Документ.КорректировкаРасчетовПоНалогам КАК КорректировкаРасчетовПоНалогам
	|ГДЕ
	|	КорректировкаРасчетовПоНалогам.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЕдиномуНалоговомуСчету.КорректировкаПоНалогуНаПрибыль)
	|	И КорректировкаРасчетовПоНалогам.КорректировкаНУ = &НаборКорректировок
	|	И КорректировкаРасчетовПоНалогам.Проведен";
	
	Запрос.УстановитьПараметр("НаборКорректировок", НаборКорректировок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеКорректировкиРасчетовПоНалогам, Выборка);
	КонецЦикла;
	
	Возврат ДанныеКорректировкиРасчетовПоНалогам;
	
КонецФункции

// Сумма перерасчета налога.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Число - Сумма перерасчета налога
Функция СуммаПерерасчетаНалога(Знач НаборКорректировок) Экспорт
	
	ТаблицаКорректировок = ПолучитьКорректировкиРасчетовПоНалогам(НаборКорректировок);
	Если ТаблицаКорректировок = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	СуммаПерерасчета = ТаблицаКорректировок.Итог("Сумма");
	Возврат СуммаПерерасчета;
	
КонецФункции

// Сальдо счета ЕНС.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Число - Сальдо счета ЕНС
Функция СальдоСчетаЕНС(Знач Организация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЕдиныйНалоговыйСчет),,
	|		Организация = &Организация) КАК ХозрасчетныйОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
КонецФункции

// Документ перерасчета налога.
// 
// Параметры:
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  ДокументСсылка.РегламентнаяОперация - Документ перерасчета налога
Функция ДокументПерерасчетаНалога(Знач НаборКорректировок) Экспорт
	
	ДокументПерерасчетаНалога = Документы.РегламентнаяОперация.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборКорректировок", НаборКорректировок);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегламентнаяОперация.Ссылка
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.Проведен
	|	И РегламентнаяОперация.НаборКорректировок = &НаборКорректировок
	|	И
	|		РегламентнаяОперация.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ПерерасчетНалогаНаПрибыльПрошлыхПериодов)";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ДокументПерерасчетаНалога;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ДокументПерерасчетаНалога = Выборка.Ссылка;
	
	Возврат ДокументПерерасчетаНалога;
	
КонецФункции

// Первый месяц перерасчета налога.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации -Организация
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Дата - Первый месяц перерасчета налога
Функция ПервыйМесяцПерерасчетаНалога(Знач Организация, Знач НаборКорректировок) Экспорт

	Возврат НачалоМесяца(НачалоПересчетаНалогаНаПрибыль(Организация, НаборКорректировок));
		
КонецФункции

// Начало перерасчета налога.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации -Организация
//  НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
// 
// Возвращаемое значение:
//  Дата - Первый месяц перерасчета налога
Функция НачалоПересчетаНалогаНаПрибыль(Знач Организация, Знач НаборКорректировок) Экспорт

	НачалоПересчетаНалогаНаПрибыль = Дата(1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НаборКорректировок", НаборКорректировок);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(КорректировкиНалоговойБазы.Период) КАК Период
	|ИЗ
	|	РегистрБухгалтерии.КорректировкиНалоговойБазы КАК КорректировкиНалоговойБазы
	|ГДЕ
	|	КорректировкиНалоговойБазы.Организация = &Организация
	|	И КорректировкиНалоговойБазы.НаборКорректировок = &НаборКорректировок";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат НачалоПересчетаНалогаНаПрибыль;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.Период) Тогда
		НачалоПересчетаНалогаНаПрибыль = Выборка.Период;
	КонецЕсли;
	
	Возврат НачалоПересчетаНалогаНаПрибыль;
		
КонецФункции

// Процедура переопределяет обработчик подписки на событие "ЗаписьОбъектовРегламентированнойОтчетности*"
//
// Параметры:
//	Ссылка - СправочникСсылка, ДокументСсылка - Ссылка на объект - источник события
//	Отказ  - Булево - Управляет значением параметра "Отказ" вызывающего обработчика подписки на событие
//	СтандартнаяОбработка - Булево - Если СтандартнаяОбработка = Истина, то будут выполнены действия вызывающего обработчика подписки на событие
Процедура ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРеглОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ИсточникОтчета, Вид, ПометкаУдаления");
	
	Если ДанныеРеглОтчета.ИсточникОтчета <> "РегламентированныйОтчетПрибыль"
		ИЛИ НЕ ДанныеРеглОтчета.ПометкаУдаления
		ИЛИ ДанныеРеглОтчета.Вид = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДекларацийПоДекларации = ДанныеДекларацийПоДекларации(Ссылка);
	
	Для Каждого Строка Из ДанныеДекларацийПоДекларации Цикл
		ПараметрыЗаписиДекларации = ПараметрыЗаписиДекларации();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаписиДекларации, Строка);
		ОчиститьДекларациюПоНабору(ПараметрыЗаписиДекларации);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пустые данные корректировки расчетов по налогам.
// 
// Возвращаемое значение:
//  Структура - Пустые данные корректировки расчетов по налогам:
// * Документ - ДокументСсылка.КорректировкаРасчетовПоНалогам - 
// * СуммаКорректировки - Число - 
Функция ПустыеДанныеКорректировкиРасчетовПоНалогам()
	
	ДанныеКорректировкиРасчетовПоНалогам = Новый Структура;
	ДанныеКорректировкиРасчетовПоНалогам.Вставить("Документ", Документы.КорректировкаРасчетовПоНалогам.ПустаяСсылка());
	ДанныеКорректировкиРасчетовПоНалогам.Вставить("СуммаКорректировки", 0);
	
	Возврат ДанныеКорректировкиРасчетовПоНалогам;
	
КонецФункции

Функция ТекстЗапроса_ДекларацииОрганизации()
	
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаНалоговойБазы.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли,
	|	ТаблицаНалоговойБазы.СуммаНУ КАК СуммаОборот,
	|	&Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_НалоговаяБаза
	|ИЗ
	|	&ТаблицаНалоговойБазы КАК ТаблицаНалоговойБазы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВариантНалогообложенияПрибыли
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НалоговаяБаза.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли,
	|	ВТ_НалоговаяБаза.СуммаОборот КАК СуммаОборот,
	|	ВТ_НалоговаяБаза.Организация КАК Организация,
	|	ЕСТЬNULL(Организации.КрупнейшийНалогоплательщик, ЛОЖЬ) КАК КрупнейшийНалогоплательщик,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Организации.КрупнейшийНалогоплательщик, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(Организации.КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане,
	|				ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(Организации.РегистрацияВНалоговомОргане,
	|			ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка))
	|	КОНЕЦ КАК РегистрацияВНалоговомОрганеОрганизации
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	ВТ_НалоговаяБаза КАК ВТ_НалоговаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТ_НалоговаяБаза.Организация = Организации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.РегистрацияВНалоговомОрганеОрганизации КАК РегистрацияВНалоговомОргане,
	|	ТаблицаДанных.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.КрупнейшийНалогоплательщик
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ВариантыНалогообложенияПрибыли.КодМестаПредставления, ""213"") = ""214""
	|					ТОГДА ""213""
	|				ИНАЧЕ ЕСТЬNULL(ВариантыНалогообложенияПрибыли.КодМестаПредставления, ""213"")
	|			КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ВариантыНалогообложенияПрибыли.КодМестаПредставления, ""214"")
	|	КОНЕЦ КАК КодМестаПредставления,
	|	ТаблицаДанных.СуммаОборот КАК НалоговаяБаза,
	|	ИСТИНА КАК ЭтоРегистрацияГоловнойОрганизации
	|ПОМЕСТИТЬ ВТ_ДекларацииОрганизации
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыНалогообложенияПрибыли КАК ВариантыНалогообложенияПрибыли
	|		ПО ТаблицаДанных.ВариантНалогообложенияПрибыли = ВариантыНалогообложенияПрибыли.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетДолейБазыНалогаНаПрибыль.РегистрацияВНалоговомОргане,
	|	ЗНАЧЕНИЕ(Справочник.ВариантыНалогообложенияПрибыли.ПустаяСсылка) КАК ВариантНалогообложенияПрибыли,
	|	ВЫБОР
	|		КОГДА РегистрацииВНалоговомОргане.ДатаСнятияСУчета <> ДАТАВРЕМЯ(1, 1, 1)
	|		И РегистрацииВНалоговомОргане.ДатаСнятияСУчета <= &ДатаОкончания
	|			ТОГДА ""223""
	|		ИНАЧЕ ""220""
	|	КОНЕЦ,
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.РасчетДолейБазыНалогаНаПрибыль КАК РасчетДолейБазыНалогаНаПрибыль
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|		ПО РасчетДолейБазыНалогаНаПрибыль.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
	|ГДЕ
	|	РасчетДолейБазыНалогаНаПрибыль.ПериодРасчета = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ)
	|	И РасчетДолейБазыНалогаНаПрибыль.Организация = &Организация
	|	И РасчетДолейБазыНалогаНаПрибыль.РегистрацияВНалоговомОргане <> &ОсновнаяРегистрацияВНалоговомОргане
	|	И РасчетДолейБазыНалогаНаПрибыль.НаборКорректировок = ЗНАЧЕНИЕ(Справочник.КорректировкиПрошлыхПериодовНУ.ПустаяСсылка)";

	Возврат Текст;
		
КонецФункции

// Получить таблицу корректировок расчетов по налогам.
// 
// Параметры:
//  НаборКорректировок - СправочникССылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
//  ДатаДокумента - Дата - Дата документа, на которую получить КБК налога на прибыль
// 
// Возвращаемое значение:
//  Неопределено, 
//  ТаблицаЗначений:
//     *Сумма - Число - Сумма корректировки налога
//     *ТипНалога - Справочникссылка.ВидыНалоговВзносов - Вид налога на прибыль (Федеральный/Региональный)
//     *СчетУчета - ПланСчетовСсылка.Хозрасчетный - Счет учета расчетов по налогу 68.04.1
//     *Субконто1 - Характеристика.ВидыСубконтоХозрасчетные - Вид платежей в бюджет
//     *Субконто2 - Характеристика.ВидыСубконтоХозрасчетные - Уровень бюджета
//     *Субконто3 - Характеристика.ВидыСубконтоХозрасчетные - Регистрация в налоговом органе
//     *СрокУплаты - Дата - Дата документа корректировки расчетов по налогам
//     *ВидПлатежа - ПеречислениеСсылка.ВидыПлатежейВГосБюджет - Начислено/уплачено или Доначислено/уплачено самостоятельно
//     *КодБК - Строка - КБК налога на прибыль в соответствии с уровнем бюджета и видом платежа

Функция ПолучитьКорректировкиРасчетовПоНалогам(НаборКорректировок, ДатаДокумента = Неопределено)
	
	Если Не ЗначениеЗаполнено(НаборКорректировок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СчетРасчетовСБюджетом", ПланыСчетов.Хозрасчетный.РасчетыСБюджетом);
	Запрос.УстановитьПараметр("НаборКорректировок", НаборКорректировок);
	Запрос.УстановитьПараметр("СрокУплаты", ДатаДокумента);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РегламентнаяОперация.Ссылка
	|ПОМЕСТИТЬ ФильтрПоРегистратору
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ПерерасчетНалогаНаПрибыльПрошлыхПериодов)
	|	И РегламентнаяОперация.НаборКорректировок = &НаборКорректировок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2 = ЗНАЧЕНИЕ(Перечисление.УровниБюджетов.ФедеральныйБюджет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.НалогНаПрибыль_ФедеральныйБюджет)
	|		КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2 = ЗНАЧЕНИЕ(Перечисление.УровниБюджетов.РегиональныйБюджет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.НалогНаПрибыль_РегиональныйБюджет)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТипНалога,
	|	ХозрасчетныйДвиженияССубконто.СчетКт КАК СчетУчета,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК Субконто1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК Субконто2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК Субконто3,
	|	&СрокУплаты КАК СрокУплаты,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК ВидПлатежа,
	|	ВЫРАЗИТЬ("""" КАК Строка(20)) КАК КодБК
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФильтрПоРегистратору КАК ФильтрПоРегистратору
	|		ПО ХозрасчетныйДвиженияССубконто.Регистратор = ФильтрПоРегистратору.Ссылка
	|ГДЕ
	|	ХозрасчетныйДвиженияССубконто.СчетКт = &СчетРасчетовСБюджетом
	|	И ХозрасчетныйДвиженияССубконто.Сумма > 0";
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаКорректировок = Запрос.Выполнить().Выгрузить();
	
	Если ДатаДокумента <> Неопределено Тогда
		СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(ДатаДокумента);

		Для Каждого СтрокаКорректировки Из ТаблицаКорректировок Цикл

			КБКПоВидуНалога = СтатьиДоходовБюджетаРФ.Получить(СтрокаКорректировки.ТипНалога);
			Если Не ЗначениеЗаполнено(КБКПоВидуНалога) Тогда
				СтрокаКорректировки.КодБК = "";
				Продолжить;
			КонецЕсли;

			Если КБКПоВидуНалога.Количество() > 1 Тогда
			// Несколько вариантов КБК, автоматически выбрать невозможно, оставим пустым.
				СтрокаКорректировки.КодБК = "";
				Продолжить;
			Иначе

				ВыборКБК = КБКПоВидуНалога.Получить(0);
				Если ВыборКБК = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				КБК = ВыборКБК.Значение;

				КБКПоВидуПлатежа = "";
				Для Каждого ПодвидДохода Из КБК.ПодвидыДохода Цикл
					Если ПодвидДохода.Значение.ВидПлатежа = ПредопределенноеЗначение(
					"Перечисление.ВидыПлатежейВГосБюджет.Налог") Тогда
						КБКПоВидуПлатежа = КБК.Администратор + КБК.ВидДохода + ПодвидДохода.Ключ + КБК.КОСГУ;
						Прервать;
					КонецЕсли;
				КонецЦикла;

				СтрокаКорректировки.КодБК = КБКПоВидуПлатежа;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаКорректировок;
	
КонецФункции

// Получить таблицу корректировок расчетов по налогам в фоне.
// Предназначена для вызова через длительные операции.
// По набору корректировок и дате документа возвращает таблицу значений для заполнения табличной части Расшифровка налогов документа
// Корректировка расчетов по налогам. Таблица значений записывается во временное хранилище по указанному адресу.
// Параметры:
//  Параметры - Структура - Параметры:
//   *НаборКорректировок - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
//   *ДатаДокумента      - Дата - Дата существующего или нового документа
//  АдресРезультата - Строка - Адрес результата во временном хранилище
Процедура ПолучитьКорректировкиРасчетовПоНалогамВФоне(Параметры, АдресРезультата) Экспорт
	ТаблицаКорректировок = ПолучитьКорректировкиРасчетовПоНалогам(Параметры.НаборКорректировок, Параметры.ДатаДокумента);
	ПоместитьВоВременноеХранилище(ТаблицаКорректировок, АдресРезультата);
КонецПроцедуры

// Создать/перезаполнить корректировку расчетов по налогам в фоне.
// Предназначена для вызова через длительные операции.
// Создает новый и заполняет его или перезаполняет указанный документ корректировки расчетов по налогам по
// указанному набору корректировок.
// Записывает ссылку на перезаполненный или вновь созданный документ Корректировка расчетов по налогам во временное
// хранилище по указанному адресу.
// 
// Параметры:
//  Параметры - Структура - Параметры:
//   *НаборКорректировок    - СправочникСсылка.КорректировкиПрошлыхПериодовНУ - Набор корректировок
//   *ДатаДокумента         - Дата - Дата существующего или нового документа
//   *ДокументКорректировки - ДокументСсылка.КорректировкаРасчетовПоНалогам, Неопределено - Существующий документ или признак необходимости создания нового
//  АдресРезультата - Строка - Адрес результата во временном хранилище
Процедура СоздатьПерезаполнитьКорректировкуРасчетовПоНалогамВФоне(Параметры, АдресРезультата) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаКорректировок = ПолучитьКорректировкиРасчетовПоНалогам(Параметры.НаборКорректировок, Параметры.ДатаДокумента);
	
	Если Параметры.ДокументКорректировки <> Неопределено Тогда
		ДокументОбъектКорректировки = Параметры.ДокументКорректировки.ПолучитьОбъект();
	Иначе
		ДокументОбъектКорректировки = Документы.КорректировкаРасчетовПоНалогам.СоздатьДокумент();
		ДокументОбъектКорректировки.Заполнить(Неопределено);
		ДокументОбъектКорректировки.Дата = Параметры.ДатаДокумента;
		ДокументОбъектКорректировки.КорректировкаНУ = Параметры.НаборКорректировок;
		ДокументОбъектКорректировки.ВидОперации = Перечисления.ВидыОперацийПоЕдиномуНалоговомуСчету.КорректировкаПоНалогуНаПрибыль;
		ДокументОбъектКорректировки.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.НаборКорректировок, "Владелец");
		ДокументОбъектКорректировки.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ДокументОбъектКорректировки.РасшифровкаНалогов.Очистить();
	
	ДокументОбъектКорректировки.РасшифровкаНалогов.Загрузить(ТаблицаКорректировок);
	
	ДокументОбъектКорректировки.Записать(РежимЗаписиДокумента.Проведение);
	
	 ПоместитьВоВременноеХранилище(ДокументОбъектКорректировки.Ссылка, АдресРезультата);
КонецПроцедуры

Функция ВсеДекларацииНабораСформированы(Знач Декларации)
	
	ВсеДекларацииНабораСформированы = Истина;
	
	Для Каждого Декларация Из Декларации Цикл
		Если НЕ ЗначениеЗаполнено(Декларация) Тогда
			ВсеДекларацииНабораСформированы = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеДекларацииНабораСформированы;
	
КонецФункции

Функция ТекстЗапроса_ПоследнийНаборРасчетаПоДатеПодписиДекларации(Знач ПолноеИмяРегистраРасчета)

	Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(КорректировкиПрошлыхПериодовНУ.ДатаНачалаПодготовкиДекларации, ДАТАВРЕМЯ(1, 1, 1)) КАК
	|		ДатаНачалаПодготовкиДекларации,
	|	ДанныеРегистра.НаборКорректировок КАК НаборКорректировок
	|ПОМЕСТИТЬ ВТ_ДатыНаборов
	|ИЗ
	|	&ИмяРегистра КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КорректировкиПрошлыхПериодовНУ КАК КорректировкиПрошлыхПериодовНУ
	|		ПО (ДанныеРегистра.НаборКорректировок = КорректировкиПрошлыхПериодовНУ.Ссылка)
	|ГДЕ
	|	ДанныеРегистра.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеРегистра.Организация = &Организация
	|	И ДанныеРегистра.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ДатыНаборов.ДатаНачалаПодготовкиДекларации) КАК ДатаНачалаПодготовкиДекларации
	|ПОМЕСТИТЬ ВТ_МаксимальнаяДатаЗакрытияНабора
	|ИЗ
	|	ВТ_ДатыНаборов КАК ВТ_ДатыНаборов
	|ГДЕ
	|	ВТ_ДатыНаборов.ДатаНачалаПодготовкиДекларации <= &ДатаНачалаПодготовкиДекларации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ДатыНаборов.НаборКорректировок, ЗНАЧЕНИЕ(Справочник.КорректировкиПрошлыхПериодовНУ.ПустаяСсылка)) КАК
	|		НаборКорректировок
	|ИЗ
	|	ВТ_МаксимальнаяДатаЗакрытияНабора КАК ВТ_МаксимальнаяДатаЗакрытияНабора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыНаборов КАК ВТ_ДатыНаборов
	|		ПО (ВТ_МаксимальнаяДатаЗакрытияНабора.ДатаНачалаПодготовкиДекларации = ВТ_ДатыНаборов.ДатаНачалаПодготовкиДекларации)";
	
	Текст = СтрЗаменить(Текст, "&ИмяРегистра", ПолноеИмяРегистраРасчета);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

