#Область ПрограммныйИнтерфейс

Процедура ПриИзмененииРеквизита(ИмяЭлемента, Форма) Экспорт
	
	ОбщегоНазначенияУТКлиент.ПродолжитьИзменениеРеквизита(Форма, ИмяЭлемента, Истина);
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИмяКоманды, Форма) Экспорт
	
	//++ Локализация
	
	//++ НЕ УТ
	Объект = Форма.Объект; // СправочникОбъект.НаправленияДеятельности -
	Если ИмяКоманды = "СведенияПоКонтрактуСБанковскимСопровождением" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", Форма);
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьИОткрытьСведенияПоКонтрактуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Необходимо записать элемент. Записать?';
													|en = 'Необходимо записать элемент. Записать?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ОткрытьСведенияПоКонтракту(Форма);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ИмяКоманды = "ПлановыеЗатратыПоКонтрактуСКазначейскимСопровождением" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", Форма);
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьИОткрытьПлановыеЗатратыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Необходимо записать элемент. Записать?';
													|en = 'Необходимо записать элемент. Записать?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ОткрытьПлановыеЗатратыПоКонтракту(Форма);
		КонецЕсли;
	
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация
	
	ОбщегоНазначенияУТКлиент.ПродолжитьВыполнениеКоманды(Форма, ИмяКоманды, Ложь);
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

//++ НЕ УТ

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьИОткрытьСведенияПоКонтрактуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Форма = ДополнительныеПараметры.Форма; // ФормаКлиентскогоПриложения - 
	Если Форма.Записать() Тогда
		ОткрытьСведенияПоКонтракту(Форма);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаписатьИОткрытьПлановыеЗатратыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Форма = ДополнительныеПараметры.Форма; // ФормаКлиентскогоПриложения - 
	Если Форма.Записать() Тогда
		ОткрытьПлановыеЗатратыПоКонтракту(Форма);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОткрытьСведенияПоКонтракту(Форма)
	
	Объект = Форма.Объект; // СправочникОбъект.НаправленияДеятельности -
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("НаправлениеДеятельности", Объект.Ссылка));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);

	ОписаниеОповещения = Новый ОписаниеОповещения("СведенияПоКонтрактамГОЗПриЗакрытии", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("РегистрСведений.СведенияПоКонтрактамГОЗ.ФормаСписка", 
		ПараметрыФормы, 
		Форма, 
		, 
		, 
		, 
		ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

Процедура ОткрытьПлановыеЗатратыПоКонтракту(Форма)
	
	Объект = Форма.Объект; // СправочникОбъект.НаправленияДеятельности -
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаправлениеДеятельности", Объект.Ссылка);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПлановыеЗатратыПоКонтрактуПриЗакрытии", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("РегистрСведений.ПлановыеЗатратыПоГосударственнымКонтрактам.ФормаСписка", 
		ПараметрыФормы, 
		Форма, 
		, 
		, 
		, 
		ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

Процедура СведенияПоКонтрактамГОЗПриЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ОбщегоНазначенияУТКлиент.ПродолжитьИзменениеРеквизита(Форма, "СведенияПоКонтрактуСБанковскимСопровождением", Истина);
	
КонецПроцедуры

Процедура ПлановыеЗатратыПоКонтрактуПриЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ОбщегоНазначенияУТКлиент.ПродолжитьИзменениеРеквизита(Форма, "ПлановыеЗатратыПоКонтрактуСКазначейскимСопровождением", Истина);
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ

//-- Локализация
