
#Область ПрограммныйИнтерфейс

#Область ПреобразованиеТиповАналитики

// Возвращает таблицу видов аналитик с колонкой типов
// 
// Возвращаемое значение:
//	ТаблицаЗначений - все доступные виды аналитик. Содержит колонки:
//		*Ссылка - ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов - вид аналитики.
//		*ТипЗначения - ОписаниеТипов - тип вида аналитики.
// 
Функция ТипыВидовВидыАналитик() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	АналитикиСтатейБюджетов.Ссылка,
	|	АналитикиСтатейБюджетов.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.АналитикиСтатейБюджетов КАК АналитикиСтатейБюджетов");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу видов аналитик с колонкой типов
// 
// Возвращаемое значение:
//	Массив из ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов - все доступные виды аналитик.
// 
Функция ВидыАналитик() Экспорт
	
	Возврат ТипыВидовВидыАналитик().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Возвращает таблицу видов аналитик с колонкой типов
// 
// Параметры:
// 	ВидАналитики - ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов, Строка - Ссылка на ПВХ АналитикиСтатейБюджетов или имя (идентификатор) вида аналитики.
//
// Возвращаемое значение:
//	Массив из Тип - Массив значений типа Тип, состоящий из используемых типов.
// 
Функция ТипыВидаАналитики(ВидАналитики) Экспорт
	ТипыВидаАналитики = Новый Массив;
	
	ИскомыйВидАналитики = Неопределено;
	ТипПараметра = ТипЗнч(ВидАналитики);
	// Уточним пустой вид и тип аналитики
	Если ТипПараметра = Тип("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов")
		И ВидАналитики.Пустая() Тогда
		ВидАналитики = Неопределено;
		ТипПараметра = Тип("Неопределено");
	КонецЕсли;
	
	Если ТипПараметра = Тип("Строка") Тогда
		ИД_ВидаАналитики = МониторингЦелевыхПоказателей.СтрокуВУникальныйИдентификатор(ВидАналитики);
		
		ИскомыйВидАналитики = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.ПолучитьСсылку(ИД_ВидаАналитики);
		
		Если НЕ ЗначениеЗаполнено(ИскомыйВидАналитики) Тогда
			ИскомыйВидАналитики = Неопределено;
		КонецЕсли;
	Иначе
		ИскомыйВидАналитики = ВидАналитики;
	КонецЕсли;
	
	// Неопределено - вид аналитики не используется 
	Если Не ТипПараметра = Тип("Неопределено") Тогда
		УстановитьПривилегированныйРежим(Истина);
		ТипЗначения = ИскомыйВидАналитики.ТипЗначения;
		УстановитьПривилегированныйРежим(Ложь);
		ТипыВидаАналитики = ТипЗначения.Типы();
	КонецЕсли;
		
	Возврат ТипыВидаАналитики;
КонецФункции

// Возвращает массив пустых ссылок плана видов характеристик АналитикиСтатейБюджетов и Неопределено.
//
// Возвращаемое значение:
// 	Массив из ЛюбаяСсылка - массив пустых ссылок и неопределено.
//
Функция ПустыеЗначенияАналитики() Экспорт
	Массив = Новый Массив;
	
	Типы = БюджетированиеСервер.ВсеТипыАналитик().Типы();
	
	Для каждого Тип Из Типы Цикл
		ПустаяСсылка = Новый (Тип);
		Массив.Добавить(ПустаяСсылка);
	КонецЦикла;
	
	Массив.Добавить(Неопределено);
	
	Возврат Массив;
КонецФункции

#КонецОбласти

#Область МассивноИспользуемыеКонстанты

// Возвращает значение одноименной опции и используется в массивных, многократно повторяющихся алгоритмах. 
//
// Возвращаемое значение:
//   Булево - значение функциональной опции.
// 
Функция ИспользоватьНесколькоВалют() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют");
КонецФункции

#КонецОбласти 

// Возвращает номер вида аналитики статьи или показателя бюджетов
//
// Параметры:
//  СтатьяПоказатель - СправочникСсылка.СтатьиБюджетов,
//						СправочникСсылка.ПоказателиБюджетов
//  ВидАналитики - ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов - вид аналитики статьи или показателя бюджетов
//
// Возвращаемое значение:
//  Число
//
Функция НомерВидаАналитикиСтатьиПоказателяБюджетов(СтатьяПоказатель, ВидАналитики) Экспорт
	
	ВидыАналитик = БюджетированиеСервер.ВидыАналитик(СтатьяПоказатель);
	
	НомерАналитики = 0;
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	Для Счетчик = 1 По МаксимальноеКоличествоАналитик Цикл
		Если ВидыАналитик[СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВидАналитики%1", Счетчик)]
			= ВидАналитики Тогда
			НомерАналитики = Счетчик;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Формат(НомерАналитики, "ЧГ=0");
	
КонецФункции

// Возвращает соответствие аналитик статьи или показателя бюджетов с аналитиками нефинансового показателя
//
// Параметры:
//  СтатьяПоказатель - СправочникСсылка.СтатьиБюджетов
//						СправочникСсылка.ПоказателиБюджетов
//  НФП - СправочникСсылка.НефинансовыеПоказателиБюджетов
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   *Ключ - Число - номер аналитики статьи (показателя) бюджетов
//   *Значение - Строка - номер аналитики нефинансового показателя
//  Неопределено, если аналитики статьи или показателя бюджетов не соответствуют аналитикам НФП.
//
Функция СоответствиеАналитикСтатьиПоказателяБюджетовСНФП(СтатьяПоказатель, НФП) Экспорт
	
	ВидыАналитикСтатьиПоказателя = БюджетированиеСервер.ВидыАналитик(СтатьяПоказатель);
	ВидыАналитикНФП = БюджетированиеСервер.ВидыАналитик(НФП);
	
	СоответствиеАналитик = Новый Соответствие;
	
	Для Каждого ВидАналитикиНФП Из ВидыАналитикНФП Цикл
		Если Не ЗначениеЗаполнено(ВидАналитикиНФП.Значение) Тогда
			Продолжить;
		КонецЕсли;
		НомерАналитикиНФП = НомерВидаАналитикиСтатьиПоказателяБюджетов(НФП, ВидАналитикиНФП.Значение);
		СоответствиеНайдено = Ложь;
		Для Каждого ВидАналитикиСтатьиПоказателя Из ВидыАналитикСтатьиПоказателя Цикл
			Если ВидАналитикиНФП.Значение = ВидАналитикиСтатьиПоказателя.Значение Тогда
				НомерАналитикиСтатьиПоказателя = НомерВидаАналитикиСтатьиПоказателяБюджетов(СтатьяПоказатель,
					ВидАналитикиСтатьиПоказателя.Значение);
				СоответствиеАналитик.Вставить(НомерАналитикиНФП, НомерАналитикиСтатьиПоказателя);
				СоответствиеНайдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не СоответствиеНайдено Тогда
			СоответствиеАналитик = Неопределено;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоответствиеАналитик;
	
КонецФункции

// Возвращает структуру полей заполнения валюты по виду аналитики.
// 
// Параметры:
// 	ВидАналитики - ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов - Вид аналитики.
// Возвращаемое значение:
// 	Структура - Описание:
// * УчитыватьПоВалюте - Булево - Флаг учета аналитики по валюте.
// * ЗаполнениеВалюты - Булево - Путь к полю валюты.
Функция ПараметрыЗаполненияВалютыВидаАналитики(ВидАналитики) Экспорт
	
	Если ЗначениеЗаполнено(ВидАналитики) Тогда
		ПараметрыЗаполненияВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидАналитики, "УчитыватьПоВалюте, ЗаполнениеВалюты");
	Иначе
		ПараметрыЗаполненияВалюты = Новый Структура("УчитыватьПоВалюте, ЗаполнениеВалюты", Ложь, Ложь);
	КонецЕсли;
	
	Возврат ПараметрыЗаполненияВалюты;
КонецФункции

// Возвращает массив имен балансовых регистров для заданного вида документа
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных - вид документа
//  ТипДанныхУчета - Неопределено, ПеречислениеСсылка.ТипыДанныхУчета - отбор по типу данных учета
//  КонтрольЛимитовБюджетирования - Булево - Истина, если формируется список регистров для контроля лимитов бюджетирования
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - массив балансовых регистров:
//   *Ключ - Строка - имя балансового регистра
//   *Значение - Структура - параметры отражения движений балансового регистра:
//    **ИмяПараметра - Строка - имя параметра
//    **ЗначениеПараметра - Произвольный
//
Функция ОстаточныеФинансовыеРегистрыПоВидуДокумента(ВидДокумента, ТипДанныхУчета = Неопределено,
	КонтрольЛимитовБюджетирования = Ложь) Экспорт
	
	ОстаточныеФинансовыеРегистры = Новый Соответствие;
	
	КоллекцияДвиженийДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ВидДокумента).Движения; // КоллекцияЗначенийСвойстваОбъектаМетаданных
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	
	НастройкиУчета = ФактическиеДанныеБюджетированияПоСтатьямАктивовПассивов.НастройкиФинансовогоУчетаДляБюджетирования();
	НастройкиОтбораСтатей = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиОтбораСтатейАктивовПассивов();
	НастройкиОтбораСтатей.ТипДанныхУчета = ТипДанныхУчета;
	ФинансовыеРегистры = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ИсточникиДанныхОбъектовУчета(
		НастройкиУчета, НастройкиОтбораСтатей);
	
	Для Каждого МетаданныеРегистра Из КоллекцияДвиженийДокумента Цикл
		
		Если Не РегистрыНакопленияМетаданные.Содержит(МетаданныеРегистра) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеРегистра = РегистрыНакопленияМетаданные.РасчетыСКлиентами Тогда
			ИмяРегистраНакопления = РегистрыНакопленияМетаданные.РасчетыСКлиентамиПоСрокам.Имя;
		ИначеЕсли МетаданныеРегистра = РегистрыНакопленияМетаданные.РасчетыСПоставщиками Тогда
			ИмяРегистраНакопления = РегистрыНакопленияМетаданные.РасчетыСПоставщикамиПоСрокам.Имя;
		Иначе
			ИмяРегистраНакопления = МетаданныеРегистра.Имя;
		КонецЕсли;
		
		Если ФинансовыеРегистры.Найти(ИмяРегистраНакопления) <> Неопределено Тогда
			ПараметрыОтраженияДвижений = РегистрыНакопления[ИмяРегистраНакопления].ПараметрыОтраженияДвиженийВФинансовомУчете(
				РегистрыНакопленияМетаданные[ИмяРегистраНакопления]);
			Если КонтрольЛимитовБюджетирования И ТипДанныхУчета <> Неопределено
				И ПараметрыОтраженияДвижений.ТипДанныхУчета <> ТипДанныхУчета Тогда
				Продолжить;
			КонецЕсли;
			ОстаточныеФинансовыеРегистры.Вставить(ИмяРегистраНакопления, ПараметрыОтраженияДвижений);
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьОстаточныеФинансовыеРегистрыПоВидуДокумента(ВидДокумента, ОстаточныеФинансовыеРегистры);
	
	Возврат ОстаточныеФинансовыеРегистры;
	
КонецФункции

// Возвращает настройки ХО, которые необходимо заменить основной настройкой ХО из правила получения факта
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.НастройкиХозяйственныхОпераций
//
Функция НастройкиХозяйственныхОперацийДляЗамены() Экспорт
	
	НастройкиХозяйственныхОпераций = Новый Массив;
	
	НастройкиХозяйственныхОпераций.Добавить(Справочники.НастройкиХозяйственныхОпераций.ВходящийНДСПоПриобретению);
	НастройкиХозяйственныхОпераций.Добавить(Справочники.НастройкиХозяйственныхОпераций.ПустаяСсылка());
	
	Возврат НастройкиХозяйственныхОпераций;
	
КонецФункции

// Возвращает признак наличия правил получения фактических данных по статьям бюджетов с хранением результата расчета правил.
//
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одно правило
//
Функция ИспользуетсяХранимыйФактПоСтатьямБюджетов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаПолученияФактаПоСтатьямБюджетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФактаПоСтатьямБюджетов
	|ГДЕ
	|	ПравилаПолученияФактаПоСтатьямБюджетов.ПромежуточноеКэшированиеРезультатовРаботыПравил
	|	И НЕ ПравилаПолученияФактаПоСтатьямБюджетов.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

// Возвращает массив имен объектов метаданных, связанных с видом аналитики, содержащих табличную часть с указанным именем.
//
// Параметры:
//  ВидАналитики - ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов - вид аналитики
//  ИмяТабличнойЧасти - Строка - имя табличной части
//
// Возвращаемое значение:
//  Массив Из Строка - массив имен объектов метаданных с указанной табличной частью
//
Функция ИменаТиповВидаАналитикиСодержащихТабличнуюЧасть(ВидАналитики, ИмяТабличнойЧасти) Экспорт
	
	ИменаТиповВидаАналитики = Новый Массив;
	
	Для Каждого ТипВидаАналитики Из ТипыВидаАналитики(ВидАналитики) Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипВидаАналитики);
		Если МетаданныеОбъекта <> Неопределено
			И Не Метаданные.Перечисления.Содержит(МетаданныеОбъекта)
			И МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) <> Неопределено Тогда
			ИменаТиповВидаАналитики.Добавить(МетаданныеОбъекта.ПолноеИмя());
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИменаТиповВидаАналитики;
	
КонецФункции

// Возвращает структуру измерений и ресурсов регистра накопления, являющегося источником данных для правила расчета
//
// Параметры:
//  ТипИсточника - ПеречислениеСсылка.ТипыИсточниковПолученияДанныхДляБюджетирования - тип источника данных
//
// Возвращаемое значение:
//  Структура:
//   *ИмяРегистра - Строка - имя регистра
//   *Измерения - Структура - данные по измерениям регистра:
//    **ИмяИзмерения - Массив из Структура:
//     ***Наименование - Строка - синоним измерения
//     ***ТипЗначения - ОписаниеТипов - тип значения измерения
//   *Ресурсы - Структура - данные по ресурсам регистра:
//    **ИмяРесурса - Массив из Структура:
//     ***Наименование - Строка - синоним ресурса
//     ***ТипЗначения - ОписаниеТипов - тип значения ресурса
//
Функция ПараметрыРегистраИсточникаПолученияДанныхДляБюджетирования(ТипИсточника) Экспорт
	
	ПараметрыРегистра = Новый Структура("ИмяРегистра, Измерения, Ресурсы", "", Новый Структура, Новый Структура);
	ИсключаемыеИзмерения = Новый Массив;
	
	МетаданныеРегистровНакопления = Метаданные.РегистрыНакопления;
	
	Если ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ОборотыБюджетов Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ОборотыБюджетов;
		
		ИсключаемыеИзмерения.Добавить("СтатьяБюджетов");
		ИсключаемыеИзмерения.Добавить("ПериодПланирования");
		МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
		Для НомерАналитики = 1 По МаксимальноеКоличествоАналитик Цикл
			ИсключаемыеИзмерения.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Аналитика%1", НомерАналитики));
		КонецЦикла;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПродаж Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыПродаж;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПродажПоКатегориям Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыПродажПоКатегориям;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыЗакупок Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыЗакупок;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатКлиентов Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыОплатКлиентов;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатПоставщикам Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыОплатПоставщикам;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПроизводства Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыПроизводства;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыВнутреннихПотреблений Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыВнутреннихПотреблений;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыСборкиРазборки Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыСборкиРазборки;
		
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОстатков Тогда
		
		МетаданныеРегистра = МетаданныеРегистровНакопления.ПланыОстатков;
		
	Иначе
		
		ШаблонСообщения = НСтр("ru = 'Не удалось определить регистр по переданному типу источника данных (%1)';
								|en = 'Cannot identify the register based on the passed data source type (%1)'");
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ТипИсточника);
		
	КонецЕсли;
	
	ПараметрыРегистра.ИмяРегистра = МетаданныеРегистра.Имя;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Если ИсключаемыеИзмерения.Найти(Измерение.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтруктураДанных = Новый Структура("Наименование, ТипЗначения", Измерение.Синоним, Измерение.Тип);
		ПараметрыРегистра.Измерения.Вставить(Измерение.Имя, СтруктураДанных);
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		СтруктураДанных = Новый Структура("Наименование, ТипЗначения", Ресурс.Синоним, Ресурс.Тип);
		ПараметрыРегистра.Ресурсы.Вставить(Ресурс.Имя, СтруктураДанных);
	КонецЦикла;
	
	Возврат ПараметрыРегистра;
	
КонецФункции

// Возвращает соответствие типов аналитик и выражений заполнения для запросов к регистрам подсистемы планирования
// в зависимости от типа источника получения данных для бюджетирования.
//
// Параметры:
//  ТипИсточника - ПеречислениеСсылка.ТипыИсточниковПолученияДанныхДляБюджетирования - тип источника данных
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   *Ключ - Тип - тип значения аналитики
//   *Значение - Строка - выражения заполнения для запросов
//
Функция ДоступныеТипыАналитикДляТипаИсточникаПланирования(ТипИсточника) Экспорт
	
	ДоступныеТипыАналитик = Новый Соответствие;
	
	ПараметрыРегистра = ПараметрыРегистраИсточникаПолученияДанныхДляБюджетирования(ТипИсточника);
	ИзмеренияРегистра = ПараметрыРегистра.Измерения;
	
	Если ИзмеренияРегистра.Свойство("Номенклатура") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Номенклатура"), "ИмяТаблицы.Номенклатура");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ВидыНоменклатуры"), "ИмяТаблицы.Номенклатура.ВидНоменклатуры");
		ДоступныеТипыАналитик.Вставить(Тип("ПеречислениеСсылка.ТипыНоменклатуры"), "ИмяТаблицы.Номенклатура.ТипНоменклатуры");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Марки"), "ИмяТаблицы.Номенклатура.Марка");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Производители"), "ИмяТаблицы.Номенклатура.Производитель");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СезонныеГруппы"), "ИмяТаблицы.Номенклатура.СезоннаяГруппа");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ЦеновыеГруппы"), "ИмяТаблицы.Номенклатура.ЦеноваяГруппа");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ТоварныеКатегории"), "ИмяТаблицы.Номенклатура.ТоварнаяКатегория");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры"), 
			"ИмяТаблицы.Номенклатура.ГруппаАналитическогоУчета");
	ИначеЕсли ИзмеренияРегистра.Свойство("ТоварнаяКатегория") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ТоварныеКатегории"), "ИмяТаблицы.ТоварнаяКатегория");
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ВидыНоменклатуры"), "ИмяТаблицы.ТоварнаяКатегория.Владелец");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Характеристика") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), "ИмяТаблицы.Характеристика");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Подразделение") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СтруктураПредприятия"), "ИмяТаблицы.Подразделение");
	ИначеЕсли ИзмеренияРегистра.Свойство("Склад") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СтруктураПредприятия"), "ИмяТаблицы.Склад.Подразделение");
	ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатКлиентов
		Или ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатПоставщикам Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СтруктураПредприятия"), "ИмяТаблицы.План.Подразделение");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Склад") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Склады"), "ИмяТаблицы.Склад");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Назначение") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.НаправленияДеятельности"), "ИмяТаблицы.Назначение.НаправлениеДеятельности");
		ДоступныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказКлиента"), "ИмяТаблицы.Назначение.Заказ");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Организация") Тогда
		Если ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПродаж
			Или ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыЗакупок Тогда
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Организации"),
				"ВЫБОР
				|	КОГДА ИмяТаблицы.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|		ТОГДА ИмяТаблицы.Соглашение.Организация
				|	ИНАЧЕ ИмяТаблицы.Организация
				|КОНЕЦ");
		ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатКлиентов
			Или ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатПоставщикам Тогда
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Организации"),
				"ВЫБОР
				|	КОГДА ИмяТаблицы.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|		ТОГДА ИмяТаблицы.План.Соглашение.Организация
				|	ИНАЧЕ ИмяТаблицы.Организация
				|КОНЕЦ");
		Иначе
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Организации"), "ИмяТаблицы.Организация");
		КонецЕсли;
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Партнер") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Партнеры"), "ИмяТаблицы.Партнер");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") Тогда
			Если ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПродаж Тогда
				ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Контрагенты"),
					"ВЫБОР
					|	КОГДА ИмяТаблицы.ПланПродаж.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
					|		ТОГДА ИмяТаблицы.Соглашение.Контрагент
					|	ИНАЧЕ ИмяТаблицы.ПланПродаж.Договор.Контрагент
					|КОНЕЦ");
				ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), "ИмяТаблицы.ПланПродаж.Договор");
			ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатКлиентов Тогда
				ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Контрагенты"), "ИмяТаблицы.Договор.Контрагент");
				ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), "ИмяТаблицы.Договор");
			ИначеЕсли ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыЗакупок Тогда
				ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Контрагенты"), "ИмяТаблицы.Соглашение.Контрагент");
			КонецЕсли;
		Иначе
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Контрагенты"), "ВтКонтрагентыПартнеров.Контрагент");
		КонецЕсли;
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Соглашение") Тогда
		Если ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыЗакупок Тогда
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СоглашенияСПоставщиками"), "ИмяТаблицы.Соглашение");
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"), "ИмяТаблицы.Соглашение.СтатьяДвиженияДенежныхСредств");
		Иначе
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СоглашенияСКлиентами"), "ИмяТаблицы.Соглашение");
			ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"),
				"ВЫБОР
				|	КОГДА ИмяТаблицы.ПланПродаж.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				|		ТОГДА ИмяТаблицы.Соглашение.СтатьяДвиженияДенежныхСредств
				|	ИНАЧЕ ИмяТаблицы.ПланПродаж.Договор.СтатьяДвиженияДенежныхСредств
				|КОНЕЦ");
		КонецЕсли;
	ИначеЕсли ИзмеренияРегистра.Свойство("Договор") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"), "ИмяТаблицы.Договор.СтатьяДвиженияДенежныхСредств");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("ФорматМагазина") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.ФорматыМагазинов"), "ИмяТаблицы.ФорматМагазина");
	КонецЕсли;
	
	Если ИзмеренияРегистра.Свойство("Менеджер") Тогда
		ДоступныеТипыАналитик.Вставить(Тип("СправочникСсылка.Пользователи"), "ИмяТаблицы.Менеджер");
	КонецЕсли;
	
	ИмяИзмеренияРегистра = ИмяИзмеренияДокументаПланированияПоТипуИсточника(ТипИсточника);
	
	Если ЗначениеЗаполнено(ИмяИзмеренияРегистра) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул КАК Идентификатор,
		|	ТИПЗНАЧЕНИЯ(ДополнительныеРеквизиты.Значение) КАК Тип
		|ИЗ
		|	Документ.ПланПродаж.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ДополнительныеРеквизиты.Значение) = ТИП(Справочник.ЗначенияСвойствОбъектов)
		|				ТОГДА ИСТИНА В
		|						(ВЫБРАТЬ ПЕРВЫЕ 1
		|							ИСТИНА
		|						ИЗ
		|							ПланВидовХарактеристик.АналитикиСтатейБюджетов КАК АналитикиСтатейБюджетов
		|						ГДЕ
		|							ДополнительныеРеквизиты.Свойство = АналитикиСтатейБюджетов.ДополнительноеСвойство)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		Если ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатПоставщикам Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланПродаж", "ПланЗакупок");
		ИначеЕсли ТипИсточника <> Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатКлиентов Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланПродаж", ИмяИзмеренияРегистра);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ДоступныеТипыАналитик.Получить(Выборка.Тип) = Неопределено Тогда
				ДоступныеТипыАналитик.Вставить(Выборка.Тип, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1_%2.Значение", ИмяИзмеренияРегистра, Выборка.Идентификатор));
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат ДоступныеТипыАналитик;
	
КонецФункции

// Возвращает имя измерения документа планирования регистра подсистемы планирования по типу источника правила расчета
//
// Параметры:
//  ТипИсточника - ПеречислениеСсылка.ТипыИсточниковПолученияДанныхДляБюджетирования
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяИзмеренияДокументаПланированияПоТипуИсточника(ТипИсточника) Экспорт
	
	ИменаИзмеренийРегистров = Новый Соответствие;
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыВнутреннихПотреблений, "ПланВнутреннихПотреблений");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыЗакупок, "ПланЗакупок");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатКлиентов, "План");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОплатПоставщикам, "План");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыОстатков, "ПланОстатков");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПродаж, "ПланПродаж");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПродажПоКатегориям, "ПланПродажПоКатегориям");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыПроизводства, "ПланПроизводства");
	ИменаИзмеренийРегистров.Вставить(
		Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ПланыСборкиРазборки, "ПланСборкиРазборки");
		
	Возврат ИменаИзмеренийРегистров.Получить(ТипИсточника);
	
КонецФункции

// Возвращает соответствие аналитик статьи, показателя или НФП с типом источника получения данных подсистемы планирования
//
// Параметры:
// 
//  ТипИсточника - ПеречислениеСсылка.ТипыИсточниковПолученияДанныхДляБюджетирования
//  СтатьяПоказательНФП - СправочникСсылка.СтатьиБюджетов,
//						СправочникСсылка.ПоказателиБюджетов,
//						СправочникСсылка.НефинансовыеПоказателиБюджетов - статья, показатель или НФП.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   *Ключ - Строка - строковое выражение вида аналитики статьи, показателя или НФП
//   *Значение - Строка - выражения заполнения из источника данных подсистемы планирования
//  Неопределено, если аналитики статьи или показателя бюджетов не соответствуют аналитикам НФП.
//
Функция СоответствиеАналитикСтатьиПоказателяНФПСТипомИсточникаПланирования(ТипИсточника, СтатьяПоказательНФП) Экспорт
	
	СоответствиеАналитик = Новый Соответствие;
	
	ВидыАналитикСтатьиПоказателя = БюджетированиеСервер.ВидыАналитик(СтатьяПоказательНФП, Истина);
	ДоступныеТипыАналитик = ДоступныеТипыАналитикДляТипаИсточникаПланирования(ТипИсточника);
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	
	Для НомерАналитики = 1 По МаксимальноеКоличествоАналитик Цикл
		
		ИмяВыраженияВидАналитики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВидАналитики%1", НомерАналитики);
		Если Не ЗначениеЗаполнено(ВидыАналитикСтатьиПоказателя[ИмяВыраженияВидАналитики]) Тогда
			Продолжить;
		КонецЕсли;
		ИмяВыраженияВидАналитикиТипЗначения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ВидАналитики%1ТипЗначения", НомерАналитики);
		ТипыВидаАналитики = ВидыАналитикСтатьиПоказателя[ИмяВыраженияВидАналитикиТипЗначения].Типы();
		
		СоответствиеНайдено = Ложь;
		
		Для Каждого Тип Из ТипыВидаАналитики Цикл
			Если ДоступныеТипыАналитик[Тип] <> Неопределено Тогда
				СоответствиеАналитик.Вставить(НомерАналитики, ДоступныеТипыАналитик[Тип]);
				СоответствиеНайдено = Истина;
			КонецЕсли;
			Если СоответствиеНайдено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СоответствиеНайдено Тогда
			СоответствиеАналитик = Неопределено;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СоответствиеАналитик;
	
КонецФункции

// Возвращает соответствие между выражениями и псевдонимами измерений бюджетирования для запросов по типу источника.
//
// Параметры:
//  ТипИсточника - ПеречислениеСсылка.ТипыИсточниковПолученияДанныхДляБюджетирования - тип источника
//
// Возвращаемое значение:
//  Структура:
//   *Сценарий - Строка - выражение измерения Сценарий
//   *Организация - Строка - выражение измерения Организация
//   *Подразделение - Строка - выражение измерения Подразделение
//   *ВалютаХранения - Строка - выражение измерения ВалютаХранения
//   *Статус - Строка - выражение измерения Статус
//
Функция СоответствиеИзмеренийБюджетированияПоТипуИсточника(ТипИсточника) Экспорт
	
	ИзмеренияБюджетирования = "Сценарий, Организация, Подразделение, ВалютаХранения, Статус";
	ИзмеренияПоТипуИсточника = Новый Структура(ИзмеренияБюджетирования);
	
	ДоступныеТипыАналитик = ДоступныеТипыАналитикДляТипаИсточникаПланирования(ТипИсточника);
	
	Для Каждого Измерение Из ИзмеренияПоТипуИсточника Цикл
		Если ТипИсточника = Перечисления.ТипыИсточниковПолученияДанныхДляБюджетирования.ОборотыБюджетов Тогда
			Если Измерение.Ключ = "ВалютаХранения" Тогда
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = "Валюта";
			Иначе
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = Измерение.Ключ;
			КонецЕсли;
		Иначе
			Если Измерение.Ключ = "Сценарий" Тогда
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = "Сценарий.СценарийБюджетирования";
			ИначеЕсли Измерение.Ключ = "Организация" Тогда
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = ДоступныеТипыАналитик.Получить(Тип("СправочникСсылка.Организации"));
			ИначеЕсли Измерение.Ключ = "Подразделение" Тогда
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = ДоступныеТипыАналитик.Получить(Тип("СправочникСсылка.СтруктураПредприятия"));
			ИначеЕсли Измерение.Ключ = "ВалютаХранения" Тогда
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = "Сценарий.Валюта";
			Иначе
				ИзмеренияПоТипуИсточника[Измерение.Ключ] = Измерение.Ключ;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИзмеренияПоТипуИсточника;
	
КонецФункции

// Возвращает соответствие типов аналитик бюджетирования, связанные с измерением Организация
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   *Ключ - Тип - тип значения аналитики
//   *Значение - Строка - выражения заполнения для запросов
//
Функция ТипыАналитикСвязанныеСОрганизацией() Экспорт
	
	СвязанныеТипыАналитик = Новый Соответствие;
	
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.ДоговорыАренды"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.ДоговорыМеждуОрганизациями"), "Организация");
	
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.БанковскиеСчетаОрганизаций"), "Владелец");
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.Кассы"), "Владелец");
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.КассыККМ"), "Владелец");
	
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.ОбъектыРасчетов"), "Организация");
	
	СвязанныеТипыАналитик.Вставить(Тип("СправочникСсылка.Сотрудники"), "ГоловнаяОрганизация");
	
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказПоставщику"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказКлиента"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказМатериаловВПроизводство"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказНаПеремещение"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказНаСборку"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказПереработчику2_5"), "Организация");
	//++ НЕ УТКА
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство2_2"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказДавальца2_5"), "Организация");
	СвязанныеТипыАналитик.Вставить(Тип("ДокументСсылка.ЗаказНаРемонт"), "Организация");
	//-- НЕ УТКА
	
	Возврат СвязанныеТипыАналитик;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьОстаточныеФинансовыеРегистрыПоВидуДокумента(ВидДокумента, ОстаточныеФинансовыеРегистры)
	
	НастройкиУчета = ФактическиеДанныеБюджетированияПоСтатьямАктивовПассивов.НастройкиФинансовогоУчетаДляБюджетирования();
	ФинансовыеРегистры = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ИсточникиДанныхОбъектовУчета(НастройкиУчета);
	
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	КоллекцияДвиженийДокумента = Новый Массив;
	
	Если ВидДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.РасчетКурсовыхРазниц) Тогда
		КоллекцияДвиженийДокумента.Добавить(РегистрыНакопленияМетаданные.РасчетыСПоставщикамиПоСрокам);
		КоллекцияДвиженийДокумента.Добавить(РегистрыНакопленияМетаданные.РасчетыСКлиентамиПоСрокам);
	КонецЕсли;
	
	Для Каждого МетаданныеРегистра Из КоллекцияДвиженийДокумента Цикл // -ОбъектМетаданных-
		
		Если ФинансовыеРегистры.Найти(МетаданныеРегистра.Имя) <> Неопределено Тогда
			ОстаточныеФинансовыеРегистры.Вставить(
				МетаданныеРегистра.Имя,
				РегистрыНакопления[МетаданныеРегистра.Имя].ПараметрыОтраженияДвиженийВФинансовомУчете(МетаданныеРегистра));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
