#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список типов налогообложения операций продажи и/или закупки, доступных в конфигурации.
//
// Параметры:
// 	Продажи - Булево - Признак необходимости вернуть типы налогообложения продажи
// 	Закупки - Булево - Признак необходимости вернуть типы налогообложения закупки
// 	РаздельныйУчет - Булево - Признак необходимости дополнить видами деятельности НДС
//
// Возвращаемое значение:
// 	СписокЗначений из ПеречислениеСсылка.ТипыНалогообложенияНДС
//
Функция ПрименяемыеТипыНалогообложенияНДС(Продажи, Закупки, РаздельныйУчет) Экспорт
	
	Возврат УчетНДСУПСлужебный.ПрименяемыеТипыНалогообложенияНДС(Продажи, Закупки, РаздельныйУчет)
	
КонецФункции

// Возвращает значение ставки НДС по умолчанию.
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить ставку НДС.
//  Дата - Дата - Дата, на которую необходимо получить ставку НДС по умолчанию.
//  РасчетнаяСтавка - Булево - указывает необходимость получения расчетной ставки НДС X/(100 + X).
//
// Возвращаемое значение:
//  СправочникСсылка.СтавкиНДС - значение ставки НДС.
//
Функция СтавкаНДСПоУмолчанию(Организация, Дата, РасчетнаяСтавка = Ложь) Экспорт
	
	Возврат УчетНДСУП.СтавкаНДСПоУмолчанию(Организация, Дата, РасчетнаяСтавка);
	
КонецФункции

// Возвращает список незначащих ставок НДС (процент = 0)
//
// Возвращаемое значение:
//  СписокЗначений из СправочникСсылка.СтавкиНДС - Список ставок НДС с процентной ставкой 0
//
Функция СписокНезначащихСтавок() Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК Ссылка,
		|	СтавкиНДС.Представление КАК Представление
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокЗначений.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Представление);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

// Функция возвращает процент НДС.
//
// Параметры:
//	СтавкаНДС - СправочникСсылка.СтавкиНДС - Значение ставки НДС.
//
// Возвращаемое значение:
//	Число - Процент НДС.
//
Функция ЗначениеСтавкиНДС(СтавкаНДС) Экспорт
	
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат 0;
	КонецЕсли;

	Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтавкаНДС, "Ставка");
		
	//++ Локализация
	
	ИначеЕсли ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
			Возврат 10;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
			Возврат 18;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
			Возврат 20;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122") Тогда
			Возврат 22;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105") Тогда
			Возврат 5;
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7")
			Или СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107") Тогда
			Возврат 7;
		КонецЕсли;
		
	//-- Локализация
		
	КонецЕсли;
	
КонецФункции

// Получает ставку НДС по типу налогообложения из табличной части справочника СтавкиНДС
// 
// Параметры:
//  ТипНалогообложенияНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - Данные для поиска ставки НДС.
//  Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить ставку НДС
//  Дата -  Дата - Дата, на которую необходимо получить ставку НДС.
// 
// Возвращаемое значение:
//  СправочникСсылка.СтавкиНДС -
//
Функция СтавкаНДСПоТипуНалогообложения(ТипНалогообложенияНДС, Организация, Дата) Экспорт
	
	Если ТипНалогообложенияНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС Тогда
		Возврат Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Если ТипНалогообложенияНДС = Перечисления.ТипыНалогообложенияНДС.РеверсивноеОбложениеНДС Тогда
		Возврат Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеСтавкиНДС.СтавкаНДС
	|ИЗ
	|	РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Дата, Страна = &Страна) КАК ОсновныеСтавкиНДС
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка КАК СтавкаНДС,
	|	1 КАК Приоритет
	|ИЗ
	|	Справочник.СтавкиНДС.ТипыНалогообложенияНДС КАК СтавкиНДСТипыНалогообложенияНДС
	|ГДЕ
	|	СтавкиНДСТипыНалогообложенияНДС.ТипНалогообложенияНДС = &ТипНалогообложенияНДС
	|	И СтавкиНДСТипыНалогообложенияНДС.Ссылка.Страна = &Страна
	|	И (СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода <= &Дата
	|			ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (КОНЕЦПЕРИОДА(СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода, ДЕНЬ) >= &Дата
	|			ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтавкиНДСТипыНалогообложенияНДС.Ссылка,
	|	2
	|ИЗ
	|	Справочник.СтавкиНДС.ТипыНалогообложенияНДС КАК СтавкиНДСТипыНалогообложенияНДС
	|ГДЕ
	|	СтавкиНДСТипыНалогообложенияНДС.ТипНалогообложенияНДС = &ТипНалогообложенияНДС
	|	И СтавкиНДСТипыНалогообложенияНДС.Ссылка.Страна = &ПустаяСтрана
	|	И (СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода <= &Дата
	|			ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (КОНЕЦПЕРИОДА(СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода, ДЕНЬ) >= &Дата
	|			ИЛИ СтавкиНДСТипыНалогообложенияНДС.Ссылка.КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ТипНалогообложенияНДС", ТипНалогообложенияНДС);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Страна", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(Организация));
	Запрос.УстановитьПараметр("ПустаяСтрана", Справочники.СтраныМира.ПустаяСсылка());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если ТипНалогообложенияНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС Тогда
		ВыборкаОсновнойСтавкиНДС = РезультатыЗапроса[0].Выбрать();
		Если ВыборкаОсновнойСтавкиНДС.Следующий() Тогда
			Если ЗначениеЗаполнено(ВыборкаОсновнойСтавкиНДС.СтавкаНДС) Тогда
				Возврат ВыборкаОсновнойСтавкиНДС.СтавкаНДС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.СтавкаНДС;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Справочники.СтавкиНДС.ПустаяСсылка();
	
КонецФункции

// Возвращает настройки учета НДС.
//
// Возвращаемое значение:
// 	 Структура - Параметры учета НДС:
// 	   * ИспользоватьУчетНДС - Булево, Произвольный - Значение опции использования учета НДС
// 	   * ОсновноеНалогообложениеНДСПродажи - ПеречислениеСсылка.ТипыНалогообложенияНДС - Основное налогообложение НДС организации.
// 	   * ОсновнойВидДеятельностиНДСЗакупки - ПеречислениеСсылка.ТипыНалогообложенияНДС - Основной вид деятельности НДС закупки товаров.
// 	   * РаздельныйУчетНДС - Булево, Произвольный - Признак наличия в ИБ организаций, использующих раздельный учет НДС по налогообложению.
// 	   * ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС - Булево - Признак использования Раздела 7 в декларации.
// 	   * ПродажиНаЭкспорт - Булево, Произвольный - Применения экспортных операций.
// 	   * ЭкспортНесырьевыхТоваров - Булево - Признак того, что осуществляется экспорт несырьевых товаров.
// 	   * ЭкспортСырьевыхТоваровУслуг - Булево - Признак того, что осуществляется экспорт сырьевых товаров, работ или услуг. 
// 	   * ДатаРазделенияЭкспорта - Дата - Дата начала применения 150-ФЗ, разделение экспорта на сырьевой и несырьевой.
// 	   * ПродажаТоваровОблагаемыхНДСУПокупателя - Булево - Признак того, что осуществляется реализация товаров с обратным обложением НДС. 
// 	                                                       При реализации таких товаров НДС начисляет не продавец, а покупатель (налоговый агент).
// 	   * ПокупкаТоваровОблагаемыхНДСУПокупателя - Булево - Признак того, что осуществляется приобретение товаров с обратным обложением НДС. 
// 	   * ДатаНачалаУчетаНДСПоНаправлениямДеятельности - Дата - Дата, начиная с которой ведется учет входящего НДС в разрезе направлений деятельности.
// 	   * ДатаОтраженияВозвратовКорректировочнымиСФ - Дата - Дата, начиная с которой возвраты отражаются КСФ.
// 	   * РеверсивноеОбложениеНДС - Булево, Произвольный - примение операций с реверсивным обложением НДС
//
Функция НастройкиУчета() Экспорт
	
	НастройкиУчета = Новый Структура();
	НастройкиУчета.Вставить("ИспользоватьУчетНДС", ПолучитьФункциональнуюОпцию("ИспользоватьУчетНДС"));
	НастройкиУчета.Вставить("ОсновноеНалогообложениеНДСПродажи",
		?(ПолучитьФункциональнуюОпцию("ИспользоватьУчетНДС"),
			Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
			Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС));
	НастройкиУчета.Вставить("ОсновнойВидДеятельностиНДСЗакупки",
		?(ПолучитьФункциональнуюОпцию("ИспользоватьУчетНДС"),
			Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
			Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС));
	НастройкиУчета.Вставить("РаздельныйУчетНДС",                             ПолучитьФункциональнуюОпцию("ИспользоватьРаздельныйУчетПоНалогообложению"));
	НастройкиУчета.Вставить("ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС", Ложь);
	НастройкиУчета.Вставить("ПродажиНаЭкспорт",                              ПолучитьФункциональнуюОпцию("ИспользоватьПродажиНаЭкспорт"));
	НастройкиУчета.Вставить("ЭкспортНесырьевыхТоваров",                      Ложь);
	НастройкиУчета.Вставить("ЭкспортСырьевыхТоваровУслуг",                   Ложь);
	НастройкиУчета.Вставить("ДатаРазделенияЭкспорта",                        Дата(1,1,1));
	НастройкиУчета.Вставить("ПродажаТоваровОблагаемыхНДСУПокупателя",        Ложь);
	НастройкиУчета.Вставить("ПокупкаТоваровОблагаемыхНДСУПокупателя",        Ложь);
	НастройкиУчета.Вставить("ДатаНачалаУчетаНДСПоНаправлениямДеятельности",  Дата(1,1,1));
	НастройкиУчета.Вставить("ДатаОтраженияВозвратовКорректировочнымиСФ",     Дата(1,1,1));
	НастройкиУчета.Вставить("РеверсивноеОбложениеНДС", ПолучитьФункциональнуюОпцию("ИспользоватьРеверсивноеОбложениеНДС"));
	
	УчетНДСЛокализация.ДополнитьНастройкиУчета(НастройкиУчета);
	
	Возврат НастройкиУчета;
	
КонецФункции

// Заполнняет список выбора типов номенклатуры товаров для отчета "Статистическая форма учета перемещения товаров".
//
// Параметры:
//  СписокВыбора - СписокЗначений из СправочникСсылка,Строка - список выбора типов номенклатуры.
//
Процедура СписокВыбораТиповНоменклатурыСтатформыФТС(СписокВыбора) Экспорт
	
	//++ Локализация
	
	//++ НЕ УТ
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров") Тогда
		СписокВыбора.Добавить(Тип("СправочникСсылка.НоменклатураКонтрагентов"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИмпортныеЗакупки")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьПродажиНаЭкспорт") Тогда
		СписокВыбора.Добавить(Тип("СправочникСсылка.КлассификаторТНВЭД"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_2")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_4") Тогда
		СписокВыбора.Добавить(Тип("СправочникСсылка.ОбъектыЭксплуатации"));
		СписокВыбора.Добавить(Тип("СправочникСсылка.ДоговорыАренды"));
	КонецЕсли;
	
	СписокВыбора.Добавить(Тип("Строка"));
	
	//-- НЕ УТ
	
	//-- Локализация
	
КонецПроцедуры

// Функция возвращает структуру запрашиваемых параметров товара для заполнения вручном режиме
// отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура,СправочникСсылка.НоменклатураКонтрагентов,СправочникСсылка.КлассификаторТНВЭД
//               - СправочникСсылка.ОбъектыЭксплуатации,СправочникСсылка.ДоговорыАренды - выбранная номенлатура для заполнения отчета.
//
// Возвращаемое значение:
//  - Структура - значенение показателей отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС
Функция ХарактеристикиТовараДляОтчетаСтатистикаФормаУчетаПеремещенияТоваровТС(Номенклатура) Экспорт
	
	ПередаваемыеПоказатели = Новый Структура;
	
	//++ Локализация
	
	//++ НЕ УТ
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ОбъектыЭксплуатации")
		ИЛИ ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ДоговорыАренды") Тогда
		
		ПередаваемыеПоказатели.Вставить("Наименование",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Наименование"));
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Параметры.Вставить("Ссылка", Номенклатура);
		
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА Номенклатура.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
			|			ТОГДА Номенклатура.ПроизводительИмпортерКонтрагент
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			|	КОНЕЦ КАК Производитель,
			|	ВЫБОР
			|		КОГДА Номенклатура.НаименованиеПолное = """"
			|			ТОГДА Номенклатура.Наименование
			|		ИНАЧЕ Номенклатура.НаименованиеПолное
			|	КОНЕЦ КАК Наименование,
			|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения, """") КАК ЕдиницаИзмеренияТНВЭД,
			|	ЕСТЬNULL(КлассификаторТНВЭД.Код, """") КАК КодТНВЭД,
			|	Номенклатура.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
			|	ЕСТЬNULL(СтраныМира.Наименование, """") КАК СтранаТовараНаименование,
			|	ЕСТЬNULL(СтраныМира.КодАльфа2, """") КАК СтранаТовараКод
			|ПОМЕСТИТЬ НоменклатураПроизводитель
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
			|		ПО Номенклатура.КодТНВЭД = КлассификаторТНВЭД.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
			|		ПО Номенклатура.СтранаПроисхождения = СтраныМира.Ссылка
			|ГДЕ
			|	Номенклатура.Ссылка = &Ссылка
			|	И НЕ Номенклатура.ПометкаУдаления
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Производитель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураПроизводитель.Наименование КАК Наименование,
			|	НоменклатураПроизводитель.КодТНВЭД КАК КодТНВЭД,
			|	НоменклатураПроизводитель.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
			|	НоменклатураПроизводитель.СтранаТовараНаименование КАК СтранаТовараНаименование,
			|	НоменклатураПроизводитель.СтранаТовараКод КАК СтранаТовараКод,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(Контрагенты.НаименованиеПолное, """") = """"
			|			ТОГДА ЕСТЬNULL(Контрагенты.Наименование, """")
			|		ИНАЧЕ ЕСТЬNULL(Контрагенты.НаименованиеПолное, """")
			|	КОНЕЦ КАК Производитель,
			|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ПроизводительИНН,
			|	ЕСТЬNULL(Контрагенты.КПП, """") КАК ПроизводительКПП,
			|	ЕСТЬNULL(Контрагенты.РегистрационныйНомер, """") КАК ПроизводительОГРН,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") = 166
			|			ТОГДА """"
			|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """")
			|	КОНЕЦ КАК ЕдИзмТовараКод,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") = ""166""
			|			ТОГДА """"
			|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Наименование, """")
			|	КОНЕЦ КАК ЕдИзмТовараКратко,
			|	ВЫБОР
			|		КОГДА НоменклатураПроизводитель.ПрослеживаемыйТовар
			|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК КодЕдИзмеренияТНВЭДПрослеживаемогоТовара,
			|	ВЫБОР
			|		КОГДА НоменклатураПроизводитель.ПрослеживаемыйТовар
			|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Наименование, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ЕдИзмеренияТНВЭДПрослеживаемогоТовара
			|ИЗ
			|	НоменклатураПроизводитель КАК НоменклатураПроизводитель
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО НоменклатураПроизводитель.Производитель = Контрагенты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|		ПО НоменклатураПроизводитель.ЕдиницаИзмеренияТНВЭД = УпаковкиЕдиницыИзмерения.Ссылка";
			
		ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.НоменклатураКонтрагентов") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Производитель,
			|	ВЫБОР
			|		КОГДА НоменклатураКонтрагентов.НаименованиеПолное = """"
			|			ТОГДА НоменклатураКонтрагентов.Наименование
			|		ИНАЧЕ НоменклатураКонтрагентов.НаименованиеПолное
			|	КОНЕЦ КАК Наименование,
			|	НоменклатураКонтрагентов.КодТНВЭД КАК КодТНВЭД,
			|	ЕСТЬNULL(КлассификаторТНВЭД.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.Пустаяссылка)) КАК СсылкаТНВЭД,
			|	НоменклатураКонтрагентов.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
			|	ЕСТЬNULL(СтраныМира.Наименование, """") КАК СтранаТовараНаименование,
			|	ЕСТЬNULL(СтраныМира.КодАльфа2, """") КАК СтранаТовараКод,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") = ""166""
			|			ТОГДА """"
			|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """")
			|	КОНЕЦ КАК ЕдИзмТовараКод,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") = ""166""
			|			ТОГДА """"
			|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Наименование, """")
			|	КОНЕЦ КАК ЕдИзмТовараКратко,
			|	ВЫБОР
			|		КОГДА НоменклатураКонтрагентов.ПрослеживаемыйТовар
			|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК КодЕдИзмеренияТНВЭДПрослеживаемогоТовара,
			|	ВЫБОР
			|		КОГДА НоменклатураКонтрагентов.ПрослеживаемыйТовар
			|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Наименование, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ЕдИзмеренияТНВЭДПрослеживаемогоТовара
			|ИЗ
			|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
			|		ПО НоменклатураКонтрагентов.КодТНВЭД = КлассификаторТНВЭД.Код
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
			|		ПО НоменклатураКонтрагентов.СтранаПроисхожденияКод = СтраныМира.Код
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|		ПО (КлассификаторТНВЭД.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка)
			|ГДЕ
			|	НоменклатураКонтрагентов.Ссылка = &Ссылка
			|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления";
			
		ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.КлассификаторТНВЭД") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КлассификаторТНВЭД.Наименование КАК Наименование,
			|	КлассификаторТНВЭД.Код КАК КодТНВЭД,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") = ""166""
			|			ТОГДА """"
			|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """")
			|	КОНЕЦ КАК ЕдИзмТовараКод,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") = ""166""
			|			ТОГДА """"
			|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Наименование, """")
			|	КОНЕЦ КАК ЕдИзмТовараКратко,
			|	КлассификаторТНВЭД.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
			|	ВЫБОР
			|		КОГДА КлассификаторТНВЭД.ПрослеживаемыйТовар
			|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК КодЕдИзмеренияТНВЭДПрослеживаемогоТовара,
			|	ВЫБОР
			|		КОГДА КлассификаторТНВЭД.ПрослеживаемыйТовар
			|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Наименование, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ЕдИзмеренияТНВЭДПрослеживаемогоТовара
			|ИЗ
			|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|		ПО КлассификаторТНВЭД.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
			|ГДЕ
			|	КлассификаторТНВЭД.Ссылка = &Ссылка
			|	И НЕ КлассификаторТНВЭД.ПометкаУдаления";
			
		Иначе
			
			ПередаваемыеПоказатели.Вставить("Наименование", "");
			
			Текст = СтрШаблон(НСтр("ru = 'Не определен выбор характеристик товара для типа %1.';
									|en = 'Не определен выбор характеристик товара для типа %1.'"), ТипЗнч(Номенклатура));
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
			Возврат ПередаваемыеПоказатели;
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ПередаваемыеПоказатели.Вставить("Наименование", Выборка.Наименование);
			ПередаваемыеПоказатели.Вставить("КодТНВЭД", Выборка.КодТНВЭД);
			ПередаваемыеПоказатели.Вставить("ЕдИзмТовараКод", Выборка.ЕдИзмТовараКод);
			ПередаваемыеПоказатели.Вставить("ЕдИзмТовараКратко", Выборка.ЕдИзмТовараКратко);
			ПередаваемыеПоказатели.Вставить("КодЕдИзмеренияТНВЭДПрослеживаемогоТовара", Выборка.КодЕдИзмеренияТНВЭДПрослеживаемогоТовара);
			ПередаваемыеПоказатели.Вставить("ЕдИзмеренияТНВЭДПрослеживаемогоТовара", Выборка.ЕдИзмеренияТНВЭДПрослеживаемогоТовара);
			
			Если (ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура")
					ИЛИ ТипЗнч(Номенклатура) = Тип("СправочникСсылка.НоменклатураКонтрагентов")) Тогда
					
				ПередаваемыеПоказатели.Вставить("СтранаТовараНаименование", Выборка.СтранаТовараНаименование);
				ПередаваемыеПоказатели.Вставить("СтранаТовараКод", Выборка.СтранаТовараКод);
				
				Если ЗначениеЗаполнено(Выборка.Производитель) Тогда
				
					ПередаваемыеПоказатели.Вставить("Производитель", Выборка.Производитель);
					ПередаваемыеПоказатели.Вставить("ПроизводительИНН", Выборка.ПроизводительИНН);
					
					МакетПоказателей =
						Отчеты.РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС.ПолучитьМакет("СпискиАналогЛК");
					СписокОКАТО = МакетПоказателей.ПолучитьОбласть("ОКАТО");
					ПередаваемыеПоказатели.Вставить("ПроизводительОКАТО",
						РегламентированнаяОтчетностьУП.ОКАТОПоИНН(Выборка.ПроизводительИНН,
																	РегламентированнаяОтчетностьУП.РегионыОКАТО(СписокОКАТО)));
					
					ПередаваемыеПоказатели.Вставить("ПроизводительКПП", Выборка.ПроизводительКПП);
					ПередаваемыеПоказатели.Вставить("ПроизводительОГРН", Выборка.ПроизводительОГРН);
				
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.ПрослеживаемыйТовар Тогда
				
				ПередаваемыеПоказатели.Вставить("Графа19Соответствие", Новый Соответствие);
					
					// Значение взято из макета СпискиАналогЛК области Гр19 отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС
					ПередаваемыеПоказатели.Графа19Соответствие.Вставить("08", НСтр("ru = 'товары, подлежащие прослеживаемости';
																					|en = 'товары, подлежащие прослеживаемости'"));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//-- НЕ УТ
	
	//-- Локализация
	
	Возврат ПередаваемыеПоказатели;
	
КонецФункции

#КонецОбласти
