#Область СлужебныйПрограммныйИнтерфейс

// Возвращает таблицу факта по результатам корреспонденции балансовых регистров.
//
// Параметры:
//  ДокументыКОбработке - ТаблицаЗначений
//  ПараметрыПолученияФакта - Структура - параметры получения факта, в том числе:
//   * Период - СтандартныйПериод
//  ТаблицаПравил - ТаблицаЗначений:
//   * ИсточникДанныхХО - СправочникСсылка.НастройкиХозяйственныхОпераций
//   * ТипДанныхУчетаПриход - ПеречислениеСсылка.ТипыДанныхУчета
//   * ТипДанныхУчетаРасход - ПеречислениеСсылка.ТипыДанныхУчета
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. БюджетированиеСервер.ШаблонТаблицыФактаПоСтатьямБюджетов
//
Функция ФактическиеДанныеОперативногоУчета(ДокументыКОбработке, ПараметрыПолученияФакта, ТаблицаПравил) Экспорт
	
	ТаблицаФактическихДанных = БюджетированиеСервер.ШаблонТаблицыФактаПоСтатьямБюджетов(ПараметрыПолученияФакта);
	ТаблицаФактическихДанных.Колонки.Добавить("Правило", Новый ОписаниеТипов("СправочникСсылка.ПравилаПолученияФактаПоСтатьямБюджетов"));
	
	БалансовыеФинансовыеРегистры = Новый Соответствие();
	ВидыДокументов = ДокументыКОбработке.Скопировать(, "ВидДокумента");
	ВидыДокументов.Свернуть("ВидДокумента");
	
	Для Каждого СтрокаДокумент Из ВидыДокументов Цикл
		БалансовыеРегистрыПоВидуДокумента = БюджетированиеПовтИсп.ОстаточныеФинансовыеРегистрыПоВидуДокумента(
			СтрокаДокумент.ВидДокумента);
		Для Каждого КлючИЗначение Из БалансовыеРегистрыПоВидуДокумента Цикл
			БалансовыеФинансовыеРегистры.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЦикла;
	
	Если БалансовыеФинансовыеРегистры.Количество() = 0 Тогда
		Возврат ТаблицаФактическихДанных;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ПараметрыЗапроса = ПараметрыЗапросаДанныхФинансовыхРегистров(ДокументыКОбработке, ПараметрыПолученияФакта, ТаблицаПравил);
	Запрос = ЗапросДанныхФинансовыхРегистров(ПараметрыЗапроса, МенеджерВременныхТаблиц);
	ТекстыЗапросов = Новый Массив();
	
	ТекстыЗапросовЗаписейРегистров = ТекстыЗапросовЗаписейРегистров(Запрос, БалансовыеФинансовыеРегистры);
	
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаписейДляКорреспонденций(ТекстыЗапросовЗаписейРегистров));
	
	СформироватьКорреспонденцииЗаписейРегистров(Запрос, ТекстыЗапросов);
	
	РаспределитьНебалансовыеРесурсыКорреспонденций(Запрос, ТекстыЗапросов);
	
	ПроверитьОшибкиКорреспонденций(Запрос, ТекстыЗапросов, ДокументыКОбработке, ТаблицаПравил);
	
	СформироватьТаблицуДвиженийСлужебныхОбъектовУчета(Запрос, ТекстыЗапросов);
	
	СформироватьТаблицуСложныхКорреспонденций(Запрос, ТекстыЗапросов);
	
	СформироватьПравилаПолученияФактаКорреспонденций(Запрос, ТекстыЗапросов);
	
	ПрименитьПравилаПолученияФактаККорреспонденциям(Запрос, ТекстыЗапросов, ТекстыЗапросовЗаписейРегистров);
	
	СформироватьПравилаЗаполненияАналитики(Запрос, ТекстыЗапросов);
	
	ОпределитьРесурсыИсточниковДанных(Запрос, ТекстыЗапросов);
	
	СформироватьЗапросыАналитикиКорреспонденций(Запрос, ТекстыЗапросов, ТекстыЗапросовЗаписейРегистров);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.УничтожитьВременныеТаблицы(Запрос, ТекстыЗапросов);
	
	ЗаполнитьТаблицуФактическихДанных(Запрос, ТекстыЗапросов, ТаблицаФактическихДанных,
		ДокументыКОбработке, ПараметрыПолученияФакта, ТаблицаПравил);
	
	Возврат ТаблицаФактическихДанных;
	
КонецФункции

// Возвращает структуру настроек финансового учета со значениями свойств, принятыми в подсистеме бюджетирования.
// 
// Возвращаемое значение:
//  см. ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиФинансовогоУчета
//
Функция НастройкиФинансовогоУчетаДляБюджетирования() Экспорт
	
	НастройкиУчета = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиФинансовогоУчета();
	
	НастройкиУчета.ФормированиеКорреспонденций = Истина;
	НастройкиУчета.УчетНесобственныхЦенностей = Ложь;
	НастройкиУчета.УчетВыручкиБезНДС = Истина;
	НастройкиУчета.УчетВыручкиСНДС = Ложь;
	
	Возврат НастройкиУчета;
	
КонецФункции

// Возвращает описание всех доступных полей источника данных статьи активов и пассивов.
// 
// Параметры:
//  ИмяРегистра - Строка - Имя регистра - источника данных
//  ПараметрыОтраженияВУчете - См. ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете
//  
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Описание:
//   * Ключ - Строка - Имя измерения регистра, имя реквизита измерения - ключа аналитики или имя реквизита регистра
//   * Значение - см. ФинансовыйУчетПоДаннымБалансовыхРегистров.ОписаниеПоляИсточникаДанных
//
Функция ОписаниеПолейФинансовогоРегистра(ИмяРегистра, ПараметрыОтраженияВУчете = Неопределено) Экспорт
	
	Если ПараметрыОтраженияВУчете = Неопределено Тогда
		МенеджерРегистра = РегистрыНакопления[ИмяРегистра]; // РегистрНакопленияМенеджер -
		ПараметрыОтраженияВУчете = МенеджерРегистра.ПараметрыОтраженияДвиженийВФинансовомУчете(); // см. ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете
	КонецЕсли;
	
	ОписаниеПолей = Новый Структура();
	
	Для Каждого ОписаниеИзмерения Из ПараметрыОтраженияВУчете.ОписаниеИзмерений Цикл
		ОписаниеПолей.Вставить(ОписаниеИзмерения.Ключ, ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеИзмерения.Значение));
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ПараметрыОтраженияВУчете.ОписаниеРеквизитов Цикл
		ОписаниеПолей.Вставить(ОписаниеРеквизита.Ключ, ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеРеквизита.Значение));
	КонецЦикла;
	
	Возврат ОписаниеПолей;
	
КонецФункции

// Возвращает имя значения ресурсов по переданному имени группы ресурсов
// 
// Параметры:
//  ГруппаРесурсов - Строка - Имя группы ресурсов источника данных
//  
// Возвращаемое значение:
//  Строка - Имя значения ресурсов
//
Функция ИмяЗначенияГруппыРесурсов(ГруппаРесурсов) Экспорт
	
	МенеджерСтатьиАктивовПассивов = ПланыВидовХарактеристик.СтатьиАктивовПассивов;
	
	Если ГруппаРесурсов = МенеджерСтатьиАктивовПассивов.ГруппаРесурсовУправленческогоУчета() Тогда
		ИмяЗначения = "СуммаУпр";
	ИначеЕсли ГруппаРесурсов = МенеджерСтатьиАктивовПассивов.ГруппаРесурсовРегламентированногоУчета() Тогда
		ИмяЗначения = "СуммаРегл";
	ИначеЕсли ГруппаРесурсов = МенеджерСтатьиАктивовПассивов.ГруппаРесурсовВалютногоУчета() Тогда
		ИмяЗначения = "СуммаВал";
	ИначеЕсли ГруппаРесурсов = МенеджерСтатьиАктивовПассивов.ГруппаРесурсовКоличественногоУчета() Тогда
		ИмяЗначения = "Количество";
	Иначе
		ИмяЗначения = "";
	КонецЕсли;
	
	Возврат ИмяЗначения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыЗапросаДанныхФинансовыхРегистров(ДокументыКОбработке, ПараметрыПолученияФакта, ТаблицаПравил)
	
	ПараметрыЗапроса = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыЗапросаДанныхФинансовыхРегистров();
	ПараметрыЗапроса.Вставить("ДокументыКОбработке", ДокументыКОбработке);
	
	Если ТипЗнч(ПараметрыПолученияФакта.Период) = Тип("СтандартныйПериод") Тогда
		Если ПараметрыЗапроса.ДатаНачала > '00010101' Тогда
			ПараметрыЗапроса.ДатаНачала = ПараметрыПолученияФакта.Период.ДатаНачала;
		КонецЕсли;
		Если ПараметрыЗапроса.ДатаНачала > '00010101' Тогда
			ПараметрыЗапроса.ДатаОкончания = ПараметрыПолученияФакта.Период.ДатаОкончания;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("ПравилаОперативногоУчета", ТаблицаПравил.Скопировать(
		Новый Структура("РазделИсточникаДанных,ТипПравила",
			Перечисления.РазделыИсточниковДанныхБюджетирования.ОперативныйУчет,
			Перечисления.ТипПравилаПолученияФактическихДанныхБюджетирования.ФактическиеДанные),
		"Правило"));
	
	ОписаниеПоказателя = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НовоеОписаниеПоказателя();
	Для Каждого КлючИЗначение Из ОписаниеПоказателя Цикл
		ГруппаРесурсов = КлючИЗначение.Ключ;
		ПараметрыЗапроса.Вставить(ГруппаРесурсов, ГруппаРесурсов);
	КонецЦикла;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ЗапросДанныхФинансовыхРегистров(ПараметрыЗапроса, МенеджерВременныхТаблиц)
	
	Запрос = ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗапросДанныхФинансовыхРегистров(ПараметрыЗапроса, МенеджерВременныхТаблиц);
	
	КвалификаторыКоличества = Метаданные.РегистрыНакопления.ФактическиеДанныеБюджетирования.Ресурсы.Количество.Тип.КвалификаторыЧисла;
	Запрос.Параметры.ДлинаКоличества = КвалификаторыКоличества.Разрядность;
	Запрос.Параметры.ТочностьКоличества = КвалификаторыКоличества.РазрядностьДробнойЧасти;
	
	Запрос.УстановитьПараметр("ВсеВыраженияАналитики", Новый Соответствие());
	
	Запрос.УстановитьПараметр("ИмяПапкиПолей", ИсточникиДанныхСервер.ИмяПапкиПолейИсточникаДанных());
	Запрос.УстановитьПараметр("ИмяПапкиКорПолей", ИсточникиДанныхСервер.ИмяПапкиПолейКорИсточникаДанных());
	Запрос.УстановитьПараметр("ПрефиксИменКорПолей", ИсточникиДанныхСервер.ПрефиксИменПолейКорИсточникаДанных());
	Запрос.УстановитьПараметр("ДлинаИмениПапкиПолей", СтрДлина(Запрос.Параметры.ИмяПапкиПолей));
	Запрос.УстановитьПараметр("ДлинаИмениПапкиКорПолей", СтрДлина(Запрос.Параметры.ИмяПапкиКорПолей));
	Запрос.УстановитьПараметр("ДлинаПрефиксаИменКорПолей", СтрДлина(Запрос.Параметры.ПрефиксИменКорПолей));
	
	ТекстыЗапросов = Новый Массив();
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДокументыКОбработке.Документ КАК Регистратор,
	|	ДокументыКОбработке.ВидДокумента КАК ВидДокумента
	|ПОМЕСТИТЬ втДокументыКОбработке
	|ИЗ
	|	&ДокументыКОбработке КАК ДокументыКОбработке
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДокументыКОбработке.Регистратор,
	|	ДокументыКОбработке.ВидДокумента КАК ВидДокумента
	|ПОМЕСТИТЬ втПорцияДокументов
	|ИЗ
	|	втДокументыКОбработке КАК ДокументыКОбработке
	|ГДЕ
	|	НЕ ДокументыКОбработке.Регистратор ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|	И НЕ ДокументыКОбработке.Регистратор ССЫЛКА Документ.ЗаявкаНаКомандировку
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаОперативногоУчета.Правило КАК Ссылка
	|ПОМЕСТИТЬ втПравилаОперативногоУчета
	|ИЗ
	|	&ПравилаОперативногоУчета КАК ПравилаОперативногоУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДокументыКОбработке");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результат = Запрос.ВыполнитьПакет();
	
	Запрос.Параметры.Удалить("ДокументыКОбработке");
	Запрос.Параметры.Удалить("ПравилаОперативногоУчета");
	
	Возврат Запрос;
	
КонецФункции

Функция ШаблонТекстаЗапросаЗаписейРегистра()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&ИмяРегистра КАК ИмяРегистра,
	|	&ОбъектУчета КАК ОбъектУчета,
	|	&ЭтоДебет КАК ЭтоДебет,
	|	&ЭтоКредит КАК ЭтоКредит,
	|	&ЭтоСторно КАК ЭтоСторно,
	|	&ПоляВыбораАналитики,
	|	&Регистратор КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&НастройкаХозОперации КАК НастройкаХозОперации,
	|	&ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	&ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	&ВидДеятельностиНДС КАК СлужебныйВидДеятельностиНДС,
	|	&Валюта КАК Валюта,
	|	&СуммаУпр КАК СуммаУпр,
	|	&СуммаРегл КАК СуммаРегл,
	|	&СуммаВал КАК СуммаВал,
	|	&Количество КАК Количество,
	|	&РесурсыИсточникаДанных,
	|	&РеквизитСторно КАК РеквизитСторно
	|ИЗ
	|	&ИсточникДанных
	|ГДЕ
	|	&Активность
	|	И &ИдентификаторФинЗаписи <> &ИдентификаторНеиспользуемойФинЗаписи
	|	И &УсловиеПериод
	|	И &УсловиеРегистратор
	|	И &УсловиеОрганизация
	|	И &УсловиеЗначенияРесурсов
	|	И &УсловиеУдаляемыеДокументы
	|	И &УсловиеДополнительныйОтбор
	|СГРУППИРОВАТЬ ПО
	|	&Период,
	|	&ОбъектУчета,
	|	&ЭтоДебет,
	|	&ЭтоКредит,
	|	&ЭтоСторно,
	|	&ГруппаПолейАналитики,
	|	&Регистратор,
	|	&Организация,
	|	&Подразделение,
	|	&НаправлениеДеятельности,
	|	&НастройкаХозОперации,
	|	&ИдентификаторФинЗаписи,
	|	&ИдентификаторСтроки,
	|	&Валюта,
	|	&РеквизитСторно
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстыЗапросовЗаписейРегистров(Запрос, БалансовыеФинансовыеРегистры)
	
	ТекстыЗапросовРегистров = Новый Структура();
	
	НастройкиУчета = НастройкиФинансовогоУчетаДляБюджетирования();
	ОбъектыФинансовогоУчета = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ОписаниеОбъектовФинансовогоУчета(НастройкиУчета);
	
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	РегистрыВосстановленияРасчетовПоСторно = ФинансовыйУчетПоДаннымБалансовыхРегистров.РегистрыВосстановленияРасчетовПоСторно();
	
	Для Каждого КлючИЗначение Из БалансовыеФинансовыеРегистры Цикл
		ИмяИсточникаДанных = КлючИЗначение.Ключ;
		ПараметрыОтраженияДвижений = КлючИЗначение.Значение;
		
		МетаданныеРегистра = РегистрыНакопленияМетаданные[ИмяИсточникаДанных];
		
		СтруктураПоиска = Новый Структура("ИсточникДанных", ИмяИсточникаДанных);
		СтрокиОбъектовУчета = ОбъектыФинансовогоУчета.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиОбъектовУчета.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если РегистрыВосстановленияРасчетовПоСторно.Найти(ИмяИсточникаДанных) <> Неопределено Тогда
			Запрос.Параметры.ВосстановитьРасчетыПоСторно = Истина;
		КонецЕсли;
		
		ФинансовыйУчетПоДаннымБалансовыхРегистров.УточнитьПараметрыОтраженияДвижений(
			ПараметрыОтраженияДвижений, МетаданныеРегистра);
		
		КлючиРесурсовОбъектовУчета = Новый Соответствие();
		
		Для Каждого СтрокаОбъектаУчета Из СтрокиОбъектовУчета Цикл
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗаполнитьКорИсточникиДанных(Запрос.Параметры, СтрокаОбъектаУчета);
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗаполнитьОбъектыПоПризнакамУчетаНДС(Запрос.Параметры, СтрокаОбъектаУчета);
			
			ФинансовыйУчетПоДаннымБалансовыхРегистров.УточнитьСвойстваОбъектаУчета(
				ПараметрыОтраженияДвижений, СтрокаОбъектаУчета, МетаданныеРегистра);
			
			КлючРесурсов = ФинансовыйУчетПоДаннымБалансовыхРегистров.КлючРесурсовОбъектаУчета(СтрокаОбъектаУчета);
			
			Если КлючиРесурсовОбъектовУчета[КлючРесурсов] = Неопределено Тогда
				КлючиРесурсовОбъектовУчета.Вставить(КлючРесурсов, Новый Массив());
			КонецЕсли;
			
			КлючиРесурсовОбъектовУчета[КлючРесурсов].Добавить(СтрокаОбъектаУчета);
		КонецЦикла;
		
		Если КлючиРесурсовОбъектовУчета.Количество() = 1 Тогда
			ПоляВыборкиОбъектаУчета = СтрокиВыборкиПолейПоОписаниюОбъектаУчета(
				СтрокиОбъектовУчета, ПараметрыОтраженияДвижений, Запрос.Параметры);
		Иначе
			ПоляВыборкиОбъектаУчета = Новый Структура();
			ИменаПолейВыборки = ПоляВыборкиПоОписаниюОбъектаУчета();
			
			Для Каждого ИмяПоля Из ИменаПолейВыборки Цикл
				ПоляВыборкиОбъектаУчета.Вставить(ИмяПоля, Новый Соответствие());
			КонецЦикла;
			
			НомерКлючаРесурсов = 0;
			
			Для Каждого КлючРесурсовОбъектовУчета Из КлючиРесурсовОбъектовУчета Цикл
				НомерКлючаРесурсов = НомерКлючаРесурсов + 1;
				СтрокиОбъектовУчета = КлючРесурсовОбъектовУчета.Значение;
				
				СтрокиВыборкиПолейОбъектаУчета = СтрокиВыборкиПолейПоОписаниюОбъектаУчета(
					СтрокиОбъектовУчета, ПараметрыОтраженияДвижений, Запрос.Параметры);
				
				Для Каждого КлючИЗначение Из ПоляВыборкиОбъектаУчета Цикл
					СтрокаВыборкиПоля = СтрокиВыборкиПолейОбъектаУчета[КлючИЗначение.Ключ];
					Если КлючИЗначение.Значение[СтрокаВыборкиПоля] = Неопределено Тогда
						КлючИЗначение.Значение.Вставить(СтрокаВыборкиПоля, Новый Массив());
					КонецЕсли;
					КлючИЗначение.Значение[СтрокаВыборкиПоля].Добавить(НомерКлючаРесурсов);
				КонецЦикла;
			КонецЦикла;
			
			Для Каждого ИмяПоля Из ИменаПолейВыборки Цикл
				СтрокиВыборкиПоля = ПоляВыборкиОбъектаУчета[ИмяПоля];
				ПолеВыборкиОбъектаУчета = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыбораЗначенияПоля(СтрокиВыборкиПоля);
				ПоляВыборкиОбъектаУчета.Вставить(ИмяПоля, ПолеВыборкиОбъектаУчета);
			КонецЦикла;
		КонецЕсли;
		
		Если ПустаяСтрока(ПараметрыОтраженияДвижений.ПутьКДаннымПодразделение) Тогда
			Подразделение = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Справочники.СтруктураПредприятия.ПустаяСсылка());
		Иначе
			Подразделение = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ПараметрыОтраженияДвижений.ПутьКДаннымПодразделение);
		КонецЕсли;
		
		Если ПустаяСтрока(ПараметрыОтраженияДвижений.ПутьКДаннымВалюта) Тогда
			Валюта = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Справочники.Валюты.ПустаяСсылка());
		Иначе
			Валюта = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ПараметрыОтраженияДвижений.ПутьКДаннымВалюта);
		КонецЕсли;
		
		Если ПустаяСтрока(ПараметрыОтраженияДвижений.ПутьКДаннымСторно) Тогда
			РеквизитСторно = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Ложь);
		Иначе
			РеквизитСторно = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ПараметрыОтраженияДвижений.ПутьКДаннымСторно);
		КонецЕсли;
		
		ИмяРегистра = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(ИмяИсточникаДанных);
		Регистратор = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ПараметрыОтраженияДвижений.ПутьКДаннымРегистратор);
		Организация = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ПараметрыОтраженияДвижений.ПутьКДаннымОрганизация);
		
		Если ПустаяСтрока(ПараметрыОтраженияДвижений.ПутьКДаннымВидДеятельностиНДС) Тогда
			ВидДеятельностиНДС = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка());
		Иначе
			ВидДеятельностиНДС = СтрШаблон("МАКСИМУМ(%1)",
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ПараметрыОтраженияДвижений.ПутьКДаннымВидДеятельностиНДС));
		КонецЕсли;
		
		Если ФинансовыйУчетПоДаннымБалансовыхРегистров.РесурсОтсутствуетИлиМожетБытьПустым(ПараметрыОтраженияДвижений.РесурсыУпр) Тогда
			Запрос.Параметры.РегистрыБезСуммыУпр.Добавить(ИмяИсточникаДанных);
		КонецЕсли;
		
		Если ФинансовыйУчетПоДаннымБалансовыхРегистров.РесурсОтсутствуетИлиМожетБытьПустым(ПараметрыОтраженияДвижений.РесурсыРегл) Тогда
			Запрос.Параметры.РегистрыБезСуммыРегл.Добавить(ИмяИсточникаДанных);
		КонецЕсли;
		
		ИсточникДанных = СтрШаблон("РегистрНакопления.%1 КАК ТаблицаРегистра
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПорцияДокументов КАК ПорцияДокументов
			|		ПО &Регистратор = ПорцияДокументов.Регистратор", ИмяИсточникаДанных);
		
		Если КлючиРесурсовОбъектовУчета.Количество() > 1 Тогда
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьПовторительВИсточникДанных(ИсточникДанных, КлючиРесурсовОбъектовУчета.Количество());
		КонецЕсли;
		
		УсловиеПериод = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаУсловияПериод(Запрос.Параметры);
		УсловиеРегистратор = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаУсловияРегистратор(Запрос.Параметры);
		УсловиеОрганизация = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаУсловияОрганизация(Запрос.Параметры);
		УсловиеУдаляемыеДокументы = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаУсловияУдаляемыеДокументы(МетаданныеРегистра);
		УсловиеДополнительныйОтбор = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаДополнительныйОтбор(ПараметрыОтраженияДвижений);
		
		Если ИмяИсточникаДанных = РегистрыНакопленияМетаданные.РасчетыСКлиентамиПоСрокам.Имя Тогда
			УсловиеДополнительныйОтбор = УсловиеДополнительныйОтбор + СтрЗаменить("
				|	И (ПсевдонимИсточникаДанных.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
				|		ИЛИ ПсевдонимИсточникаДанных.АналитикаУчетаПоПартнерам.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация))",
				"ПсевдонимИсточникаДанных",
				ПараметрыОтраженияДвижений.ПсевдонимИсточникаДанных);
		ИначеЕсли ИмяИсточникаДанных = РегистрыНакопленияМетаданные.РасчетыСПоставщикамиПоСрокам.Имя Тогда
			УсловиеДополнительныйОтбор = УсловиеДополнительныйОтбор + СтрЗаменить("
				|	И (ПсевдонимИсточникаДанных.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
				|		ИЛИ ПсевдонимИсточникаДанных.АналитикаУчетаПоПартнерам.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация))",
				"ПсевдонимИсточникаДанных",
				ПараметрыОтраженияДвижений.ПсевдонимИсточникаДанных);
		КонецЕсли;
		
		Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("КэшДокументов") <> Неопределено Тогда
			УсловиеДополнительныйОтбор = УсловиеДополнительныйОтбор + "
				|	И НЕ ИСТИНА В
				|		(ВЫБРАТЬ ПЕРВЫЕ 1
				|			ИСТИНА
				|		ИЗ
				|			КэшДокументов КАК КэшДокументов
				|		ГДЕ
				|			КэшДокументов.Регистратор = &Регистратор
				|			И КэшДокументов.Период = &Период)";
		КонецЕсли;
		
		ТекстЗапроса = ШаблонТекстаЗапросаЗаписейРегистра();
		
		Если КлючиРесурсовОбъектовУчета.Количество() > 1 Тогда
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьПовторительВПоляГруппировки(ТекстЗапроса);
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОбъектУчета", ПоляВыборкиОбъектаУчета.ОбъектУчета);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НаправлениеДеятельности", ПоляВыборкиОбъектаУчета.НаправлениеДеятельности);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторФинЗаписи", ПоляВыборкиОбъектаУчета.ИдентификаторФинЗаписи);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НастройкаХозОперации", ПоляВыборкиОбъектаУчета.НастройкаХозОперации);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторСтроки", ПоляВыборкиОбъектаУчета.ИдентификаторСтроки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоДебет", ПоляВыборкиОбъектаУчета.ЭтоДебет);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоКредит", ПоляВыборкиОбъектаУчета.ЭтоКредит);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоСторно", ПоляВыборкиОбъектаУчета.ЭтоСторно);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаУпр", ПоляВыборкиОбъектаУчета.СуммаУпр);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаРегл", ПоляВыборкиОбъектаУчета.СуммаРегл);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммаВал", ПоляВыборкиОбъектаУчета.СуммаВал);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Количество", ПоляВыборкиОбъектаУчета.Количество);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеЗначенияРесурсов", ПоляВыборкиОбъектаУчета.УсловиеЗначенияРесурсов);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникДанных", ИсточникДанных);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПериод", УсловиеПериод);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеРегистратор", УсловиеРегистратор);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОрганизация", УсловиеОрганизация);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеУдаляемыеДокументы", УсловиеУдаляемыеДокументы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДополнительныйОтбор", УсловиеДополнительныйОтбор);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистра", ИмяРегистра);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Валюта", Валюта);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Регистратор", Регистратор);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организация", Организация);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Подразделение", Подразделение);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДеятельностиНДС", ВидДеятельностиНДС);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитСторно", РеквизитСторно);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрЗапросаРегистратор", "&Регистратор");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрЗапросаОрганизация", "&Организация");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Период", ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника("Период"));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Активность", ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника("Активность"));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДвижения", ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника("ВидДвижения"));
		
		Если ИмяИсточникаДанных = РегистрыНакопленияМетаданные.РасчетыСКлиентамиПоСрокам.Имя Тогда
			ТекстВложеннойТаблицы = "(" + ТекстЗапроса + ")";
			
			// удалить после исправления ошибки 00-00450915
			НачислениеАвансаКлиентаПриВозврате = "(ТаблицаРегистра.ЭтоКредит
			|	И ТаблицаРегистра.ОбъектУчета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|	И ТаблицаРегистра.НастройкаХозОперации В (
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка),
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности))
			|	И ТИПЗНАЧЕНИЯ(ТаблицаРегистра.Регистратор) В (
			|		ТИП(Документ.ВозвратТоваровОтКлиента),
			|		ТИП(Документ.КорректировкаРеализации),
			|		ТИП(Документ.КорректировкаЗадолженности)))";
			
			// удалить после исправления причины возникновения ошибки 00-00556880
			ЗачетАвансаКлиентаПриКорректировке = "(ТаблицаРегистра.ЭтоДебет
			|	И ТаблицаРегистра.ОбъектУчета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|	И ТаблицаРегистра.НастройкаХозОперации В (
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности))
			|	И ТИПЗНАЧЕНИЯ(ТаблицаРегистра.Регистратор) В (
			|		ТИП(Документ.КорректировкаЗадолженности)))";
			
			// удалить после исправления причины возникновения ошибки 00-00570173
			НачислениеАвансаКлиентаПриКорректировке = "(ТаблицаРегистра.ЭтоДебет
			|	И ТаблицаРегистра.ОбъектУчета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|	И ТаблицаРегистра.НастройкаХозОперации В (
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКредиторскойЗадолженности))
			|	И ТИПЗНАЧЕНИЯ(ТаблицаРегистра.Регистратор) В (
			|		ТИП(Документ.КорректировкаЗадолженности)))";
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ТаблицаРегистра.Период КАК Период,
			|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|				КОГДА &НачислениеАвансаКлиентаПриВозврате
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				КОГДА &ЗачетАвансаКлиентаПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				КОГДА &НачислениеАвансаКлиентаПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|				ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаКлиентаПриВозврате
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|			КОНЕЦ
			|		КОГДА &ЗачетАвансаКлиентаПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаКлиентаПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|			КОНЕЦ
			|		ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|	КОНЕЦ КАК ОбъектУчета,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоДебет
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Дт
			|	КОНЕЦ КАК ЭтоДебет,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоКредит
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Кт
			|	КОНЕЦ КАК ЭтоКредит,
			|	ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
			|	&ПоляАналитикиВложеннойТаблицы,
			|	ТаблицаРегистра.Регистратор КАК Регистратор,
			|	ТаблицаРегистра.Организация КАК Организация,
			|	ТаблицаРегистра.Подразделение КАК Подразделение,
			|	ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.НастройкаХозОперации
			|		КОГДА &НачислениеАвансаКлиентаПриВозврате
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаКлиента)
			|		КОГДА &ЗачетАвансаКлиентаПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗачетАвансаКлиента)
			|		КОГДА &НачислениеАвансаКлиентаПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаКлиента)
			|		ИНАЧЕ ТаблицаРегистра.НастройкаХозОперации
			|	КОНЕЦ КАК НастройкаХозОперации,
			|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
			|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ТаблицаРегистра.СлужебныйВидДеятельностиНДС КАК СлужебныйВидДеятельностиНДС,
			|	ТаблицаРегистра.Валюта КАК Валюта,
			|	СУММА(ТаблицаРегистра.СуммаУпр) КАК СуммаУпр,
			|	СУММА(ТаблицаРегистра.СуммаРегл) КАК СуммаРегл,
			|	СУММА(ТаблицаРегистра.СуммаВал) КАК СуммаВал,
			|	СУММА(ТаблицаРегистра.Количество) КАК Количество,
			|	&СуммыРесурсовВложенногоИсточникаДанных,
			|	ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
			|ИЗ
			|	&ТекстВложеннойТаблицы КАК ТаблицаРегистра
			|	,
			|	(ВЫБРАТЬ
			|		НЕОПРЕДЕЛЕНО КАК ДтКт
			|	ОБЪЕДИНИТЬ ВСЕ
			|	ВЫБРАТЬ
			|		&Дт КАК ДтКт
			|	ОБЪЕДИНИТЬ ВСЕ
			|	ВЫБРАТЬ
			|		&Кт КАК ДтКт
			|	) КАК ЧастиДвойнойЗаписи
			|ГДЕ
			|	ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|	ИЛИ &НачислениеАвансаКлиентаПриВозврате
			|	ИЛИ &ЗачетАвансаКлиентаПриКорректировке
			|	ИЛИ &НачислениеАвансаКлиентаПриКорректировке
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаРегистра.Период,
			|	ТаблицаРегистра.ИмяРегистра,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|				КОГДА &НачислениеАвансаКлиентаПриВозврате
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				КОГДА &ЗачетАвансаКлиентаПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				КОГДА &НачислениеАвансаКлиентаПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|				ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаКлиентаПриВозврате
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|			КОНЕЦ
			|		КОГДА &ЗачетАвансаКлиентаПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаКлиентаПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов)
			|			КОНЕЦ
			|		ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоДебет
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Дт
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоКредит
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Кт
			|	КОНЕЦ,
			|	ТаблицаРегистра.ЭтоСторно,
			|	&ГруппаАналитикиВложеннойТаблицы,
			|	ТаблицаРегистра.Регистратор,
			|	ТаблицаРегистра.Организация,
			|	ТаблицаРегистра.Подразделение,
			|	ТаблицаРегистра.НаправлениеДеятельности,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.НастройкаХозОперации
			|		КОГДА &НачислениеАвансаКлиентаПриВозврате
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаКлиента)
			|		КОГДА &ЗачетАвансаКлиентаПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗачетАвансаКлиента)
			|		КОГДА &НачислениеАвансаКлиентаПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаКлиента)
			|		ИНАЧЕ ТаблицаРегистра.НастройкаХозОперации
			|	КОНЕЦ,
			|	ТаблицаРегистра.ИдентификаторФинЗаписи,
			|	ТаблицаРегистра.ИдентификаторСтроки,
			|	ТаблицаРегистра.СлужебныйВидДеятельностиНДС,
			|	ТаблицаРегистра.Валюта,
			|	ТаблицаРегистра.РеквизитСторно
			|";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстВложеннойТаблицы", ТекстВложеннойТаблицы);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачислениеАвансаКлиентаПриВозврате", НачислениеАвансаКлиентаПриВозврате);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗачетАвансаКлиентаПриКорректировке", ЗачетАвансаКлиентаПриКорректировке);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачислениеАвансаКлиентаПриКорректировке", НачислениеАвансаКлиентаПриКорректировке);
			
		ИначеЕсли ИмяИсточникаДанных = РегистрыНакопленияМетаданные.РасчетыСПоставщикамиПоСрокам.Имя Тогда
			ТекстВложеннойТаблицы = "(" + ТекстЗапроса + ")";
			
			// удалить после исправления ошибки 00-00453822
			НачислениеАвансаПоставщикуПриВозврате = "(ТаблицаРегистра.ЭтоДебет
			|	И ТаблицаРегистра.ОбъектУчета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|	И ТаблицаРегистра.НастройкаХозОперации В (
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка),
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеДебиторскойЗадолженности))
			|	И ТИПЗНАЧЕНИЯ(ТаблицаРегистра.Регистратор) В (
			|		ТИП(Документ.ВозвратТоваровПоставщику),
			|		ТИП(Документ.КорректировкаПриобретения),
			|		ТИП(Документ.КорректировкаЗадолженности)))";
			
			// удалить после исправления причины возникновения ошибки 00-00556880
			ЗачетАвансаПоставщикуПриКорректировке = "(ТаблицаРегистра.ЭтоКредит
			|	И ТаблицаРегистра.ОбъектУчета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|	И ТаблицаРегистра.НастройкаХозОперации В (
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.НачислениеКредиторскойЗадолженности))
			|	И ТИПЗНАЧЕНИЯ(ТаблицаРегистра.Регистратор) В (
			|		ТИП(Документ.КорректировкаЗадолженности)))";
			
			// удалить после исправления причины возникновения ошибки 00-00570173
			НачислениеАвансаПоставщикуПриКорректировке = "(ТаблицаРегистра.ЭтоКредит
			|	И ТаблицаРегистра.ОбъектУчета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|	И ТаблицаРегистра.НастройкаХозОперации В (
			|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеДебиторскойЗадолженности))
			|	И ТИПЗНАЧЕНИЯ(ТаблицаРегистра.Регистратор) В (
			|		ТИП(Документ.КорректировкаЗадолженности)))";
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ТаблицаРегистра.Период КАК Период,
			|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|				КОГДА &НачислениеАвансаПоставщикуПриВозврате
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|				КОГДА &ЗачетАвансаПоставщикуПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|				КОГДА &НачислениеАвансаПоставщикуПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|				ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаПоставщикуПриВозврате
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|			КОНЕЦ
			|		КОГДА &ЗачетАвансаПоставщикуПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаПоставщикуПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|			КОНЕЦ
			|		ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|	КОНЕЦ КАК ОбъектУчета,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоДебет
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Дт
			|	КОНЕЦ КАК ЭтоДебет,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоКредит
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Кт
			|	КОНЕЦ КАК ЭтоКредит,
			|	ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
			|	&ПоляАналитикиВложеннойТаблицы,
			|	ТаблицаРегистра.Регистратор КАК Регистратор,
			|	ТаблицаРегистра.Организация КАК Организация,
			|	ТаблицаРегистра.Подразделение КАК Подразделение,
			|	ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.НастройкаХозОперации
			|		КОГДА &НачислениеАвансаПоставщикуПриВозврате
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаПоставщику)
			|		КОГДА &ЗачетАвансаПоставщикуПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗачетАвансаПоставщику)
			|		КОГДА &НачислениеАвансаПоставщикуПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаПоставщику)
			|		ИНАЧЕ ТаблицаРегистра.НастройкаХозОперации
			|	КОНЕЦ КАК НастройкаХозОперации,
			|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
			|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ТаблицаРегистра.СлужебныйВидДеятельностиНДС КАК СлужебныйВидДеятельностиНДС,
			|	ТаблицаРегистра.Валюта КАК Валюта,
			|	СУММА(ТаблицаРегистра.СуммаУпр) КАК СуммаУпр,
			|	СУММА(ТаблицаРегистра.СуммаРегл) КАК СуммаРегл,
			|	СУММА(ТаблицаРегистра.СуммаВал) КАК СуммаВал,
			|	СУММА(ТаблицаРегистра.Количество) КАК Количество,
			|	&СуммыРесурсовВложенногоИсточникаДанных,
			|	ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
			|ИЗ
			|	&ТекстВложеннойТаблицы КАК ТаблицаРегистра
			|	,
			|	(ВЫБРАТЬ
			|		НЕОПРЕДЕЛЕНО КАК ДтКт
			|	ОБЪЕДИНИТЬ ВСЕ
			|	ВЫБРАТЬ
			|		&Дт КАК ДтКт
			|	ОБЪЕДИНИТЬ ВСЕ
			|	ВЫБРАТЬ
			|		&Кт КАК ДтКт
			|	) КАК ЧастиДвойнойЗаписи
			|ГДЕ
			|	ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|	ИЛИ &НачислениеАвансаПоставщикуПриВозврате
			|	ИЛИ &ЗачетАвансаПоставщикуПриКорректировке
			|	ИЛИ &НачислениеАвансаПоставщикуПриКорректировке
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаРегистра.Период,
			|	ТаблицаРегистра.ИмяРегистра,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|				КОГДА &НачислениеАвансаПоставщикуПриВозврате
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|				КОГДА &ЗачетАвансаПоставщикуПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|				КОГДА &НачислениеАвансаПоставщикуПриКорректировке
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|				ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаПоставщикуПриВозврате
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|			КОНЕЦ
			|		КОГДА &ЗачетАвансаПоставщикуПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|			КОНЕЦ
			|		КОГДА &НачислениеАвансаПоставщикуПриКорректировке
			|			ТОГДА ВЫБОР
			|				КОГДА ЧастиДвойнойЗаписи.ДтКт = &Дт
			|					ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам)
			|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками)
			|			КОНЕЦ
			|		ИНАЧЕ ТаблицаРегистра.ОбъектУчета
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоДебет
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Дт
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.ЭтоКредит
			|		ИНАЧЕ ЧастиДвойнойЗаписи.ДтКт = &Кт
			|	КОНЕЦ,
			|	ТаблицаРегистра.ЭтоСторно,
			|	&ГруппаАналитикиВложеннойТаблицы,
			|	ТаблицаРегистра.Регистратор,
			|	ТаблицаРегистра.Организация,
			|	ТаблицаРегистра.Подразделение,
			|	ТаблицаРегистра.НаправлениеДеятельности,
			|	ВЫБОР
			|		КОГДА ЧастиДвойнойЗаписи.ДтКт = НЕОПРЕДЕЛЕНО
			|			ТОГДА ТаблицаРегистра.НастройкаХозОперации
			|		КОГДА &НачислениеАвансаПоставщикуПриВозврате
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаПоставщику)
			|		КОГДА &ЗачетАвансаПоставщикуПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗачетАвансаПоставщику)
			|		КОГДА &НачислениеАвансаПоставщикуПриКорректировке
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаПоставщику)
			|		ИНАЧЕ ТаблицаРегистра.НастройкаХозОперации
			|	КОНЕЦ,
			|	ТаблицаРегистра.ИдентификаторФинЗаписи,
			|	ТаблицаРегистра.ИдентификаторСтроки,
			|	ТаблицаРегистра.СлужебныйВидДеятельностиНДС,
			|	ТаблицаРегистра.Валюта,
			|	ТаблицаРегистра.РеквизитСторно
			|";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстВложеннойТаблицы", ТекстВложеннойТаблицы);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачислениеАвансаПоставщикуПриВозврате", НачислениеАвансаПоставщикуПриВозврате);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗачетАвансаПоставщикуПриКорректировке", ЗачетАвансаПоставщикуПриКорректировке);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачислениеАвансаПоставщикуПриКорректировке", НачислениеАвансаПоставщикуПриКорректировке);
		КонецЕсли;
		
		ТекстыЗапросовРегистров.Вставить(ИмяИсточникаДанных, ТекстЗапроса);
	КонецЦикла;
	
	Возврат ТекстыЗапросовРегистров;
	
КонецФункции

Функция ТекстЗапросаЗаписейДляКорреспонденций(ТекстыЗапросовЗаписейРегистров)
	
	ТекстыЗапросов = Новый Массив();
	
	Для Каждого КлючИЗначение Из ТекстыЗапросовЗаписейРегистров Цикл
		ТекстыЗапросов.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбораАналитики", "//ПоляВыбораАналитики");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппаПолейАналитики", "//ГруппаПолейАналитики");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РесурсыИсточникаДанных", "//РесурсыИсточникаДанных");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СуммыРесурсовВложенногоИсточникаДанных", "//СуммыРесурсовВложенногоИсточникаДанных");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляАналитикиВложеннойТаблицы", "//ПоляАналитикиВложеннойТаблицы");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппаАналитикиВложеннойТаблицы", "//ГруппаАналитикиВложеннойТаблицы");
	
	УдаляемыеПоляВыборки = УдаляемыеПоляВыборкиЗапросовКорреспонденций();
	ПоляИндексирования = ПоляИндексаТаблицыКорреспонденций();
	ТаблицаДляПомещения = "втДвиженияРегистров";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапроса, УдаляемыеПоляВыборки , ПоляИндексирования, ТаблицаДляПомещения);

	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СформироватьКорреспонденцииЗаписейРегистров(Запрос, ТекстыЗапросов)
	
	ДобавитьТаблицыДвиженийДебетаИКредита(Запрос, ТекстыЗапросов);
	ОбработатьИСоединитьТаблицыДвижений(Запрос, ТекстыЗапросов);
	
	ОпределитьОшибкиКорреспонденций(ТекстыЗапросов, Запрос.Параметры, Истина);
	
	Если ФинансовыйУчетПоДаннымБалансовыхРегистров.ЕстьЗаписиВоВременнойТаблице(Запрос, ТекстыЗапросов, "втОшибкиКорреспонденций") Тогда
		ОпределитьМаксимальныйНомерЗаписейДвижений(ТекстыЗапросов);
		
		ВосстановитьДвиженияОшибочныхКорреспонденций(ТекстыЗапросов, Запрос.Параметры, "Дт");
		ВосстановитьДвиженияОшибочныхКорреспонденций(ТекстыЗапросов, Запрос.Параметры, "Кт");
		
		ОпределитьРегистрыСДвижениямиРеверса(ТекстыЗапросов);
		
		ЗаменитьДвиженияРеверсаНаСторно(ТекстыЗапросов, "Дт");
		ЗаменитьДвиженияРеверсаНаСторно(ТекстыЗапросов, "Кт");
		
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втОшибкиКорреспонденций");
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втМаксимальныйНомерЗаписей");
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияРегистровРеверсДебет");
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияРегистровРеверсКредит");

		ТаблицаКорреспонденцийДвиженийРегистров = Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров;
		
		ОбработатьИСоединитьТаблицыДвижений(Запрос, ТекстыЗапросов);
		
		ОпределитьКорреспонденцииБезОшибок(ТекстыЗапросов, Запрос.Параметры);
		ОпределитьРегистрыЗаменыРеверсаНаСторно(ТекстыЗапросов);
		
		Если ФинансовыйУчетПоДаннымБалансовыхРегистров.ЕстьЗаписиВоВременнойТаблице(Запрос, ТекстыЗапросов, "втКорреспонденцииБезОшибок") Тогда
			ЗаменитьКорреспонденцииРеверсаНаСторно(ТекстыЗапросов,
				Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров,
				ТаблицаКорреспонденцийДвиженийРегистров);
			
			ТаблицаРегистровЗаменыРеверса = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("втРегистрыЗаменыРеверсаНаСторно");
			ТаблицаРегистровЗаменыРеверса = ТаблицаРегистровЗаменыРеверса.ПолучитьДанные().Выгрузить();
			Запрос.Параметры.РегистрыЗаменыРеверсаНаСторно = ТаблицаРегистровЗаменыРеверса.ВыгрузитьКолонку("ИмяРегистра");
		Иначе
			Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров = ТаблицаКорреспонденцийДвиженийРегистров;
		КонецЕсли;
		
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРегистрыЗаменыРеверсаНаСторно");
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втКорреспонденцииБезОшибок");
	Иначе
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втОшибкиКорреспонденций");
		ДобавитьПустуюТаблицуДокументовЗаменыРеверса(ТекстыЗапросов);
	КонецЕсли;
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияДебет");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияКредит");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втКорИсточникиДанных");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втИдентификаторыКорИсточниковДанных");
	
	ВосстановитьРасчетыПоСторно(Запрос, ТекстыЗапросов);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.НомерЗаписиДт КАК НомерЗаписиДт,
	|	ДвиженияДебетКредит.НомерЗаписиКт КАК НомерЗаписиКт,
	|	ДвиженияДебетКредит.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияДебетКредит.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияДебетКредит.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияДебетКредит.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияДебетКредит.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ДвиженияДебетКредит.ВидДеятельностиНДСДт КАК ВидДеятельностиНДСДт,
	|	ДвиженияДебетКредит.ВидДеятельностиНДСКт КАК ВидДеятельностиНДСКт,
	|	ДвиженияДебетКредит.ВалютаДт КАК ВалютаДт,
	|	ДвиженияДебетКредит.ВалютаКт КАК ВалютаКт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалДт КАК СуммаДвиженияВалДт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалКт КАК СуммаДвиженияВалКт,
	|	ДвиженияДебетКредит.КоличествоДвиженияДт КАК КоличествоДвиженияДт,
	|	ДвиженияДебетКредит.КоличествоДвиженияКт КАК КоличествоДвиженияКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно,
	|	ДвиженияДебетКредит.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ДвиженияДебетКредит.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ДвиженияДебетКредит.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.СуммаУпрДт <> 0
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрДт
	|		КОГДА НЕ ДвиженияДебетКредит.ИмяРегистраДт В (&РегистрыБезСуммыУпр)
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрДт
	|		КОГДА ДвиженияДебетКредит.СуммаРеглДт = ДвиженияДебетКредит.СуммаРеглКт
	|			И НЕ ДвиженияДебетКредит.СложнаяПроводкаКт
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрКт
	|		ИНАЧЕ ДвиженияДебетКредит.СуммаУпрДт
	|	КОНЕЦ КАК СуммаУпрДт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.СуммаУпрКт <> 0
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрКт
	|		КОГДА НЕ ДвиженияДебетКредит.ИмяРегистраКт В (&РегистрыБезСуммыУпр)
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрКт
	|		КОГДА ДвиженияДебетКредит.СуммаРеглДт = ДвиженияДебетКредит.СуммаРеглКт
	|			И НЕ ДвиженияДебетКредит.СложнаяПроводкаДт
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрДт
	|		ИНАЧЕ ДвиженияДебетКредит.СуммаУпрКт
	|	КОНЕЦ КАК СуммаУпрКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.СуммаРеглДт <> 0
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглДт
	|		КОГДА НЕ ДвиженияДебетКредит.ИмяРегистраДт В (&РегистрыБезСуммыРегл)
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглДт
	|		КОГДА ДвиженияДебетКредит.СуммаУпрДт = ДвиженияДебетКредит.СуммаУпрКт
	|			И НЕ ДвиженияДебетКредит.СложнаяПроводкаКт
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглКт
	|		ИНАЧЕ ДвиженияДебетКредит.СуммаРеглДт
	|	КОНЕЦ КАК СуммаРеглДт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.СуммаРеглКт <> 0
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглКт
	|		КОГДА НЕ ДвиженияДебетКредит.ИмяРегистраКт В (&РегистрыБезСуммыРегл)
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглКт
	|		КОГДА ДвиженияДебетКредит.СуммаУпрДт = ДвиженияДебетКредит.СуммаУпрКт
	|			И НЕ ДвиженияДебетКредит.СложнаяПроводкаДт
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглДт
	|		ИНАЧЕ ДвиженияДебетКредит.СуммаРеглКт
	|	КОНЕЦ КАК СуммаРеглКт
	|ПОМЕСТИТЬ втДвиженияДебетКредит
	|ИЗ
	|	ТаблицаКорреспонденцийДвиженийРегистров КАК ДвиженияДебетКредит
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСторно.Период КАК Период,
	|	0 КАК НомерЗаписиДт,
	|	0 КАК НомерЗаписиКт,
	|	РасчетыСКлиентамиПоСторно.ИмяРегистра КАК ИмяРегистраДт,
	|	РасчетыСКлиентамиПоСторно.ИмяРегистра КАК ИмяРегистраКт,
	|	РасчетыСКлиентамиПоСторно.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	РасчетыСКлиентамиПоСторно.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	РасчетыСКлиентамиПоСторно.ЭтоСторно КАК ЭтоСторноДт,
	|	РасчетыСКлиентамиПоСторно.ЭтоСторно КАК ЭтоСторноКт,
	|	РасчетыСКлиентамиПоСторно.Организация КАК Организация,
	|	РасчетыСКлиентамиПоСторно.Регистратор КАК Регистратор,
	|	РасчетыСКлиентамиПоСторно.НастройкаХозОперации КАК НастройкаХозОперации,
	|	РасчетыСКлиентамиПоСторно.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыСКлиентамиПоСторно.ИдентификаторСтроки КАК ИдентификаторСтрокиДт,
	|	РасчетыСКлиентамиПоСторно.ИдентификаторСтроки КАК ИдентификаторСтрокиКт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДСДт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДСКт,
	|	РасчетыСКлиентамиПоСторно.Валюта КАК ВалютаДт,
	|	РасчетыСКлиентамиПоСторно.Валюта КАК ВалютаКт,
	|	РасчетыСКлиентамиПоСторно.СуммаУпрДт КАК СуммаДвиженияУпрДт,
	|	РасчетыСКлиентамиПоСторно.СуммаУпрКт КАК СуммаДвиженияУпрКт,
	|	РасчетыСКлиентамиПоСторно.СуммаРеглДт КАК СуммаДвиженияРеглДт,
	|	РасчетыСКлиентамиПоСторно.СуммаРеглКт КАК СуммаДвиженияРеглКт,
	|	РасчетыСКлиентамиПоСторно.СуммаВалДт КАК СуммаДвиженияВалДт,
	|	РасчетыСКлиентамиПоСторно.СуммаВалКт КАК СуммаДвиженияВалКт,
	|	0 КАК КоличествоДвиженияДт,
	|	0 КАК КоличествоДвиженияКт,
	|	РасчетыСКлиентамиПоСторно.РеквизитСторно КАК РеквизитСторно,
	|	ЛОЖЬ КАК СложнаяПроводкаДт,
	|	ЛОЖЬ КАК СложнаяПроводкаКт,
	|	ИСТИНА КАК УчитыватьХозОперацию,
	|	РасчетыСКлиентамиПоСторно.СуммаУпрДт КАК СуммаУпрДт,
	|	РасчетыСКлиентамиПоСторно.СуммаУпрКт КАК СуммаУпрКт,
	|	РасчетыСКлиентамиПоСторно.СуммаРеглДт КАК СуммаРеглДт,
	|	РасчетыСКлиентамиПоСторно.СуммаРеглКт КАК СуммаРеглКт
	|ИЗ
	|	втРасчетыСКлиентамиПоСторно КАК РасчетыСКлиентамиПоСторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСторно.Период КАК Период,
	|	0 КАК НомерЗаписиДт,
	|	0 КАК НомерЗаписиКт,
	|	РасчетыСПоставщикамиПоСторно.ИмяРегистра КАК ИмяРегистраДт,
	|	РасчетыСПоставщикамиПоСторно.ИмяРегистра КАК ИмяРегистраКт,
	|	РасчетыСПоставщикамиПоСторно.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	РасчетыСПоставщикамиПоСторно.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	РасчетыСПоставщикамиПоСторно.ЭтоСторно КАК ЭтоСторноДт,
	|	РасчетыСПоставщикамиПоСторно.ЭтоСторно КАК ЭтоСторноКт,
	|	РасчетыСПоставщикамиПоСторно.Организация КАК Организация,
	|	РасчетыСПоставщикамиПоСторно.Регистратор КАК Регистратор,
	|	РасчетыСПоставщикамиПоСторно.НастройкаХозОперации КАК НастройкаХозОперации,
	|	РасчетыСПоставщикамиПоСторно.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыСПоставщикамиПоСторно.ИдентификаторСтроки КАК ИдентификаторСтрокиДт,
	|	РасчетыСПоставщикамиПоСторно.ИдентификаторСтроки КАК ИдентификаторСтрокиКт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДСДт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДСКт,
	|	РасчетыСПоставщикамиПоСторно.Валюта КАК ВалютаДт,
	|	РасчетыСПоставщикамиПоСторно.Валюта КАК ВалютаКт,
	|	РасчетыСПоставщикамиПоСторно.СуммаУпрДт КАК СуммаДвиженияУпрДт,
	|	РасчетыСПоставщикамиПоСторно.СуммаУпрКт КАК СуммаДвиженияУпрКт,
	|	РасчетыСПоставщикамиПоСторно.СуммаРеглДт КАК СуммаДвиженияРеглДт,
	|	РасчетыСПоставщикамиПоСторно.СуммаРеглКт КАК СуммаДвиженияРеглКт,
	|	РасчетыСПоставщикамиПоСторно.СуммаВалДт КАК СуммаДвиженияВалДт,
	|	РасчетыСПоставщикамиПоСторно.СуммаВалКт КАК СуммаДвиженияВалКт,
	|	0 КАК КоличествоДвиженияДт,
	|	0 КАК КоличествоДвиженияКт,
	|	РасчетыСПоставщикамиПоСторно.РеквизитСторно КАК РеквизитСторно,
	|	ЛОЖЬ КАК СложнаяПроводкаДт,
	|	ЛОЖЬ КАК СложнаяПроводкаКт,
	|	ИСТИНА КАК УчитыватьХозОперацию,
	|	РасчетыСПоставщикамиПоСторно.СуммаУпрДт КАК СуммаУпрДт,
	|	РасчетыСПоставщикамиПоСторно.СуммаУпрКт КАК СуммаУпрКт,
	|	РасчетыСПоставщикамиПоСторно.СуммаРеглДт КАК СуммаРеглДт,
	|	РасчетыСПоставщикамиПоСторно.СуммаРеглКт КАК СуммаРеглКт
	|ИЗ
	|	втРасчетыСПоставщикамиПоСторно КАК РасчетыСПоставщикамиПоСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ИдентификаторСтрокиДт,
	|	ИдентификаторСтрокиКт,
	|	ВалютаДт,
	|	ВалютаКт,
	|	СложнаяПроводкаДт,
	|	СложнаяПроводкаКт
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ТаблицаКорреспонденцийДвиженийРегистров",
		Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров);
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров);
	
КонецПроцедуры

Процедура РаспределитьНебалансовыеРесурсыКорреспонденций(Запрос, ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	СуммыДокументовВВалютахУчета.Регистратор КАК Регистратор,
	|	СуммыДокументовВВалютахУчета.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СуммыДокументовВВалютахУчета.Валюта КАК Валюта,
	|	СуммыДокументовВВалютахУчета.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СуммыДокументовВВалютахУчета.СуммаБезНДС КАК СуммаБезНДС,
	|	СуммыДокументовВВалютахУчета.СуммаНДС КАК СуммаНДС,
	|	СуммыДокументовВВалютахУчета.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	СуммыДокументовВВалютахУчета.СуммаНДСВзаиморасчетов КАК СуммаНДСВзаиморасчетов
	|ПОМЕСТИТЬ втСуммыДокументовВВалютахУчета
	|ИЗ
	|	РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втДвиженияДебетКредит КАК ДвиженияДебетКредит
	|		ГДЕ
	|			ДвиженияДебетКредит.Регистратор = СуммыДокументовВВалютахУчета.Регистратор
	|			И (ДвиженияДебетКредит.СложнаяПроводкаДт ИЛИ ДвиженияДебетКредит.СложнаяПроводкаКт)
	|		)
	|	И НЕ
	|		(СуммыДокументовВВалютахУчета.Валюта В
	|			(&ВалютаУправленческогоУчета,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		И СуммыДокументовВВалютахУчета.ВалютаВзаиморасчетов В
	|			(&ВалютаУправленческогоУчета,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		)
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ИдентификаторСтроки,
	|	Валюта,
	|	ВалютаВзаиморасчетов,
	|	СуммаНДСВзаиморасчетов
	|");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.НомерЗаписиДт КАК НомерЗаписиДт,
	|	ДвиженияДебетКредит.НомерЗаписиКт КАК НомерЗаписиКт,
	|	0 КАК НомерСложнойЗаписи,
	|	ДвиженияДебетКредит.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияДебетКредит.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияДебетКредит.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияДебетКредит.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияДебетКредит.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ДвиженияДебетКредит.ВалютаДт КАК ВалютаДт,
	|	ДвиженияДебетКредит.ВалютаКт КАК ВалютаКт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно,
	|	ДвиженияДебетКредит.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ДвиженияДебетКредит.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ДвиженияДебетКредит.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ДвиженияДебетКредит.СуммаУпрДт КАК СуммаУпрДт,
	|	ДвиженияДебетКредит.СуммаУпрКт КАК СуммаУпрКт,
	|	ДвиженияДебетКредит.СуммаРеглДт КАК СуммаРеглДт,
	|	ДвиженияДебетКредит.СуммаРеглКт КАК СуммаРеглКт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалДт КАК РаспределяемаяСуммаВалДт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалКт КАК РаспределяемаяСуммаВалКт,
	|	ДвиженияДебетКредит.КоличествоДвиженияДт КАК РаспределяемоеКоличествоДт,
	|	ДвиженияДебетКредит.КоличествоДвиженияКт КАК РаспределяемоеКоличествоКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.НастройкаХозОперации В (&ХозОперацииБезУчетаВВалюте)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаДт
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = &ВалютаУправленческогоУчета
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = ДвиженияДебетКредит.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ЛОЖЬ
	|		КОГДА СуммыВВалютахДт.ИдентификаторСтроки ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьРаспределениеСуммыДт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.НастройкаХозОперации В (&ХозОперацииБезУчетаВВалюте)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаКт
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = &ВалютаУправленческогоУчета
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = ДвиженияДебетКредит.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ЛОЖЬ
	|		КОГДА СуммыВВалютахКт.ИдентификаторСтроки ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьРаспределениеСуммыКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.НастройкаХозОперации В (&ХозОперацииБезУчетаВВалюте)
	|			ТОГДА 0
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаДт
	|			ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалДт
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = &ВалютаУправленческогоУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрДт
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = ДвиженияДебетКредит.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглДт
	|		КОГДА ДвиженияДебетКредит.ВалютаДт = ДвиженияДебетКредит.ВалютаКт
	|			ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалКт
	|		КОГДА СуммыВВалютахДт.ИдентификаторСтроки ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ДвиженияДебетКредит.СуммаДвиженияУпрДт <> 0
	|					ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалДт * ДвиженияДебетКредит.СуммаУпрДт / ДвиженияДебетКредит.СуммаДвиженияУпрДт
	|				КОГДА ДвиженияДебетКредит.СуммаДвиженияРеглДт <> 0
	|					ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалДт * ДвиженияДебетКредит.СуммаРеглДт / ДвиженияДебетКредит.СуммаДвиженияРеглДт
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(&ДлинаСуммы, &ТочностьСуммы))
	|		КОГДА ДвиженияДебетКредит.ВидДеятельностиНДСДт В (&ТипыНалогообложенияБезУчетаНДС)
	|		  ИЛИ ДвиженияДебетКредит.ВидДеятельностиНДСКт В (&ТипыНалогообложенияБезУчетаНДС)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебетКредит.ОбъектУчетаКт В (&ОбъектыУчетаНДС)
	|					ТОГДА 0
	|				КОГДА ДвиженияДебетКредит.ВалютаДт = СуммыВВалютахДт.Валюта
	|					ТОГДА СуммыВВалютахДт.СуммаБезНДС + СуммыВВалютахДт.СуммаНДС
	|				ИНАЧЕ СуммыВВалютахДт.СуммаВзаиморасчетов
	|			КОНЕЦ * ВЫБОР
	|				КОГДА СуммыВВалютахДт.СуммаБезНДС < 0 ИЛИ СуммыВВалютахДт.СуммаНДС < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		КОГДА ДвиженияДебетКредит.ОбъектУчетаКт В (&ОбъектыУчетаНДС)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебетКредит.ВалютаДт = СуммыВВалютахДт.Валюта
	|					ТОГДА СуммыВВалютахДт.СуммаНДС
	|				ИНАЧЕ СуммыВВалютахДт.СуммаНДСВзаиморасчетов
	|			КОНЕЦ * ВЫБОР
	|				КОГДА СуммыВВалютахДт.СуммаНДС < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		КОГДА ДвиженияДебетКредит.ОбъектУчетаКт В (&ОбъектыУчетаСНДС)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебетКредит.ВалютаДт = СуммыВВалютахДт.Валюта
	|					ТОГДА СуммыВВалютахДт.СуммаБезНДС + СуммыВВалютахДт.СуммаНДС
	|				ИНАЧЕ СуммыВВалютахДт.СуммаВзаиморасчетов
	|			КОНЕЦ * ВЫБОР
	|				КОГДА СуммыВВалютахДт.СуммаБезНДС < 0 ИЛИ СуммыВВалютахДт.СуммаНДС < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ДвиженияДебетКредит.ВалютаДт = СуммыВВалютахДт.Валюта
	|				ТОГДА СуммыВВалютахДт.СуммаБезНДС
	|			ИНАЧЕ СуммыВВалютахДт.СуммаВзаиморасчетов - СуммыВВалютахДт.СуммаНДСВзаиморасчетов
	|		КОНЕЦ * ВЫБОР
	|			КОГДА СуммыВВалютахДт.СуммаБезНДС < 0
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	КОНЕЦ КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.НастройкаХозОперации В (&ХозОперацииБезУчетаВВалюте)
	|			ТОГДА 0
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаКт
	|			ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалКт
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = &ВалютаУправленческогоУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрКт
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = ДвиженияДебетКредит.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглКт
	|		КОГДА ДвиженияДебетКредит.ВалютаКт = ДвиженияДебетКредит.ВалютаДт
	|			ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалДт
	|		КОГДА СуммыВВалютахКт.ИдентификаторСтроки ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ДвиженияДебетКредит.СуммаДвиженияУпрКт <> 0
	|					ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалКт * ДвиженияДебетКредит.СуммаУпрКт / ДвиженияДебетКредит.СуммаДвиженияУпрКт
	|				КОГДА ДвиженияДебетКредит.СуммаДвиженияРеглКт <> 0
	|					ТОГДА ДвиженияДебетКредит.СуммаДвиженияВалКт * ДвиженияДебетКредит.СуммаРеглКт / ДвиженияДебетКредит.СуммаДвиженияРеглКт
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(&ДлинаСуммы, &ТочностьСуммы))
	|		КОГДА ДвиженияДебетКредит.ВидДеятельностиНДСКт В (&ТипыНалогообложенияБезУчетаНДС)
	|		  ИЛИ ДвиженияДебетКредит.ВидДеятельностиНДСДт В (&ТипыНалогообложенияБезУчетаНДС)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебетКредит.ОбъектУчетаДт В (&ОбъектыУчетаНДС)
	|					ТОГДА 0
	|				КОГДА ДвиженияДебетКредит.ВалютаКт = СуммыВВалютахКт.Валюта
	|					ТОГДА СуммыВВалютахКт.СуммаБезНДС + СуммыВВалютахКт.СуммаНДС
	|				ИНАЧЕ СуммыВВалютахКт.СуммаВзаиморасчетов
	|			КОНЕЦ * ВЫБОР
	|				КОГДА СуммыВВалютахКт.СуммаБезНДС < 0 ИЛИ СуммыВВалютахКт.СуммаНДС < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		КОГДА ДвиженияДебетКредит.ОбъектУчетаДт В (&ОбъектыУчетаНДС)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебетКредит.ВалютаКт = СуммыВВалютахКт.Валюта
	|					ТОГДА СуммыВВалютахКт.СуммаНДС
	|				ИНАЧЕ СуммыВВалютахКт.СуммаНДСВзаиморасчетов
	|			КОНЕЦ * ВЫБОР
	|				КОГДА СуммыВВалютахКт.СуммаНДС < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		КОГДА ДвиженияДебетКредит.ОбъектУчетаДт В (&ОбъектыУчетаСНДС)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебетКредит.ВалютаКт = СуммыВВалютахКт.Валюта
	|					ТОГДА СуммыВВалютахКт.СуммаБезНДС + СуммыВВалютахКт.СуммаНДС
	|				ИНАЧЕ СуммыВВалютахКт.СуммаВзаиморасчетов
	|			КОНЕЦ * ВЫБОР
	|				КОГДА СуммыВВалютахКт.СуммаБезНДС < 0 ИЛИ СуммыВВалютахКт.СуммаНДС < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ДвиженияДебетКредит.ВалютаКт = СуммыВВалютахКт.Валюта
	|				ТОГДА СуммыВВалютахКт.СуммаБезНДС
	|			ИНАЧЕ СуммыВВалютахКт.СуммаВзаиморасчетов - СуммыВВалютахКт.СуммаНДСВзаиморасчетов
	|		КОНЕЦ * ВЫБОР
	|			КОГДА СуммыВВалютахКт.СуммаБезНДС < 0
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	КОНЕЦ КАК СуммаВалКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.КоличествоДвиженияДт = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаДт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьРаспределениеКоличестваДт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебетКредит.КоличествоДвиженияКт = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьРаспределениеКоличестваКт,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.КоличествоДвиженияДт = 0
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияДт
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаДт
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияДт
	|		КОГДА ДвиженияДебетКредит.СуммаДвиженияУпрДт <> 0
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияДт * ДвиженияДебетКредит.СуммаУпрДт / ДвиженияДебетКредит.СуммаДвиженияУпрДт
	|		КОГДА ДвиженияДебетКредит.СуммаДвиженияРеглДт <> 0
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияДт * ДвиженияДебетКредит.СуммаРеглДт / ДвиженияДебетКредит.СуммаДвиженияРеглДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(&ДлинаКоличества, &ТочностьКоличества)) КАК КоличествоДт,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.КоличествоДвиженияКт = 0
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияКт
	|		КОГДА НЕ ДвиженияДебетКредит.СложнаяПроводкаКт
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияКт
	|		КОГДА ДвиженияДебетКредит.СуммаДвиженияУпрКт <> 0
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияКт * ДвиженияДебетКредит.СуммаУпрКт / ДвиженияДебетКредит.СуммаДвиженияУпрКт
	|		КОГДА ДвиженияДебетКредит.СуммаДвиженияРеглКт <> 0
	|			ТОГДА ДвиженияДебетКредит.КоличествоДвиженияКт * ДвиженияДебетКредит.СуммаРеглКт / ДвиженияДебетКредит.СуммаДвиженияРеглКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(&ДлинаКоличества, &ТочностьКоличества)) КАК КоличествоКт
	|ПОМЕСТИТЬ втРаспределениеНебалансовых
	|ИЗ
	|	втДвиженияДебетКредит КАК ДвиженияДебетКредит
	|	ЛЕВОЕ СОЕДИНЕНИЕ втСуммыДокументовВВалютахУчета КАК СуммыВВалютахДт
	|		ПО ДвиженияДебетКредит.Регистратор = СуммыВВалютахДт.Регистратор
	|		 И ДвиженияДебетКредит.ИдентификаторСтрокиКт = СуммыВВалютахДт.ИдентификаторСтроки
	|		 И ДвиженияДебетКредит.СложнаяПроводкаДт
	|		 И (ДвиженияДебетКредит.ВалютаДт = СуммыВВалютахДт.Валюта
	|			ИЛИ (ДвиженияДебетКредит.ВалютаДт = СуммыВВалютахДт.ВалютаВзаиморасчетов И СуммыВВалютахДт.СуммаНДСВзаиморасчетов <> 0))
	|		 И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втДокументыЗаменыРеверсаНаСторно КАК ДокументыЗаменыРеверса
	|			ГДЕ
	|				ДокументыЗаменыРеверса.Период = ДвиженияДебетКредит.Период
	|				И ДокументыЗаменыРеверса.Регистратор = ДвиженияДебетКредит.Регистратор
	|				И ДокументыЗаменыРеверса.ИдентификаторФинЗаписи = ДвиженияДебетКредит.ИдентификаторФинЗаписи
	|				И ДокументыЗаменыРеверса.Организация = ДвиженияДебетКредит.Организация
	|				И ДокументыЗаменыРеверса.РеквизитСторно = ДвиженияДебетКредит.РеквизитСторно
	|			)
	|	ЛЕВОЕ СОЕДИНЕНИЕ втСуммыДокументовВВалютахУчета КАК СуммыВВалютахКт
	|		ПО ДвиженияДебетКредит.Регистратор = СуммыВВалютахКт.Регистратор
	|		 И ДвиженияДебетКредит.ИдентификаторСтрокиДт = СуммыВВалютахКт.ИдентификаторСтроки
	|		 И ДвиженияДебетКредит.СложнаяПроводкаКт
	|		 И (ДвиженияДебетКредит.ВалютаКт = СуммыВВалютахКт.Валюта
	|			ИЛИ (ДвиженияДебетКредит.ВалютаКт = СуммыВВалютахКт.ВалютаВзаиморасчетов И СуммыВВалютахКт.СуммаНДСВзаиморасчетов <> 0))
	|		 И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втДокументыЗаменыРеверсаНаСторно КАК ДокументыЗаменыРеверса
	|			ГДЕ
	|				ДокументыЗаменыРеверса.Период = ДвиженияДебетКредит.Период
	|				И ДокументыЗаменыРеверса.Регистратор = ДвиженияДебетКредит.Регистратор
	|				И ДокументыЗаменыРеверса.ИдентификаторФинЗаписи = ДвиженияДебетКредит.ИдентификаторФинЗаписи
	|				И ДокументыЗаменыРеверса.Организация = ДвиженияДебетКредит.Организация
	|				И ДокументыЗаменыРеверса.РеквизитСторно = ДвиженияДебетКредит.РеквизитСторно
	|			)
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки,
	|	НомерЗаписиДт,
	|	НомерЗаписиКт,
	|	НомерСложнойЗаписи
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДлинаСуммы", ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Запрос.Параметры.ДлинаСуммы));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТочностьСуммы", ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Запрос.Параметры.ТочностьСуммы));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДлинаКоличества", ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Запрос.Параметры.ДлинаКоличества));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТочностьКоличества", ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокаВыборкиЗначения(Запрос.Параметры.ТочностьКоличества));
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);

	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияДебетКредит");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втСуммыДокументовВВалютахУчета");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьТаблицуОшибокОкругленияСуммы(ТекстыЗапросов, "втКоррекцияОшибокСуммВалДт", "РаспределяемаяСуммаВалДт", "СуммаВалДт");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьТаблицуОшибокОкругленияСуммы(ТекстыЗапросов, "втКоррекцияОшибокСуммВалКт", "РаспределяемаяСуммаВалКт", "СуммаВалКт");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьТаблицуОшибокОкругленияКоличества(ТекстыЗапросов, "втКоррекцияОшибокКоличествДт", "РаспределяемоеКоличествоДт", "КоличествоДт");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьТаблицуОшибокОкругленияКоличества(ТекстыЗапросов, "втКоррекцияОшибокКоличествКт", "РаспределяемоеКоличествоКт", "КоличествоКт");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	РаспределениеНебалансовых.Период КАК Период,
	|	РаспределениеНебалансовых.НомерСтроки КАК НомерЗаписи,
	|	РаспределениеНебалансовых.НомерЗаписиДт КАК НомерЗаписиДт,
	|	РаспределениеНебалансовых.НомерЗаписиКт КАК НомерЗаписиКт,
	|	РаспределениеНебалансовых.ИмяРегистраДт КАК ИмяРегистраДт,
	|	РаспределениеНебалансовых.ИмяРегистраКт КАК ИмяРегистраКт,
	|	РаспределениеНебалансовых.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	РаспределениеНебалансовых.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	РаспределениеНебалансовых.ЭтоСторноДт КАК ЭтоСторноДт,
	|	РаспределениеНебалансовых.ЭтоСторноКт КАК ЭтоСторноКт,
	|	РаспределениеНебалансовых.Организация КАК Организация,
	|	РаспределениеНебалансовых.Регистратор КАК Регистратор,
	|	РаспределениеНебалансовых.НастройкаХозОперации КАК НастройкаХозОперации,
	|	РаспределениеНебалансовых.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РаспределениеНебалансовых.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	РаспределениеНебалансовых.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	РаспределениеНебалансовых.ВалютаДт КАК ВалютаДт,
	|	РаспределениеНебалансовых.ВалютаКт КАК ВалютаКт,
	|	РаспределениеНебалансовых.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	РаспределениеНебалансовых.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	РаспределениеНебалансовых.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	РаспределениеНебалансовых.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	РаспределениеНебалансовых.РеквизитСторно КАК РеквизитСторно,
	|	РаспределениеНебалансовых.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	РаспределениеНебалансовых.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	РаспределениеНебалансовых.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	РаспределениеНебалансовых.СуммаУпрДт КАК СуммаУпрДт,
	|	РаспределениеНебалансовых.СуммаУпрКт КАК СуммаУпрКт,
	|	РаспределениеНебалансовых.СуммаРеглДт КАК СуммаРеглДт,
	|	РаспределениеНебалансовых.СуммаРеглКт КАК СуммаРеглКт,
	|	РаспределениеНебалансовых.СуммаВалДт + ЕСТЬNULL(КоррекцияОшибокСуммВалДт.ОшибкаОкругления, 0) КАК СуммаВалДт,
	|	РаспределениеНебалансовых.СуммаВалКт + ЕСТЬNULL(КоррекцияОшибокСуммВалКт.ОшибкаОкругления, 0) КАК СуммаВалКт,
	|	РаспределениеНебалансовых.КоличествоДт + ЕСТЬNULL(КоррекцияОшибокКоличествДт.ОшибкаОкругления, 0) КАК КоличествоДт,
	|	РаспределениеНебалансовых.КоличествоКт + ЕСТЬNULL(КоррекцияОшибокКоличествКт.ОшибкаОкругления, 0) КАК КоличествоКт
	|ПОМЕСТИТЬ втДвиженияДебетКредит
	|ИЗ
	|	втРаспределениеНебалансовых КАК РаспределениеНебалансовых
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКоррекцияОшибокСуммВалДт КАК КоррекцияОшибокСуммВалДт
	|		ПО РаспределениеНебалансовых.НомерЗаписиДт = КоррекцияОшибокСуммВалДт.НомерЗаписиДт
	|		 И РаспределениеНебалансовых.НомерСтроки = КоррекцияОшибокСуммВалДт.НомерСтроки
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКоррекцияОшибокСуммВалКт КАК КоррекцияОшибокСуммВалКт
	|		ПО РаспределениеНебалансовых.НомерЗаписиКт = КоррекцияОшибокСуммВалКт.НомерЗаписиКт
	|		 И РаспределениеНебалансовых.НомерСтроки = КоррекцияОшибокСуммВалКт.НомерСтроки
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКоррекцияОшибокКоличествДт КАК КоррекцияОшибокКоличествДт
	|		ПО РаспределениеНебалансовых.НомерЗаписиДт = КоррекцияОшибокКоличествДт.НомерЗаписиДт
	|		 И РаспределениеНебалансовых.НомерСтроки = КоррекцияОшибокКоличествДт.НомерСтроки
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКоррекцияОшибокКоличествКт КАК КоррекцияОшибокКоличествКт
	|		ПО РаспределениеНебалансовых.НомерЗаписиКт = КоррекцияОшибокКоличествКт.НомерЗаписиКт
	|		 И РаспределениеНебалансовых.НомерСтроки = КоррекцияОшибокКоличествКт.НомерСтроки
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	ИмяРегистраДт,
	|	ИмяРегистраКт,
	|	ОбъектУчетаДт,
	|	ОбъектУчетаКт
	|");
	
	УдаляемыеВременныеТаблицы = Новый Массив();
	УдаляемыеВременныеТаблицы.Добавить("втРаспределениеНебалансовых");
	УдаляемыеВременныеТаблицы.Добавить("втКоррекцияОшибокСуммВалДт");
	УдаляемыеВременныеТаблицы.Добавить("втКоррекцияОшибокСуммВалКт");
	УдаляемыеВременныеТаблицы.Добавить("втКоррекцияОшибокКоличествДт");
	УдаляемыеВременныеТаблицы.Добавить("втКоррекцияОшибокКоличествКт");

	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, УдаляемыеВременныеТаблицы);
	
КонецПроцедуры

Процедура ПроверитьОшибкиКорреспонденций(Запрос, ТекстыЗапросов, ДокументыКОбработке, ТаблицаПравил)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияДебетКредит.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияДебетКредит.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияДебетКредит.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияДебетКредит.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.СуммаУпрДт КАК СуммаУпрДт,
	|	ДвиженияДебетКредит.СуммаУпрКт КАК СуммаУпрКт,
	|	ДвиженияДебетКредит.СуммаРеглДт КАК СуммаРеглДт,
	|	ДвиженияДебетКредит.СуммаРеглКт КАК СуммаРеглКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втОшибкиКорреспонденций
	|ИЗ
	|	втДвиженияДебетКредит КАК ДвиженияДебетКредит
	|ГДЕ
	|	ДвиженияДебетКредит.ИмяРегистраДт = """"
	|	ИЛИ ДвиженияДебетКредит.ИмяРегистраКт = """"
	|	ИЛИ ДвиженияДебетКредит.ОбъектУчетаДт = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	ИЛИ ДвиженияДебетКредит.ОбъектУчетаКт = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	ИЛИ ДвиженияДебетКредит.ИдентификаторФинЗаписи = """"
	|	ИЛИ ДвиженияДебетКредит.СуммаУпрДт <> ДвиженияДебетКредит.СуммаУпрКт
	|	ИЛИ ДвиженияДебетКредит.СуммаРеглДт <> ДвиженияДебетКредит.СуммаРеглКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияДебетКредит.Период КАК Период,
	|	&ИмяРегистраСлужебныхОбъектовУчета КАК ИмяРегистраДт,
	|	&ИмяРегистраСлужебныхОбъектовУчета КАК ИмяРегистраКт,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.ОбъектУчетаДт
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	КОНЕЦ) КАК ОбъектУчетаДт,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.ОбъектУчетаКт
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	КОНЕЦ) КАК ОбъектУчетаКт,
	|	ЛОЖЬ КАК ЭтоСторноДт,
	|	ЛОЖЬ КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК НастройкаХозОперации,
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|	СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрДт
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаУпрДт,
	|	СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрКт
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаУпрКт,
	|	СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглДт
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаРеглДт,
	|	СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглКт
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаРеглКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно
	|ИЗ
	|	втДвиженияДебетКредит КАК ДвиженияДебетКредит
	|ГДЕ
	|	(ДвиженияДебетКредит.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|	И НЕ ДвиженияДебетКредит.ОбъектУчетаДт В
	|		(ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВводОстатков),
	|		 ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.НесобственныеЦенности)))
	|	ИЛИ
	|	(ДвиженияДебетКредит.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|	И НЕ ДвиженияДебетКредит.ОбъектУчетаКт В
	|		(ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВводОстатков),
	|		 ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.НесобственныеЦенности)))
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияДебетКредит.Период,
	|	ДвиженияДебетКредит.Регистратор,
	|	ДвиженияДебетКредит.Организация,
	|	ДвиженияДебетКредит.РеквизитСторно
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрДт
	|		ИНАЧЕ 0
	|	КОНЕЦ) <> СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаУпрКт
	|		ИНАЧЕ 0
	|	КОНЕЦ)
	|	ИЛИ
	|	СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглДт
	|		ИНАЧЕ 0
	|	КОНЕЦ) <> СУММА(ВЫБОР
	|		КОГДА ДвиженияДебетКредит.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|			ТОГДА ДвиженияДебетКредит.СуммаРеглКт
	|		ИНАЧЕ 0
	|	КОНЕЦ)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	РеквизитСторно
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ОшибкиКорреспонденций.Период КАК Период,
	|	ОшибкиКорреспонденций.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ОшибкиКорреспонденций.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ОшибкиКорреспонденций.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ОшибкиКорреспонденций.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ОшибкиКорреспонденций.Организация КАК Организация,
	|	ОшибкиКорреспонденций.Регистратор КАК Регистратор,
	|	ОшибкиКорреспонденций.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ОшибкиКорреспонденций.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ОшибкиКорреспонденций.СуммаУпрДт КАК СуммаУпрДт,
	|	ОшибкиКорреспонденций.СуммаУпрКт КАК СуммаУпрКт,
	|	ОшибкиКорреспонденций.СуммаРеглДт КАК СуммаРеглДт,
	|	ОшибкиКорреспонденций.СуммаРеглКт КАК СуммаРеглКт,
	|	ОшибкиКорреспонденций.РеквизитСторно КАК РеквизитСторно
	|ИЗ
	|	втОшибкиКорреспонденций КАК ОшибкиКорреспонденций
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ОшибкиКорреспонденций.Период КАК Период,
	|	ОшибкиКорреспонденций.Организация КАК Организация,
	|	ОшибкиКорреспонденций.Регистратор КАК Регистратор,
	|	МАКСИМУМ(КэшИменДокументовПоПравилу.Правило) КАК ПравилоПолученияФакта
	|ИЗ
	|	втОшибкиКорреспонденций КАК ОшибкиКорреспонденций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПорцияДокументов КАК ПорцияДокументов
	|	ПО ОшибкиКорреспонденций.Регистратор = ПорцияДокументов.Регистратор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КэшИменДокументовДляОбработкиПоПравилу КАК КэшИменДокументовПоПравилу
	|	ПО ПорцияДокументов.ВидДокумента = КэшИменДокументовПоПравилу.ВидДокумента
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втПравилаОперативногоУчета КАК ПравилаОперативногоУчета
	|		ГДЕ
	|			ПравилаОперативногоУчета.Ссылка = КэшИменДокументовПоПравилу.Правило
	|		)
	|СГРУППИРОВАТЬ ПО
	|	ОшибкиКорреспонденций.Период,
	|	ОшибкиКорреспонденций.Регистратор,
	|	ОшибкиКорреспонденций.Организация
	|");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результаты = Запрос.ВыполнитьПакет();
	ТекстыЗапросов.Очистить();
	
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	
	Выборка = Результаты[Результаты.ВГраница() - 1].Выбрать();
	ВыборкаКорреспонденции = Результаты[Результаты.ВГраница()].Выбрать();
	
	Пока ВыборкаКорреспонденции.Следующий() Цикл
		ОшибкиКорреспонденции = Новый Соответствие();
		
		СтруктураПоиска = Новый Структура("Период,Организация,Регистратор");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаКорреспонденции);
		
		Выборка.Сбросить();
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторФинЗаписи) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнен идентификатор фин.записи в %1';
									|en = 'Financial record ID is required in %1'");
				Если НЕ ЗначениеЗаполнено(Выборка.ИмяРегистраДт)
					ИЛИ Выборка.ИмяРегистраДт = ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
					ТекстОшибки = СтрШаблон(ТекстОшибки, СтрШаблон(НСтр("ru = 'регистре ""%1""';
																		|en = 'the ""%1"" register'"),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраКт])));
				ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ИмяРегистраКт)
					ИЛИ Выборка.ИмяРегистраКт = ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
					ТекстОшибки = СтрШаблон(ТекстОшибки, СтрШаблон(НСтр("ru = 'регистре ""%1""';
																		|en = 'the ""%1"" register'"),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт])));
				ИначеЕсли Выборка.ИмяРегистраДт = Выборка.ИмяРегистраКт Тогда
					ТекстОшибки = СтрШаблон(ТекстОшибки, СтрШаблон(НСтр("ru = 'регистре ""%1""';
																		|en = 'the ""%1"" register'"),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт])));
				Иначе
					ТекстОшибки = СтрШаблон(ТекстОшибки, СтрШаблон(НСтр("ru = 'регистрах ""%1"" и ""%2""';
																		|en = 'the ""%1"" and ""%2"" registers'"),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт]),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраКт])));
				КонецЕсли;
				ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ИмяРегистраДт) Тогда
				
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найдена корреспонденция для записи регистра ""%1"" с идентификатором %2';
											|en = 'Correspondence for the ""%1"" register record with the %2 ID is not found'"),
					ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраКт]),
					Выборка.ИдентификаторФинЗаписи);
				ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ИмяРегистраКт) Тогда
				
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найдена корреспонденция для записи регистра ""%1"" с идентификатором %2';
											|en = 'Correspondence for the ""%1"" register record with the %2 ID is not found'"),
					ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт]),
					Выборка.ИдентификаторФинЗаписи);
				ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(Выборка.ОбъектУчетаДт)
					И Выборка.ИмяРегистраДт <> ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = 'Не определен объект учета для записи регистра ""%1"" с идентификатором %2';
												|en = 'Accounting object is not defined for the ""%1"" register record with the %2 ID'"),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт]),
						Выборка.ИдентификаторФинЗаписи);
					ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Выборка.ОбъектУчетаКт)
					И Выборка.ИмяРегистраКт <> ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = 'Не определен объект учета для записи регистра ""%1"" с идентификатором %2';
												|en = 'Accounting object is not defined for the ""%1"" register record with the %2 ID'"),
						ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраКт]),
						Выборка.ИдентификаторФинЗаписи);
					ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				КонецЕсли;
				
				Если Выборка.СуммаУпрДт <> Выборка.СуммаУпрКт Тогда
					Если Выборка.ИмяРегистраДт = ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
						ТекстОшибки = СтрШаблон(НСтр("ru = 'Не совпадают суммы управленческого учета дебета и кредита по объекту учета ""%1""';
													|en = 'The amounts of management accounting of debit and credit for the ""%1"" accounting object do not match'"),
							?(ЗначениеЗаполнено(Выборка.ОбъектУчетаДт), Выборка.ОбъектУчетаДт, Выборка.ОбъектУчетаКт));
					Иначе
						ТекстОшибки = СтрШаблон(НСтр("ru = 'Не совпадают суммы управленческого учета записей регистров ""%1"" и ""%2"" с идентификатором %3';
													|en = 'The amounts of management accounting of the ""%1"" and ""%2"" register records with the %3 ID do not match'"),
							ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт]),
							ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраКт]),
							Выборка.ИдентификаторФинЗаписи);
					КонецЕсли;
					ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				КонецЕсли;
				
				Если Выборка.СуммаРеглДт <> Выборка.СуммаРеглКт Тогда
					Если Выборка.ИмяРегистраДт = ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
						ТекстОшибки = СтрШаблон(НСтр("ru = 'Не совпадают суммы регламентированного учета дебета и кредита по объекту учета ""%1""';
													|en = 'The amounts of local accounting of debit and credit for the ""%1"" accounting object do not match'"),
							?(ЗначениеЗаполнено(Выборка.ОбъектУчетаДт), Выборка.ОбъектУчетаДт, Выборка.ОбъектУчетаКт));
					Иначе
						ТекстОшибки = СтрШаблон(НСтр("ru = 'Не совпадают суммы регламентированного учета записей регистров ""%1"" и ""%2"" с идентификатором %3';
													|en = 'The amounts of local accounting of the ""%1"" and ""%2"" register records with the %3 ID do not match'"),
							ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраДт]),
							ОбщегоНазначения.ПредставлениеОбъекта(РегистрыНакопленияМетаданные[Выборка.ИмяРегистраКт]),
							Выборка.ИдентификаторФинЗаписи);
					КонецЕсли;
					ОшибкиКорреспонденции.Вставить(ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ОшибкиКорреспонденции.Количество() > 0 Тогда
			ТекстОшибки = "";
			Для Каждого КлючИЗначение Из ОшибкиКорреспонденции Цикл
				ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + КлючИЗначение.Ключ;
			КонецЦикла;
			
			СтруктураПоиска = Новый Структура("Правило", ВыборкаКорреспонденции.ПравилоПолученияФакта);
			ОписаниеПравила = ТаблицаПравил.НайтиСтроки(СтруктураПоиска)[0];
			
			ЗарегистрироватьОшибкуОбработкиДокумента(ТекстОшибки, ВыборкаКорреспонденции, ДокументыКОбработке, ОписаниеПравила);
		КонецЕсли;
	КонецЦикла;
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ОшибкиКорреспонденций.Период КАК Период,
	|	ОшибкиКорреспонденций.Организация КАК Организация,
	|	ОшибкиКорреспонденций.Регистратор КАК Регистратор,
	|	ОшибкиКорреспонденций.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втРегистраторыСОшибками
	|ИЗ
	|	втОшибкиКорреспонденций КАК ОшибкиКорреспонденций
	|СГРУППИРОВАТЬ ПО
	|	ОшибкиКорреспонденций.Период,
	|	ОшибкиКорреспонденций.Регистратор,
	|	ОшибкиКорреспонденций.Организация,
	|	ОшибкиКорреспонденций.РеквизитСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	РеквизитСторно
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втОшибкиКорреспонденций");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияДебетКредит.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияДебетКредит.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияДебетКредит.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияДебетКредит.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт ИЛИ ДвиженияДебетКредит.ЭтоСторноКт КАК ИнвертироватьКорреспонденцию,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно,
	|	ДвиженияДебетКредит.ВалютаДт КАК ВалютаДт,
	|	ДвиженияДебетКредит.ВалютаКт КАК ВалютаКт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ДвиженияДебетКредит.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ДвиженияДебетКредит.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ДвиженияДебетКредит.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ДвиженияДебетКредит.СуммаУпрДт КАК СуммаУпрДт,
	|	ДвиженияДебетКредит.СуммаУпрКт КАК СуммаУпрКт,
	|	ДвиженияДебетКредит.СуммаРеглДт КАК СуммаРеглДт,
	|	ДвиженияДебетКредит.СуммаРеглКт КАК СуммаРеглКт,
	|	ДвиженияДебетКредит.СуммаВалДт КАК СуммаВалДт,
	|	ДвиженияДебетКредит.СуммаВалКт КАК СуммаВалКт,
	|	ДвиженияДебетКредит.КоличествоДт КАК КоличествоДт,
	|	ДвиженияДебетКредит.КоличествоКт КАК КоличествоКт
	|ПОМЕСТИТЬ втКорреспонденцииДвижений
	|ИЗ
	|	втДвиженияДебетКредит КАК ДвиженияДебетКредит
	|ГДЕ
	|	НЕ ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втРегистраторыСОшибками КАК РегистраторыСОшибками
	|		ГДЕ
	|			РегистраторыСОшибками.Период = ДвиженияДебетКредит.Период
	|			И РегистраторыСОшибками.Регистратор = ДвиженияДебетКредит.Регистратор
	|			И РегистраторыСОшибками.Организация = ДвиженияДебетКредит.Организация
	|			И РегистраторыСОшибками.РеквизитСторно = ДвиженияДебетКредит.РеквизитСторно
	|		)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ОбъектУчетаДт,
	|	ОбъектУчетаКт,
	|	ИнвертироватьКорреспонденцию
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияДебетКредит");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРегистраторыСОшибками");
	
КонецПроцедуры

Процедура СформироватьТаблицуДвиженийСлужебныхОбъектовУчета(Запрос, ТекстыЗапросов)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоДебет,
	|	ЛОЖЬ КАК ЭтоКредит,
	|	КорреспонденцииДвижений.Период КАК Период,
	|	КорреспонденцииДвижений.ИмяРегистраДт КАК ИмяРегистра,
	|	КорреспонденцииДвижений.ОбъектУчетаДт КАК ОбъектУчета,
	|	КорреспонденцииДвижений.ЭтоСторноДт КАК ЭтоСторно,
	|	КорреспонденцииДвижений.Регистратор КАК Регистратор,
	|	КорреспонденцииДвижений.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	КорреспонденцииДвижений.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиДт КАК ИдентификаторСтроки,
	|	КорреспонденцииДвижений.ВалютаДт КАК Валюта,
	|	КорреспонденцииДвижений.РеквизитСторно КАК РеквизитСторно,
	|	СУММА(КорреспонденцииДвижений.СуммаУпрДт) КАК СуммаУпр,
	|	СУММА(КорреспонденцииДвижений.СуммаРеглДт) КАК СуммаРегл,
	|	СУММА(КорреспонденцииДвижений.СуммаВалДт) КАК СуммаВал,
	|	СУММА(КорреспонденцииДвижений.КоличествоДт) КАК Количество
	|ПОМЕСТИТЬ ТаблицаДляПомещения
	|ИЗ
	|	втКорреспонденцииДвижений КАК КорреспонденцииДвижений
	|ГДЕ
	|	КорреспонденцииДвижений.ИмяРегистраДт = &ИмяРегистраСлужебныхОбъектовУчета
	|СГРУППИРОВАТЬ ПО
	|	КорреспонденцииДвижений.Период,
	|	КорреспонденцииДвижений.ИмяРегистраДт,
	|	КорреспонденцииДвижений.ОбъектУчетаДт,
	|	КорреспонденцииДвижений.ЭтоСторноДт,
	|	КорреспонденцииДвижений.Регистратор,
	|	КорреспонденцииДвижений.Организация,
	|	КорреспонденцииДвижений.НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиДт,
	|	КорреспонденцииДвижений.ВалютаДт,
	|	КорреспонденцииДвижений.РеквизитСторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоДебет,
	|	ИСТИНА КАК ЭтоКредит,
	|	КорреспонденцииДвижений.Период КАК Период,
	|	КорреспонденцииДвижений.ИмяРегистраКт КАК ИмяРегистра,
	|	КорреспонденцииДвижений.ОбъектУчетаКт КАК ОбъектУчета,
	|	КорреспонденцииДвижений.ЭтоСторноКт КАК ЭтоСторно,
	|	КорреспонденцииДвижений.Регистратор КАК Регистратор,
	|	КорреспонденцииДвижений.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	КорреспонденцииДвижений.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиКт КАК ИдентификаторСтроки,
	|	КорреспонденцииДвижений.ВалютаКт КАК Валюта,
	|	КорреспонденцииДвижений.РеквизитСторно КАК РеквизитСторно,
	|	СУММА(КорреспонденцииДвижений.СуммаУпрКт) КАК СуммаУпр,
	|	СУММА(КорреспонденцииДвижений.СуммаРеглКт) КАК СуммаРегл,
	|	СУММА(КорреспонденцииДвижений.СуммаВалКт) КАК СуммаВал,
	|	СУММА(КорреспонденцииДвижений.КоличествоКт) КАК Количество
	|ИЗ
	|	втКорреспонденцииДвижений КАК КорреспонденцииДвижений
	|ГДЕ
	|	КорреспонденцииДвижений.ИмяРегистраКт = &ИмяРегистраСлужебныхОбъектовУчета
	|СГРУППИРОВАТЬ ПО
	|	КорреспонденцииДвижений.Период,
	|	КорреспонденцииДвижений.ИмяРегистраКт,
	|	КорреспонденцииДвижений.ОбъектУчетаКт,
	|	КорреспонденцииДвижений.ЭтоСторноКт,
	|	КорреспонденцииДвижений.Регистратор,
	|	КорреспонденцииДвижений.Организация,
	|	КорреспонденцииДвижений.НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиКт,
	|	КорреспонденцииДвижений.ВалютаКт,
	|	КорреспонденцииДвижений.РеквизитСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	ИдентификаторСтроки,
	|	ОбъектУчета,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДляПомещения", "вт" + ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета());
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура СформироватьТаблицуСложныхКорреспонденций(Запрос, ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	КорреспонденцииДвижений.НомерЗаписи КАК НомерЗаписи,
	|	КорреспонденцииДвижений.Период КАК Период,
	|	КорреспонденцииДвижений.Организация КАК Организация,
	|	КорреспонденцииДвижений.Регистратор КАК Регистратор,
	|	КорреспонденцииДвижений.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.РеквизитСторно КАК РеквизитСторно,
	|	КорреспонденцииДвижений.СуммаДвиженияУпрДт КАК СуммаДвиженияУпр,
	|	КорреспонденцииДвижений.СуммаДвиженияРеглДт КАК СуммаДвиженияРегл,
	|	КорреспонденцииДвижений.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	КорреспонденцииДвижений.СуммаУпрДт КАК СуммаУпр,
	|	КорреспонденцииДвижений.СуммаРеглДт КАК СуммаРегл
	|ПОМЕСТИТЬ втСложныеКорреспонденции
	|ИЗ
	|	втКорреспонденцииДвижений КАК КорреспонденцииДвижений
	|ГДЕ
	|	КорреспонденцииДвижений.СложнаяПроводкаДт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорреспонденцииДвижений.НомерЗаписи КАК НомерЗаписи,
	|	КорреспонденцииДвижений.Период КАК Период,
	|	КорреспонденцииДвижений.Организация КАК Организация,
	|	КорреспонденцииДвижений.Регистратор КАК Регистратор,
	|	КорреспонденцииДвижений.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.РеквизитСторно КАК РеквизитСторно,
	|	КорреспонденцииДвижений.СуммаДвиженияУпрКт КАК СуммаДвиженияУпр,
	|	КорреспонденцииДвижений.СуммаДвиженияРеглКт КАК СуммаДвиженияРегл,
	|	КорреспонденцииДвижений.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	КорреспонденцииДвижений.СуммаУпрКт КАК СуммаУпр,
	|	КорреспонденцииДвижений.СуммаРеглКт КАК СуммаРегл
	|ИЗ
	|	втКорреспонденцииДвижений КАК КорреспонденцииДвижений
	|ГДЕ
	|	КорреспонденцииДвижений.СложнаяПроводкаКт
	|");
	
КонецПроцедуры

Процедура СформироватьПравилаПолученияФактаКорреспонденций(Запрос, ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаПолученияФакта.Ссылка КАК Ссылка,
	|	ПравилаПолученияФакта.ДействуетС КАК ДействуетС,
	|	ПравилаПолученияФакта.ДействуетПо КАК ДействуетПо,
	|	ВЫРАЗИТЬ(ПравилаПолученияФакта.ИсточникДанных КАК ПланВидовХарактеристик.СтатьиАктивовПассивов) КАК ИсточникДанных,
	|	ВЫРАЗИТЬ(ПравилаПолученияФакта.КорИсточникДанных КАК ПланВидовХарактеристик.СтатьиАктивовПассивов) КАК КорИсточникДанных,
	|	ВЫРАЗИТЬ(ПравилаПолученияФакта.ПредставлениеОтбора КАК СТРОКА(16)) <> """" КАК ПравилоСодержитОтбор,
	|	ПравилаПолученияФакта.ТипИтога КАК ТипИтога
	|ПОМЕСТИТЬ втПравилаПолученияФакта
	|ИЗ
	|	Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФакта
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПравилаОперативногоУчета КАК ПравилаОперативногоУчета
	|		ПО ПравилаПолученияФакта.Ссылка = ПравилаОперативногоУчета.Ссылка
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПравилаПолученияФакта.ИсточникДанных) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипИтога
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втПравилаОперативногоУчета");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаПолученияФакта.Ссылка КАК Ссылка,
	|	ПравилаПолученияФакта.ДействуетС КАК ДействуетС,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ДействуетПо = ДАТАВРЕМЯ(0001, 01, 01)
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|		ИНАЧЕ ПравилаПолученияФакта.ДействуетПо
	|	КОНЕЦ КАК ДействуетПо,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ТипИтога = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)
	|			ТОГДА ПравилаПолученияФакта.КорИсточникДанных
	|		ИНАЧЕ ПравилаПолученияФакта.ИсточникДанных
	|	КОНЕЦ КАК ИсточникДанныхДт,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ТипИтога = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)
	|			ТОГДА ПравилаПолученияФакта.ИсточникДанных
	|		ИНАЧЕ ПравилаПолученияФакта.КорИсточникДанных
	|	КОНЕЦ КАК ИсточникДанныхКт,
	|	ПравилаПолученияФакта.ПравилоСодержитОтбор КАК ПравилоСодержитОтбор,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ТипИтога = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)
	|			ТОГДА ПравилаПолученияФакта.КорИсточникДанных
	|		ИНАЧЕ ПравилаПолученияФакта.ИсточникДанных
	|	КОНЕЦ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК ПустойИсточникДанныхДт,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ТипИтога = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)
	|			ТОГДА ПравилаПолученияФакта.ИсточникДанных
	|		ИНАЧЕ ПравилаПолученияФакта.КорИсточникДанных
	|	КОНЕЦ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК ПустойИсточникДанныхКт,
	|	ПравилаПолученияФакта.ТипИтога = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт) КАК ИнверсияИсточниковДанных,
	|	ЛОЖЬ КАК ИнверсияФактическихДанных
	|ПОМЕСТИТЬ втПравилаПолученияФактаКорреспонденций
	|ИЗ
	|	втПравилаПолученияФакта КАК ПравилаПолученияФакта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаПолученияФакта.Ссылка КАК Ссылка,
	|	ПравилаПолученияФакта.ДействуетС КАК ДействуетС,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ДействуетПо = ДАТАВРЕМЯ(0001, 01, 01)
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|		ИНАЧЕ ПравилаПолученияФакта.ДействуетПо
	|	КОНЕЦ КАК ДействуетПо,
	|	ПравилаПолученияФакта.КорИсточникДанных КАК ИсточникДанныхДт,
	|	ПравилаПолученияФакта.ИсточникДанных КАК ИсточникДанныхКт,
	|	ПравилаПолученияФакта.ПравилоСодержитОтбор КАК ПравилоСодержитОтбор,
	|	ПравилаПолученияФакта.КорИсточникДанных = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК ПустойИсточникДанныхДт,
	|	ПравилаПолученияФакта.ИсточникДанных = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК ПустойИсточникДанныхКт,
	|	ИСТИНА КАК ИнверсияИсточниковДанных,
	|	ИСТИНА КАК ИнверсияФактическихДанных
	|ИЗ
	|	втПравилаПолученияФакта КАК ПравилаПолученияФакта
	|ГДЕ
	|	ПравилаПолученияФакта.ТипИтога = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот)
	|ИНДЕКСИРОВАТЬ ПО
	|	ДействуетС,
	|	ДействуетПо,
	|	ИсточникДанныхДт,
	|	ИсточникДанныхКт,
	|	ПустойИсточникДанныхДт,
	|	ПустойИсточникДанныхКт
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втПравилаПолученияФакта");
	
КонецПроцедуры

Процедура ПрименитьПравилаПолученияФактаККорреспонденциям(Запрос, ТекстыЗапросов, ТекстыЗапросовРегистров)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаПолученияФакта.Ссылка КАК ПравилоПолученияФакта,
	|	ПравилаПолученияФакта.ПравилоСодержитОтбор КАК ПравилоСодержитОтбор,
	|	ПравилаПолученияФакта.ПустойИсточникДанныхДт КАК ПустойИсточникДанныхДт,
	|	ПравилаПолученияФакта.ПустойИсточникДанныхКт КАК ПустойИсточникДанныхКт,
	|	ПравилаПолученияФакта.ИнверсияИсточниковДанных КАК ИнверсияИсточниковДанных,
	|	ПравилаПолученияФакта.ИнверсияФактическихДанных КАК ИнверсияФактическихДанных,
	|	КорреспонденцииДвижений.НомерЗаписи КАК НомерЗаписи,
	|	КорреспонденцииДвижений.Период КАК Период,
	|	КорреспонденцииДвижений.ИмяРегистраДт КАК ИмяРегистраДт,
	|	КорреспонденцииДвижений.ИмяРегистраКт КАК ИмяРегистраКт,
	|	КорреспонденцииДвижений.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	КорреспонденцииДвижений.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	КорреспонденцииДвижений.ЭтоСторноДт КАК ЭтоСторноДт,
	|	КорреспонденцииДвижений.ЭтоСторноКт КАК ЭтоСторноКт,
	|	КорреспонденцииДвижений.ИнвертироватьКорреспонденцию КАК ИнвертироватьКорреспонденцию,
	|	КорреспонденцииДвижений.Организация КАК Организация,
	|	КорреспонденцииДвижений.Регистратор КАК Регистратор,
	|	КорреспонденцииДвижений.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	КорреспонденцииДвижений.РеквизитСторно КАК РеквизитСторно,
	|	КорреспонденцииДвижений.ВалютаДт КАК ВалютаДт,
	|	КорреспонденцииДвижений.ВалютаКт КАК ВалютаКт,
	|	КорреспонденцииДвижений.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	КорреспонденцииДвижений.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	КорреспонденцииДвижений.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	КорреспонденцииДвижений.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	КорреспонденцииДвижений.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	КорреспонденцииДвижений.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	КорреспонденцииДвижений.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	КорреспонденцииДвижений.СуммаУпрДт КАК СуммаУпрДт,
	|	КорреспонденцииДвижений.СуммаУпрКт КАК СуммаУпрКт,
	|	КорреспонденцииДвижений.СуммаРеглДт КАК СуммаРеглДт,
	|	КорреспонденцииДвижений.СуммаРеглКт КАК СуммаРеглКт,
	|	КорреспонденцииДвижений.СуммаВалДт КАК СуммаВалДт,
	|	КорреспонденцииДвижений.СуммаВалКт КАК СуммаВалКт,
	|	КорреспонденцииДвижений.КоличествоДт КАК КоличествоДт,
	|	КорреспонденцииДвижений.КоличествоКт КАК КоличествоКт
	|ПОМЕСТИТЬ втКорреспонденцииПоПравилам
	|ИЗ
	|	втКорреспонденцииДвижений КАК КорреспонденцииДвижений
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПравилаПолученияФактаКорреспонденций КАК ПравилаПолученияФакта
	|		ПО КорреспонденцииДвижений.Период >= ПравилаПолученияФакта.ДействуетС
	|		 И КорреспонденцииДвижений.Период <= ПравилаПолученияФакта.ДействуетПо
	|		 И (ПравилаПолученияФакта.ПустойИсточникДанныхДт
	|			ИЛИ КорреспонденцииДвижений.ОбъектУчетаДт = ПравилаПолученияФакта.ИсточникДанныхДт)
	|		 И (ПравилаПолученияФакта.ПустойИсточникДанныхКт
	|			ИЛИ КорреспонденцииДвижений.ОбъектУчетаКт = ПравилаПолученияФакта.ИсточникДанныхКт)
	|ГДЕ
	|	НЕ КорреспонденцииДвижений.ИнвертироватьКорреспонденцию
	|	И НЕ(ПравилаПолученияФакта.ПустойИсточникДанныхДт И ПравилаПолученияФакта.ПустойИсточникДанныхКт)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаПолученияФакта.Ссылка КАК ПравилоПолученияФакта,
	|	ПравилаПолученияФакта.ПравилоСодержитОтбор КАК ПравилоСодержитОтбор,
	|	ПравилаПолученияФакта.ПустойИсточникДанныхДт КАК ПустойИсточникДанныхДт,
	|	ПравилаПолученияФакта.ПустойИсточникДанныхКт КАК ПустойИсточникДанныхКт,
	|	ПравилаПолученияФакта.ИнверсияИсточниковДанных КАК ИнверсияИсточниковДанных,
	|	ПравилаПолученияФакта.ИнверсияФактическихДанных КАК ИнверсияФактическихДанных,
	|	КорреспонденцииДвижений.НомерЗаписи КАК НомерЗаписи,
	|	КорреспонденцииДвижений.Период КАК Период,
	|	КорреспонденцииДвижений.ИмяРегистраКт КАК ИмяРегистраДт,
	|	КорреспонденцииДвижений.ИмяРегистраДт КАК ИмяРегистраКт,
	|	КорреспонденцииДвижений.ОбъектУчетаКт КАК ОбъектУчетаДт,
	|	КорреспонденцииДвижений.ОбъектУчетаДт КАК ОбъектУчетаКт,
	|	КорреспонденцииДвижений.ЭтоСторноКт КАК ЭтоСторноДт,
	|	КорреспонденцииДвижений.ЭтоСторноДт КАК ЭтоСторноКт,
	|	КорреспонденцииДвижений.ИнвертироватьКорреспонденцию КАК ИнвертироватьКорреспонденцию,
	|	КорреспонденцииДвижений.Организация КАК Организация,
	|	КорреспонденцииДвижений.Регистратор КАК Регистратор,
	|	КорреспонденцииДвижений.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииДвижений.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиДт,
	|	КорреспонденцииДвижений.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиКт,
	|	КорреспонденцииДвижений.РеквизитСторно КАК РеквизитСторно,
	|	КорреспонденцииДвижений.ВалютаКт КАК ВалютаДт,
	|	КорреспонденцииДвижений.ВалютаДт КАК ВалютаКт,
	|	КорреспонденцииДвижений.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	КорреспонденцииДвижений.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	КорреспонденцииДвижений.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	КорреспонденцииДвижений.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	КорреспонденцииДвижений.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	КорреспонденцииДвижений.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	КорреспонденцииДвижений.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	КорреспонденцииДвижений.СуммаУпрДт КАК СуммаУпрДт,
	|	КорреспонденцииДвижений.СуммаУпрКт КАК СуммаУпрКт,
	|	КорреспонденцииДвижений.СуммаРеглДт КАК СуммаРеглДт,
	|	КорреспонденцииДвижений.СуммаРеглКт КАК СуммаРеглКт,
	|	КорреспонденцииДвижений.СуммаВалДт КАК СуммаВалДт,
	|	КорреспонденцииДвижений.СуммаВалКт КАК СуммаВалКт,
	|	КорреспонденцииДвижений.КоличествоДт КАК КоличествоДт,
	|	КорреспонденцииДвижений.КоличествоКт КАК КоличествоКт
	|ИЗ
	|	втКорреспонденцииДвижений КАК КорреспонденцииДвижений
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПравилаПолученияФактаКорреспонденций КАК ПравилаПолученияФакта
	|		ПО КорреспонденцииДвижений.Период >= ПравилаПолученияФакта.ДействуетС
	|		 И КорреспонденцииДвижений.Период <= ПравилаПолученияФакта.ДействуетПо
	|		 И (ПравилаПолученияФакта.ПустойИсточникДанныхДт
	|			ИЛИ КорреспонденцииДвижений.ОбъектУчетаКт = ПравилаПолученияФакта.ИсточникДанныхДт)
	|		 И (ПравилаПолученияФакта.ПустойИсточникДанныхКт
	|			ИЛИ КорреспонденцииДвижений.ОбъектУчетаДт = ПравилаПолученияФакта.ИсточникДанныхКт)
	|ГДЕ
	|	КорреспонденцииДвижений.ИнвертироватьКорреспонденцию
	|	И НЕ(ПравилаПолученияФакта.ПустойИсточникДанныхДт И ПравилаПолученияФакта.ПустойИсточникДанныхКт)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	ИдентификаторСтрокиДт,
	|	ИдентификаторСтрокиКт,
	|	ИмяРегистраДт,
	|	ИмяРегистраКт,
	|	ОбъектУчетаДт,
	|	ОбъектУчетаКт,
	|	Организация,
	|	НастройкаХозОперации,
	|	ИнвертироватьКорреспонденцию,
	|	РеквизитСторно
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втКорреспонденцииДвижений");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втПравилаПолученияФактаКорреспонденций");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	КорреспонденцииПоПравилам.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	КорреспонденцииПоПравилам.ПравилоСодержитОтбор КАК ПравилоСодержитОтбор,
	|	КорреспонденцииПоПравилам.ПустойИсточникДанныхДт КАК ПустойИсточникДанныхДт,
	|	КорреспонденцииПоПравилам.ПустойИсточникДанныхКт КАК ПустойИсточникДанныхКт,
	|	КорреспонденцииПоПравилам.ИнверсияИсточниковДанных КАК ИнверсияИсточниковДанных,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхДт
	|			ТОГДА """"
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИмяРегистраДт
	|	КОНЕЦ КАК ИмяРегистраДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхКт
	|			ТОГДА """"
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИмяРегистраКт
	|	КОНЕЦ КАК ИмяРегистраКт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхДт
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|		ИНАЧЕ КорреспонденцииПоПравилам.ОбъектУчетаДт
	|	КОНЕЦ КАК ОбъектУчетаДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхКт
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|		ИНАЧЕ КорреспонденцииПоПравилам.ОбъектУчетаКт
	|	КОНЕЦ КАК ОбъектУчетаКт
	|ПОМЕСТИТЬ втПравилаОбработкиКорреспонденций
	|ИЗ
	|	втКорреспонденцииПоПравилам КАК КорреспонденцииПоПравилам
	|СГРУППИРОВАТЬ ПО
	|	КорреспонденцииПоПравилам.ПравилоПолученияФакта,
	|	КорреспонденцииПоПравилам.ПравилоСодержитОтбор,
	|	КорреспонденцииПоПравилам.ПустойИсточникДанныхДт,
	|	КорреспонденцииПоПравилам.ПустойИсточникДанныхКт,
	|	КорреспонденцииПоПравилам.ИнверсияИсточниковДанных,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхДт
	|			ТОГДА """"
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИмяРегистраДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхКт
	|			ТОГДА """"
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИмяРегистраКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхДт
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|		ИНАЧЕ КорреспонденцииПоПравилам.ОбъектУчетаДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ПустойИсточникДанныхКт
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|		ИНАЧЕ КорреспонденцииПоПравилам.ОбъектУчетаКт
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	ПравилоПолученияФакта,
	|	ПравилоСодержитОтбор
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных КАК ИнверсияИсточниковДанных,
	|	ПравилаОбработкиКорреспонденций.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ПравилаОбработкиКорреспонденций.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ПравилаОбработкиКорреспонденций.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ПравилаОбработкиКорреспонденций.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ПравилаПолученияФакта.КомпоновщикНастроек
	|ИЗ
	|	втПравилаОбработкиКорреспонденций КАК ПравилаОбработкиКорреспонденций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФакта
	|		ПО ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта = ПравилаПолученияФакта.Ссылка
	|ГДЕ
	|	ПравилаОбработкиКорреспонденций.ПравилоСодержитОтбор
	|ИТОГИ ПО
	|	ИмяРегистраДт,
	|	ИмяРегистраКт
	|");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результаты = Запрос.ВыполнитьПакет();
	ТекстыЗапросов.Очистить();
	
	РезультатПравилаОтбора = Результаты[Результаты.ВГраница()];
	
	ОтборыКорреспонденций = Новый ТаблицаЗначений();
	ОтборыКорреспонденций.Колонки.Добавить("ИмяРегистраДт", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ОтборыКорреспонденций.Колонки.Добавить("ИмяРегистраКт", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ОтборыКорреспонденций.Колонки.Добавить("ЕстьОтборДт", Новый ОписаниеТипов("Булево"));
	ОтборыКорреспонденций.Колонки.Добавить("ЕстьОтборКт", Новый ОписаниеТипов("Булево"));
	ОтборыКорреспонденций.Колонки.Добавить("Отбор", Новый ОписаниеТипов("ОтборКомпоновкиДанных"));
	
	ПоляОтбораРегистров = Новый Структура();
	ДоступныеПоляРегистров = Новый Структура();
	
	ВыборкаИмяРегистраДт = РезультатПравилаОтбора.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИмяРегистраДт.Следующий() Цикл
		ВыборкаИмяРегистраКт = ВыборкаИмяРегистраДт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИмяРегистраКт.Следующий() Цикл
			ВыборкаПравилаОтбора = ВыборкаИмяРегистраКт.Выбрать();
			
			ОтборКорреспонденций = ОтборыКорреспонденций.Добавить();
			ОтборКорреспонденций.ИмяРегистраДт = ВыборкаИмяРегистраДт.ИмяРегистраДт;
			ОтборКорреспонденций.ИмяРегистраКт = ВыборкаИмяРегистраКт.ИмяРегистраКт;
			
			Если ВыборкаПравилаОтбора.Количество() > 1 Тогда
				ПравилаОтбора = ОтборКорреспонденций.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ПравилаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			Иначе
				ПравилаОтбора = ОтборКорреспонденций.Отбор;
			КонецЕсли;
			
			Пока ВыборкаПравилаОтбора.Следующий() Цикл
				Если ТипЗнч(ПравилаОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
					ПравилоОтбора = ПравилаОтбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ПравилоОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				Иначе
					ПравилоОтбора = ПравилаОтбора;
				КонецЕсли;
				
				КомпоновщикНастроекПравила = Новый КомпоновщикНастроекКомпоновкиДанных();
				КомпоновщикНастроекПравила.ЗагрузитьНастройки(ВыборкаПравилаОтбора.КомпоновщикНастроек.Получить());
				ДобавитьОтборПравилаВОтборКомпоновкиДанных(
					КомпоновщикНастроекПравила.Настройки.Отбор,
					ВыборкаПравилаОтбора.ИнверсияИсточниковДанных,
					ПравилоОтбора);
				
				Если НЕ ПустаяСтрока(ВыборкаПравилаОтбора.ИмяРегистраДт)
					И ФинансовыйУчетПоДаннымБалансовыхРегистров.ЕстьЭлементыОтбора(ПравилоОтбора, "Дт") Тогда
					Если НЕ ПоляОтбораРегистров.Свойство(ВыборкаПравилаОтбора.ИмяРегистраДт) Тогда
						ПоляОтбораРегистров.Вставить(ВыборкаПравилаОтбора.ИмяРегистраДт, Новый Массив());
					КонецЕсли;
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьПоляЭлементовОтбора(
						ПоляОтбораРегистров[ВыборкаПравилаОтбора.ИмяРегистраДт], ПравилоОтбора, "Дт");
					ОтборКорреспонденций.ЕстьОтборДт = Истина;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ВыборкаПравилаОтбора.ИмяРегистраКт)
					И ФинансовыйУчетПоДаннымБалансовыхРегистров.ЕстьЭлементыОтбора(ПравилоОтбора, "Кт") Тогда
					Если НЕ ПоляОтбораРегистров.Свойство(ВыборкаПравилаОтбора.ИмяРегистраКт) Тогда
						ПоляОтбораРегистров.Вставить(ВыборкаПравилаОтбора.ИмяРегистраКт, Новый Массив());
					КонецЕсли;
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьПоляЭлементовОтбора(
						ПоляОтбораРегистров[ВыборкаПравилаОтбора.ИмяРегистраКт], ПравилоОтбора, "Кт");
					ОтборКорреспонденций.ЕстьОтборКт = Истина;
				КонецЕсли;
				
				КлючПравила = КлючПравилаОтбора(ВыборкаПравилаОтбора);
				ДобавитьКлючПравилаВОтборКомпоновкиДанных(КлючПравила, ПравилоОтбора);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УдаляемыеПоляВыборки = УдаляемыеПоляВыборкиЗапросовАналитикиДвижений();
	ПоляИндексирования = ПоляИндексаТаблицОтбораКорреспонденций();
	ПоляИндексаРеверса = ПоляИндексаТаблицЗаменыРеверсаНаСторно();
	РегистрыВосстановленияРасчетовПоСторно = ФинансовыйУчетПоДаннымБалансовыхРегистров.РегистрыВосстановленияРасчетовПоСторно();
	
	СуществующиеПоляВыборки = Новый Массив();
	СуществующиеПоляВыборки.Добавить("Организация");
	СуществующиеПоляВыборки.Добавить("Подразделение");
	СуществующиеПоляВыборки.Добавить("НаправлениеДеятельности");
	СуществующиеПоляВыборки.Добавить("Валюта");
	СуществующиеПоляВыборки.Добавить("Регистратор");
	СуществующиеПоляВыборки.Добавить("НастройкаХозяйственнойОперации");
	СуществующиеПоляВыборки.Добавить("РеквизитСторно");
	
	Для Каждого КлючИЗначение Из ПоляОтбораРегистров Цикл
		ИмяТаблицыРегистра = КлючИЗначение.Ключ;
		ПоляОтбораРегистра = КлючИЗначение.Значение;
		
		Если ИмяТаблицыРегистра = ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
			ДоступныеПоляРегистра = ОбщегоНазначения.СкопироватьРекурсивно(СуществующиеПоляВыборки);
		Иначе
			ДоступныеПоляРегистра = ФинансовыйУчетПоДаннымБалансовыхРегистров.ДоступныеПоляИсточникаДанных(
				ОписаниеПолейФинансовогоРегистра(ИмяТаблицыРегистра));
			
			ВыборкаПолейАналитики = Новый Массив();
			ВыборкаРесурсовИсточника = Новый Массив();
			ГруппировкаПолейАналитики = Новый Массив();
			
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗаполнитьСтрокиВыборкиАналитики(
				ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ДоступныеПоляРегистра, СуществующиеПоляВыборки, ПоляОтбораРегистра);
			
			ТекстЗапросаРегистра = ТекстыЗапросовРегистров[ИмяТаблицыРегистра];
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
				ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
				ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
			
			ТребуетсяЗаменаСторноНаРеверс = Запрос.Параметры.РегистрыЗаменыСторноНаРеверс.Найти(ИмяТаблицыРегистра) <> Неопределено;
			ТребуетсяЗаменаРеверсаНаСторно = Запрос.Параметры.РегистрыЗаменыРеверсаНаСторно.Найти(ИмяТаблицыРегистра) <> Неопределено;
			
			ТаблицаДляПомещения = "вт" + ИмяТаблицыРегистра;
			ТаблицаЗаменыСторно = ТаблицаДляПомещения + "ЗаменаСторно";
			ТаблицаЗаменыРеверса = ТаблицаДляПомещения + "ЗаменаРеверса";
			
			Если ТребуетсяЗаменаСторноНаРеверс Тогда
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапросаРегистра, УдаляемыеПоляВыборки,, ТаблицаЗаменыСторно);
				ТекстыЗапросов.Добавить(ТекстЗапросаРегистра);
				ТекстЗапросаРегистра = ТекстВыборкиАналитикиИзВложеннойТаблицы();
				ТекстЗапросаРегистра = СтрЗаменить(ТекстЗапросаРегистра, "&ИсточникДанных", ТаблицаЗаменыСторно);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
					ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
					ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
			КонецЕсли;
			
			Если ТребуетсяЗаменаРеверсаНаСторно Тогда
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапросаРегистра, УдаляемыеПоляВыборки, ПоляИндексаРеверса, ТаблицаЗаменыРеверса);
				ТекстыЗапросов.Добавить(ТекстЗапросаРегистра);
				ТекстЗапросаРегистра = ТекстВыборкиАналитикиИзВременнойТаблицы(Истина);
				ТекстЗапросаРегистра = СтрЗаменить(ТекстЗапросаРегистра, "&ИсточникДанных", ТаблицаЗаменыРеверса);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
					ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
					ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
			КонецЕсли;
			
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапросаРегистра, УдаляемыеПоляВыборки, ПоляИндексирования, ТаблицаДляПомещения);
			
			Если РегистрыВосстановленияРасчетовПоСторно.Найти(ИмяТаблицыРегистра) <> Неопределено Тогда
				ДобавитьТаблицуВосстановленияРасчетовПоСторно(ТекстЗапросаРегистра, ИмяТаблицыРегистра);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
					ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
					ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
			КонецЕсли;
			
			ТекстыЗапросов.Добавить(ТекстЗапросаРегистра);
			
			Если ТребуетсяЗаменаСторноНаРеверс Тогда
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ТаблицаЗаменыСторно);
			КонецЕсли;
			
			Если ТребуетсяЗаменаРеверсаНаСторно Тогда
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ТаблицаЗаменыРеверса);
			КонецЕсли;
		КонецЕсли;
	
		ДоступныеПоляРегистра.Добавить("ТипРегистратора");
		ДоступныеПоляРегистров.Вставить(ИмяТаблицыРегистра, ДоступныеПоляРегистра);
	КонецЦикла;
	
	Если ТекстыЗапросов.Количество() > 0 Тогда
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Результаты = Запрос.ВыполнитьПакет();
		ТекстыЗапросов.Очистить();
	
		ПоляВыбораКомпоновкиДанных = ПоляВыбораКомпоновкиДанных(Запрос.Параметры);
		ТаблицаРезультатовКомпоновкиДанных = ТаблицаРезультатовКомпоновкиДанных(ПоляВыбораКомпоновкиДанных);
		АдресХранилищаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	Иначе
		ТаблицаРезультатовКомпоновкиДанных = Неопределено;
	КонецЕсли;
	
	СуществующиеПоляВыборки = Новый Массив();
	СуществующиеПоляВыборки.Добавить("ВалютаДт");
	СуществующиеПоляВыборки.Добавить("ВалютаКт");
	
	ВыборкаИмяРегистраДт.Сбросить();
	
	Пока ВыборкаИмяРегистраДт.Следующий() Цикл
		ВыборкаИмяРегистраКт = ВыборкаИмяРегистраДт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИмяРегистраКт.Следующий() Цикл
			СтруктураПоискаОтбора = Новый Структура("ИмяРегистраДт,ИмяРегистраКт",
				ВыборкаИмяРегистраДт.ИмяРегистраДт, ВыборкаИмяРегистраКт.ИмяРегистраКт);
			ОтборКорреспонденций = ОтборыКорреспонденций.НайтиСтроки(СтруктураПоискаОтбора)[0];
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	КорреспонденцииПоПравилам.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
			|	КорреспонденцииПоПравилам.НомерЗаписи КАК НомерЗаписи,
			|	КорреспонденцииПоПравилам.ОбъектУчетаДт КАК ОбъектУчетаДт,
			|	КорреспонденцииПоПравилам.ОбъектУчетаКт КАК ОбъектУчетаКт,
			|	КорреспонденцииПоПравилам.ВалютаДт КАК ВалютаДт,
			|	КорреспонденцииПоПравилам.ВалютаКт КАК ВалютаКт,
			|	&ПоляОтбораТаблицыДт,
			|	&ПоляОтбораТаблицыКт
			|ИЗ
			|	втКорреспонденцииПоПравилам КАК КорреспонденцииПоПравилам
			|";
			
			Если ОтборКорреспонденций.ЕстьОтборДт Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаДт КАК ТаблицаДт
				|		ПО КорреспонденцииПоПравилам.Период = ТаблицаДт.Период
				|		 И КорреспонденцииПоПравилам.Регистратор = ТаблицаДт.Регистратор
				|		 И КорреспонденцииПоПравилам.ИдентификаторФинЗаписи = ТаблицаДт.ИдентификаторФинЗаписи
				|		 И КорреспонденцииПоПравилам.ИдентификаторСтрокиДт = ТаблицаДт.ИдентификаторСтроки
				|		 И КорреспонденцииПоПравилам.ИмяРегистраДт = &ИмяРегистраДт
				|		 И КорреспонденцииПоПравилам.ОбъектУчетаДт = ТаблицаДт.ОбъектУчета
				|		 И КорреспонденцииПоПравилам.Организация = ТаблицаДт.Организация
				|		 И ВЫБОР
				|			КОГДА ТаблицаДт.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
				|				ТОГДА КорреспонденцииПоПравилам.НастройкаХозОперации = ТаблицаДт.НастройкаХозОперации
				|			ИНАЧЕ ИСТИНА
				|		 КОНЕЦ
				|		 И ВЫБОР
				|			КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
				|				ТОГДА НЕ ТаблицаДт.ЭтоДебет
				|			ИНАЧЕ НЕ ТаблицаДт.ЭтоКредит
				|		 КОНЕЦ
				|		 И КорреспонденцииПоПравилам.ЭтоСторноДт = ТаблицаДт.ЭтоСторно
				|		 И КорреспонденцииПоПравилам.РеквизитСторно = ТаблицаДт.РеквизитСторно
				|";
			КонецЕсли;
			
			Если ОтборКорреспонденций.ЕстьОтборКт Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаКт КАК ТаблицаКт
				|		ПО КорреспонденцииПоПравилам.Период = ТаблицаКт.Период
				|		 И КорреспонденцииПоПравилам.Регистратор = ТаблицаКт.Регистратор
				|		 И КорреспонденцииПоПравилам.ИдентификаторФинЗаписи = ТаблицаКт.ИдентификаторФинЗаписи
				|		 И КорреспонденцииПоПравилам.ИдентификаторСтрокиКт = ТаблицаКт.ИдентификаторСтроки
				|		 И КорреспонденцииПоПравилам.ИмяРегистраКт = &ИмяРегистраКт
				|		 И КорреспонденцииПоПравилам.ОбъектУчетаКт = ТаблицаКт.ОбъектУчета
				|		 И КорреспонденцииПоПравилам.Организация = ТаблицаКт.Организация
				|		 И ВЫБОР
				|			КОГДА ТаблицаКт.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
				|				ТОГДА КорреспонденцииПоПравилам.НастройкаХозОперации = ТаблицаКт.НастройкаХозОперации
				|			ИНАЧЕ ИСТИНА
				|		 КОНЕЦ
				|		 И ВЫБОР
				|			КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
				|				ТОГДА НЕ ТаблицаКт.ЭтоКредит
				|			ИНАЧЕ НЕ ТаблицаКт.ЭтоДебет
				|		 КОНЕЦ
				|		 И КорреспонденцииПоПравилам.ЭтоСторноКт = ТаблицаКт.ЭтоСторно
				|		 И КорреспонденцииПоПравилам.РеквизитСторно = ТаблицаКт.РеквизитСторно
				|";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	КорреспонденцииПоПравилам.ПравилоСодержитОтбор
			|";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаДт", СтрШаблон("вт%1", ВыборкаИмяРегистраДт.ИмяРегистраДт));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаКт", СтрШаблон("вт%1", ВыборкаИмяРегистраКт.ИмяРегистраКт));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистраДт", СтрШаблон("""%1""", ВыборкаИмяРегистраДт.ИмяРегистраДт));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистраКт", СтрШаблон("""%1""", ВыборкаИмяРегистраКт.ИмяРегистраКт));
			
			ПоляОтбораРегистраДт = Неопределено;
			ДоступныеПоляРегистраДт = Неопределено;
			
			Если ПустаяСтрока(ВыборкаИмяРегистраДт.ИмяРегистраДт)
			 ИЛИ НЕ ПоляОтбораРегистров.Свойство(ВыборкаИмяРегистраДт.ИмяРегистраДт, ПоляОтбораРегистраДт) Тогда
				ПоляОтбораРегистраДт = Новый Массив();
			КонецЕсли;
			
			Если ПустаяСтрока(ВыборкаИмяРегистраДт.ИмяРегистраДт)
			 ИЛИ НЕ ДоступныеПоляРегистров.Свойство(ВыборкаИмяРегистраДт.ИмяРегистраДт, ДоступныеПоляРегистраДт) Тогда
				ДоступныеПоляРегистраДт = Новый Массив();
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляОтбораТаблицыДт",
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ТекстВыборкиПолей(
					ДоступныеПоляРегистраДт, СуществующиеПоляВыборки, ПоляОтбораРегистраДт, "Дт", "ТаблицаДт"));
			
			ПоляОтбораРегистраКт = Неопределено;
			ДоступныеПоляРегистраКт = Неопределено;
			
			Если ПустаяСтрока(ВыборкаИмяРегистраКт.ИмяРегистраКт)
			 ИЛИ НЕ ПоляОтбораРегистров.Свойство(ВыборкаИмяРегистраКт.ИмяРегистраКт, ПоляОтбораРегистраКт) Тогда
				ПоляОтбораРегистраКт = Новый Массив();
			КонецЕсли;
			
			Если ПустаяСтрока(ВыборкаИмяРегистраКт.ИмяРегистраКт)
			 ИЛИ НЕ ДоступныеПоляРегистров.Свойство(ВыборкаИмяРегистраКт.ИмяРегистраКт, ДоступныеПоляРегистраКт) Тогда
				ДоступныеПоляРегистраКт = Новый Массив();
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляОтбораТаблицыКт",
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ТекстВыборкиПолей(
					ДоступныеПоляРегистраКт, СуществующиеПоляВыборки, ПоляОтбораРегистраКт, "Кт", "ТаблицаКт"));
			
			СхемаКомпоновкиДанных = ФинансовыйУчетПоДаннымБалансовыхРегистров.НоваяСхемаКомпоновкиДанных(ТекстЗапроса);
			АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресХранилищаКомпоновкиДанных);
			КомпоновщикНастроек = ФинансовыйУчетПоДаннымБалансовыхРегистров.НовыйКомпоновщикНастроекКомпоновкиДанных(
				АдресСхемыКомпоновкиДанных, ПоляВыбораКомпоновкиДанных, Запрос.Параметры);
			КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Отбор, ОтборКорреспонденций.Отбор);
			
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьРезультатКомпоновкиВТаблицу(СхемаКомпоновкиДанных, КомпоновщикНастроек,
				Запрос.МенеджерВременныхТаблиц, ТаблицаРезультатовКомпоновкиДанных);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ПоляОтбораРегистров Цикл
		ИмяТаблицыРегистра = КлючИЗначение.Ключ;
		ТаблицаДляПомещения = "вт" + ИмяТаблицыРегистра;
		Если ИмяТаблицыРегистра <> ФинансовыйУчетПоДаннымБалансовыхРегистров.ИмяРегистраСлужебныхОбъектовУчета() Тогда
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ТаблицаДляПомещения);
		КонецЕсли;
	КонецЦикла;
	
	ЕстьКорреспонденцииСОтбором = ТаблицаРезультатовКомпоновкиДанных <> Неопределено
		И ТаблицаРезультатовКомпоновкиДанных.Количество() > 0;
	
	Если ЕстьКорреспонденцииСОтбором Тогда
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	ТаблицаРезультатовКомпоновки.НомерЗаписи КАК НомерЗаписи,
		|	ТаблицаРезультатовКомпоновки.ПравилоПолученияФакта КАК ПравилоПолученияФакта
		|ПОМЕСТИТЬ втКорреспонденцииСОтбором
		|ИЗ
		|	&ТаблицаРезультатовКомпоновкиДанных КАК ТаблицаРезультатовКомпоновки
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерЗаписи,
		|	ПравилоПолученияФакта
		|");
		
		Запрос.УстановитьПараметр("ТаблицаРезультатовКомпоновкиДанных", ТаблицаРезультатовКомпоновкиДанных);
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КорреспонденцииПоПравилам.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	КорреспонденцииПоПравилам.ПустойИсточникДанныхДт КАК ПустойИсточникДанныхДт,
	|	КорреспонденцииПоПравилам.ПустойИсточникДанныхКт КАК ПустойИсточникДанныхКт,
	|	КорреспонденцииПоПравилам.ИнверсияИсточниковДанных КАК ИнверсияИсточниковДанных,
	|	КорреспонденцииПоПравилам.ИнверсияФактическихДанных КАК ИнверсияФактическихДанных,
	|	ВЫБОР
	|		КОГДА НЕ КорреспонденцииПоПравилам.ИнверсияИсточниковДанных
	|			И НЕ КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА &Дт
	|		КОГДА КорреспонденцииПоПравилам.ИнверсияИсточниковДанных
	|			И КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА &Дт
	|		ИНАЧЕ &Кт
	|	КОНЕЦ КАК ИсточникДанныхКорреспонденции,
	|	КорреспонденцииПоПравилам.НомерЗаписи КАК НомерЗаписи,
	|	КорреспонденцииПоПравилам.Период КАК Период,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ИмяРегистраКт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИмяРегистраДт
	|	КОНЕЦ КАК ИмяРегистраДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ИмяРегистраДт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИмяРегистраКт
	|	КОНЕЦ КАК ИмяРегистраКт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ОбъектУчетаКт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ОбъектУчетаДт
	|	КОНЕЦ КАК ОбъектУчетаДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ОбъектУчетаДт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ОбъектУчетаКт
	|	КОНЕЦ КАК ОбъектУчетаКт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ЭтоСторноКт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ЭтоСторноДт
	|	КОНЕЦ КАК ЭтоСторноДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ЭтоСторноДт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ЭтоСторноКт
	|	КОНЕЦ КАК ЭтоСторноКт,
	|	КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию КАК ИнвертироватьКорреспонденцию,
	|	КорреспонденцииПоПравилам.Организация КАК Организация,
	|	КорреспонденцииПоПравилам.Регистратор КАК Регистратор,
	|	КорреспонденцииПоПравилам.НастройкаХозОперации КАК НастройкаХозОперации,
	|	КорреспонденцииПоПравилам.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ИдентификаторСтрокиКт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИдентификаторСтрокиДт
	|	КОНЕЦ КАК ИдентификаторСтрокиДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ИдентификаторСтрокиДт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ИдентификаторСтрокиКт
	|	КОНЕЦ КАК ИдентификаторСтрокиКт,
	|	КорреспонденцииПоПравилам.РеквизитСторно КАК РеквизитСторно,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ВалютаКт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ВалютаДт
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА КорреспонденцииПоПравилам.ИнвертироватьКорреспонденцию
	|			ТОГДА КорреспонденцииПоПравилам.ВалютаДт
	|		ИНАЧЕ КорреспонденцииПоПравилам.ВалютаКт
	|	КОНЕЦ КАК ВалютаКт,
	|	КорреспонденцииПоПравилам.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	КорреспонденцииПоПравилам.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	КорреспонденцииПоПравилам.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	КорреспонденцииПоПравилам.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	КорреспонденцииПоПравилам.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	КорреспонденцииПоПравилам.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	КорреспонденцииПоПравилам.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	КорреспонденцииПоПравилам.СуммаУпрДт КАК СуммаУпрДт,
	|	КорреспонденцииПоПравилам.СуммаУпрКт КАК СуммаУпрКт,
	|	КорреспонденцииПоПравилам.СуммаРеглДт КАК СуммаРеглДт,
	|	КорреспонденцииПоПравилам.СуммаРеглКт КАК СуммаРеглКт,
	|	КорреспонденцииПоПравилам.СуммаВалДт КАК СуммаВалДт,
	|	КорреспонденцииПоПравилам.СуммаВалКт КАК СуммаВалКт,
	|	КорреспонденцииПоПравилам.КоличествоДт КАК КоличествоДт,
	|	КорреспонденцииПоПравилам.КоличествоКт КАК КоличествоКт
	|ПОМЕСТИТЬ втФактическиеКорреспонденции
	|ИЗ
	|	втКорреспонденцииПоПравилам КАК КорреспонденцииПоПравилам
	|ГДЕ
	|	НЕ КорреспонденцииПоПравилам.ПравилоСодержитОтбор
	|	ИЛИ &УсловиеОтбораКорреспонденцийСОтбором
	|ИНДЕКСИРОВАТЬ ПО
	|	ПравилоПолученияФакта,
	|	ОбъектУчетаДт,
	|	ОбъектУчетаКт
	|";
	
	Если ЕстьКорреспонденцииСОтбором Тогда
		УсловиеОтбораКорреспонденцийСОтбором = "ИСТИНА В
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ИСТИНА
		|	ИЗ
		|		втКорреспонденцииСОтбором КАК КорреспонденцииСОтбором
		|	ГДЕ
		|		КорреспонденцииСОтбором.НомерЗаписи = КорреспонденцииПоПравилам.НомерЗаписи
		|		И КорреспонденцииСОтбором.ПравилоПолученияФакта = КорреспонденцииПоПравилам.ПравилоПолученияФакта
		|	)
		|";
	Иначе
		УсловиеОтбораКорреспонденцийСОтбором = "ЛОЖЬ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораКорреспонденцийСОтбором", УсловиеОтбораКорреспонденцийСОтбором);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втКорреспонденцииПоПравилам");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втПравилаОбработкиКорреспонденций");
	
	Если ЕстьКорреспонденцииСОтбором Тогда
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втКорреспонденцииСОтбором");
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПравилаЗаполненияАналитики(Запрос, ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ФактическиеКорреспонденции.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ФактическиеКорреспонденции.ПустойИсточникДанныхДт КАК ПустойИсточникДанныхДт,
	|	ФактическиеКорреспонденции.ПустойИсточникДанныхКт КАК ПустойИсточникДанныхКт,
	|	ФактическиеКорреспонденции.ИнверсияИсточниковДанных КАК ИнверсияИсточниковДанных,
	|	ФактическиеКорреспонденции.ИсточникДанныхКорреспонденции КАК ИсточникДанныхКорреспонденции,
	|	ФактическиеКорреспонденции.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ФактическиеКорреспонденции.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ФактическиеКорреспонденции.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ФактическиеКорреспонденции.ИмяРегистраКт КАК ИмяРегистраКт
	|ПОМЕСТИТЬ втПравилаОбработкиКорреспонденций
	|ИЗ
	|	втФактическиеКорреспонденции КАК ФактическиеКорреспонденции
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеКорреспонденции.ПравилоПолученияФакта,
	|	ФактическиеКорреспонденции.ПустойИсточникДанныхДт,
	|	ФактическиеКорреспонденции.ПустойИсточникДанныхКт,
	|	ФактическиеКорреспонденции.ИнверсияИсточниковДанных,
	|	ФактическиеКорреспонденции.ИсточникДанныхКорреспонденции,
	|	ФактическиеКорреспонденции.ОбъектУчетаДт,
	|	ФактическиеКорреспонденции.ОбъектУчетаКт,
	|	ФактическиеКорреспонденции.ИмяРегистраДт,
	|	ФактическиеКорреспонденции.ИмяРегистраКт
	|ИНДЕКСИРОВАТЬ ПО
	|	ПравилоПолученияФакта
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику1
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗначениеАналитики1,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику2
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики2
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗначениеАналитики2,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику3
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики3
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗначениеАналитики3,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику4
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики4
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗначениеАналитики4,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику5
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики5
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗначениеАналитики5,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику6
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики6
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗначениеАналитики6
	|ПОМЕСТИТЬ втЗначенияЗаполненияАналитики
	|ИЗ
	|	втПравилаОбработкиКорреспонденций КАК ПравилаОбработкиКорреспонденций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФакта
	|		ПО ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта = ПравилаПолученияФакта.Ссылка
	|ГДЕ
	|	ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику1
	|	ИЛИ ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику2
	|	ИЛИ ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику3
	|	ИЛИ ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику4
	|	ИЛИ ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику5
	|	ИЛИ ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику6
	|СГРУППИРОВАТЬ ПО
	|	ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику1
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику2
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики2
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику3
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики3
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику4
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики4
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику5
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики5
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику6
	|			ТОГДА ПравилаПолученияФакта.ЗначениеАналитики6
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ПравилаОбработкиКорреспонденций.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ПравилаОбработкиКорреспонденций.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ВЫБОР
	|		КОГДА ПравилаОбработкиКорреспонденций.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА ПравилаОбработкиКорреспонденций.ИмяРегистраДт
	|		ИНАЧЕ ПравилаОбработкиКорреспонденций.ИмяРегистраКт
	|	КОНЕЦ КАК ИмяРегистра,
	|	ВЫБОР
	|		КОГДА ПравилаОбработкиКорреспонденций.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА ПравилаОбработкиКорреспонденций.ИмяРегистраКт
	|		ИНАЧЕ ПравилаОбработкиКорреспонденций.ИмяРегистраДт
	|	КОНЕЦ КАК ИмяКорРегистра,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику1
	|			ТОГДА NULL
	|		ИНАЧЕ ВЫРАЗИТЬ(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики1 КАК СТРОКА(1024))
	|	КОНЕЦ КАК ВыражениеАналитики1,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику2
	|			ТОГДА NULL
	|		ИНАЧЕ ВЫРАЗИТЬ(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики2 КАК СТРОКА(1024))
	|	КОНЕЦ КАК ВыражениеАналитики2,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику3
	|			ТОГДА NULL
	|		ИНАЧЕ ВЫРАЗИТЬ(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики3 КАК СТРОКА(1024))
	|	КОНЕЦ КАК ВыражениеАналитики3,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику4
	|			ТОГДА NULL
	|		ИНАЧЕ ВЫРАЗИТЬ(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики4 КАК СТРОКА(1024))
	|	КОНЕЦ КАК ВыражениеАналитики4,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику5
	|			ТОГДА NULL
	|		ИНАЧЕ ВЫРАЗИТЬ(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики5 КАК СТРОКА(1024))
	|	КОНЕЦ КАК ВыражениеАналитики5,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику6
	|			ТОГДА NULL
	|		ИНАЧЕ ВЫРАЗИТЬ(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики6 КАК СТРОКА(1024))
	|	КОНЕЦ КАК ВыражениеАналитики6,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику1
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхДт
	|		ИЛИ НЕ ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПОДСТРОКА(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики1, 1, &ДлинаИмениПапкиКорПолей) = &ИмяПапкиКорПолей
	|	КОНЕЦ КАК КорИсточникАналитики1,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику2
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхДт
	|		ИЛИ НЕ ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПОДСТРОКА(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики2, 1, &ДлинаИмениПапкиКорПолей) = &ИмяПапкиКорПолей
	|	КОНЕЦ КАК КорИсточникАналитики2,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику3
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхДт
	|		ИЛИ НЕ ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПОДСТРОКА(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики3, 1, &ДлинаИмениПапкиКорПолей) = &ИмяПапкиКорПолей
	|	КОНЕЦ КАК КорИсточникАналитики3,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику4
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхДт
	|		ИЛИ НЕ ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПОДСТРОКА(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики4, 1, &ДлинаИмениПапкиКорПолей) = &ИмяПапкиКорПолей
	|	КОНЕЦ КАК КорИсточникАналитики4,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику5
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхДт
	|		ИЛИ НЕ ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПОДСТРОКА(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики5, 1, &ДлинаИмениПапкиКорПолей) = &ИмяПапкиКорПолей
	|	КОНЕЦ КАК КорИсточникАналитики5,
	|	ВЫБОР
	|		КОГДА ПравилаПолученияФакта.ЗаполнятьУказаннымЗначениемАналитику6
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхДт
	|		ИЛИ НЕ ПравилаОбработкиКорреспонденций.ИнверсияИсточниковДанных И ПравилаОбработкиКорреспонденций.ПустойИсточникДанныхКт
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПОДСТРОКА(ПравилаПолученияФакта.ВыражениеЗаполненияАналитики6, 1, &ДлинаИмениПапкиКорПолей) = &ИмяПапкиКорПолей
	|	КОНЕЦ КАК КорИсточникАналитики6
	|ПОМЕСТИТЬ втВыраженияЗаполненияАналитики
	|ИЗ
	|	втПравилаОбработкиКорреспонденций КАК ПравилаОбработкиКорреспонденций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФакта
	|		ПО ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта = ПравилаПолученияФакта.Ссылка
	|ИНДЕКСИРОВАТЬ ПО
	|	ПравилоПолученияФакта,
	|	ОбъектУчетаДт,
	|	ОбъектУчетаКт
	|");
	
КонецПроцедуры

Процедура ОпределитьРесурсыИсточниковДанных(Запрос, ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПравилаОбработкиКорреспонденций.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА ПравилаОбработкиКорреспонденций.ОбъектУчетаДт
	|		ИНАЧЕ ПравилаОбработкиКорреспонденций.ОбъектУчетаКт
	|	КОНЕЦ КАК ОбъектУчета,
	|	ВЫБОР
	|		КОГДА ПравилаОбработкиКорреспонденций.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА ПравилаОбработкиКорреспонденций.ИмяРегистраДт
	|		ИНАЧЕ ПравилаОбработкиКорреспонденций.ИмяРегистраКт
	|	КОНЕЦ КАК ИмяРегистра,
	|	ПравилаПолученияФакта.ИсточникСуммыОперации КАК Показатель
	|ПОМЕСТИТЬ втПоказателиПравилПолученияФакта
	|ИЗ
	|	втПравилаОбработкиКорреспонденций КАК ПравилаОбработкиКорреспонденций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФакта
	|		ПО ПравилаОбработкиКорреспонденций.ПравилоПолученияФакта = ПравилаПолученияФакта.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПравилаОбработкиКорреспонденций.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА ПравилаОбработкиКорреспонденций.ОбъектУчетаДт
	|		ИНАЧЕ ПравилаОбработкиКорреспонденций.ОбъектУчетаКт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПравилаОбработкиКорреспонденций.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА ПравилаОбработкиКорреспонденций.ИмяРегистраДт
	|		ИНАЧЕ ПравилаОбработкиКорреспонденций.ИмяРегистраКт
	|	КОНЕЦ,
	|	ПравилаПолученияФакта.ИсточникСуммыОперации
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втПравилаОбработкиКорреспонденций");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПоказателиОбъектовУчета.ОбъектУчета КАК ОбъектУчета
	|ПОМЕСТИТЬ втРазличныеПоказателиОбъектовУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтатьиАктивовПассивовРесурсыУпр.Ссылка КАК ОбъектУчета,
	|		СтатьиАктивовПассивовРесурсыУпр.Показатель КАК Показатель
	|	ИЗ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыУпр КАК СтатьиАктивовПассивовРесурсыУпр
	|	ГДЕ
	|		ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|			ГДЕ
	|				ПоказателиПравилПолученияФакта.ОбъектУчета = СтатьиАктивовПассивовРесурсыУпр.Ссылка
	|			)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтатьиАктивовПассивовРесурсыРегл.Ссылка КАК ОбъектУчета,
	|		СтатьиАктивовПассивовРесурсыРегл.Показатель КАК Показатель
	|	ИЗ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыРегл КАК СтатьиАктивовПассивовРесурсыРегл
	|	ГДЕ
	|		ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|			ГДЕ
	|				ПоказателиПравилПолученияФакта.ОбъектУчета = СтатьиАктивовПассивовРесурсыРегл.Ссылка
	|			)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтатьиАктивовПассивовРесурсыВал.Ссылка КАК ОбъектУчета,
	|		СтатьиАктивовПассивовРесурсыВал.Показатель КАК Показатель
	|	ИЗ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыВал КАК СтатьиАктивовПассивовРесурсыВал
	|	ГДЕ
	|		ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|			ГДЕ
	|				ПоказателиПравилПолученияФакта.ОбъектУчета = СтатьиАктивовПассивовРесурсыВал.Ссылка
	|			)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтатьиАктивовПассивовРесурсыКоличество.Ссылка КАК ОбъектУчета,
	|		СтатьиАктивовПассивовРесурсыКоличество.Показатель КАК Показатель
	|	ИЗ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыКоличество КАК СтатьиАктивовПассивовРесурсыКоличество
	|	ГДЕ
	|		ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|			ГДЕ
	|				ПоказателиПравилПолученияФакта.ОбъектУчета = СтатьиАктивовПассивовРесурсыКоличество.Ссылка
	|			)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтатьиАктивовПассивовДополнительныеПоказатели.Ссылка КАК ОбъектУчета,
	|		СтатьиАктивовПассивовДополнительныеПоказатели.Показатель КАК Показатель
	|	ИЗ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов.ДополнительныеПоказатели КАК СтатьиАктивовПассивовДополнительныеПоказатели
	|	ГДЕ
	|		ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|			ГДЕ
	|				ПоказателиПравилПолученияФакта.ОбъектУчета = СтатьиАктивовПассивовДополнительныеПоказатели.Ссылка
	|			)
	|	) КАК ПоказателиОбъектовУчета
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиОбъектовУчета.ОбъектУчета
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоказателиОбъектовУчета.Показатель) > 1
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель
	|ПОМЕСТИТЬ втРазличныеПоказателиПравилПолученияФакта
	|ИЗ
	|	втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазличныеПоказателиОбъектовУчета КАК РазличныеПоказателиОбъектовУчета
	|	ПО ПоказателиПравилПолученияФакта.ОбъектУчета = РазличныеПоказателиОбъектовУчета.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель
	|ИЗ
	|	втПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|ГДЕ
	|	НЕ ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втРазличныеПоказателиОбъектовУчета КАК РазличныеПоказателиОбъектовУчета
	|		ГДЕ
	|			РазличныеПоказателиОбъектовУчета.ОбъектУчета = ПоказателиПравилПолученияФакта.ОбъектУчета
	|		)
	|	И ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			ПланВидовХарактеристик.СтатьиАктивовПассивов.ДополнительныеПоказатели КАК СтатьиАктивовПассивовДополнительныеПоказатели
	|		ГДЕ
	|			СтатьиАктивовПассивовДополнительныеПоказатели.Ссылка = ПоказателиПравилПолученияФакта.ОбъектУчета
	|		)
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета,
	|	Показатель
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втПоказателиПравилПолученияФакта");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРазличныеПоказателиОбъектовУчета");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель,
	|	СтатьиАктивовПассивовРесурсыУпр.ИмяРесурса КАК ИмяРесурса,
	|	СтатьиАктивовПассивовРесурсыУпр.Коэффициент КАК Коэффициент,
	|	&РесурсыУпр КАК ГруппаРесурсов
	|ПОМЕСТИТЬ втРесурсыИсточниковДанных
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыУпр КАК СтатьиАктивовПассивовРесурсыУпр
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазличныеПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|	ПО СтатьиАктивовПассивовРесурсыУпр.Ссылка = ПоказателиПравилПолученияФакта.ОбъектУчета
	|	 И СтатьиАктивовПассивовРесурсыУпр.Показатель = ПоказателиПравилПолученияФакта.Показатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель,
	|	СтатьиАктивовПассивовРесурсыРегл.ИмяРесурса КАК ИмяРесурса,
	|	СтатьиАктивовПассивовРесурсыРегл.Коэффициент КАК Коэффициент,
	|	&РесурсыРегл КАК ГруппаРесурсов
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыРегл КАК СтатьиАктивовПассивовРесурсыРегл
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазличныеПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|	ПО СтатьиАктивовПассивовРесурсыРегл.Ссылка = ПоказателиПравилПолученияФакта.ОбъектУчета
	|	 И СтатьиАктивовПассивовРесурсыРегл.Показатель = ПоказателиПравилПолученияФакта.Показатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель,
	|	СтатьиАктивовПассивовРесурсыВал.ИмяРесурса КАК ИмяРесурса,
	|	СтатьиАктивовПассивовРесурсыВал.Коэффициент КАК Коэффициент,
	|	&РесурсыВал КАК ГруппаРесурсов
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыВал КАК СтатьиАктивовПассивовРесурсыВал
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазличныеПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|	ПО СтатьиАктивовПассивовРесурсыВал.Ссылка = ПоказателиПравилПолученияФакта.ОбъектУчета
	|	 И СтатьиАктивовПассивовРесурсыВал.Показатель = ПоказателиПравилПолученияФакта.Показатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель,
	|	СтатьиАктивовПассивовРесурсыКоличество.ИмяРесурса КАК ИмяРесурса,
	|	СтатьиАктивовПассивовРесурсыКоличество.Коэффициент КАК Коэффициент,
	|	&РесурсыКоличество КАК ГруппаРесурсов
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов.РесурсыКоличество КАК СтатьиАктивовПассивовРесурсыКоличество
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазличныеПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|	ПО СтатьиАктивовПассивовРесурсыКоличество.Ссылка = ПоказателиПравилПолученияФакта.ОбъектУчета
	|	 И СтатьиАктивовПассивовРесурсыКоличество.Показатель = ПоказателиПравилПолученияФакта.Показатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиПравилПолученияФакта.ОбъектУчета КАК ОбъектУчета,
	|	ПоказателиПравилПолученияФакта.ИмяРегистра КАК ИмяРегистра,
	|	ПоказателиПравилПолученияФакта.Показатель КАК Показатель,
	|	СтатьиАктивовПассивовДополнительныеПоказатели.ИмяРесурса КАК ИмяРесурса,
	|	СтатьиАктивовПассивовДополнительныеПоказатели.Коэффициент КАК Коэффициент,
	|	СтатьиАктивовПассивовДополнительныеПоказатели.ГруппаРесурсов КАК ГруппаРесурсов
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов.ДополнительныеПоказатели КАК СтатьиАктивовПассивовДополнительныеПоказатели
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазличныеПоказателиПравилПолученияФакта КАК ПоказателиПравилПолученияФакта
	|	ПО СтатьиАктивовПассивовДополнительныеПоказатели.Ссылка = ПоказателиПравилПолученияФакта.ОбъектУчета
	|	 И СтатьиАктивовПассивовДополнительныеПоказатели.Показатель = ПоказателиПравилПолученияФакта.Показатель
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРазличныеПоказателиПравилПолученияФакта");
	
КонецПроцедуры

Процедура СформироватьЗапросыАналитикиКорреспонденций(Запрос, ТекстыЗапросов, ТекстыЗапросовРегистров)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ВыраженияЗаполненияАналитики.ИмяРегистра КАК ИмяРегистра,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики1
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики1,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики2
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики2
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики2,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики3
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики3
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики3,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики4
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики4
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики4,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики5
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики5
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики5,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики6
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики6
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики6
	|ИЗ
	|	втВыраженияЗаполненияАналитики КАК ВыраженияЗаполненияАналитики
	|СГРУППИРОВАТЬ ПО
	|	ВыраженияЗаполненияАналитики.ИмяРегистра,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики1
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики2
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики2
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики3
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики3
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики4
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики4
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики5
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики5
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВыраженияЗаполненияАналитики.КорИсточникАналитики6
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики6
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВыраженияЗаполненияАналитики.ИмяКорРегистра КАК ИмяРегистра,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики1
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики1,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики2
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики2
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики2,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики3
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики3
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики3,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики4
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики4
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики4,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики5
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики5
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики5,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики6
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики6
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВыражениеАналитики6
	|ИЗ
	|	втВыраженияЗаполненияАналитики КАК ВыраженияЗаполненияАналитики
	|ГДЕ
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики1
	|	ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики2
	|	ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики3
	|	ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики4
	|	ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики5
	|	ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики6
	|СГРУППИРОВАТЬ ПО
	|	ВыраженияЗаполненияАналитики.ИмяКорРегистра,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики1
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики2
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики2
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики3
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики3
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики4
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики4
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики5
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики5
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыраженияЗаполненияАналитики.КорИсточникАналитики6
	|			ТОГДА ВыраженияЗаполненияАналитики.ВыражениеАналитики6
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|ИТОГИ ПО
	|	ИмяРегистра
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	РесурсыИсточниковДанных.ИмяРегистра КАК ИмяРегистра,
	|	РесурсыИсточниковДанных.ИмяРесурса КАК ИмяРесурса
	|ИЗ
	|	втРесурсыИсточниковДанных КАК РесурсыИсточниковДанных
	|СГРУППИРОВАТЬ ПО
	|	РесурсыИсточниковДанных.ИмяРегистра,
	|	РесурсыИсточниковДанных.ИмяРесурса
	|ИТОГИ ПО
	|	ИмяРегистра
	|");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результаты = Запрос.ВыполнитьПакет();
	ТекстыЗапросов.Очистить();
	
	РезультатВыраженияАналитики = Результаты[Результаты.ВГраница() - 1];
	РезультатРесурсыИсточников = Результаты[Результаты.ВГраница()];
	
	ВыборкаИмяРегистра = РезультатВыраженияАналитики.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИмяИсточника = РезультатРесурсыИсточников.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	УдаляемыеПоляВыборки = УдаляемыеПоляВыборкиЗапросовАналитикиДвижений();
	ПоляИндексаРеверса = ПоляИндексаТаблицЗаменыРеверсаНаСторно();
	РегистрыВосстановленияРасчетовПоСторно = ФинансовыйУчетПоДаннымБалансовыхРегистров.РегистрыВосстановленияРасчетовПоСторно();
	
	УдаляемыеВременныеТаблицы = Новый Массив();
	ИндексРезультатаЗапросаАналитики = 0;
	
	Пока ВыборкаИмяРегистра.Следующий() Цикл
		ВыраженияАналитикиРегистра = ВыраженияАналитикиРегистра(ВыборкаИмяРегистра, Запрос.Параметры);
		
		ВыборкаПолейАналитики = Новый Массив();
		ВыборкаРесурсовИсточника = Новый Массив();
		ГруппировкаПолейАналитики = Новый Массив();
		
		ЗаполнитьСтрокиВыборкиВыражений(ВыборкаПолейАналитики, ГруппировкаПолейАналитики,
			ВыраженияАналитикиРегистра, Запрос.Параметры.ВсеВыраженияАналитики);
		
		ВыборкаИмяИсточника.Сбросить();
		СтруктураПоиска = Новый Структура("ИмяРегистра", ВыборкаИмяРегистра.ИмяРегистра);
		
		Если ВыборкаИмяИсточника.НайтиСледующий(СтруктураПоиска) Тогда
			ЗаполнитьСтрокиВыборкиРесурсов(ВыборкаРесурсовИсточника, ВыборкаИмяИсточника);
		КонецЕсли;
		
		ИмяТаблицыРегистра = ВыборкаИмяРегистра.ИмяРегистра;
		ИмяВременнойТаблицыРегистра = "вт" + ВыборкаИмяРегистра.ИмяРегистра;
		
		Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицыРегистра) = Неопределено Тогда
			ТекстЗапросаРегистра = ТекстыЗапросовРегистров[ИмяТаблицыРегистра];
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
				ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
				ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
			
			ТребуетсяЗаменаСторноНаРеверс = Запрос.Параметры.РегистрыЗаменыСторноНаРеверс.Найти(ИмяТаблицыРегистра) <> Неопределено;
			ТребуетсяЗаменаРеверсаНаСторно = Запрос.Параметры.РегистрыЗаменыРеверсаНаСторно.Найти(ИмяТаблицыРегистра) <> Неопределено;
			
			Если ТребуетсяЗаменаСторноНаРеверс ИЛИ ТребуетсяЗаменаРеверсаНаСторно Тогда
				Если ТребуетсяЗаменаСторноНаРеверс Тогда
					ТаблицаЗаменыСторно = ИмяВременнойТаблицыРегистра + "ЗаменаСторно";
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапросаРегистра, УдаляемыеПоляВыборки,, ТаблицаЗаменыСторно);
					ТекстыЗапросов.Добавить(ТекстЗапросаРегистра);
					ТекстЗапросаРегистра = ТекстВыборкиАналитикиИзВложеннойТаблицы();
					ТекстЗапросаРегистра = СтрЗаменить(ТекстЗапросаРегистра, "&ИсточникДанных", ТаблицаЗаменыСторно);
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
						ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
						ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
					УдаляемыеВременныеТаблицы.Добавить(ТаблицаЗаменыСторно);
					ИндексРезультатаЗапросаАналитики = ИндексРезультатаЗапросаАналитики + 1;
				КонецЕсли;
				
				Если ТребуетсяЗаменаРеверсаНаСторно Тогда
					ТаблицаЗаменыРеверса = ИмяВременнойТаблицыРегистра + "ЗаменаРеверса";
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапросаРегистра, УдаляемыеПоляВыборки, ПоляИндексаРеверса, ТаблицаЗаменыРеверса);
					ТекстыЗапросов.Добавить(ТекстЗапросаРегистра);
					ТекстЗапросаРегистра = ТекстВыборкиАналитикиИзВременнойТаблицы(Истина);
					ТекстЗапросаРегистра = СтрЗаменить(ТекстЗапросаРегистра, "&ИсточникДанных", ТаблицаЗаменыРеверса);
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
						ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
					ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
						ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
					УдаляемыеВременныеТаблицы.Добавить(ТаблицаЗаменыРеверса);
					ИндексРезультатаЗапросаАналитики = ИндексРезультатаЗапросаАналитики + 1;
				КонецЕсли;
			Иначе
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ИзменитьСоставПолейВыборки(ТекстЗапросаРегистра, УдаляемыеПоляВыборки);
			КонецЕсли;
			
			Если РегистрыВосстановленияРасчетовПоСторно.Найти(ИмяТаблицыРегистра) <> Неопределено Тогда
				ДобавитьТаблицуВосстановленияРасчетовПоСторно(ТекстЗапросаРегистра, ИмяТаблицыРегистра);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
					ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
				ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
					ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
			КонецЕсли;
		Иначе
			ТекстЗапросаРегистра = ТекстВыборкиАналитикиИзВременнойТаблицы();
			ТекстЗапросаРегистра = СтрЗаменить(ТекстЗапросаРегистра, "&ИсточникДанных", ИмяВременнойТаблицыРегистра);
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуАналитикиВТекстЗапроса(
				ВыборкаПолейАналитики, ГруппировкаПолейАналитики, ТекстЗапросаРегистра);
			ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьВыборкуРесурсовВТекстЗапроса(
				ВыборкаРесурсовИсточника, ТекстЗапросаРегистра);
		КонецЕсли;
		
		ТекстыЗапросов.Добавить(ТекстЗапросаРегистра);
		Запрос.Параметры.РегистрыВыборкиАналитики.Вставить(ВыборкаИмяРегистра.ИмяРегистра, ИндексРезультатаЗапросаАналитики);
		ИндексРезультатаЗапросаАналитики = ИндексРезультатаЗапросаАналитики + 1;
	КонецЦикла;
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ФактическиеКорреспонденции.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ФактическиеКорреспонденции.ИнверсияФактическихДанных КАК ИнверсияФактическихДанных,
	|	ФактическиеКорреспонденции.ИсточникДанныхКорреспонденции КАК ИсточникДанныхКорреспонденции,
	|	ВЫБОР
	|		КОГДА ФактическиеКорреспонденции.ИсточникДанныхКорреспонденции = &Дт
	|			ТОГДА &Кт
	|		ИНАЧЕ &Дт
	|	КОНЕЦ КАК КорИсточникДанныхКорреспонденции,
	|	ЕСТЬNULL(ВыраженияЗаполненияАналитики.КорИсточникАналитики1
	|		ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики2
	|		ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики3
	|		ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики4
	|		ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики5
	|		ИЛИ ВыраженияЗаполненияАналитики.КорИсточникАналитики6, ЛОЖЬ) КАК ПолучитьКорАналитику,
	|	ФактическиеКорреспонденции.НомерЗаписи КАК НомерЗаписи,
	|	ФактическиеКорреспонденции.Период КАК Период,
	|	ФактическиеКорреспонденции.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ФактическиеКорреспонденции.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ФактическиеКорреспонденции.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ФактическиеКорреспонденции.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ФактическиеКорреспонденции.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ФактическиеКорреспонденции.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ФактическиеКорреспонденции.ИнвертироватьКорреспонденцию КАК ИнвертироватьКорреспонденцию,
	|	ФактическиеКорреспонденции.Организация КАК Организация,
	|	ФактическиеКорреспонденции.Регистратор КАК Регистратор,
	|	ФактическиеКорреспонденции.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ФактическиеКорреспонденции.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ФактическиеКорреспонденции.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ФактическиеКорреспонденции.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ФактическиеКорреспонденции.РеквизитСторно КАК РеквизитСторно,
	|	ФактическиеКорреспонденции.ВалютаДт КАК ВалютаДт,
	|	ФактическиеКорреспонденции.ВалютаКт КАК ВалютаКт,
	|	ФактическиеКорреспонденции.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ФактическиеКорреспонденции.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ФактическиеКорреспонденции.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ФактическиеКорреспонденции.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ФактическиеКорреспонденции.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ФактическиеКорреспонденции.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ФактическиеКорреспонденции.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ФактическиеКорреспонденции.СуммаУпрДт КАК СуммаУпр,
	|	ФактическиеКорреспонденции.СуммаРеглДт КАК СуммаРегл,
	|	ФактическиеКорреспонденции.СуммаВалДт КАК СуммаВалДт,
	|	ФактическиеКорреспонденции.СуммаВалКт КАК СуммаВалКт,
	|	ФактическиеКорреспонденции.КоличествоДт КАК КоличествоДт,
	|	ФактическиеКорреспонденции.КоличествоКт КАК КоличествоКт
	|ИЗ
	|	втФактическиеКорреспонденции КАК ФактическиеКорреспонденции
	|	ЛЕВОЕ СОЕДИНЕНИЕ втВыраженияЗаполненияАналитики КАК ВыраженияЗаполненияАналитики
	|	ПО ФактическиеКорреспонденции.ПравилоПолученияФакта = ВыраженияЗаполненияАналитики.ПравилоПолученияФакта
	|	 И ФактическиеКорреспонденции.ОбъектУчетаДт = ВыраженияЗаполненияАналитики.ОбъектУчетаДт
	|	 И ФактическиеКорреспонденции.ОбъектУчетаКт = ВыраженияЗаполненияАналитики.ОбъектУчетаКт
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ЗначенияЗаполненияАналитики.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ЗначенияЗаполненияАналитики.ЗначениеАналитики1 КАК ЗначениеАналитики1,
	|	ЗначенияЗаполненияАналитики.ЗначениеАналитики2 КАК ЗначениеАналитики2,
	|	ЗначенияЗаполненияАналитики.ЗначениеАналитики3 КАК ЗначениеАналитики3,
	|	ЗначенияЗаполненияАналитики.ЗначениеАналитики4 КАК ЗначениеАналитики4,
	|	ЗначенияЗаполненияАналитики.ЗначениеАналитики5 КАК ЗначениеАналитики5,
	|	ЗначенияЗаполненияАналитики.ЗначениеАналитики6 КАК ЗначениеАналитики6
	|ИЗ
	|	втЗначенияЗаполненияАналитики КАК ЗначенияЗаполненияАналитики
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ВыраженияЗаполненияАналитики.ПравилоПолученияФакта КАК ПравилоПолученияФакта,
	|	ВыраженияЗаполненияАналитики.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ВыраженияЗаполненияАналитики.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ВыраженияЗаполненияАналитики.ВыражениеАналитики1 КАК ВыражениеАналитики1,
	|	ВыраженияЗаполненияАналитики.ВыражениеАналитики2 КАК ВыражениеАналитики2,
	|	ВыраженияЗаполненияАналитики.ВыражениеАналитики3 КАК ВыражениеАналитики3,
	|	ВыраженияЗаполненияАналитики.ВыражениеАналитики4 КАК ВыражениеАналитики4,
	|	ВыраженияЗаполненияАналитики.ВыражениеАналитики5 КАК ВыражениеАналитики5,
	|	ВыраженияЗаполненияАналитики.ВыражениеАналитики6 КАК ВыражениеАналитики6,
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики1 КАК КорИсточникАналитики1,
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики2 КАК КорИсточникАналитики2,
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики3 КАК КорИсточникАналитики3,
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики4 КАК КорИсточникАналитики4,
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики5 КАК КорИсточникАналитики5,
	|	ВыраженияЗаполненияАналитики.КорИсточникАналитики6 КАК КорИсточникАналитики6
	|ИЗ
	|	втВыраженияЗаполненияАналитики КАК ВыраженияЗаполненияАналитики
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	РесурсыИсточниковДанных.ОбъектУчета КАК ОбъектУчета,
	|	РесурсыИсточниковДанных.Показатель КАК Показатель,
	|	РесурсыИсточниковДанных.ГруппаРесурсов КАК ГруппаРесурсов,
	|	РесурсыИсточниковДанных.ИмяРесурса КАК ИмяРесурса,
	|	РесурсыИсточниковДанных.Коэффициент КАК Коэффициент
	|ИЗ
	|	втРесурсыИсточниковДанных КАК РесурсыИсточниковДанных
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	СложныеКорреспонденции.НомерЗаписи КАК НомерЗаписи,
	|	СложныеКорреспонденции.Период КАК Период,
	|	СложныеКорреспонденции.Организация КАК Организация,
	|	СложныеКорреспонденции.Регистратор КАК Регистратор,
	|	СложныеКорреспонденции.НастройкаХозОперации КАК НастройкаХозОперации,
	|	СложныеКорреспонденции.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	СложныеКорреспонденции.РеквизитСторно КАК РеквизитСторно,
	|	СложныеКорреспонденции.СуммаДвиженияУпр КАК СуммаДвиженияУпр,
	|	СложныеКорреспонденции.СуммаДвиженияРегл КАК СуммаДвиженияРегл,
	|	СложныеКорреспонденции.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	СложныеКорреспонденции.СуммаУпр КАК СуммаУпр,
	|	СложныеКорреспонденции.СуммаРегл КАК СуммаРегл
	|ИЗ
	|	втСложныеКорреспонденции КАК СложныеКорреспонденции
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, УдаляемыеВременныеТаблицы);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуФактическихДанных(Запрос, ТекстыЗапросов, ТаблицаФактическихДанных,
	ДокументыКОбработке, ПараметрыПолученияФакта, ТаблицаПравил)
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результаты = Запрос.ВыполнитьПакет();
	ТекстыЗапросов.Очистить();
	
	ПараметрыПолученияФакта.Вставить("ДлинаСуммы", Запрос.Параметры.ДлинаСуммы);
	ПараметрыПолученияФакта.Вставить("ТочностьСуммы", Запрос.Параметры.ТочностьСуммы);
	ПараметрыПолученияФакта.Вставить("ДлинаКоличества", Запрос.Параметры.ДлинаКоличества);
	ПараметрыПолученияФакта.Вставить("ТочностьКоличества", Запрос.Параметры.ТочностьКоличества);
	
	ТаблицыАналитики = Новый Структура();
	ИндексРезультатаЗапросаКорреспонденций = 0;
	
	Для Каждого КлючИЗначение Из Запрос.Параметры.РегистрыВыборкиАналитики Цикл
		ТаблицыАналитики.Вставить(КлючИЗначение.Ключ, ТаблицаЗапросаАналитики(Результаты[КлючИЗначение.Значение]));
		Если КлючИЗначение.Значение >= ИндексРезультатаЗапросаКорреспонденций Тогда
			ИндексРезультатаЗапросаКорреспонденций = КлючИЗначение.Значение + 1;
		КонецЕсли;
	КонецЦикла;
	
	ИндексРезультатаЗначенийАналитики = ИндексРезультатаЗапросаКорреспонденций + 1;
	ИндексРезультатаВыраженийАналитики = ИндексРезультатаЗапросаКорреспонденций + 2;
	ИндексРезультатаРесурсыПоказателей = ИндексРезультатаЗапросаКорреспонденций + 3;
	ИндексРезультатаСложныеКорреспонденции = ИндексРезультатаЗапросаКорреспонденций + 4;
	
	РезультатКорреспонденции = Результаты[ИндексРезультатаЗапросаКорреспонденций];
	РезультатЗначенияАналитики = Результаты[ИндексРезультатаЗначенийАналитики];
	РезультатВыраженияАналитики = Результаты[ИндексРезультатаВыраженийАналитики];
	РезультатРесурсыПоказателей = Результаты[ИндексРезультатаРесурсыПоказателей];
	РезультатСложныеКорреспонденции = Результаты[ИндексРезультатаСложныеКорреспонденции];
	
	ВыборкаКорреспонденции = РезультатКорреспонденции.Выбрать();
	ВыборкаЗначенияАналитики = РезультатЗначенияАналитики.Выбрать();
	ВыборкаВыраженияАналитики = РезультатВыраженияАналитики.Выбрать();
	ВыборкаРесурсыПоказателей = РезультатРесурсыПоказателей.Выбрать();
	ВыборкаСложныеКорреспонденции = РезультатСложныеКорреспонденции.Выбрать();
	
	Пока ВыборкаКорреспонденции.Следующий() Цикл
		ДтКт = ВыборкаКорреспонденции.ИсточникДанныхКорреспонденции;
		КорДтКт = ВыборкаКорреспонденции.КорИсточникДанныхКорреспонденции;
		
		АналитикаИсточникаДанных = СтрокиАналитикиДвижения(ВыборкаКорреспонденции,
			ВыборкаЗначенияАналитики, ВыборкаВыраженияАналитики, ТаблицыАналитики, Запрос.Параметры, ДтКт);
		АналитикаКорИсточникаДанных = СтрокиАналитикиДвижения(ВыборкаКорреспонденции,
			ВыборкаЗначенияАналитики, ВыборкаВыраженияАналитики, ТаблицыАналитики, Запрос.Параметры, КорДтКт);
		
		ОшибкиКорреспонденции = Новый Соответствие();
		
		Если НЕ ФинансовыйУчетПоДаннымБалансовыхРегистров.ПроверкаРавенстваБалансовыхРесурсов(
			ВыборкаКорреспонденции, АналитикаИсточникаДанных, Запрос.Параметры, ДтКт) Тогда
			ОшибкиКорреспонденции.Вставить(СтрШаблон(
				НСтр("ru = 'Ошибка при подборе аналитики к записи регистра ""%1"" с идентификатором %2.';
					|en = 'An error occurred while picking a dimension for the ""%1"" register record with ID %2.'"),
				ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.РегистрыНакопления[ВыборкаКорреспонденции["ИмяРегистра" + ДтКт]]),
				ВыборкаКорреспонденции.ИдентификаторФинЗаписи));
		КонецЕсли;
		
		Если ВыборкаКорреспонденции.ПолучитьКорАналитику
		И НЕ ФинансовыйУчетПоДаннымБалансовыхРегистров.ПроверкаРавенстваБалансовыхРесурсов(
			ВыборкаКорреспонденции, АналитикаКорИсточникаДанных, Запрос.Параметры, КорДтКт) Тогда
			ОшибкиКорреспонденции.Вставить(СтрШаблон(
				НСтр("ru = 'Ошибка при подборе аналитики к записи регистра ""%1"" с идентификатором %2.';
					|en = 'An error occurred while picking a dimension for the ""%1"" register record with ID %2.'"),
				ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.РегистрыНакопления[ВыборкаКорреспонденции["ИмяРегистра" + КорДтКт]]),
				ВыборкаКорреспонденции.ИдентификаторФинЗаписи));
		КонецЕсли;
		
		Если АналитикаИсточникаДанных.Количество() > 1 И АналитикаКорИсточникаДанных.Количество() > 1 Тогда
			ОшибкиКорреспонденции.Вставить(СтрШаблон(
				НСтр("ru = 'Записи регистров ""%1"" и ""%2"" с идентификатором %3 имеют отношение ""многие ко многим"".';
					|en = 'Records of registers ""%1"" and ""%2"" with ID %3 have the Many-to-Many relationship.'"),
				ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.РегистрыНакопления[ВыборкаКорреспонденции.ИмяРегистраДт]),
				ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.РегистрыНакопления[ВыборкаКорреспонденции.ИмяРегистраКт]),
				ВыборкаКорреспонденции.ИдентификаторФинЗаписи));
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Правило", ВыборкаКорреспонденции.ПравилоПолученияФакта);
		СтрокиПравила = ТаблицаПравил.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиПравила <> Неопределено Тогда
			ОписаниеПравила = СтрокиПравила[0];
		Иначе
			ОшибкиКорреспонденции.Вставить(СтрШаблон(
				НСтр("ru = 'Ошибка при обращении к свойствам правила получения фактических данных ""%1"".';
					|en = 'An error occurred when accessing the properties of the rule for obtaining the ""%1"" actual data.'"),
				ВыборкаКорреспонденции.ПравилоПолученияФакта));
		КонецЕсли;
		
		Если ОшибкиКорреспонденции.Количество() > 0 Тогда
			ТекстОшибки = "";
			Для Каждого ОшибкаКорреспонденции Из ОшибкиКорреспонденции Цикл
				ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + ОшибкаКорреспонденции.Ключ;
			КонецЦикла;
			ЗарегистрироватьОшибкуОбработкиДокумента(ТекстОшибки, ВыборкаКорреспонденции, ДокументыКОбработке, ОписаниеПравила);
			Продолжить;
		КонецЕсли;
		
		ОписаниеПоказателя = ОписаниеПоказателяИсточникаДанных(ВыборкаРесурсыПоказателей, ОписаниеПравила);
		ЗначенияРесурсов = ЗначенияРесурсовПоказателя(ВыборкаКорреспонденции, ОписаниеПоказателя, АналитикаИсточникаДанных, ПараметрыПолученияФакта, ДтКт);
		
		Если ВыборкаКорреспонденции["СложнаяПроводка" + ДтКт] Тогда
			Если НЕ БалансныйПоказательИсточника(ОписаниеПоказателя) Тогда
				ПересчитатьРесурсыНебалансногоПоказателяСложнойКорреспонденции(ВыборкаКорреспонденции, ВыборкаСложныеКорреспонденции, ЗначенияРесурсов);
			ИначеЕсли ЗначенияРесурсов.Количество() > 1 Тогда
				ПересчитатьРесурсыБалансногоПоказателяСложнойКорреспонденции(ВыборкаКорреспонденции, ЗначенияРесурсов, ДтКт);
			КонецЕсли;
		КонецЕсли;
		
		Если АналитикаИсточникаДанных.Количество() = 1 И АналитикаКорИсточникаДанных.Количество() <= 1 Тогда
			ПолучитьДанныеПростойАналитики(ВыборкаКорреспонденции, ТаблицаФактическихДанных, ЗначенияРесурсов,
				АналитикаИсточникаДанных, АналитикаКорИсточникаДанных, ПараметрыПолученияФакта, ОписаниеПравила);
		Иначе
			ПолучитьДанныеСложнойАналитики(ВыборкаКорреспонденции, ТаблицаФактическихДанных, ЗначенияРесурсов,
				АналитикаИсточникаДанных, АналитикаКорИсточникаДанных, ПараметрыПолученияФакта, ОписаниеПравила);
		КонецЕсли;
	КонецЦикла;
	
	СвернутьТаблицуФактическихДанных(ТаблицаФактическихДанных);
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибкуОбработкиДокумента(ТекстОшибки, ВыборкаКорреспонденции, ДокументыКОбработке, ОписаниеПравила)
	
	СтруктураПоиска = Новый Структура("Документ", ВыборкаКорреспонденции.Регистратор);
	СтрокиДокумента = ДокументыКОбработке.НайтиСтроки(СтруктураПоиска);
	СтрокаОшибки = Неопределено;
	
	Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл
		Если СтрокаДокумента.Организация.Пустая() И СтрокаДокумента.Период = '00010101'
		 ИЛИ СтрокаДокумента.Организация = ВыборкаКорреспонденции.Организация
			И СтрокаДокумента.Период = ВыборкаКорреспонденции.Период Тогда
			СтрокаОшибки = СтрокаДокумента;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаОшибки = Неопределено Тогда
		СтрокаОшибки = ДокументыКОбработке.Добавить();
		СтрокаОшибки.Документ = СтруктураПоиска.Документ;
	КонецЕсли;
	
	СтрокаОшибки.Ошибка = Истина;
	СтрокаОшибки.Период = ВыборкаКорреспонденции.Период;
	СтрокаОшибки.Организация = ВыборкаКорреспонденции.Организация;
	СтрокаОшибки.Комментарий = СтрокаОшибки.Комментарий
		+ ?(ПустаяСтрока(СтрокаОшибки.Комментарий), "", Символы.ПС)
		+ ТекстОшибки;
	СтрокаОшибки.Правило = ОписаниеПравила.Правило;
	СтрокаОшибки.СтатьяБюджетов = ОписаниеПравила.СтатьяБюджетов;
	
КонецПроцедуры

Процедура СвернутьТаблицуФактическихДанных(ТаблицаФактическихДанных)
	
	КолонкиГруппировки = Новый Массив();
	КолонкиСуммирования = Новый Массив();
	
	Для Каждого Колонка Из ТаблицаФактическихДанных.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			КолонкиСуммирования.Добавить(Колонка.Имя);
		Иначе
			КолонкиГруппировки.Добавить(Колонка.Имя);	
		КонецЕсли;
	КонецЦикла;	
	
	КолонкиГруппировки  = СтрСоединить(КолонкиГруппировки , ",");
	КолонкиСуммирования = СтрСоединить(КолонкиСуммирования, ",");
	
	ТаблицаФактическихДанных.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
КонецПроцедуры

#Область ТекстыЗапросовОбработкиДвиженийРегистров

Процедура ДобавитьТаблицыДвиженийДебетаИКредита(Запрос, ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДвиженияРегистров.Период КАК Период,
	|	ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияРегистров.ЭтоДебет КАК ЭтоДебет,
	|	ДвиженияРегистров.ЭтоКредит КАК ЭтоКредит,
	|	ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияРегистров.Организация КАК Организация,
	|	ДвиженияРегистров.Регистратор КАК Регистратор,
	|	ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияРегистров.СлужебныйВидДеятельностиНДС КАК СлужебныйВидДеятельностиНДС,
	|	ДвиженияРегистров.Валюта КАК Валюта,
	|	ДвиженияРегистров.СуммаУпр КАК СуммаУпр,
	|	ДвиженияРегистров.СуммаРегл КАК СуммаРегл,
	|	ДвиженияРегистров.СуммаВал КАК СуммаВал,
	|	ДвиженияРегистров.Количество КАК Количество,
	|	ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втДвиженияРегистровСоСторно
	|ИЗ
	|	втДвиженияРегистров КАК ДвиженияРегистров
	|ГДЕ
	|	ДвиженияРегистров.СуммаУпр < 0 ИЛИ ДвиженияРегистров.СуммаРегл < 0
	|	ИЛИ ДвиженияРегистров.СуммаВал < 0 ИЛИ ДвиженияРегистров.Количество < 0
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоДебет,
	|	ЭтоКредит
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияРегистровСоСторно.ИмяРегистра КАК ИмяРегистра
	|ПОМЕСТИТЬ втРегистрыЗаменыСторноНаРеверс
	|ИЗ
	|	втДвиженияРегистровСоСторно КАК ДвиженияРегистровСоСторно
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ДвиженияРегистров.Период КАК Период,
	|	ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияРегистров.ЭтоДебет КАК ЭтоДебет,
	|	ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияРегистров.Организация КАК Организация,
	|	ДвиженияРегистров.Регистратор КАК Регистратор,
	|	ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияРегистров.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияРегистров.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ДвиженияРегистров.СуммаУпр <> 0
	|			ТОГДА ДвиженияРегистров.СуммаУпр
	|		КОГДА НЕ ДвиженияРегистров.ИмяРегистра В (&РегистрыБезСуммыУпр)
	|			ТОГДА ДвиженияРегистров.СуммаУпр
	|		КОГДА ДвиженияРегистров.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА ДвиженияРегистров.СуммаВал
	|		КОГДА ДвиженияРегистров.Организация.ВалютаРегламентированногоУчета = &ВалютаУправленческогоУчета
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияРегистров.СуммаРегл <> 0
	|					ТОГДА ДвиженияРегистров.СуммаРегл
	|				КОГДА ЕСТЬNULL(ДвиженияРегистров.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					ТОГДА ДвиженияРегистров.СуммаВал
	|				ИНАЧЕ ДвиженияРегистров.СуммаУпр
	|			КОНЕЦ
	|		ИНАЧЕ ДвиженияРегистров.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	ВЫБОР
	|		КОГДА ДвиженияРегистров.СуммаРегл <> 0
	|			ТОГДА ДвиженияРегистров.СуммаРегл
	|		КОГДА НЕ ДвиженияРегистров.ИмяРегистра В (&РегистрыБезСуммыРегл)
	|			ТОГДА ДвиженияРегистров.СуммаРегл
	|		КОГДА ДвиженияРегистров.Валюта = ДвиженияРегистров.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ДвиженияРегистров.СуммаВал
	|		КОГДА ДвиженияРегистров.Организация.ВалютаРегламентированногоУчета = &ВалютаУправленческогоУчета
	|			И ДвиженияРегистров.СуммаУпр <> 0
	|			ТОГДА ДвиженияРегистров.СуммаУпр
	|		КОГДА ЕСТЬNULL(ДвиженияРегистров.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ДвиженияРегистров.СуммаВал
	|		ИНАЧЕ ДвиженияРегистров.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ДвиженияРегистров.СуммаВал КАК СуммаВал,
	|	ДвиженияРегистров.Количество КАК Количество,
	|	ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втСвернутыеДвиженияДебет
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияРегистров.Период КАК Период,
	|		ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
	|		ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
	|		ДвиженияРегистров.ЭтоДебет КАК ЭтоДебет,
	|		ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
	|		ДвиженияРегистров.Организация КАК Организация,
	|		ДвиженияРегистров.Регистратор КАК Регистратор,
	|		ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
	|		ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ДвиженияРегистров.СлужебныйВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		ДвиженияРегистров.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.СуммаУпр >= 0
	|				ТОГДА ДвиженияРегистров.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.СуммаРегл >= 0
	|				ТОГДА ДвиженияРегистров.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.СуммаВал >= 0
	|				ТОГДА ДвиженияРегистров.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.Количество >= 0
	|				ТОГДА ДвиженияРегистров.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	|		ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно
	|	ИЗ
	|		втДвиженияРегистров КАК ДвиженияРегистров
	|	ГДЕ
	|		НЕ ДвиженияРегистров.ЭтоКредит
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияРегистровСоСторно.Период КАК Период,
	|		ДвиженияРегистровСоСторно.ИмяРегистра КАК ИмяРегистра,
	|		ДвиженияРегистровСоСторно.ОбъектУчета КАК ОбъектУчета,
	|		ДвиженияРегистровСоСторно.ЭтоКредит КАК ЭтоДебет,
	|		НЕ ДвиженияРегистровСоСторно.ЭтоСторно КАК ЭтоСторно,
	|		ДвиженияРегистровСоСторно.Организация КАК Организация,
	|		ДвиженияРегистровСоСторно.Регистратор КАК Регистратор,
	|		ДвиженияРегистровСоСторно.НастройкаХозОперации КАК НастройкаХозОперации,
	|		ДвиженияРегистровСоСторно.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		ДвиженияРегистровСоСторно.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ДвиженияРегистровСоСторно.СлужебныйВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		ДвиженияРегистровСоСторно.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.СуммаУпр < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.СуммаРегл < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.СуммаВал < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.Количество < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	|		ДвиженияРегистровСоСторно.РеквизитСторно КАК РеквизитСторно
	|	ИЗ
	|		втДвиженияРегистровСоСторно КАК ДвиженияРегистровСоСторно
	|	ГДЕ
	|		НЕ ДвиженияРегистровСоСторно.ЭтоДебет
	|	) КАК ДвиженияРегистров
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	ИмяРегистра,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ДвиженияРегистров.Период КАК Период,
	|	ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияРегистров.ЭтоКредит КАК ЭтоКредит,
	|	ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияРегистров.Организация КАК Организация,
	|	ДвиженияРегистров.Регистратор КАК Регистратор,
	|	ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияРегистров.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияРегистров.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ДвиженияРегистров.СуммаУпр <> 0
	|			ТОГДА ДвиженияРегистров.СуммаУпр
	|		КОГДА НЕ ДвиженияРегистров.ИмяРегистра В (&РегистрыБезСуммыУпр)
	|			ТОГДА ДвиженияРегистров.СуммаУпр
	|		КОГДА ДвиженияРегистров.Валюта = &ВалютаУправленческогоУчета
	|			ТОГДА ДвиженияРегистров.СуммаВал
	|		КОГДА ДвиженияРегистров.Организация.ВалютаРегламентированногоУчета = &ВалютаУправленческогоУчета
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияРегистров.СуммаРегл <> 0
	|					ТОГДА ДвиженияРегистров.СуммаРегл
	|				КОГДА ЕСТЬNULL(ДвиженияРегистров.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					ТОГДА ДвиженияРегистров.СуммаВал
	|				ИНАЧЕ ДвиженияРегистров.СуммаУпр
	|			КОНЕЦ
	|		ИНАЧЕ ДвиженияРегистров.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	ВЫБОР
	|		КОГДА ДвиженияРегистров.СуммаРегл <> 0
	|			ТОГДА ДвиженияРегистров.СуммаРегл
	|		КОГДА НЕ ДвиженияРегистров.ИмяРегистра В (&РегистрыБезСуммыРегл)
	|			ТОГДА ДвиженияРегистров.СуммаРегл
	|		КОГДА ДвиженияРегистров.Валюта = ДвиженияРегистров.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ДвиженияРегистров.СуммаВал
	|		КОГДА ДвиженияРегистров.Организация.ВалютаРегламентированногоУчета = &ВалютаУправленческогоУчета
	|			И ДвиженияРегистров.СуммаУпр <> 0
	|			ТОГДА ДвиженияРегистров.СуммаУпр
	|		КОГДА ЕСТЬNULL(ДвиженияРегистров.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ДвиженияРегистров.СуммаВал
	|		ИНАЧЕ ДвиженияРегистров.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ДвиженияРегистров.СуммаВал КАК СуммаВал,
	|	ДвиженияРегистров.Количество КАК Количество,
	|	ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втСвернутыеДвиженияКредит
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияРегистров.Период КАК Период,
	|		ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
	|		ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
	|		ДвиженияРегистров.ЭтоКредит КАК ЭтоКредит,
	|		ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
	|		ДвиженияРегистров.Организация КАК Организация,
	|		ДвиженияРегистров.Регистратор КАК Регистратор,
	|		ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
	|		ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ДвиженияРегистров.СлужебныйВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		ДвиженияРегистров.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.СуммаУпр >= 0
	|				ТОГДА ДвиженияРегистров.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.СуммаРегл >= 0
	|				ТОГДА ДвиженияРегистров.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.СуммаВал >= 0
	|				ТОГДА ДвиженияРегистров.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистров.Количество >= 0
	|				ТОГДА ДвиженияРегистров.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	|		ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно
	|	ИЗ
	|		втДвиженияРегистров КАК ДвиженияРегистров
	|	ГДЕ
	|		НЕ ДвиженияРегистров.ЭтоДебет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияРегистровСоСторно.Период КАК Период,
	|		ДвиженияРегистровСоСторно.ИмяРегистра КАК ИмяРегистра,
	|		ДвиженияРегистровСоСторно.ОбъектУчета КАК ОбъектУчета,
	|		ДвиженияРегистровСоСторно.ЭтоДебет КАК ЭтоКредит,
	|		НЕ ДвиженияРегистровСоСторно.ЭтоСторно КАК ЭтоСторно,
	|		ДвиженияРегистровСоСторно.Организация КАК Организация,
	|		ДвиженияРегистровСоСторно.Регистратор КАК Регистратор,
	|		ДвиженияРегистровСоСторно.НастройкаХозОперации КАК НастройкаХозОперации,
	|		ДвиженияРегистровСоСторно.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		ДвиженияРегистровСоСторно.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ДвиженияРегистровСоСторно.СлужебныйВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		ДвиженияРегистровСоСторно.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.СуммаУпр < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.СуммаРегл < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.СуммаВал < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ДвиженияРегистровСоСторно.Количество < 0
	|				ТОГДА -ДвиженияРегистровСоСторно.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	|		ДвиженияРегистровСоСторно.РеквизитСторно КАК РеквизитСторно
	|	ИЗ
	|		втДвиженияРегистровСоСторно КАК ДвиженияРегистровСоСторно
	|	ГДЕ
	|		НЕ ДвиженияРегистровСоСторно.ЭтоКредит
	|	) КАК ДвиженияРегистров
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	ИмяРегистра,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияРегистров");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияРегистровСоСторно");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результаты = Запрос.ВыполнитьПакет();
	ТекстыЗапросов.Очистить();
	
	ТаблицаРегистровЗаменыСторно = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("втРегистрыЗаменыСторноНаРеверс");
	ТаблицаРегистровЗаменыСторно = ТаблицаРегистровЗаменыСторно.ПолучитьДанные().Выгрузить();
	Запрос.Параметры.РегистрыЗаменыСторноНаРеверс = ТаблицаРегистровЗаменыСторно.ВыгрузитьКолонку("ИмяРегистра");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРегистрыЗаменыСторноНаРеверс");
	
КонецПроцедуры

Процедура ОбработатьИСоединитьТаблицыДвижений(Запрос, ТекстыЗапросов)
	
	ОпределитьСложныеПроводкиСУказаниемКорИсточников(Запрос, ТекстыЗапросов);
	
	ДобавитьИдентификаторыИсточниковДанных(ТекстыЗапросов, Запрос.Параметры, "Дт");
	ДобавитьИдентификаторыИсточниковДанных(ТекстыЗапросов, Запрос.Параметры, "Кт");
	
	ДобавитьИтогиПоОперациямИФинЗаписям(ТекстыЗапросов, "Дт");
	ДобавитьИтогиПоОперациямИФинЗаписям(ТекстыЗапросов, "Кт");
	
	СоединитьДвиженияПоКлючевымПолям(Запрос, ТекстыЗапросов);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияСИтогамиДебет");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияСИтогамиКредит");
	
КонецПроцедуры

Процедура ОпределитьСложныеПроводкиСУказаниемКорИсточников(Запрос, ТекстыЗапросов)
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("втКорИсточникиДанных") = Неопределено Тогда
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	КорИсточникиДанных.ОбъектУчета КАК ОбъектУчета,
		|	КорИсточникиДанных.КорИсточникДанных КАК КорИмяРегистра,
		|	КорИсточникиДанных.Идентификатор КАК Идентификатор,
		|	КорИсточникиДанных.КорИдентификатор КАК КорИдентификатор
		|ПОМЕСТИТЬ втКорИсточникиДанных
		|ИЗ
		|	&КорИсточникиДанных КАК КорИсточникиДанных
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектУчета,
		|	КорИмяРегистра
		|");
		
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	КорИсточникиДанных.ОбъектУчета КАК ОбъектУчета,
		|	КорИсточникиДанных.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втИдентификаторыКорИсточниковДанных
		|ИЗ
		|	втКорИсточникиДанных КАК КорИсточникиДанных
		|СГРУППИРОВАТЬ ПО
		|	КорИсточникиДанных.ОбъектУчета,
		|	КорИсточникиДанных.Идентификатор
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектУчета
		|");
	КонецЕсли;
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДвиженияДебет.Период КАК Период,
	|	ДвиженияДебет.Организация КАК Организация,
	|	ДвиженияДебет.Регистратор КАК Регистратор,
	|	ДвиженияДебет.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебет.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебет.РеквизитСторно КАК РеквизитСторно,
	|	КорИсточникиДанных.КорИмяРегистра КАК КорИмяРегистра,
	|	КорИсточникиДанных.КорИдентификатор КАК КорИдентификатор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДвиженияДебет.ОбъектУчета) КАК КоличествоОбъектовУчета
	|ПОМЕСТИТЬ втИдентификаторыОперацийДебет
	|ИЗ
	|	втСвернутыеДвиженияДебет КАК ДвиженияДебет
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|		ПО ДвиженияДебет.ОбъектУчета = КорИсточникиДанных.ОбъектУчета
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияДебет.Период,
	|	ДвиженияДебет.Регистратор,
	|	ДвиженияДебет.ИдентификаторФинЗаписи,
	|	ДвиженияДебет.Организация,
	|	ДвиженияДебет.НастройкаХозОперации,
	|	ДвиженияДебет.РеквизитСторно,
	|	КорИсточникиДанных.КорИмяРегистра,
	|	КорИсточникиДанных.КорИдентификатор
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	КорИмяРегистра,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДвиженияКредит.Период КАК Период,
	|	ДвиженияКредит.Организация КАК Организация,
	|	ДвиженияКредит.Регистратор КАК Регистратор,
	|	ДвиженияКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияКредит.РеквизитСторно КАК РеквизитСторно,
	|	КорИсточникиДанных.КорИмяРегистра КАК КорИмяРегистра,
	|	КорИсточникиДанных.КорИдентификатор КАК КорИдентификатор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДвиженияКредит.ОбъектУчета) КАК КоличествоОбъектовУчета
	|ПОМЕСТИТЬ втИдентификаторыОперацийКредит
	|ИЗ
	|	втСвернутыеДвиженияКредит КАК ДвиженияКредит
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|		ПО ДвиженияКредит.ОбъектУчета = КорИсточникиДанных.ОбъектУчета
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияКредит.Период,
	|	ДвиженияКредит.Регистратор,
	|	ДвиженияКредит.ИдентификаторФинЗаписи,
	|	ДвиженияКредит.Организация,
	|	ДвиженияКредит.НастройкаХозОперации,
	|	ДвиженияКредит.РеквизитСторно,
	|	КорИсточникиДанных.КорИмяРегистра,
	|	КорИсточникиДанных.КорИдентификатор
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	КорИмяРегистра,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	втИдентификаторыОперацийДебет КАК ИдентификаторыОперацийДебет
	|ГДЕ
	|	ИдентификаторыОперацийДебет.КоличествоОбъектовУчета > 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	втИдентификаторыОперацийКредит КАК ИдентификаторыОперацийКредит
	|ГДЕ
	|	ИдентификаторыОперацийКредит.КоличествоОбъектовУчета > 1
	|");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТекстыЗапросов.Очистить();
	
	Результаты = Запрос.ВыполнитьПакет();
	ЕстьСложныеПроводки = НЕ Результаты[Результаты.ВГраница()].Пустой();
	
	Если НЕ ЕстьСложныеПроводки Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДвиженияДебет.Период КАК Период,
		|	ДвиженияДебет.ИмяРегистра КАК ИмяРегистра,
		|	ДвиженияДебет.Организация КАК Организация,
		|	ДвиженияДебет.Регистратор КАК Регистратор,
		|	ДвиженияДебет.НастройкаХозОперации КАК НастройкаХозОперации,
		|	ДвиженияДебет.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	ДвиженияДебет.РеквизитСторно КАК РеквизитСторно,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДвиженияДебет.ОбъектУчета) КАК КоличествоОбъектовУчета
		|ИЗ
		|	втСвернутыеДвиженияДебет КАК ДвиженияДебет
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИдентификаторыОперацийКредит КАК ИдентификаторыОперацийКредит
		|		ПО ДвиженияДебет.Период = ИдентификаторыОперацийКредит.Период
		|		 И ДвиженияДебет.Регистратор = ИдентификаторыОперацийКредит.Регистратор
		|		 И ДвиженияДебет.ИдентификаторФинЗаписи = ИдентификаторыОперацийКредит.ИдентификаторФинЗаписи
		|		 И ДвиженияДебет.ИмяРегистра = ИдентификаторыОперацийКредит.КорИмяРегистра
		|		 И ДвиженияДебет.Организация = ИдентификаторыОперацийКредит.Организация
		|		 И ВЫБОР
		|			КОГДА ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
		|				И ИдентификаторыОперацийКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
		|				ТОГДА ДвиженияДебет.НастройкаХозОперации = ИдентификаторыОперацийКредит.НастройкаХозОперации
		|			ИНАЧЕ ИСТИНА
		|		 КОНЕЦ
		|		 И ДвиженияДебет.РеквизитСторно = ИдентификаторыОперацийКредит.РеквизитСторно
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияДебет.Период,
		|	ДвиженияДебет.Регистратор,
		|	ДвиженияДебет.ИдентификаторФинЗаписи,
		|	ДвиженияДебет.ИмяРегистра,
		|	ДвиженияДебет.Организация,
		|	ДвиженияДебет.НастройкаХозОперации,
		|	ДвиженияДебет.РеквизитСторно
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДвиженияДебет.ОбъектУчета) > 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДвиженияКредит.Период КАК Период,
		|	ДвиженияКредит.ИмяРегистра КАК ИмяРегистра,
		|	ДвиженияКредит.Организация КАК Организация,
		|	ДвиженияКредит.Регистратор КАК Регистратор,
		|	ДвиженияКредит.НастройкаХозОперации КАК НастройкаХозОперации,
		|	ДвиженияКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	ДвиженияКредит.РеквизитСторно КАК РеквизитСторно,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДвиженияКредит.ОбъектУчета) КАК КоличествоОбъектовУчета
		|ИЗ
		|	втСвернутыеДвиженияКредит КАК ДвиженияКредит
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИдентификаторыОперацийДебет КАК ИдентификаторыОперацийДебет
		|		ПО ДвиженияКредит.Период = ИдентификаторыОперацийДебет.Период
		|		 И ДвиженияКредит.Регистратор = ИдентификаторыОперацийДебет.Регистратор
		|		 И ДвиженияКредит.ИдентификаторФинЗаписи = ИдентификаторыОперацийДебет.ИдентификаторФинЗаписи
		|		 И ДвиженияКредит.ИмяРегистра = ИдентификаторыОперацийДебет.КорИмяРегистра
		|		 И ДвиженияКредит.Организация = ИдентификаторыОперацийДебет.Организация
		|		 И ВЫБОР
		|			КОГДА ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
		|				И ИдентификаторыОперацийДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
		|				ТОГДА ДвиженияКредит.НастройкаХозОперации = ИдентификаторыОперацийДебет.НастройкаХозОперации
		|			ИНАЧЕ ИСТИНА
		|		 КОНЕЦ
		|		 И ДвиженияКредит.РеквизитСторно = ИдентификаторыОперацийДебет.РеквизитСторно
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияКредит.Период,
		|	ДвиженияКредит.Регистратор,
		|	ДвиженияКредит.ИдентификаторФинЗаписи,
		|	ДвиженияКредит.ИмяРегистра,
		|	ДвиженияКредит.Организация,
		|	ДвиженияКредит.НастройкаХозОперации,
		|	ДвиженияКредит.РеквизитСторно
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДвиженияКредит.ОбъектУчета) > 1
		|";
		
		Результат = Запрос.Выполнить();
		ЕстьСложныеПроводки = НЕ Результат.Пустой();
	КонецЕсли;
	
	Если НЕ ЕстьСложныеПроводки Тогда
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втИдентификаторыОперацийДебет");
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втИдентификаторыОперацийКредит");
	КонецЕсли;
	
	Запрос.Параметры.СложныеПроводкиСУказаниемКорИсточников = ЕстьСложныеПроводки;
	
КонецПроцедуры

Процедура ДобавитьИдентификаторыИсточниковДанных(ТекстыЗапросов, ПараметрыЗапроса, ДтКт)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияРегистров.Период КАК Период,
	|	ДвиженияРегистров.НомерЗаписи КАК НомерЗаписи,
	|	ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияРегистров.ЭтоДтКт КАК ЭтоДтКт,
	|	ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияРегистров.Организация КАК Организация,
	|	ДвиженияРегистров.Регистратор КАК Регистратор,
	|	ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияРегистров.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияРегистров.Валюта КАК Валюта,
	|	ДвиженияРегистров.СуммаУпр КАК СуммаУпр,
	|	ДвиженияРегистров.СуммаРегл КАК СуммаРегл,
	|	ДвиженияРегистров.СуммаВал КАК СуммаВал,
	|	ДвиженияРегистров.Количество КАК Количество,
	|	ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно,
	|	&ЕстьКорИсточникиДанных КАК ЕстьКорИсточникиДанных,
	|	&ИдентификаторКорИсточниковДанных КАК ИдентификаторКорИсточниковДанных
	|ПОМЕСТИТЬ втДвиженияДтКт
	|ИЗ
	|	втСвернутыеДвиженияДтКт КАК ДвиженияРегистров
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	НастройкаХозОперации,
	|	Организация,
	|	РеквизитСторно,
	|	ИдентификаторКорИсточниковДанных
	|";
	
	Если ПараметрыЗапроса.СложныеПроводкиСУказаниемКорИсточников Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"втСвернутыеДвиженияДтКт КАК ДвиженияРегистров",
			"втСвернутыеДвиженияДтКт КАК ДвиженияРегистров
			|	ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыКорИсточниковДанных КАК ИдентификаторыКорИсточниковДанных
			|		ПО ДвиженияРегистров.ОбъектУчета = ИдентификаторыКорИсточниковДанных.ОбъектУчета");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ПОМЕСТИТЬ втДвиженияДтКт",
			"ПОМЕСТИТЬ втДвиженияРегистровДтКт");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ИНДЕКСИРОВАТЬ ПО
			|	Период,
			|	Регистратор,
			|	ИдентификаторФинЗаписи,",
			"ИНДЕКСИРОВАТЬ ПО
			|	Период,
			|	Регистратор,
			|	ИдентификаторФинЗаписи,
			|	ИмяРегистра,");
		
		ЕстьКорИсточникиДанных = "НЕ ИдентификаторыКорИсточниковДанных.Идентификатор ЕСТЬ NULL";
		ИдентификаторКорИсточниковДанных = "ЕСТЬNULL(ИдентификаторыКорИсточниковДанных.Идентификатор, """")";
	Иначе
		ЕстьКорИсточникиДанных = "ИСТИНА В
			|		(ВЫБРАТЬ ПЕРВЫЕ 1
			|			ИСТИНА
			|		ИЗ
			|			втИдентификаторыКорИсточниковДанных КАК ИдентификаторыКорИсточниковДанных
			|		ГДЕ
			|			ИдентификаторыКорИсточниковДанных.ОбъектУчета = ДвиженияРегистров.ОбъектУчета
			|		)";
		ИдентификаторКорИсточниковДанных = """""";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЕстьКорИсточникиДанных", ЕстьКорИсточникиДанных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторКорИсточниковДанных", ИдентификаторКорИсточниковДанных);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ИмяТаблицыДвижений = "втСвернутыеДвиженияДтКт";
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ИмяТаблицыДвижений, ДтКт);
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ИмяТаблицыДвижений);
	
	Если ПараметрыЗапроса.СложныеПроводкиСУказаниемКорИсточников Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДвиженияРегистров.Период КАК Период,
		|	ДвиженияРегистров.НомерЗаписи КАК НомерЗаписи,
		|	ДвиженияРегистров.ИмяРегистра КАК ИмяРегистра,
		|	ДвиженияРегистров.ОбъектУчета КАК ОбъектУчета,
		|	ДвиженияРегистров.ЭтоДтКт КАК ЭтоДтКт,
		|	ДвиженияРегистров.ЭтоСторно КАК ЭтоСторно,
		|	ДвиженияРегистров.Организация КАК Организация,
		|	ДвиженияРегистров.Регистратор КАК Регистратор,
		|	ДвиженияРегистров.НастройкаХозОперации КАК НастройкаХозОперации,
		|	ДвиженияРегистров.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	ДвиженияРегистров.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ДвиженияРегистров.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДвиженияРегистров.Валюта КАК Валюта,
		|	ДвиженияРегистров.СуммаУпр КАК СуммаУпр,
		|	ДвиженияРегистров.СуммаРегл КАК СуммаРегл,
		|	ДвиженияРегистров.СуммаВал КАК СуммаВал,
		|	ДвиженияРегистров.Количество КАК Количество,
		|	ДвиженияРегистров.РеквизитСторно КАК РеквизитСторно,
		|	ДвиженияРегистров.ЕстьКорИсточникиДанных КАК ЕстьКорИсточникиДанных,
		|	ВЫБОР
		|		КОГДА ДвиженияРегистров.ИдентификаторКорИсточниковДанных <> """"
		|			ТОГДА ДвиженияРегистров.ИдентификаторКорИсточниковДанных
		|		ИНАЧЕ ЕСТЬNULL(КорИдентификаторыОпераций.КорИдентификатор, """")
		|	КОНЕЦ КАК ИдентификаторКорИсточниковДанных
		|ПОМЕСТИТЬ втДвиженияДтКт
		|ИЗ
		|	втДвиженияРегистровДтКт КАК ДвиженияРегистров
		|	ЛЕВОЕ СОЕДИНЕНИЕ втКорИдентификаторыОперацийДтКт КАК КорИдентификаторыОпераций
		|		ПО ДвиженияРегистров.Период = КорИдентификаторыОпераций.Период
		|		 И ДвиженияРегистров.Регистратор = КорИдентификаторыОпераций.Регистратор
		|		 И ДвиженияРегистров.ИдентификаторФинЗаписи = КорИдентификаторыОпераций.ИдентификаторФинЗаписи
		|		 И ДвиженияРегистров.ИмяРегистра = КорИдентификаторыОпераций.КорИмяРегистра
		|		 И ДвиженияРегистров.Организация = КорИдентификаторыОпераций.Организация
		|		 И ВЫБОР
		|			КОГДА ДвиженияРегистров.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
		|				И КорИдентификаторыОпераций.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
		|				ТОГДА ДвиженияРегистров.НастройкаХозОперации = КорИдентификаторыОпераций.НастройкаХозОперации
		|			ИНАЧЕ ИСТИНА
		|		 КОНЕЦ
		|		 И ДвиженияРегистров.РеквизитСторно = КорИдентификаторыОпераций.РеквизитСторно
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Регистратор,
		|	ИдентификаторФинЗаписи,
		|	НастройкаХозОперации,
		|	Организация,
		|	РеквизитСторно,
		|	ИдентификаторКорИсточниковДанных
		|";
		
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
		ИмяТаблицыДвижений = "втДвиженияРегистровДтКт";
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ИмяТаблицыДвижений, ДтКт);
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ИмяТаблицыДвижений);
		
		ИмяТаблицыДвижений = "втКорИдентификаторыОперацийДтКт";
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ИмяТаблицыДвижений, ДтКт);
		ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ИмяТаблицыДвижений);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьИтогиПоОперациямИФинЗаписям(ТекстыЗапросов, ДтКт)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	Движения.Организация КАК Организация,
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.НастройкаХозОперации КАК НастройкаХозОперации,
	|	Движения.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Движения.РеквизитСторно КАК РеквизитСторно,
	|	Движения.ИдентификаторКорИсточниковДанных КАК ИдентификаторКорИсточниковДанных,
	|	КОЛИЧЕСТВО(Движения.ИдентификаторФинЗаписи) КАК КоличествоФинЗаписей,
	|	СУММА(Движения.СуммаУпр) КАК СуммаУпр,
	|	СУММА(Движения.СуммаРегл) КАК СуммаРегл,
	|	МАКСИМУМ(Движения.СуммаУпр = 0 И Движения.СуммаРегл = 0) КАК ЕстьНулевойБаланс
	|ПОМЕСТИТЬ втИтогиПоОперациям
	|ИЗ
	|	втДвиженияДтКт КАК Движения
	|СГРУППИРОВАТЬ ПО
	|	Движения.Период,
	|	Движения.Регистратор,
	|	Движения.ИдентификаторФинЗаписи,
	|	Движения.НастройкаХозОперации,
	|	Движения.Организация,
	|	Движения.РеквизитСторно,
	|	Движения.ИдентификаторКорИсточниковДанных
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	НастройкаХозОперации,
	|	Организация,
	|	РеквизитСторно,
	|	ИдентификаторКорИсточниковДанных
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	Движения.Организация КАК Организация,
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Движения.РеквизитСторно КАК РеквизитСторно,
	|	КОЛИЧЕСТВО(Движения.ИдентификаторФинЗаписи) КАК КоличествоФинЗаписей,
	|	СУММА(Движения.СуммаУпр) КАК СуммаУпр,
	|	СУММА(Движения.СуммаРегл) КАК СуммаРегл,
	|	МАКСИМУМ(Движения.СуммаУпр = 0 И Движения.СуммаРегл = 0) КАК ЕстьНулевойБаланс
	|ПОМЕСТИТЬ втИтогиПоФинЗаписям
	|ИЗ
	|	втДвиженияДтКт КАК Движения
	|ГДЕ
	|	Движения.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|	И ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втКорДвиженияДтКт КАК КорДвижения
	|		ГДЕ
	|			КорДвижения.Период = Движения.Период
	|			И КорДвижения.Регистратор = Движения.Регистратор
	|			И КорДвижения.ИдентификаторФинЗаписи = Движения.ИдентификаторФинЗаписи
	|			И КорДвижения.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			И КорДвижения.Организация = Движения.Организация
	|			И КорДвижения.РеквизитСторно = Движения.РеквизитСторно
	|			И КорДвижения.ЭтоКорДтКт
	|		)
	|	И НЕ ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втКорДвиженияДтКт КАК КорДвижения
	|			ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|				ПО КорИсточникиДанных.ОбъектУчета = Движения.ОбъектУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК ИсточникиДанных
	|				ПО ИсточникиДанных.ОбъектУчета = КорДвижения.ОбъектУчета
	|		ГДЕ
	|			КорДвижения.Период = Движения.Период
	|			И КорДвижения.Регистратор = Движения.Регистратор
	|			И КорДвижения.ИдентификаторФинЗаписи = Движения.ИдентификаторФинЗаписи
	|			И КорДвижения.НастройкаХозОперации = Движения.НастройкаХозОперации
	|			И КорДвижения.Организация = Движения.Организация
	|			И КорДвижения.РеквизитСторно = Движения.РеквизитСторно
	|			И КорДвижения.ЭтоКорДтКт
	|			И (КорДвижения.ОбъектУчета <> Движения.ОбъектУчета ИЛИ КорДвижения.ЭтоСторно = Движения.ЭтоСторно)
	|			И ВЫБОР
	|				КОГДА НЕ ИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|					ТОГДА ИсточникиДанных.КорИмяРегистра = Движения.ИмяРегистра
	|				КОГДА НЕ КорИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|					ТОГДА КорИсточникиДанных.КорИмяРегистра = КорДвижения.ИмяРегистра
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		)
	|СГРУППИРОВАТЬ ПО
	|	Движения.Период,
	|	Движения.Регистратор,
	|	Движения.ИдентификаторФинЗаписи,
	|	Движения.Организация,
	|	Движения.РеквизитСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	Организация,
	|	РеквизитСторно
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	Движения.НомерЗаписи КАК НомерЗаписи,
	|	Движения.ИмяРегистра КАК ИмяРегистра,
	|	Движения.ОбъектУчета КАК ОбъектУчета,
	|	Движения.ЭтоДтКт КАК ЭтоДтКт,
	|	Движения.ЭтоСторно КАК ЭтоСторно,
	|	Движения.Организация КАК Организация,
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.НастройкаХозОперации КАК НастройкаХозОперации,
	|	Движения.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Движения.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Движения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Движения.Валюта КАК Валюта,
	|	Движения.СуммаУпр КАК СуммаУпр,
	|	Движения.СуммаРегл КАК СуммаРегл,
	|	Движения.СуммаВал КАК СуммаВал,
	|	Движения.Количество КАК Количество,
	|	Движения.РеквизитСторно КАК РеквизитСторно,
	|	Движения.ЕстьКорИсточникиДанных КАК ЕстьКорИсточникиДанных,
	|	ЕСТЬNULL(ИтогиПоОперациям.КоличествоФинЗаписей, 0) КАК КоличествоЗаписейОперации,
	|	ЕСТЬNULL(ИтогиПоОперациям.СуммаУпр, 0) КАК СуммаУпрОперации,
	|	ЕСТЬNULL(ИтогиПоОперациям.СуммаРегл, 0) КАК СуммаРеглОперации,
	|	ЕСТЬNULL(ИтогиПоОперациям.ЕстьНулевойБаланс, ЛОЖЬ) КАК ЕстьНулевойБалансОперации,
	|	ЕСТЬNULL(ИтогиПоФинЗаписям.КоличествоФинЗаписей, 0) КАК КоличествоЗаписейФинЗаписи,
	|	ЕСТЬNULL(ИтогиПоФинЗаписям.СуммаУпр, 0) КАК СуммаУпрФинЗаписи,
	|	ЕСТЬNULL(ИтогиПоФинЗаписям.СуммаРегл, 0) КАК СуммаРеглФинЗаписи,
	|	ЕСТЬNULL(ИтогиПоФинЗаписям.ЕстьНулевойБаланс, ЛОЖЬ) КАК ЕстьНулевойБалансФинЗаписи,
	|	ТИПЗНАЧЕНИЯ(Движения.Регистратор) КАК ТипРегистратора
	|ПОМЕСТИТЬ втДвиженияСИтогамиДтКт
	|ИЗ
	|	втДвиженияДтКт КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ втИтогиПоОперациям КАК ИтогиПоОперациям
	|		ПО Движения.Период = ИтогиПоОперациям.Период
	|		 И Движения.Регистратор = ИтогиПоОперациям.Регистратор
	|		 И Движения.ИдентификаторФинЗаписи = ИтогиПоОперациям.ИдентификаторФинЗаписи
	|		 И Движения.НастройкаХозОперации = ИтогиПоОперациям.НастройкаХозОперации
	|		 И Движения.Организация = ИтогиПоОперациям.Организация
	|		 И Движения.РеквизитСторно = ИтогиПоОперациям.РеквизитСторно
	|		 И Движения.ИдентификаторКорИсточниковДанных = ИтогиПоОперациям.ИдентификаторКорИсточниковДанных
	|	ЛЕВОЕ СОЕДИНЕНИЕ втИтогиПоФинЗаписям КАК ИтогиПоФинЗаписям
	|		ПО Движения.Период = ИтогиПоФинЗаписям.Период
	|		 И Движения.Регистратор = ИтогиПоФинЗаписям.Регистратор
	|		 И Движения.ИдентификаторФинЗаписи = ИтогиПоФинЗаписям.ИдентификаторФинЗаписи
	|		 И Движения.Организация = ИтогиПоФинЗаписям.Организация
	|		 И Движения.РеквизитСторно = ИтогиПоФинЗаписям.РеквизитСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно,
	|	ОбъектУчета
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втИтогиПоОперациям");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втИтогиПоФинЗаписям");
	
КонецПроцедуры

Процедура СоединитьДвиженияПоКлючевымПолям(Запрос, ТекстыЗапросов)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДвиженияДебет.Период, ДвиженияКредит.Период) КАК Период,
	|	ЕСТЬNULL(ДвиженияДебет.НомерЗаписи, 0) КАК НомерЗаписиДт,
	|	ЕСТЬNULL(ДвиженияКредит.НомерЗаписи, 0) КАК НомерЗаписиКт,
	|	ВЫБОР
	|		КОГДА НЕ ДвиженияДебет.ИмяРегистра ЕСТЬ NULL
	|			ТОГДА ДвиженияДебет.ИмяРегистра
	|		КОГДА ДвиженияКредит.ТипРегистратора В (&ТипыРегистраторовСлужебныхОбъектовУчета)
	|			ТОГДА &ИмяРегистраСлужебныхОбъектовУчета
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИмяРегистраДт,
	|	ВЫБОР
	|		КОГДА НЕ ДвиженияКредит.ИмяРегистра ЕСТЬ NULL
	|			ТОГДА ДвиженияКредит.ИмяРегистра
	|		КОГДА ДвиженияДебет.ТипРегистратора В (&ТипыРегистраторовСлужебныхОбъектовУчета)
	|			ТОГДА &ИмяРегистраСлужебныхОбъектовУчета
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИмяРегистраКт,
	|	ВЫБОР
	|		КОГДА НЕ ДвиженияДебет.ОбъектУчета ЕСТЬ NULL
	|			ТОГДА ДвиженияДебет.ОбъектУчета
	|		КОГДА ДвиженияКредит.ТипРегистратора В (&ТипыДокументовВзаимозачетаЗадолженности)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВзаимозачетамЗадолженности)
	|		КОГДА ДвиженияКредит.ТипРегистратора В (&ТипыДокументовРозничныхПродаж)
	|		  ИЛИ ДвиженияКредит.ТипРегистратора В (&ТипыДокументовРозничныхВозвратов)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыСРозничнымиПокупателями)
	|		КОГДА ДвиженияКредит.ТипРегистратора В (&ТипыДокументовВводаОстатков)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВводОстатков)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	КОНЕЦ КАК ОбъектУчетаДт,
	|	ВЫБОР
	|		КОГДА НЕ ДвиженияКредит.ОбъектУчета ЕСТЬ NULL
	|			ТОГДА ДвиженияКредит.ОбъектУчета
	|		КОГДА ДвиженияДебет.ТипРегистратора В (&ТипыДокументовВзаимозачетаЗадолженности)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыПоВзаимозачетамЗадолженности)
	|		КОГДА ДвиженияДебет.ТипРегистратора В (&ТипыДокументовРозничныхПродаж)
	|		  ИЛИ ДвиженияДебет.ТипРегистратора В (&ТипыДокументовРозничныхВозвратов)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыСРозничнымиПокупателями)
	|		КОГДА ДвиженияДебет.ТипРегистратора В (&ТипыДокументовВводаОстатков)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВводОстатков)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	КОНЕЦ КАК ОбъектУчетаКт,
	|	ЕСТЬNULL(ДвиженияДебет.ЭтоСторно, ЛОЖЬ) КАК ЭтоСторноДт,
	|	ЕСТЬNULL(ДвиженияКредит.ЭтоСторно, ЛОЖЬ) КАК ЭтоСторноКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.Организация ЕСТЬ NULL
	|			ТОГДА ДвиженияКредит.Организация
	|		КОГДА ДвиженияКредит.Организация ЕСТЬ NULL
	|			ТОГДА ДвиженияДебет.Организация
	|		КОГДА ДвиженияДебет.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДвиженияКредит.Организация
	|		ИНАЧЕ ДвиженияДебет.Организация
	|	КОНЕЦ КАК Организация,
	|	ЕСТЬNULL(ДвиженияДебет.Регистратор, ДвиженияКредит.Регистратор) КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.НастройкаХозОперации ЕСТЬ NULL
	|			ТОГДА ДвиженияКредит.НастройкаХозОперации
	|		КОГДА ДвиженияКредит.НастройкаХозОперации ЕСТЬ NULL
	|			ТОГДА ДвиженияДебет.НастройкаХозОперации
	|		КОГДА ДвиженияДебет.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ДвиженияКредит.НастройкаХозОперации
	|		ИНАЧЕ ДвиженияДебет.НастройкаХозОперации
	|	КОНЕЦ КАК НастройкаХозОперации,
	|	ЕСТЬNULL(ДвиженияДебет.ИдентификаторФинЗаписи, ДвиженияКредит.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
	|	ЕСТЬNULL(ДвиженияДебет.ИдентификаторСтроки, """") КАК ИдентификаторСтрокиДт,
	|	ЕСТЬNULL(ДвиженияКредит.ИдентификаторСтроки, """") КАК ИдентификаторСтрокиКт,
	|	ЕСТЬNULL(ДвиженияДебет.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) КАК ВидДеятельностиНДСДт,
	|	ЕСТЬNULL(ДвиженияКредит.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) КАК ВидДеятельностиНДСКт,
	|	ЕСТЬNULL(ДвиженияДебет.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаДт,
	|	ЕСТЬNULL(ДвиженияКредит.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаКт,
	|	ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0) КАК СуммаДвиженияУпрДт,
	|	ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0) КАК СуммаДвиженияУпрКт,
	|	ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0) КАК СуммаДвиженияРеглДт,
	|	ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0) КАК СуммаДвиженияРеглКт,
	|	ЕСТЬNULL(ДвиженияДебет.СуммаВал, 0) КАК СуммаДвиженияВалДт,
	|	ЕСТЬNULL(ДвиженияКредит.СуммаВал, 0) КАК СуммаДвиженияВалКт,
	|	ЕСТЬNULL(ДвиженияДебет.Количество, 0) КАК КоличествоДвиженияДт,
	|	ЕСТЬNULL(ДвиженияКредит.Количество, 0) КАК КоличествоДвиженияКт,
	|	ЕСТЬNULL(ДвиженияДебет.РеквизитСторно, ДвиженияКредит.РеквизитСторно) КАК РеквизитСторно,
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейФинЗаписи, 0) > 1
	|					ТОГДА ЛОЖЬ
	|				КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаУпрФинЗаписи, 0)
	|				  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаРеглФинЗаписи, 0)
	|					ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|					  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|					  ИЛИ ЕСТЬNULL(ДвиженияКредит.ЕстьНулевойБалансФинЗаписи, ЛОЖЬ)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		КОГДА НЕ (ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейОперации, 0) = 1 И ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейОперации, 0) > 1)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпрОперации, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаУпрОперации, 0)
	|		  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРеглОперации, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаРеглОперации, 0)
	|			ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|			  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|			  ИЛИ ЕСТЬNULL(ДвиженияКредит.ЕстьНулевойБалансОперации, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СложнаяПроводкаДт,
	|	ВЫБОР
	|		КОГДА ДвиженияКредит.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейФинЗаписи, 0) > 1
	|					ТОГДА ЛОЖЬ
	|				КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпрФинЗаписи, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|				  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРеглФинЗаписи, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|					ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|					  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|					  ИЛИ ЕСТЬNULL(ДвиженияДебет.ЕстьНулевойБалансФинЗаписи, ЛОЖЬ)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		КОГДА НЕ (ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейОперации, 0) > 1 И ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейОперации, 0) = 1)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпрОперации, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаУпрОперации, 0)
	|		  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРеглОперации, 0) = ЕСТЬNULL(ДвиженияКредит.СуммаРеглОперации, 0)
	|			ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|			  ИЛИ ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0) <> ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|			  ИЛИ ЕСТЬNULL(ДвиженияДебет.ЕстьНулевойБалансОперации, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СложнаяПроводкаКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|		  ИЛИ ДвиженияКредит.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьХозОперацию,
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.СуммаУпр ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияКредит.ТипРегистратора В (&ТипыРегистраторовСлужебныхОбъектовУчета)
	|					ТОГДА ДвиженияКредит.СуммаУпр
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		КОГДА ДвиженияДебет.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебет.СуммаУпр <> ЕСТЬNULL(ДвиженияКредит.СуммаУпрФинЗаписи, 0)
	|					ТОГДА ДвиженияДебет.СуммаУпр
	|				КОГДА ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейФинЗаписи, 0) > 1
	|					ТОГДА ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|				ИНАЧЕ ДвиженияДебет.СуммаУпр
	|			КОНЕЦ
	|		КОГДА ДвиженияДебет.СуммаУпрОперации <> ЕСТЬNULL(ДвиженияКредит.СуммаУпрОперации, 0)
	|			ТОГДА ДвиженияДебет.СуммаУпр
	|		КОГДА ДвиженияДебет.КоличествоЗаписейОперации = 1 И ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейОперации, 0) > 1
	|			ТОГДА ЕСТЬNULL(ДвиженияКредит.СуммаУпр, 0)
	|		ИНАЧЕ ДвиженияДебет.СуммаУпр
	|	КОНЕЦ КАК СуммаУпрДт,
	|	ВЫБОР
	|		КОГДА ДвиженияКредит.СуммаУпр ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебет.ТипРегистратора В (&ТипыРегистраторовСлужебныхОбъектовУчета)
	|					ТОГДА ДвиженияДебет.СуммаУпр
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		КОГДА ДвиженияКредит.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпрФинЗаписи, 0) <> ДвиженияКредит.СуммаУпр
	|					ТОГДА ДвиженияКредит.СуммаУпр
	|				КОГДА ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейФинЗаписи, 0) > 1
	|					ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0)
	|				ИНАЧЕ ДвиженияКредит.СуммаУпр
	|			КОНЕЦ
	|		КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпрОперации, 0) <> ДвиженияКредит.СуммаУпрОперации
	|			ТОГДА ДвиженияКредит.СуммаУпр
	|		КОГДА ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейОперации, 0) > 1 И ДвиженияКредит.КоличествоЗаписейОперации = 1
	|			ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаУпр, 0)
	|		ИНАЧЕ ДвиженияКредит.СуммаУпр
	|	КОНЕЦ КАК СуммаУпрКт,
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.СуммаРегл ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияКредит.ТипРегистратора В (&ТипыРегистраторовСлужебныхОбъектовУчета)
	|					ТОГДА ДвиженияКредит.СуммаРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		КОГДА ДвиженияДебет.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебет.СуммаРегл <> ЕСТЬNULL(ДвиженияКредит.СуммаРеглФинЗаписи, 0)
	|					ТОГДА ДвиженияДебет.СуммаРегл
	|				КОГДА ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейФинЗаписи, 0) > 1
	|					ТОГДА ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|				ИНАЧЕ ДвиженияДебет.СуммаРегл
	|			КОНЕЦ
	|		КОГДА ДвиженияДебет.СуммаРеглОперации <> ЕСТЬNULL(ДвиженияКредит.СуммаРеглОперации, 0)
	|			ТОГДА ДвиженияДебет.СуммаРегл
	|		КОГДА ДвиженияДебет.КоличествоЗаписейОперации = 1 И ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейОперации, 0) > 1
	|			ТОГДА ЕСТЬNULL(ДвиженияКредит.СуммаРегл, 0)
	|		ИНАЧЕ ДвиженияДебет.СуммаРегл
	|	КОНЕЦ КАК СуммаРеглДт,
	|	ВЫБОР
	|		КОГДА ДвиженияКредит.СуммаРегл ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА ДвиженияДебет.ТипРегистратора В (&ТипыРегистраторовСлужебныхОбъектовУчета)
	|					ТОГДА ДвиженияДебет.СуммаРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		КОГДА ДвиженияКредит.НастройкаХозОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаРеглФинЗаписи, 0) <> ДвиженияКредит.СуммаРегл
	|					ТОГДА ДвиженияКредит.СуммаРегл
	|				КОГДА ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейФинЗаписи, 0) > 1
	|					ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0)
	|				ИНАЧЕ ДвиженияКредит.СуммаРегл
	|			КОНЕЦ
	|		КОГДА ЕСТЬNULL(ДвиженияДебет.СуммаРеглОперации, 0) <> ДвиженияКредит.СуммаРеглОперации
	|			ТОГДА ДвиженияКредит.СуммаРегл
	|		КОГДА ЕСТЬNULL(ДвиженияДебет.КоличествоЗаписейОперации, 0) > 1 И ЕСТЬNULL(ДвиженияКредит.КоличествоЗаписейОперации, 0) = 1
	|			ТОГДА ЕСТЬNULL(ДвиженияДебет.СуммаРегл, 0)
	|		ИНАЧЕ ДвиженияКредит.СуммаРегл
	|	КОНЕЦ КАК СуммаРеглКт
	|ПОМЕСТИТЬ ТаблицаКорреспонденцийДвиженийРегистров
	|ИЗ
	|	втДвиженияСИтогамиДебет КАК ДвиженияДебет
	|	ПОЛНОЕ СОЕДИНЕНИЕ втДвиженияСИтогамиКредит КАК ДвиженияКредит
	|	ПО ДвиженияДебет.Период = ДвиженияКредит.Период
	|	 И ДвиженияДебет.Регистратор = ДвиженияКредит.Регистратор
	|	 И ДвиженияДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|	 И ДвиженияДебет.Организация = ДвиженияКредит.Организация
	|	 И ДвиженияДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|	 И НЕ ДвиженияДебет.ТипРегистратора В (&ТипыДокументовВводаОстатков)
	|	 И НЕ ДвиженияКредит.ТипРегистратора В (&ТипыДокументовВводаОстатков)
	|	 И ВЫБОР
	|		КОГДА ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА ДвиженияДебет.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	// Корреспонденции записей с заполненной и пустой настройками ХО разрешены, если для записи с заполненной ХО нет других корреспонденций с такой же ХО
	|		КОГДА ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияКредит КАК ДвиженияТолькоКредит
	|					ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|						ПО КорИсточникиДанных.ОбъектУчета = ДвиженияДебет.ОбъектУчета
	|					ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК ИсточникиДанных
	|						ПО ИсточникиДанных.ОбъектУчета = ДвиженияТолькоКредит.ОбъектУчета
	|				ГДЕ
	|					ДвиженияТолькоКредит.Период = ДвиженияДебет.Период
	|					И ДвиженияТолькоКредит.Регистратор = ДвиженияДебет.Регистратор
	|					И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоКредит.НастройкаХозОперации = ДвиженияДебет.НастройкаХозОперации
	|					И ДвиженияТолькоКредит.Организация = ДвиженияДебет.Организация
	|					И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|					И ДвиженияТолькоКредит.ЭтоКредит
	|					И (ДвиженияТолькоКредит.ОбъектУчета <> ДвиженияДебет.ОбъектУчета ИЛИ ДвиженияТолькоКредит.ЭтоСторно = ДвиженияДебет.ЭтоСторно)
	|					И ВЫБОР
	|						КОГДА НЕ ИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|							ТОГДА ИсточникиДанных.КорИмяРегистра = ДвиженияДебет.ИмяРегистра
	|						КОГДА НЕ КорИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|							ТОГДА КорИсточникиДанных.КорИмяРегистра = ДвиженияТолькоКредит.ИмяРегистра
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|				)
	// Корреспонденции записей с заполненной и пустой настройками ХО разрешены, если для записи с заполненной ХО нет других корреспонденций с такой же ХО
	|		КОГДА ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияДебет КАК ДвиженияТолькоДебет
	|					ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|						ПО КорИсточникиДанных.ОбъектУчета = ДвиженияКредит.ОбъектУчета
	|					ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК ИсточникиДанных
	|						ПО ИсточникиДанных.ОбъектУчета = ДвиженияТолькоДебет.ОбъектУчета
	|				ГДЕ
	|					ДвиженияТолькоДебет.Период = ДвиженияКредит.Период
	|					И ДвиженияТолькоДебет.Регистратор = ДвиженияКредит.Регистратор
	|					И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоДебет.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	|					И ДвиженияТолькоДебет.Организация = ДвиженияКредит.Организация
	|					И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|					И ДвиженияТолькоДебет.ЭтоДебет
	|					И (ДвиженияТолькоДебет.ОбъектУчета <> ДвиженияКредит.ОбъектУчета ИЛИ ДвиженияТолькоДебет.ЭтоСторно = ДвиженияКредит.ЭтоСторно)
	|					И ВЫБОР
	|						КОГДА НЕ ИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|							ТОГДА ИсточникиДанных.КорИмяРегистра = ДвиженияКредит.ИмяРегистра
	|						КОГДА НЕ КорИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|							ТОГДА КорИсточникиДанных.КорИмяРегистра = ДвиженияТолькоДебет.ИмяРегистра
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|				)
	// Корреспонденции записей с пустыми настройками ХО запрещены, если обе образуют сложные проводки с другими записями
	|		КОГДА ДвиженияДебет.КоличествоЗаписейФинЗаписи > 1 И ДвиженияКредит.КоличествоЗаписейФинЗаписи > 1
	|			ТОГДА ЛОЖЬ
	// Корреспонденции записей с пустыми настройками ХО запрещены, если одна образует сложные проводки, а для другой есть корреспонденция с заполненной настройкой ХО
	|		КОГДА ДвиженияДебет.КоличествоЗаписейФинЗаписи > 1
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияДебет КАК ДвиженияТолькоДебет
	|				ГДЕ
	|					ДвиженияТолькоДебет.Период = ДвиженияКредит.Период
	|					И ДвиженияТолькоДебет.Регистратор = ДвиженияКредит.Регистратор
	|					И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|					И ДвиженияТолькоДебет.Организация = ДвиженияКредит.Организация
	|					И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|					И ДвиженияТолькоДебет.ЭтоДебет
	|					И (ДвиженияТолькоДебет.ОбъектУчета <> ДвиженияКредит.ОбъектУчета ИЛИ ДвиженияТолькоДебет.ЭтоСторно = ДвиженияКредит.ЭтоСторно)
	|				)
	// Корреспонденции записей с пустыми настройками ХО запрещены, если одна образует сложные проводки, а для другой есть корреспонденция с заполненной настройкой ХО
	|		КОГДА ДвиженияКредит.КоличествоЗаписейФинЗаписи > 1
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияКредит КАК ДвиженияТолькоКредит
	|				ГДЕ
	|					ДвиженияТолькоКредит.Период = ДвиженияДебет.Период
	|					И ДвиженияТолькоКредит.Регистратор = ДвиженияДебет.Регистратор
	|					И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|					И ДвиженияТолькоКредит.Организация = ДвиженияДебет.Организация
	|					И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|					И ДвиженияТолькоКредит.ЭтоКредит
	|					И (ДвиженияТолькоКредит.ОбъектУчета <> ДвиженияДебет.ОбъектУчета ИЛИ ДвиженияТолькоКредит.ЭтоСторно = ДвиженияДебет.ЭтоСторно)
	|				)
	// Корреспонденции записей с пустыми настройками ХО запрещены, если для обеих есть корреспонденции с заполненными настройками ХО
	|		ИНАЧЕ НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втДвиженияДебет КАК ДвиженияТолькоДебет
	|			ГДЕ
	|				ДвиженияТолькоДебет.Период = ДвиженияКредит.Период
	|				И ДвиженияТолькоДебет.Регистратор = ДвиженияКредит.Регистратор
	|				И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|				И ДвиженияТолькоДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|				И ДвиженияТолькоДебет.Организация = ДвиженияКредит.Организация
	|				И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|				И ДвиженияТолькоДебет.ЭтоДебет
	|				И (ДвиженияТолькоДебет.ОбъектУчета <> ДвиженияКредит.ОбъектУчета ИЛИ ДвиженияТолькоДебет.ЭтоСторно = ДвиженияКредит.ЭтоСторно)
	|			)
	|		И НЕ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				втДвиженияКредит КАК ДвиженияТолькоКредит
	|			ГДЕ
	|				ДвиженияТолькоКредит.Период = ДвиженияДебет.Период
	|				И ДвиженияТолькоКредит.Регистратор = ДвиженияДебет.Регистратор
	|				И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|				И ДвиженияТолькоКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|				И ДвиженияТолькоКредит.Организация = ДвиженияДебет.Организация
	|				И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|				И ДвиженияТолькоКредит.ЭтоКредит
	|				И (ДвиженияТолькоКредит.ОбъектУчета <> ДвиженияДебет.ОбъектУчета ИЛИ ДвиженияТолькоКредит.ЭтоСторно = ДвиженияДебет.ЭтоСторно)
	|			)
	|	 КОНЕЦ
	|	 И ВЫБОР
	// Корреспонденции записей оборотного регистров с самими собой запрещены всегда
	|		КОГДА НЕ ДвиженияДебет.ЭтоДебет И НЕ ДвиженияКредит.ЭтоКредит
	|			ТОГДА ЛОЖЬ
	// Корреспонденции записей ограничены в описании объекта учета дебета
	|		КОГДА ДвиженияДебет.ЕстьКорИсточникиДанных
	|			ТОГДА ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втКорИсточникиДанных КАК КорИсточникиДанных
	|				ГДЕ
	|					КорИсточникиДанных.ОбъектУчета = ДвиженияДебет.ОбъектУчета
	|					И КорИсточникиДанных.КорИмяРегистра = ДвиженияКредит.ИмяРегистра
	|				)
	// Корреспонденции записей ограничены в описании объекта учета кредита
	|		КОГДА ДвиженияКредит.ЕстьКорИсточникиДанных
	|			ТОГДА ИСТИНА В 
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втКорИсточникиДанных КАК КорИсточникиДанных
	|				ГДЕ
	|					КорИсточникиДанных.ОбъектУчета = ДвиженияКредит.ОбъектУчета
	|					И КорИсточникиДанных.КорИмяРегистра = ДвиженияДебет.ИмяРегистра
	|				)
	// Это часть корректной сложной корреспонденции "один ко многим" по дебету
	|		КОГДА ДвиженияДебет.КоличествоЗаписейОперации = 1 И ДвиженияКредит.КоличествоЗаписейОперации > 1
	|			И ДвиженияДебет.СуммаУпрОперации = ДвиженияКредит.СуммаУпрОперации
	|			И ДвиженияДебет.СуммаРеглОперации = ДвиженияКредит.СуммаРеглОперации
	|			ТОГДА ИСТИНА
	// Это часть корректной сложной корреспонденции "многие к одному" по кредиту
	|		КОГДА ДвиженияДебет.КоличествоЗаписейОперации > 1 И ДвиженияКредит.КоличествоЗаписейОперации = 1
	|			И ДвиженияДебет.СуммаУпрОперации = ДвиженияКредит.СуммаУпрОперации
	|			И ДвиженияДебет.СуммаРеглОперации = ДвиженияКредит.СуммаРеглОперации
	|			ТОГДА ИСТИНА
	// Корреспонденции прямой и сторно записей внутри одного регистра разрешены, если для сторно нет корреспонденций с другими объектами или таким же признаком сторно и суммами упр и регл
	|		КОГДА ДвиженияДебет.ОбъектУчета = ДвиженияКредит.ОбъектУчета И ДвиженияДебет.ЭтоСторно И НЕ ДвиженияКредит.ЭтоСторно
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияКредит КАК ДвиженияТолькоКредит
	|				ГДЕ
	|					ДвиженияТолькоКредит.Период = ДвиженияДебет.Период
	|					И ДвиженияТолькоКредит.Регистратор = ДвиженияДебет.Регистратор
	|					И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоКредит.Организация = ДвиженияДебет.Организация
	|					И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|					И ДвиженияТолькоКредит.ЭтоКредит
	|					И ВЫБОР
	|						КОГДА ДвиженияТолькоКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоКредит.НастройкаХозОперации = ДвиженияДебет.НастройкаХозОперации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ((ДвиженияТолькоКредит.ОбъектУчета <> ДвиженияДебет.ОбъектУчета
	|						ИЛИ ДвиженияТолькоКредит.ЭтоСторно = ДвиженияДебет.ЭтоСторно)
	|						ИЛИ
	|						(ДвиженияТолькоКредит.ОбъектУчета = ДвиженияДебет.ОбъектУчета
	|						И ДвиженияТолькоКредит.ЭтоСторно <> ДвиженияДебет.ЭтоСторно
	|						И ДвиженияТолькоКредит.СуммаУпр = ДвиженияДебет.СуммаУпр
	|						И ДвиженияТолькоКредит.СуммаРегл = ДвиженияДебет.СуммаРегл
	|						И ДвиженияТолькоКредит.СуммаУпр <> ДвиженияКредит.СуммаУпр
	|						И ДвиженияТолькоКредит.СуммаРегл <> ДвиженияКредит.СуммаРегл)
	|					)
	|				)
	// Корреспонденции прямой и сторно записей внутри одного регистра разрешены, если для сторно нет корреспонденций с другими объектами или таким же признаком сторно и суммами упр и регл
	|		КОГДА ДвиженияДебет.ОбъектУчета = ДвиженияКредит.ОбъектУчета И НЕ ДвиженияДебет.ЭтоСторно И ДвиженияКредит.ЭтоСторно
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияДебет КАК ДвиженияТолькоДебет
	|				ГДЕ
	|					ДвиженияТолькоДебет.Период = ДвиженияКредит.Период
	|					И ДвиженияТолькоДебет.Регистратор = ДвиженияКредит.Регистратор
	|					И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоДебет.Организация = ДвиженияКредит.Организация
	|					И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|					И ДвиженияТолькоДебет.ЭтоДебет
	|					И ВЫБОР
	|						КОГДА ДвиженияТолькоДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоДебет.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ((ДвиженияТолькоДебет.ОбъектУчета <> ДвиженияКредит.ОбъектУчета
	|						ИЛИ ДвиженияТолькоДебет.ЭтоСторно = ДвиженияКредит.ЭтоСторно)
	|						ИЛИ
	|						(ДвиженияТолькоДебет.ОбъектУчета = ДвиженияКредит.ОбъектУчета
	|						И ДвиженияТолькоДебет.ЭтоСторно <> ДвиженияКредит.ЭтоСторно
	|						И ДвиженияТолькоДебет.СуммаУпр = ДвиженияКредит.СуммаУпр
	|						И ДвиженияТолькоДебет.СуммаРегл = ДвиженияКредит.СуммаРегл
	|						И ДвиженияТолькоДебет.СуммаУпр <> ДвиженияДебет.СуммаУпр
	|						И ДвиженияТолькоДебет.СуммаРегл <> ДвиженияДебет.СуммаРегл)
	|					)
	|				)
	// Корреспонденции записей внутри одного регистра приоритет у записей с одинаковыми объектами учета и суммами упр и регл
	|		КОГДА ДвиженияДебет.ИмяРегистра = ДвиженияКредит.ИмяРегистра И ДвиженияДебет.ЭтоСторно = ДвиженияКредит.ЭтоСторно
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияКредит КАК ДвиженияТолькоКредит
	|				ГДЕ
	|					ДвиженияТолькоКредит.Период = ДвиженияДебет.Период
	|					И ДвиженияТолькоКредит.Регистратор = ДвиженияДебет.Регистратор
	|					И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоКредит.Организация = ДвиженияДебет.Организация
	|					И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|					И ДвиженияТолькоКредит.ЭтоКредит
	|					И ВЫБОР
	|						КОГДА ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоКредит.НастройкаХозОперации = ДвиженияДебет.НастройкаХозОперации
	|						КОГДА ДвиженияТолькоКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоКредит.НастройкаХозОперации = ДвиженияДебет.НастройкаХозОперации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ДвиженияТолькоКредит.ОбъектУчета = ДвиженияДебет.ОбъектУчета
	|					И ДвиженияТолькоКредит.ЭтоСторно = ДвиженияДебет.ЭтоСторно
	|					И ДвиженияТолькоКредит.СуммаУпр = ДвиженияДебет.СуммаУпр
	|					И ДвиженияТолькоКредит.СуммаРегл = ДвиженияДебет.СуммаРегл
	|					И (ДвиженияТолькоКредит.ОбъектУчета <> ДвиженияКредит.ОбъектУчета
	|						ИЛИ
	|						(ДвиженияТолькоКредит.ОбъектУчета = ДвиженияКредит.ОбъектУчета
	|						И ДвиженияТолькоКредит.СуммаУпр <> ДвиженияКредит.СуммаУпр
	|						И ДвиженияТолькоКредит.СуммаРегл <> ДвиженияКредит.СуммаРегл)
	|					И НЕ (ДвиженияКредит.СуммаУпр = 0 И ДвиженияКредит.СуммаРегл = 0)
	|					)
	|				)
	|			И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияДебет КАК ДвиженияТолькоДебет
	|				ГДЕ
	|					ДвиженияТолькоДебет.Период = ДвиженияКредит.Период
	|					И ДвиженияТолькоДебет.Регистратор = ДвиженияКредит.Регистратор
	|					И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоДебет.Организация = ДвиженияКредит.Организация
	|					И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|					И ДвиженияТолькоДебет.ЭтоДебет
	|					И ВЫБОР
	|						КОГДА ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоДебет.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	|						КОГДА ДвиженияТолькоДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоДебет.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ДвиженияТолькоДебет.ОбъектУчета = ДвиженияКредит.ОбъектУчета
	|					И ДвиженияТолькоДебет.ЭтоСторно = ДвиженияКредит.ЭтоСторно
	|					И ДвиженияТолькоДебет.СуммаУпр = ДвиженияКредит.СуммаУпр
	|					И ДвиженияТолькоДебет.СуммаРегл = ДвиженияКредит.СуммаРегл
	|					И (ДвиженияТолькоДебет.ОбъектУчета <> ДвиженияДебет.ОбъектУчета
	|						ИЛИ
	|						(ДвиженияТолькоДебет.ОбъектУчета = ДвиженияДебет.ОбъектУчета
	|						И ДвиженияТолькоДебет.СуммаУпр <> ДвиженияДебет.СуммаУпр
	|						И ДвиженияТолькоДебет.СуммаРегл <> ДвиженияДебет.СуммаРегл)
	|					)
	|					И НЕ (ДвиженияДебет.СуммаУпр = 0 И ДвиженияДебет.СуммаРегл = 0)
	|				)
	// Прочие случаи отношения многие ко многим, приоритет у записей с одинаковыми суммами упр и регл
	|		КОГДА ДвиженияДебет.КоличествоЗаписейОперации > 1 И ДвиженияКредит.КоличествоЗаписейОперации > 1
	|			ТОГДА НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияКредит КАК ДвиженияТолькоКредит
	|				ГДЕ
	|					ДвиженияТолькоКредит.Период = ДвиженияДебет.Период
	|					И ДвиженияТолькоКредит.Регистратор = ДвиженияДебет.Регистратор
	|					И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоКредит.Организация = ДвиженияДебет.Организация
	|					И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|					И ДвиженияТолькоКредит.ЭтоКредит
	|					И ВЫБОР
	|						КОГДА ДвиженияТолькоКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоКредит.НастройкаХозОперации = ДвиженияДебет.НастройкаХозОперации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ДвиженияТолькоКредит.СуммаУпр = ДвиженияДебет.СуммаУпр
	|					И ДвиженияТолькоКредит.СуммаРегл = ДвиженияДебет.СуммаРегл
	|					И ДвиженияТолькоКредит.СуммаУпр <> ДвиженияКредит.СуммаУпр
	|					И ДвиженияТолькоКредит.СуммаРегл <> ДвиженияКредит.СуммаРегл
	|				)
	|			И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					втДвиженияДебет КАК ДвиженияТолькоДебет
	|				ГДЕ
	|					ДвиженияТолькоДебет.Период = ДвиженияКредит.Период
	|					И ДвиженияТолькоДебет.Регистратор = ДвиженияКредит.Регистратор
	|					И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|					И ДвиженияТолькоДебет.Организация = ДвиженияКредит.Организация
	|					И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|					И ДвиженияТолькоДебет.ЭтоДебет
	|					И ВЫБОР
	|						КОГДА ДвиженияТолькоДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|							ТОГДА ДвиженияТолькоДебет.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ДвиженияТолькоДебет.СуммаУпр = ДвиженияКредит.СуммаУпр
	|					И ДвиженияТолькоДебет.СуммаРегл = ДвиженияКредит.СуммаРегл
	|					И ДвиженияТолькоДебет.СуммаУпр <> ДвиженияДебет.СуммаУпр
	|					И ДвиженияТолькоДебет.СуммаРегл <> ДвиженияДебет.СуммаРегл
	|				)
	|		ИНАЧЕ ИСТИНА
	|	 КОНЕЦ
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ДвиженияДебет.Регистратор ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	// Запись с нулевыми балансовыми ресурсами не выводим
	|				КОГДА ДвиженияКредит.СуммаУпр = 0 И ДвиженияКредит.СуммаРегл = 0
	|					ТОГДА ЛОЖЬ
	// Запись остаточного регистра выводим всегда
	|				КОГДА ДвиженияКредит.ЭтоКредит
	|					ТОГДА ИСТИНА
	// Запись оборотного регистра не выводим, если для нее же есть корреспонденция с другим расходным движением
	|				ИНАЧЕ НЕ ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						втДвиженияКредит КАК ДвиженияТолькоКредит
	|						ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|							ПО ДвиженияТолькоКредит.ИмяРегистра = КорИсточникиДанных.КорИмяРегистра
	|							 И ДвиженияКредит.ЕстьКорИсточникиДанных
	|					ГДЕ
	|						ДвиженияТолькоКредит.Период = ДвиженияКредит.Период
	|						И ДвиженияТолькоКредит.Регистратор = ДвиженияКредит.Регистратор
	|						И ДвиженияТолькоКредит.ИдентификаторФинЗаписи = ДвиженияКредит.ИдентификаторФинЗаписи
	|						И ДвиженияТолькоКредит.Организация = ДвиженияКредит.Организация
	|						И ДвиженияТолькоКредит.РеквизитСторно = ДвиженияКредит.РеквизитСторно
	|						И ДвиженияТолькоКредит.ЭтоКредит
	|						И ВЫБОР
	|							КОГДА ДвиженияТолькоКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|								И ДвиженияКредит.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|								ТОГДА ДвиженияТолькоКредит.НастройкаХозОперации = ДвиженияКредит.НастройкаХозОперации
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА НЕ КорИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|								ТОГДА КорИсточникиДанных.ОбъектУчета = ДвиженияКредит.ОбъектУчета
	|							ИНАЧЕ НЕ ДвиженияКредит.ТипРегистратора В (&ТипыДокументовРозничныхПродаж)
	|						КОНЕЦ
	|					)
	|					И НЕ ДвиженияКредит.ТипРегистратора В (&ТипыДокументовРозничныхВозвратов)
	|			КОНЕЦ
	|		КОГДА ДвиженияКредит.Регистратор ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	// Запись с нулевыми балансовыми ресурсами не выводим
	|				КОГДА ДвиженияДебет.СуммаУпр = 0 И ДвиженияДебет.СуммаРегл = 0
	|					ТОГДА ЛОЖЬ
	// Запись остаточного регистра выводим всегда
	|				КОГДА ДвиженияДебет.ЭтоДебет
	|					ТОГДА ИСТИНА
	// Запись оборотного регистра не выводим, если для нее же есть корреспонденция с другим приходным движением
	|				ИНАЧЕ НЕ ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						втДвиженияДебет КАК ДвиженияТолькоДебет
	|						ЛЕВОЕ СОЕДИНЕНИЕ втКорИсточникиДанных КАК КорИсточникиДанных
	|							ПО ДвиженияТолькоДебет.ИмяРегистра = КорИсточникиДанных.КорИмяРегистра
	|							 И ДвиженияДебет.ЕстьКорИсточникиДанных
	|					ГДЕ
	|						ДвиженияТолькоДебет.Период = ДвиженияДебет.Период
	|						И ДвиженияТолькоДебет.Регистратор = ДвиженияДебет.Регистратор
	|						И ДвиженияТолькоДебет.ИдентификаторФинЗаписи = ДвиженияДебет.ИдентификаторФинЗаписи
	|						И ДвиженияТолькоДебет.Организация = ДвиженияДебет.Организация
	|						И ДвиженияТолькоДебет.РеквизитСторно = ДвиженияДебет.РеквизитСторно
	|						И ДвиженияТолькоДебет.ЭтоДебет
	|						И ВЫБОР
	|							КОГДА ДвиженияТолькоДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|								И ДвиженияДебет.НастройкаХозОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|								ТОГДА ДвиженияТолькоДебет.НастройкаХозОперации = ДвиженияДебет.НастройкаХозОперации
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА НЕ КорИсточникиДанных.ОбъектУчета ЕСТЬ NULL
	|								ТОГДА КорИсточникиДанных.ОбъектУчета = ДвиженияДебет.ОбъектУчета
	|							ИНАЧЕ НЕ ДвиженияДебет.ТипРегистратора В (&ТипыДокументовРозничныхВозвратов)
	|						КОНЕЦ
	|					)
	|					И НЕ ДвиженияДебет.ТипРегистратора В (&ТипыДокументовРозничныхПродаж)
	|			КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	Организация,
	|	ЭтоСторноДт,
	|	ЭтоСторноКт
	|";
	
	ТаблицаКорреспонденцийДвиженийРегистров = Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров;
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ТаблицаКорреспонденцийДвиженийРегистров) <> Неопределено Тогда
		ТаблицаКорреспонденцийДвиженийРегистров = ТаблицаКорреспонденцийДвиженийРегистров + "1";
		Запрос.Параметры.ТаблицаКорреспонденцийДвиженийРегистров = ТаблицаКорреспонденцийДвиженийРегистров;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаКорреспонденцийДвиженийРегистров", ТаблицаКорреспонденцийДвиженийРегистров);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросовИсправленияОшибокКорреспонденцийСРеверсом

Процедура ОпределитьОшибкиКорреспонденций(ТекстыЗапросов, ПараметрыЗапроса, ОшибкиРеверса = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втОшибкиКорреспонденций
	|ИЗ
	|	ТаблицаКорреспонденцийДвиженийРегистров КАК ДвиженияДебетКредит
	|ГДЕ
	|	(ДвиженияДебетКредит.ИмяРегистраДт = """"
	|		ИЛИ ДвиженияДебетКредит.ИмяРегистраКт = """"
	|		ИЛИ (ДвиженияДебетКредит.СуммаУпрДт <> ДвиженияДебетКредит.СуммаУпрКт
	|			И НЕ ДвиженияДебетКредит.ИмяРегистраДт В (&РегистрыБезСуммыУпр)
	|			И НЕ ДвиженияДебетКредит.ИмяРегистраКт В (&РегистрыБезСуммыУпр))
	|		ИЛИ (ДвиженияДебетКредит.СуммаРеглДт <> ДвиженияДебетКредит.СуммаРеглКт
	|			И НЕ ДвиженияДебетКредит.ИмяРегистраДт В (&РегистрыБезСуммыРегл)
	|			И НЕ ДвиженияДебетКредит.ИмяРегистраКт В (&РегистрыБезСуммыРегл)))
	|	И ДвиженияДебетКредит.ИдентификаторФинЗаписи <> """"
	|	И &ЭтоДвиженияРеверса
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияДебетКредит.Период,
	|	ДвиженияДебетКредит.Регистратор,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.Организация,
	|	ДвиженияДебетКредит.РеквизитСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	Организация,
	|	РеквизитСторно
	|";
	
	Если ОшибкиРеверса Тогда
		ЭтоДвиженияРеверса = "ИСТИНА В 
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ТаблицаКорреспонденцийДвиженийРегистров КАК ДвиженияРеверса
		|		ГДЕ
		|			ДвиженияРеверса.Период = ДвиженияДебетКредит.Период
		|			И ДвиженияРеверса.Регистратор = ДвиженияДебетКредит.Регистратор
		|			И ДвиженияРеверса.ИдентификаторФинЗаписи = ДвиженияДебетКредит.ИдентификаторФинЗаписи
		|			И ДвиженияРеверса.Организация = ДвиженияДебетКредит.Организация
		|			И ДвиженияРеверса.РеквизитСторно = ДвиженияДебетКредит.РеквизитСторно
		|			И (ДвиженияРеверса.ЭтоСторноДт ИЛИ ДвиженияРеверса.ЭтоСторноКт)
		|		)";
	Иначе
		ЭтоДвиженияРеверса = "ИСТИНА";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоДвиженияРеверса", ЭтоДвиженияРеверса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаКорреспонденцийДвиженийРегистров", ПараметрыЗапроса.ТаблицаКорреспонденцийДвиженийРегистров);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ОпределитьМаксимальныйНомерЗаписейДвижений(ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	МАКСИМУМ(МаксимальныеНомераЗаписей.НомерЗаписи) КАК НомерЗаписи
	|ПОМЕСТИТЬ втМаксимальныйНомерЗаписей
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ДвиженияДебет.НомерЗаписи) КАК НомерЗаписи
	|	ИЗ
	|		втДвиженияДебет КАК ДвиженияДебет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МАКСИМУМ(ДвиженияКредит.НомерЗаписи) КАК НомерЗаписи
	|	ИЗ
	|		втДвиженияКредит КАК ДвиженияКредит
	|	) КАК МаксимальныеНомераЗаписей
	|");
	
КонецПроцедуры

Процедура ВосстановитьДвиженияОшибочныхКорреспонденций(ТекстыЗапросов, ПараметрыЗапроса, ДтКт)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	Движения.ИмяРегистра КАК ИмяРегистра,
	|	Движения.ОбъектУчета КАК ОбъектУчета,
	|	Движения.ЭтоДтКт КАК ЭтоДтКт,
	|	Движения.ЭтоСторно КАК ЭтоСторно,
	|	Движения.Организация КАК Организация,
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.НастройкаХозОперации КАК НастройкаХозОперации,
	|	Движения.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Движения.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Движения.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Движения.Валюта КАК Валюта,
	|	Движения.СуммаУпр КАК СуммаУпр,
	|	Движения.СуммаРегл КАК СуммаРегл,
	|	Движения.СуммаВал КАК СуммаВал,
	|	Движения.Количество КАК Количество,
	|	Движения.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втДвиженияРегистровРеверсДтКт
	|ИЗ
	|	втДвиженияДтКт КАК Движения
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втОшибкиКорреспонденций КАК ОшибкиКорреспонденций
	|		ГДЕ
	|			ОшибкиКорреспонденций.Период = Движения.Период
	|			И ОшибкиКорреспонденций.Регистратор = Движения.Регистратор
	|			И ОшибкиКорреспонденций.ИдентификаторФинЗаписи = Движения.ИдентификаторФинЗаписи
	|			И ОшибкиКорреспонденций.Организация = Движения.Организация
	|			И ОшибкиКорреспонденций.РеквизитСторно = Движения.РеквизитСторно
	|		)
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтоСторно
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ИмяТаблицыДвижений = "втДвиженияДтКт";
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ИмяТаблицыДвижений, ДтКт);
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ИмяТаблицыДвижений);
	
КонецПроцедуры

Процедура ОпределитьРегистрыСДвижениямиРеверса(ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияРеверсДт.Период КАК Период,
	|	ДвиженияРеверсДт.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРеверсДт.Организация КАК Организация,
	|	ДвиженияРеверсДт.Регистратор КАК Регистратор,
	|	ДвиженияРеверсДт.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРеверсДт.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втРегистрыСДвижениямиРеверса
	|ИЗ
	|	втДвиженияРегистровРеверсДебет КАК ДвиженияРеверсДт
	|ГДЕ
	|	ДвиженияРеверсДт.ЭтоСторно
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияРеверсКт.Период КАК Период,
	|	ДвиженияРеверсКт.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРеверсКт.Организация КАК Организация,
	|	ДвиженияРеверсКт.Регистратор КАК Регистратор,
	|	ДвиженияРеверсКт.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРеверсКт.РеквизитСторно КАК РеквизитСторно
	|ИЗ
	|	втДвиженияРегистровРеверсКредит КАК ДвиженияРеверсКт
	|ГДЕ
	|	ДвиженияРеверсКт.ЭтоСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	Организация,
	|	РеквизитСторно
	|");
	
КонецПроцедуры

Процедура ЗаменитьДвиженияРеверсаНаСторно(ТекстыЗапросов, ДтКт)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияРеверс.Период КАК Период,
	|	ДвиженияРеверс.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРеверс.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияРеверс.ЭтоДтКт КАК ЭтоДтКт,
	|	ДвиженияРеверс.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияРеверс.Организация КАК Организация,
	|	ДвиженияРеверс.Регистратор КАК Регистратор,
	|	ДвиженияРеверс.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияРеверс.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРеверс.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияРеверс.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияРеверс.Валюта КАК Валюта,
	|	ДвиженияРеверс.СуммаУпр КАК СуммаУпр,
	|	ДвиженияРеверс.СуммаРегл КАК СуммаРегл,
	|	ДвиженияРеверс.СуммаВал КАК СуммаВал,
	|	ДвиженияРеверс.Количество КАК Количество,
	|	ДвиженияРеверс.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втДвиженияРегистровСторно
	|ИЗ
	|	втДвиженияРегистровРеверсДтКт КАК ДвиженияРеверс
	|ГДЕ
	|	НЕ ДвиженияРеверс.ЭтоСторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияРеверс.Период КАК Период,
	|	ДвиженияРеверс.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияРеверс.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияРеверс.ЭтоКорДтКт КАК ЭтоДтКт,
	|	НЕ ДвиженияРеверс.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияРеверс.Организация КАК Организация,
	|	ДвиженияРеверс.Регистратор КАК Регистратор,
	|	ДвиженияРеверс.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияРеверс.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияРеверс.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияРеверс.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияРеверс.Валюта КАК Валюта,
	|	- ДвиженияРеверс.СуммаУпр КАК СуммаУпр,
	|	- ДвиженияРеверс.СуммаРегл КАК СуммаРегл,
	|	- ДвиженияРеверс.СуммаВал КАК СуммаВал,
	|	- ДвиженияРеверс.Количество КАК Количество,
	|	ДвиженияРеверс.РеквизитСторно КАК РеквизитСторно
	|ИЗ
	|	втКорДвиженияРегистровРеверсДтКт КАК ДвиженияРеверс
	|ГДЕ
	|	ДвиженияРеверс.ЭтоСторно
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ДвиженияСторно.Период КАК Период,
	|	ДвиженияСторно.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияСторно.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияСторно.ЭтоДтКт КАК ЭтоДтКт,
	|	ДвиженияСторно.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияСторно.Организация КАК Организация,
	|	ДвиженияСторно.Регистратор КАК Регистратор,
	|	ДвиженияСторно.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияСторно.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияСторно.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияСторно.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияСторно.Валюта КАК Валюта,
	|	СУММА(ДвиженияСторно.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ДвиженияСторно.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ДвиженияСторно.СуммаВал) КАК СуммаВал,
	|	СУММА(ДвиженияСторно.Количество) КАК Количество,
	|	ДвиженияСторно.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втСвернутыеДвиженияСторно
	|ИЗ
	|	втДвиженияРегистровСторно КАК ДвиженияСторно
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСторно.Период,
	|	ДвиженияСторно.ИмяРегистра,
	|	ДвиженияСторно.ОбъектУчета,
	|	ДвиженияСторно.ЭтоДтКт,
	|	ДвиженияСторно.ЭтоСторно,
	|	ДвиженияСторно.Организация,
	|	ДвиженияСторно.Регистратор,
	|	ДвиженияСторно.НастройкаХозОперации,
	|	ДвиженияСторно.ИдентификаторФинЗаписи,
	|	ДвиженияСторно.ИдентификаторСтроки,
	|	ДвиженияСторно.ВидДеятельностиНДС,
	|	ДвиженияСторно.Валюта,
	|	ДвиженияСторно.РеквизитСторно
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втДвиженияРегистровСторно");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияСторно.НомерЗаписи + МаксимальныйНомерЗаписей.НомерЗаписи КАК НомерЗаписи,
	|	ДвиженияСторно.Период КАК Период,
	|	ДвиженияСторно.ИмяРегистра КАК ИмяРегистра,
	|	ДвиженияСторно.ОбъектУчета КАК ОбъектУчета,
	|	ДвиженияСторно.ЭтоДтКт КАК ЭтоДтКт,
	|	ДвиженияСторно.ЭтоСторно КАК ЭтоСторно,
	|	ДвиженияСторно.Организация КАК Организация,
	|	ДвиженияСторно.Регистратор КАК Регистратор,
	|	ДвиженияСторно.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияСторно.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияСторно.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДвиженияСторно.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДвиженияСторно.Валюта КАК Валюта,
	|	ДвиженияСторно.СуммаУпр КАК СуммаУпр,
	|	ДвиженияСторно.СуммаРегл КАК СуммаРегл,
	|	ДвиженияСторно.СуммаВал КАК СуммаВал,
	|	ДвиженияСторно.Количество КАК Количество,
	|	ДвиженияСторно.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втСвернутыеДвиженияДтКт
	|ИЗ
	|	втСвернутыеДвиженияСторно КАК ДвиженияСторно
	|	,
	|	втМаксимальныйНомерЗаписей КАК МаксимальныйНомерЗаписей
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	ИмяРегистра,
	|	Организация,
	|	НастройкаХозОперации,
	|	РеквизитСторно
	|";
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ВыполнитьЗаменуИменТаблицИПолейДвижений(ТекстЗапроса, ДтКт);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втСвернутыеДвиженияСторно");
	
КонецПроцедуры

Процедура ОпределитьКорреспонденцииБезОшибок(ТекстыЗапросов, ПараметрыЗапроса)
	
	ОпределитьОшибкиКорреспонденций(ТекстыЗапросов, ПараметрыЗапроса);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.НомерЗаписиДт КАК НомерЗаписиДт,
	|	ДвиженияДебетКредит.НомерЗаписиКт КАК НомерЗаписиКт,
	|	ДвиженияДебетКредит.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияДебетКредит.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияДебетКредит.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияДебетКредит.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияДебетКредит.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ДвиженияДебетКредит.ВидДеятельностиНДСДт КАК ВидДеятельностиНДСДт,
	|	ДвиженияДебетКредит.ВидДеятельностиНДСКт КАК ВидДеятельностиНДСКт,
	|	ДвиженияДебетКредит.ВалютаДт КАК ВалютаДт,
	|	ДвиженияДебетКредит.ВалютаКт КАК ВалютаКт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалДт КАК СуммаДвиженияВалДт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалКт КАК СуммаДвиженияВалКт,
	|	ДвиженияДебетКредит.КоличествоДвиженияДт КАК КоличествоДвиженияДт,
	|	ДвиженияДебетКредит.КоличествоДвиженияКт КАК КоличествоДвиженияКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно,
	|	ДвиженияДебетКредит.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ДвиженияДебетКредит.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ДвиженияДебетКредит.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ДвиженияДебетКредит.СуммаУпрДт КАК СуммаУпрДт,
	|	ДвиженияДебетКредит.СуммаУпрКт КАК СуммаУпрКт,
	|	ДвиженияДебетКредит.СуммаРеглДт КАК СуммаРеглДт,
	|	ДвиженияДебетКредит.СуммаРеглКт КАК СуммаРеглКт
	|ПОМЕСТИТЬ втКорреспонденцииБезОшибок
	|ИЗ
	|	ТаблицаКорреспонденцийДвиженийРегистров КАК ДвиженияДебетКредит
	|ГДЕ
	|	НЕ ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втОшибкиКорреспонденций КАК ОшибкиКорреспонденций
	|		ГДЕ
	|			ОшибкиКорреспонденций.Период = ДвиженияДебетКредит.Период
	|			И ОшибкиКорреспонденций.Регистратор = ДвиженияДебетКредит.Регистратор
	|			И ОшибкиКорреспонденций.ИдентификаторФинЗаписи = ДвиженияДебетКредит.ИдентификаторФинЗаписи
	|			И ОшибкиКорреспонденций.Организация = ДвиженияДебетКредит.Организация
	|			И ОшибкиКорреспонденций.РеквизитСторно = ДвиженияДебетКредит.РеквизитСторно
	|		)
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаКорреспонденцийДвиженийРегистров", ПараметрыЗапроса.ТаблицаКорреспонденцийДвиженийРегистров);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втОшибкиКорреспонденций");
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, ПараметрыЗапроса.ТаблицаКорреспонденцийДвиженийРегистров);
	
КонецПроцедуры

Процедура ОпределитьРегистрыЗаменыРеверсаНаСторно(ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	КорреспонденцииБезОшибок.Период КАК Период,
	|	КорреспонденцииБезОшибок.Организация КАК Организация,
	|	КорреспонденцииБезОшибок.Регистратор КАК Регистратор,
	|	КорреспонденцииБезОшибок.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорреспонденцииБезОшибок.РеквизитСторно КАК РеквизитСторно
	|ПОМЕСТИТЬ втДокументыЗаменыРеверсаНаСторно
	|ИЗ
	|	втКорреспонденцииБезОшибок КАК КорреспонденцииБезОшибок
	|СГРУППИРОВАТЬ ПО
	|	КорреспонденцииБезОшибок.Период,
	|	КорреспонденцииБезОшибок.Регистратор,
	|	КорреспонденцииБезОшибок.ИдентификаторФинЗаписи,
	|	КорреспонденцииБезОшибок.Организация,
	|	КорреспонденцииБезОшибок.РеквизитСторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	Организация,
	|	РеквизитСторно
	|");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрыРеверса.ИмяРегистра КАК ИмяРегистра
	|ПОМЕСТИТЬ втРегистрыЗаменыРеверсаНаСторно
	|ИЗ
	|	втРегистрыСДвижениямиРеверса КАК РегистрыРеверса
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втДокументыЗаменыРеверсаНаСторно КАК ДокументыЗаменыРеверса
	|		ГДЕ
	|			ДокументыЗаменыРеверса.Период = РегистрыРеверса.Период
	|			И ДокументыЗаменыРеверса.Регистратор = РегистрыРеверса.Регистратор
	|			И ДокументыЗаменыРеверса.ИдентификаторФинЗаписи = РегистрыРеверса.ИдентификаторФинЗаписи
	|			И ДокументыЗаменыРеверса.Организация = РегистрыРеверса.Организация
	|			И ДокументыЗаменыРеверса.РеквизитСторно = РегистрыРеверса.РеквизитСторно
	|		)
	|");
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРегистрыСДвижениямиРеверса");
	
КонецПроцедуры

Процедура ЗаменитьКорреспонденцииРеверсаНаСторно(ТекстыЗапросов,
	СоздаваемаяТаблицаКорреспонденцийДвижений, УдаляемаяТаблицаКорреспонденцийДвижений)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДвиженияДебетКредит.Период КАК Период,
	|	ДвиженияДебетКредит.НомерЗаписиДт КАК НомерЗаписиДт,
	|	ДвиженияДебетКредит.НомерЗаписиКт КАК НомерЗаписиКт,
	|	ДвиженияДебетКредит.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияДебетКредит.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияДебетКредит.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияДебетКредит.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияДебетКредит.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияДебетКредит.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияДебетКредит.Организация КАК Организация,
	|	ДвиженияДебетКредит.Регистратор КАК Регистратор,
	|	ДвиженияДебетКредит.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияДебетКредит.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ДвиженияДебетКредит.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ДвиженияДебетКредит.ВидДеятельностиНДСДт КАК ВидДеятельностиНДСДт,
	|	ДвиженияДебетКредит.ВидДеятельностиНДСКт КАК ВидДеятельностиНДСКт,
	|	ДвиженияДебетКредит.ВалютаДт КАК ВалютаДт,
	|	ДвиженияДебетКредит.ВалютаКт КАК ВалютаКт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ДвиженияДебетКредит.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ДвиженияДебетКредит.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалДт КАК СуммаДвиженияВалДт,
	|	ДвиженияДебетКредит.СуммаДвиженияВалКт КАК СуммаДвиженияВалКт,
	|	ДвиженияДебетКредит.КоличествоДвиженияДт КАК КоличествоДвиженияДт,
	|	ДвиженияДебетКредит.КоличествоДвиженияКт КАК КоличествоДвиженияКт,
	|	ДвиженияДебетКредит.РеквизитСторно КАК РеквизитСторно,
	|	ДвиженияДебетКредит.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ДвиженияДебетКредит.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ДвиженияДебетКредит.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ДвиженияДебетКредит.СуммаУпрДт КАК СуммаУпрДт,
	|	ДвиженияДебетКредит.СуммаУпрКт КАК СуммаУпрКт,
	|	ДвиженияДебетКредит.СуммаРеглДт КАК СуммаРеглДт,
	|	ДвиженияДебетКредит.СуммаРеглКт КАК СуммаРеглКт
	|ПОМЕСТИТЬ СоздаваемаяТаблицаКорреспонденцийДвижений
	|ИЗ
	|	УдаляемаяТаблицаКорреспонденцийДвижений КАК ДвиженияДебетКредит
	|ГДЕ
	|	НЕ ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			втДокументыЗаменыРеверсаНаСторно КАК ДокументыЗаменыРеверса
	|		ГДЕ
	|			ДокументыЗаменыРеверса.Период = ДвиженияДебетКредит.Период
	|			И ДокументыЗаменыРеверса.Регистратор = ДвиженияДебетКредит.Регистратор
	|			И ДокументыЗаменыРеверса.ИдентификаторФинЗаписи = ДвиженияДебетКредит.ИдентификаторФинЗаписи
	|			И ДокументыЗаменыРеверса.Организация = ДвиженияДебетКредит.Организация
	|			И ДокументыЗаменыРеверса.РеквизитСторно = ДвиженияДебетКредит.РеквизитСторно
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияБезОшибок.Период КАК Период,
	|	ДвиженияБезОшибок.НомерЗаписиДт КАК НомерЗаписиДт,
	|	ДвиженияБезОшибок.НомерЗаписиКт КАК НомерЗаписиКт,
	|	ДвиженияБезОшибок.ИмяРегистраДт КАК ИмяРегистраДт,
	|	ДвиженияБезОшибок.ИмяРегистраКт КАК ИмяРегистраКт,
	|	ДвиженияБезОшибок.ОбъектУчетаДт КАК ОбъектУчетаДт,
	|	ДвиженияБезОшибок.ОбъектУчетаКт КАК ОбъектУчетаКт,
	|	ДвиженияБезОшибок.ЭтоСторноДт КАК ЭтоСторноДт,
	|	ДвиженияБезОшибок.ЭтоСторноКт КАК ЭтоСторноКт,
	|	ДвиженияБезОшибок.Организация КАК Организация,
	|	ДвиженияБезОшибок.Регистратор КАК Регистратор,
	|	ДвиженияБезОшибок.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ДвиженияБезОшибок.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДвиженияБезОшибок.ИдентификаторСтрокиДт КАК ИдентификаторСтрокиДт,
	|	ДвиженияБезОшибок.ИдентификаторСтрокиКт КАК ИдентификаторСтрокиКт,
	|	ДвиженияБезОшибок.ВидДеятельностиНДСДт КАК ВидДеятельностиНДСДт,
	|	ДвиженияБезОшибок.ВидДеятельностиНДСКт КАК ВидДеятельностиНДСКт,
	|	ДвиженияБезОшибок.ВалютаДт КАК ВалютаДт,
	|	ДвиженияБезОшибок.ВалютаКт КАК ВалютаКт,
	|	ДвиженияБезОшибок.СуммаДвиженияУпрДт КАК СуммаДвиженияУпрДт,
	|	ДвиженияБезОшибок.СуммаДвиженияУпрКт КАК СуммаДвиженияУпрКт,
	|	ДвиженияБезОшибок.СуммаДвиженияРеглДт КАК СуммаДвиженияРеглДт,
	|	ДвиженияБезОшибок.СуммаДвиженияРеглКт КАК СуммаДвиженияРеглКт,
	|	ДвиженияБезОшибок.СуммаДвиженияВалДт КАК СуммаДвиженияВалДт,
	|	ДвиженияБезОшибок.СуммаДвиженияВалКт КАК СуммаДвиженияВалКт,
	|	ДвиженияБезОшибок.КоличествоДвиженияДт КАК КоличествоДвиженияДт,
	|	ДвиженияБезОшибок.КоличествоДвиженияКт КАК КоличествоДвиженияКт,
	|	ДвиженияБезОшибок.РеквизитСторно КАК РеквизитСторно,
	|	ДвиженияБезОшибок.СложнаяПроводкаДт КАК СложнаяПроводкаДт,
	|	ДвиженияБезОшибок.СложнаяПроводкаКт КАК СложнаяПроводкаКт,
	|	ДвиженияБезОшибок.УчитыватьХозОперацию КАК УчитыватьХозОперацию,
	|	ДвиженияБезОшибок.СуммаУпрДт КАК СуммаУпрДт,
	|	ДвиженияБезОшибок.СуммаУпрКт КАК СуммаУпрКт,
	|	ДвиженияБезОшибок.СуммаРеглДт КАК СуммаРеглДт,
	|	ДвиженияБезОшибок.СуммаРеглКт КАК СуммаРеглКт
	|ИЗ
	|	втКорреспонденцииБезОшибок КАК ДвиженияБезОшибок
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СоздаваемаяТаблицаКорреспонденцийДвижений", СоздаваемаяТаблицаКорреспонденцийДвижений);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "УдаляемаяТаблицаКорреспонденцийДвижений", УдаляемаяТаблицаКорреспонденцийДвижений);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, УдаляемаяТаблицаКорреспонденцийДвижений);
	
КонецПроцедуры

Процедура ДобавитьПустуюТаблицуДокументовЗаменыРеверса(ТекстыЗапросов)
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(0001, 01, 01) КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЛОЖЬ КАК РеквизитСторно
	|ПОМЕСТИТЬ втДокументыЗаменыРеверсаНаСторно
	|ГДЕ
	|	ЛОЖЬ
	|");
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросовВосстановленияРасчетовПоСторно

Процедура ВосстановитьРасчетыПоСторно(Запрос, ТекстыЗапросов)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	РеестрДокументов.Организация КАК Организация,
	|	РеестрДокументов.Ссылка КАК ДокументСторно,
	|	РеестрДокументов.ДатаДокументаИБ КАК Период,
	|	РеестрДокументов.СторнируемыйДокумент КАК СторнируемыйДокумент
	|ПОМЕСТИТЬ втРеестрДокументовСторно
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПорцияДокументов КАК ПорцияДокументов
	|		ПО РеестрДокументов.Ссылка = ПорцияДокументов.Регистратор
	|ГДЕ
	|	РеестрДокументов.Проведен
	|	И РеестрДокументов.СторноИсправление
	|	И НЕ РеестрДокументов.ДополнительнаяЗапись
	|	И &УсловияОтбора
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументСторно,
	|	СторнируемыйДокумент
	|";
	
	Если Запрос.Параметры.ВосстановитьРасчетыПоСторно Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 0", "");
	КонецЕсли;
	
	СтрокиУсловийОтбора = Новый Массив();
	
	Если Запрос.Параметры.ДатаНачала > '00010101' Тогда
		СтрокиУсловийОтбора.Добавить("РеестрДокументов.ДатаДокументаИБ >= &ДатаНачала");
	КонецЕсли;
	
	Если Запрос.Параметры.ДатаОкончания > '00010101' Тогда
		СтрокиУсловийОтбора.Добавить("РеестрДокументов.ДатаДокументаИБ <= &ДатаОкончания");
	КонецЕсли;
	
	Если ТипЗнч(Запрос.Параметры.Регистратор) = Тип("Массив") Тогда
		СтрокиУсловийОтбора.Добавить("РеестрДокументов.Ссылка В (&Регистратор)");
	ИначеЕсли ЗначениеЗаполнено(Запрос.Параметры.Регистратор) Тогда
		СтрокиУсловийОтбора.Добавить("РеестрДокументов.Ссылка = &Регистратор");
	КонецЕсли;
	
	Если СтрокиУсловийОтбора.Количество() > 0 Тогда
		РазделительСтрок = Символы.ПС + Символы.Таб + "И ";
		ТекстУсловияОтбора = СтрСоединить(СтрокиУсловийОтбора, РазделительСтрок);
	Иначе
		ТекстУсловияОтбора = "ИСТИНА";
	КонецЕсли;
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияОтбора", ТекстУсловияОтбора);
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	#Область ВосстановлениеАвансаКлиента
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	""РасчетыСКлиентамиПоСрокам"" КАК ИмяРегистра,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьКлиентов) КАК ОбъектУчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыПолученныеОтКлиентов) КАК ОбъектУчетаКт,
	|	ЛОЖЬ КАК ЭтоСторно,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаКлиента) КАК НастройкаХозОперации,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	"""" КАК ИдентификаторСтроки,
	|	ЛОЖЬ КАК РеквизитСторно,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.Регистратор КАК РасчетныйДокумент,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	&ПрочиеПоляВыборки,
	|	СУММА(ДанныеРегистра.ДолгУпр) КАК СуммаУпрДт,
	|	СУММА(ДанныеРегистра.ПредоплатаУпр) КАК СуммаУпрКт,
	|	СУММА(ДанныеРегистра.ДолгРегл) КАК СуммаРеглДт,
	|	СУММА(ДанныеРегистра.ПредоплатаРегл) КАК СуммаРеглКт,
	|	СУММА(ДанныеРегистра.Долг) КАК СуммаВалДт,
	|	СУММА(ДанныеРегистра.Предоплата) КАК СуммаВалКт
	|ПОМЕСТИТЬ втРасчетыСКлиентамиПоСторно
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеестрДокументов.Период КАК Период,
	|		РеестрДокументов.ДокументСторно КАК Регистратор,
	|		РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта КАК Валюта,
	|		-ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.Долг 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.Долг 
	|		КОНЕЦ КАК Долг,
	|		-ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ДолгРегл 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДолгРегл 
	|		КОНЕЦ КАК ДолгРегл,
	|		-ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ДолгУпр 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДолгУпр 
	|		КОНЕЦ КАК ДолгУпр,
	|		-ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.Предоплата 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.Предоплата 
	|		КОНЕЦ КАК Предоплата,
	|		-ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ПредоплатаРегл 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРегл 
	|		КОНЕЦ КАК ПредоплатаРегл,
	|		-ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ПредоплатаУпр 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаУпр 
	|		КОНЕЦ КАК ПредоплатаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеестрДокументовСторно КАК РеестрДокументов
	|		ПО РасчетыСКлиентамиПоСрокам.ДокументРегистратор = РеестрДокументов.СторнируемыйДокумент
	|		 И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = РеестрДокументов.Организация
	|	ГДЕ
	|		НЕ РасчетыСКлиентамиПоСрокам.Сторно
	|		И &УсловиеОтбораПоОрганизации
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РеестрДокументов.Период КАК Период,
	|		РеестрДокументов.ДокументСторно КАК Регистратор,
	|		РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.Долг 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.Долг 
	|		КОНЕЦ КАК Долг,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ДолгРегл 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДолгРегл 
	|		КОНЕЦ КАК ДолгРегл,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ДолгУпр 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ДолгУпр 
	|		КОНЕЦ КАК ДолгУпр,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.Предоплата 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.Предоплата 
	|		КОНЕЦ КАК Предоплата,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ПредоплатаРегл 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаРегл 
	|		КОНЕЦ КАК ПредоплатаРегл,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСКлиентамиПоСрокам.ПредоплатаУпр 
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПредоплатаУпр 
	|		КОНЕЦ КАК ПредоплатаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеестрДокументовСторно КАК РеестрДокументов
	|		ПО РасчетыСКлиентамиПоСрокам.ДокументРегистратор = РеестрДокументов.ДокументСторно
	|		 И РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = РеестрДокументов.Организация
	|	ГДЕ
	|		РасчетыСКлиентамиПоСрокам.Сторно
	|		И &УсловиеОтбораПоОрганизации
	|	) КАК ДанныеРегистра
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов,
	|	ДанныеРегистра.Валюта
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.Долг) <> 0 ИЛИ СУММА(ДанныеРегистра.Предоплата) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.ДолгУпр) <> 0 ИЛИ СУММА(ДанныеРегистра.ПредоплатаУпр) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.ДолгРегл) <> 0 ИЛИ СУММА(ДанныеРегистра.ПредоплатаРегл) <> 0
	|";
	
	Если ТипЗнч(Запрос.Параметры.Организация) = Тип("Массив") Тогда
		УсловиеОтбораПоОрганизации = "РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация В (&Организация)";
	ИначеЕсли ЗначениеЗаполнено(Запрос.Параметры.Организация) Тогда
		УсловиеОтбораПоОрганизации = "РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация";
	Иначе
		УсловиеОтбораПоОрганизации = "ИСТИНА";
	КонецЕсли;
	
	СуществующиеПоляВыборки = Новый Массив();
	СуществующиеПоляВыборки.Добавить("АналитикаУчетаПоПартнерам");
	СуществующиеПоляВыборки.Добавить("ОбъектРасчетов");
	СуществующиеПоляВыборки.Добавить("Валюта");
	СуществующиеПоляВыборки.Добавить("РасчетныйДокумент");
	СуществующиеПоляВыборки.Добавить("Регистратор");
	СуществующиеПоляВыборки.Добавить("ИдентификаторФинЗаписи");
	СуществующиеПоляВыборки.Добавить("НастройкаХозяйственнойОперации");
	СуществующиеПоляВыборки.Добавить("Сторно");
	
	ДоступныеПрочиеПоля = Новый Массив();
	ВсеПоляРегистра = ФинансовыйУчетПоДаннымБалансовыхРегистров.ДоступныеПоляИсточникаДанных(
		ОписаниеПолейФинансовогоРегистра(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Имя));
	
	ТекстВыборкиПрочихПолей = ФинансовыйУчетПоДаннымБалансовыхРегистров.ТекстВыборкиПолей(
		ДоступныеПрочиеПоля, СуществующиеПоляВыборки, ВсеПоляРегистра);
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрочиеПоляВыборки", ТекстВыборкиПрочихПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоОрганизации", УсловиеОтбораПоОрганизации);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	#Область ВосстановлениеАвансаПоставщику
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	""РасчетыСПоставщикамиПоСрокам"" КАК ИмяРегистра,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.АвансыВыданныеПоставщикам) КАК ОбъектУчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ЗадолженностьПередПоставщиками) КАК ОбъектУчетаКт,
	|	ЛОЖЬ КАК ЭтоСторно,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеАвансаПоставщику) КАК НастройкаХозОперации,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	"""" КАК ИдентификаторСтроки,
	|	ЛОЖЬ КАК РеквизитСторно,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.Регистратор КАК РасчетныйДокумент,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	&ПрочиеПоляВыборки,
	|	СУММА(ДанныеРегистра.ПредоплатаУпр) КАК СуммаУпрДт,
	|	СУММА(ДанныеРегистра.ДолгУпр) КАК СуммаУпрКт,
	|	СУММА(ДанныеРегистра.ПредоплатаРегл) КАК СуммаРеглДт,
	|	СУММА(ДанныеРегистра.ДолгРегл) КАК СуммаРеглКт,
	|	СУММА(ДанныеРегистра.Предоплата) КАК СуммаВалДт,
	|	СУММА(ДанныеРегистра.Долг) КАК СуммаВалКт
	|ПОМЕСТИТЬ втРасчетыСПоставщикамиПоСторно
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеестрДокументов.Период КАК Период,
	|		РеестрДокументов.ДокументСторно КАК Регистратор,
	|		РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта КАК Валюта,
	|		-ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.Долг 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Долг 
	|		КОНЕЦ КАК Долг,
	|		-ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ДолгРегл 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДолгРегл 
	|		КОНЕЦ КАК ДолгРегл,
	|		-ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ДолгУпр 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДолгУпр 
	|		КОНЕЦ КАК ДолгУпр,
	|		-ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.Предоплата 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Предоплата 
	|		КОНЕЦ КАК Предоплата,
	|		-ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл 
	|		КОНЕЦ КАК ПредоплатаРегл,
	|		-ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ПредоплатаУпр 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаУпр 
	|		КОНЕЦ КАК ПредоплатаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеестрДокументовСторно КАК РеестрДокументов
	|		ПО РасчетыСПоставщикамиПоСрокам.ДокументРегистратор = РеестрДокументов.СторнируемыйДокумент
	|		 И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = РеестрДокументов.Организация
	|	ГДЕ
	|		НЕ РасчетыСПоставщикамиПоСрокам.Сторно
	|		И &УсловиеОтбораПоОрганизации
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РеестрДокументов.Период КАК Период,
	|		РеестрДокументов.ДокументСторно КАК Регистратор,
	|		РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.Долг 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Долг 
	|		КОНЕЦ КАК Долг,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ДолгРегл 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДолгРегл 
	|		КОНЕЦ КАК ДолгРегл,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ДолгУпр 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ДолгУпр 
	|		КОНЕЦ КАК ДолгУпр,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.Предоплата 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.Предоплата 
	|		КОНЕЦ КАК Предоплата,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл 
	|		КОНЕЦ КАК ПредоплатаРегл,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -РасчетыСПоставщикамиПоСрокам.ПредоплатаУпр 
	|			ИНАЧЕ РасчетыСПоставщикамиПоСрокам.ПредоплатаУпр 
	|		КОНЕЦ КАК ПредоплатаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеестрДокументовСторно КАК РеестрДокументов
	|		ПО РасчетыСПоставщикамиПоСрокам.ДокументРегистратор = РеестрДокументов.ДокументСторно
	|		 И РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = РеестрДокументов.Организация
	|	ГДЕ
	|		РасчетыСПоставщикамиПоСрокам.Сторно
	|		И &УсловиеОтбораПоОрганизации
	|	) КАК ДанныеРегистра
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов,
	|	ДанныеРегистра.Валюта
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.Долг) <> 0 ИЛИ СУММА(ДанныеРегистра.Предоплата) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.ДолгУпр) <> 0 ИЛИ СУММА(ДанныеРегистра.ПредоплатаУпр) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.ДолгРегл) <> 0 ИЛИ СУММА(ДанныеРегистра.ПредоплатаРегл) <> 0
	|";
	
	Если ТипЗнч(Запрос.Параметры.Организация) = Тип("Массив") Тогда
		УсловиеОтбораПоОрганизации = "РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация В (&Организация)";
	ИначеЕсли ЗначениеЗаполнено(Запрос.Параметры.Организация) Тогда
		УсловиеОтбораПоОрганизации = "РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация";
	Иначе
		УсловиеОтбораПоОрганизации = "ИСТИНА";
	КонецЕсли;
	
	СуществующиеПоляВыборки = Новый Массив();
	СуществующиеПоляВыборки.Добавить("АналитикаУчетаПоПартнерам");
	СуществующиеПоляВыборки.Добавить("ОбъектРасчетов");
	СуществующиеПоляВыборки.Добавить("Валюта");
	СуществующиеПоляВыборки.Добавить("РасчетныйДокумент");
	СуществующиеПоляВыборки.Добавить("Регистратор");
	СуществующиеПоляВыборки.Добавить("ИдентификаторФинЗаписи");
	СуществующиеПоляВыборки.Добавить("НастройкаХозяйственнойОперации");
	СуществующиеПоляВыборки.Добавить("Сторно");
	
	ДоступныеПрочиеПоля = Новый Массив();
	ВсеПоляРегистра = ФинансовыйУчетПоДаннымБалансовыхРегистров.ДоступныеПоляИсточникаДанных(
		ОписаниеПолейФинансовогоРегистра(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.Имя));
	
	ТекстВыборкиПрочихПолей = ФинансовыйУчетПоДаннымБалансовыхРегистров.ТекстВыборкиПолей(
		ДоступныеПрочиеПоля, СуществующиеПоляВыборки, ВсеПоляРегистра);
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрочиеПоляВыборки", ТекстВыборкиПрочихПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоОрганизации", УсловиеОтбораПоОрганизации);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	#КонецОбласти
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ДобавитьЗапросУдаленияВременнойТаблицы(ТекстыЗапросов, "втРеестрДокументовСторно");
	
	Если Запрос.Параметры.ВосстановитьРасчетыПоСторно Тогда
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Результаты = Запрос.ВыполнитьПакет();
		ТекстыЗапросов.Очистить();
		
		Если ОбщегоНазначенияУТ.РазмерВременнойТаблицы(Запрос.МенеджерВременныхТаблиц, "втРасчетыСКлиентамиПоСторно") > 0 Тогда
			ОбщегоНазначенияУТ.ДобавитьИдентификаторыВоВременнуюТаблицу(
				"втРасчетыСКлиентамиПоСторно",
				Запрос.МенеджерВременныхТаблиц,
				"ИдентификаторФинЗаписи");
		КонецЕсли;
		
		Если ОбщегоНазначенияУТ.РазмерВременнойТаблицы(Запрос.МенеджерВременныхТаблиц, "втРасчетыСПоставщикамиПоСторно") > 0 Тогда
			ОбщегоНазначенияУТ.ДобавитьИдентификаторыВоВременнуюТаблицу(
				"втРасчетыСПоставщикамиПоСторно",
				Запрос.МенеджерВременныхТаблиц,
				"ИдентификаторФинЗаписи");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьТаблицуВосстановленияРасчетовПоСторно(ТекстЗапросаРегистра, ИмяРегистра)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
	|	ТаблицаРегистра.ОбъектУчетаДт КАК ОбъектУчета,
	|	ИСТИНА КАК ЭтоДебет,
	|	ЛОЖЬ КАК ЭтоКредит,
	|	ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
	|	&ПоляВыбораАналитики,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ТаблицаРегистра.Организация КАК Организация,
	|	ТаблицаРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ТаблицаРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаРегистра.Валюта КАК Валюта,
	|	ТаблицаРегистра.СуммаУпрДт КАК СуммаУпр,
	|	ТаблицаРегистра.СуммаРеглДт КАК СуммаРегл,
	|	ТаблицаРегистра.СуммаВалДт КАК СуммаВал,
	|	0 КАК Количество,
	|	&ПустыеРесурсыИсточникаДанных,
	|	ЛОЖЬ КАК РеквизитСторно
	|ИЗ
	|	&ИсточникДанных КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
	|	ТаблицаРегистра.ОбъектУчетаКт КАК ОбъектУчета,
	|	ЛОЖЬ КАК ЭтоДебет,
	|	ИСТИНА КАК ЭтоКредит,
	|	ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
	|	&ПоляВыбораАналитики,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ТаблицаРегистра.Организация КАК Организация,
	|	ТаблицаРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ТаблицаРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаРегистра.Валюта КАК Валюта,
	|	ТаблицаРегистра.СуммаУпрКт КАК СуммаУпр,
	|	ТаблицаРегистра.СуммаРеглКт КАК СуммаРегл,
	|	ТаблицаРегистра.СуммаВалКт КАК СуммаВал,
	|	0 КАК Количество,
	|	&ПустыеРесурсыИсточникаДанных,
	|	ЛОЖЬ КАК РеквизитСторно
	|ИЗ
	|	&ИсточникДанных КАК ТаблицаРегистра
	|";
	
	Если ИмяРегистра = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Имя Тогда
		ИсточникДанных = "втРасчетыСКлиентамиПоСторно";
	Иначе
		ИсточникДанных = "втРасчетыСПоставщикамиПоСторно";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникДанных", ИсточникДанных);
	
	ИндексироватьПо = "ИНДЕКСИРОВАТЬ ПО"; //@Query-part
	
	Если СтрНайти(ТекстЗапросаРегистра, ИндексироватьПо, НаправлениеПоиска.СКонца) = 0 Тогда
		ТекстЗапросаРегистра = ТекстЗапросаРегистра
			+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
			+ ТекстЗапроса;
	Иначе
		ТекстЗапросаРегистра = СтрЗаменить(ТекстЗапросаРегистра, ИндексироватьПо,
			ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
			+ ТекстЗапроса
			+ ИндексироватьПо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросовАналитикиКорреспонденций

Функция ТекстВыборкиАналитикиИзВложеннойТаблицы()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
	|	ТаблицаРегистра.ОбъектУчета КАК ОбъектУчета,
	|	ТаблицаРегистра.ЭтоДебет КАК ЭтоДебет,
	|	ТаблицаРегистра.ЭтоКредит КАК ЭтоКредит,
	|	ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
	|	&ПоляАналитикиВложеннойТаблицы,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ТаблицаРегистра.Организация КАК Организация,
	|	ТаблицаРегистра.Подразделение КАК Подразделение,
	|	ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
	|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаРегистра.Валюта КАК Валюта,
	|	СУММА(ТаблицаРегистра.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ТаблицаРегистра.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаРегистра.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаРегистра.Количество) КАК Количество,
	|	&СуммыРесурсовВложенногоИсточникаДанных,
	|	ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаРегистра.Период КАК Период,
	|		ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
	|		ТаблицаРегистра.ОбъектУчета КАК ОбъектУчета,
	|		ТаблицаРегистра.ЭтоДебет КАК ЭтоДебет,
	|		ТаблицаРегистра.ЭтоКредит КАК ЭтоКредит,
	|		ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
	|		&ПоляАналитикиВложеннойТаблицы,
	|		ТаблицаРегистра.Регистратор КАК Регистратор,
	|		ТаблицаРегистра.Организация КАК Организация,
	|		ТаблицаРегистра.Подразделение КАК Подразделение,
	|		ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
	|		ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ТаблицаРегистра.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.СуммаУпр >= 0
	|				ТОГДА ТаблицаРегистра.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.СуммаРегл >= 0
	|				ТОГДА ТаблицаРегистра.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.СуммаВал >= 0
	|				ТОГДА ТаблицаРегистра.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.Количество >= 0
	|				ТОГДА ТаблицаРегистра.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	|		&РесурсыВложенногоИсточникаДанных,
	|		ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
	|	ИЗ
	|		&ИсточникДанных КАК ТаблицаРегистра
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаРегистра.Период КАК Период,
	|		ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
	|		ТаблицаРегистра.ОбъектУчета КАК ОбъектУчета,
	|		ТаблицаРегистра.ЭтоКредит КАК ЭтоДебет,
	|		ТаблицаРегистра.ЭтоДебет КАК ЭтоКредит,
	|		НЕ ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
	|		&ПоляАналитикиВложеннойТаблицы,
	|		ТаблицаРегистра.Регистратор КАК Регистратор,
	|		ТаблицаРегистра.Организация КАК Организация,
	|		ТаблицаРегистра.Подразделение КАК Подразделение,
	|		ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
	|		ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ТаблицаРегистра.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.СуммаУпр < 0
	|				ТОГДА -ТаблицаРегистра.СуммаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаУпр,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.СуммаРегл < 0
	|				ТОГДА -ТаблицаРегистра.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.СуммаВал < 0
	|				ТОГДА -ТаблицаРегистра.СуммаВал
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ТаблицаРегистра.Количество < 0
	|				ТОГДА -ТаблицаРегистра.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	|		&ПустыеРесурсыИсточникаДанных,
	|		ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
	|	ИЗ
	|		&ИсточникДанных КАК ТаблицаРегистра
	|	ГДЕ
	|		ТаблицаРегистра.СуммаУпр < 0 ИЛИ ТаблицаРегистра.СуммаРегл < 0
	|		ИЛИ ТаблицаРегистра.СуммаВал < 0 ИЛИ ТаблицаРегистра.Количество < 0
	|	) КАК ТаблицаРегистра
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.ИмяРегистра,
	|	ТаблицаРегистра.ОбъектУчета,
	|	ТаблицаРегистра.ЭтоДебет,
	|	ТаблицаРегистра.ЭтоКредит,
	|	ТаблицаРегистра.ЭтоСторно,
	|	&ГруппаАналитикиВложеннойТаблицы,
	|	ТаблицаРегистра.Регистратор,
	|	ТаблицаРегистра.Организация,
	|	ТаблицаРегистра.Подразделение,
	|	ТаблицаРегистра.НаправлениеДеятельности,
	|	ТаблицаРегистра.НастройкаХозОперации,
	|	ТаблицаРегистра.ИдентификаторФинЗаписи,
	|	ТаблицаРегистра.ИдентификаторСтроки,
	|	ТаблицаРегистра.Валюта,
	|	ТаблицаРегистра.РеквизитСторно
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстВыборкиАналитикиИзВременнойТаблицы(ЗаменаРеверсаНаСторно = Ложь)
	
	Если ЗаменаРеверсаНаСторно Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРегистра.Период КАК Период,
		|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
		|	ТаблицаРегистра.ОбъектУчета КАК ОбъектУчета,
		|	ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.ЭтоДебет
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА ТаблицаРегистра.ЭтоКредит
		|		ИНАЧЕ ТаблицаРегистра.ЭтоДебет
		|	КОНЕЦ КАК ЭтоДебет,
		|	ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.ЭтоКредит
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА ТаблицаРегистра.ЭтоДебет
		|		ИНАЧЕ ТаблицаРегистра.ЭтоКредит
		|	КОНЕЦ КАК ЭтоКредит,
		|	ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.ЭтоСторно
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА НЕ ТаблицаРегистра.ЭтоСторно
		|		ИНАЧЕ ТаблицаРегистра.ЭтоСторно
		|	КОНЕЦ КАК ЭтоСторно,
		|	&ПоляАналитикиВложеннойТаблицы,
		|	ТаблицаРегистра.Регистратор КАК Регистратор,
		|	ТаблицаРегистра.Организация КАК Организация,
		|	ТаблицаРегистра.Подразделение КАК Подразделение,
		|	ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
		|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаРегистра.Валюта КАК Валюта,
		|	СУММА(ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.СуммаУпр
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА -ТаблицаРегистра.СуммаУпр
		|		ИНАЧЕ ТаблицаРегистра.СуммаУпр
		|	КОНЕЦ) КАК СуммаУпр,
		|	СУММА(ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.СуммаРегл
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА -ТаблицаРегистра.СуммаРегл
		|		ИНАЧЕ ТаблицаРегистра.СуммаРегл
		|	КОНЕЦ) КАК СуммаРегл,
		|	СУММА(ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.СуммаВал
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА -ТаблицаРегистра.СуммаВал
		|		ИНАЧЕ ТаблицаРегистра.СуммаВал
		|	КОНЕЦ) КАК СуммаВал,
		|	СУММА(ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.Количество
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА -ТаблицаРегистра.Количество
		|		ИНАЧЕ ТаблицаРегистра.Количество
		|	КОНЕЦ) КАК Количество,
		|	&СуммыРесурсовВложенногоИсточникаДанных,
		|	ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
		|ИЗ
		|	&ИсточникДанных КАК ТаблицаРегистра
		|	ЛЕВОЕ СОЕДИНЕНИЕ втДокументыЗаменыРеверсаНаСторно КАК ДокументыЗаменыРеверса
		|		ПО ТаблицаРегистра.Период = ДокументыЗаменыРеверса.Период
		|		 И ТаблицаРегистра.Регистратор = ДокументыЗаменыРеверса.Регистратор
		|		 И ТаблицаРегистра.ИдентификаторФинЗаписи = ДокументыЗаменыРеверса.ИдентификаторФинЗаписи
		|		 И ТаблицаРегистра.Организация = ДокументыЗаменыРеверса.Организация
		|		 И ТаблицаРегистра.РеквизитСторно = ДокументыЗаменыРеверса.РеквизитСторно
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРегистра.Период,
		|	ТаблицаРегистра.ИмяРегистра,
		|	ТаблицаРегистра.ОбъектУчета,
		|	ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.ЭтоДебет
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА ТаблицаРегистра.ЭтоКредит
		|		ИНАЧЕ ТаблицаРегистра.ЭтоДебет
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.ЭтоКредит
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА ТаблицаРегистра.ЭтоДебет
		|		ИНАЧЕ ТаблицаРегистра.ЭтоКредит
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДокументыЗаменыРеверса.Регистратор ЕСТЬ NULL
		|			ТОГДА ТаблицаРегистра.ЭтоСторно
		|		КОГДА ТаблицаРегистра.ЭтоСторно
		|			ТОГДА НЕ ТаблицаРегистра.ЭтоСторно
		|		ИНАЧЕ ТаблицаРегистра.ЭтоСторно
		|	КОНЕЦ,
		|	&ГруппаАналитикиВложеннойТаблицы,
		|	ТаблицаРегистра.Регистратор,
		|	ТаблицаРегистра.Организация,
		|	ТаблицаРегистра.Подразделение,
		|	ТаблицаРегистра.НаправлениеДеятельности,
		|	ТаблицаРегистра.НастройкаХозОперации,
		|	ТаблицаРегистра.ИдентификаторФинЗаписи,
		|	ТаблицаРегистра.ИдентификаторСтроки,
		|	ТаблицаРегистра.Валюта,
		|	ТаблицаРегистра.РеквизитСторно
		|";
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРегистра.Период КАК Период,
		|	ТаблицаРегистра.ИмяРегистра КАК ИмяРегистра,
		|	ТаблицаРегистра.ОбъектУчета КАК ОбъектУчета,
		|	ТаблицаРегистра.ЭтоДебет КАК ЭтоДебет,
		|	ТаблицаРегистра.ЭтоКредит КАК ЭтоКредит,
		|	ТаблицаРегистра.ЭтоСторно КАК ЭтоСторно,
		|	&ПоляВыбораАналитики,
		|	ТаблицаРегистра.Регистратор КАК Регистратор,
		|	ТаблицаРегистра.Организация КАК Организация,
		|	ТаблицаРегистра.Подразделение КАК Подразделение,
		|	ТаблицаРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ТаблицаРегистра.НастройкаХозОперации КАК НастройкаХозОперации,
		|	ТаблицаРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	ТаблицаРегистра.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаРегистра.Валюта КАК Валюта,
		|	ТаблицаРегистра.СуммаУпр КАК СуммаУпр,
		|	ТаблицаРегистра.СуммаРегл КАК СуммаРегл,
		|	ТаблицаРегистра.СуммаВал КАК СуммаВал,
		|	ТаблицаРегистра.Количество КАК Количество,
		|	&РесурсыВложенногоИсточникаДанных,
		|	ТаблицаРегистра.РеквизитСторно КАК РеквизитСторно
		|ИЗ
		|	&ИсточникДанных КАК ТаблицаРегистра
		|";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииФормированияТекстовЗапросов

Функция УдаляемыеПоляВыборкиЗапросовКорреспонденций()
	
	УдаляемыеПоля = Новый Массив();
	УдаляемыеПоля.Добавить("Подразделение");
	УдаляемыеПоля.Добавить("НаправлениеДеятельности");
	
	Возврат УдаляемыеПоля;
	
КонецФункции

Функция УдаляемыеПоляВыборкиЗапросовАналитикиДвижений()
	
	УдаляемыеПоля = Новый Массив();
	УдаляемыеПоля.Добавить("СлужебныйВидДеятельностиНДС");
	
	Возврат УдаляемыеПоля;
	
КонецФункции

Функция ПоляИндексаТаблицыКорреспонденций()
	
	ПоляИндекса = Новый Массив();
	ПоляИндекса.Добавить("ЭтоДебет");
	ПоляИндекса.Добавить("ЭтоКредит");
	
	Возврат ПоляИндекса;
	
КонецФункции

Функция ПоляИндексаТаблицОтбораКорреспонденций()
	
	ПоляИндекса = Новый Массив();
	ПоляИндекса.Добавить("Период");
	ПоляИндекса.Добавить("Регистратор");
	ПоляИндекса.Добавить("ИдентификаторФинЗаписи");
	ПоляИндекса.Добавить("ИдентификаторСтроки");
	ПоляИндекса.Добавить("ОбъектУчета");
	ПоляИндекса.Добавить("Организация");
	ПоляИндекса.Добавить("НастройкаХозОперации");
	ПоляИндекса.Добавить("РеквизитСторно");
	
	Возврат ПоляИндекса;
	
КонецФункции

Функция ПоляИндексаТаблицЗаменыРеверсаНаСторно()
	
	ПоляИндекса = Новый Массив();
	ПоляИндекса.Добавить("Период");
	ПоляИндекса.Добавить("Регистратор");
	ПоляИндекса.Добавить("ИдентификаторФинЗаписи");
	ПоляИндекса.Добавить("Организация");
	
	Возврат ПоляИндекса;
	
КонецФункции

Функция ПоляВыборкиПоОписаниюОбъектаУчета()
	
	ПоляВыборки = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПоляВыборкиПоОписаниюОбъектаУчета();
	
	Возврат ПоляВыборки;
	
КонецФункции

Функция СтрокиВыборкиПолейПоОписаниюОбъектаУчета(СтрокиОбъектовУчета, ПараметрыОтраженияДвижений, ПараметрыЗапроса)
	
	СписокПолей = СтрСоединить(ПоляВыборкиПоОписаниюОбъектаУчета(), ",");
	
	ПоляВыборкиОбъектаУчета = ФинансовыйУчетПоДаннымБалансовыхРегистров.СтрокиВыборкиПолейПоОписаниюОбъектаУчета(
		СтрокиОбъектовУчета, ПараметрыОтраженияДвижений, ПараметрыЗапроса, СписокПолей);
	
	Возврат ПоляВыборкиОбъектаУчета;
	
КонецФункции

#КонецОбласти

#Область ОтборКорреспонденцийПоНастройкамСхемыКомпоновкиДанных

Функция ПоляВыбораКомпоновкиДанных(ПараметрыЗапроса)
	
	ПоляВыбора = Новый Структура();
	ПоляВыбора.Вставить("НомерЗаписи", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	ПоляВыбора.Вставить("ПравилоПолученияФакта", Новый ОписаниеТипов("СправочникСсылка.ПравилаПолученияФактаПоСтатьямБюджетов"));
	
	Возврат ПоляВыбора;
	
КонецФункции

Функция ТаблицаРезультатовКомпоновкиДанных(ПоляВыбораКомпоновкиДанных)
	
	ТаблицаРезультатов = Новый ТаблицаЗначений();
	
	Для Каждого ПолеВыбора Из ПоляВыбораКомпоновкиДанных Цикл
		ТаблицаРезультатов.Колонки.Добавить(ПолеВыбора.Ключ, ПолеВыбора.Значение);
	КонецЦикла;
	
	Возврат ТаблицаРезультатов;
	
КонецФункции

Функция КлючПравилаОтбора(ВыборкаПравилаОтбора)
	
	КлючПравила = Новый Структура();
	КлючПравила.Вставить("ПравилоПолученияФакта", ВыборкаПравилаОтбора.ПравилоПолученияФакта);
	
	Если ЗначениеЗаполнено(ВыборкаПравилаОтбора.ОбъектУчетаДт) Тогда
		КлючПравила.Вставить("ОбъектУчетаДт", ВыборкаПравилаОтбора.ОбъектУчетаДт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаПравилаОтбора.ОбъектУчетаКт) Тогда
		КлючПравила.Вставить("ОбъектУчетаКт", ВыборкаПравилаОтбора.ОбъектУчетаКт);
	КонецЕсли;
	
	Возврат КлючПравила;
	
КонецФункции

Процедура ДобавитьКлючПравилаВОтборКомпоновкиДанных(КлючПравила, ОтборПриемник)
	
	Для Каждого КлючИЗначение Из КлючПравила Цикл
		НовыйЭлемент = ОтборПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Ключ);
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = КлючИЗначение.Значение;
		НовыйЭлемент.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОтборПравилаВОтборКомпоновкиДанных(ОтборИсточник, ИнверсияИсточниковДанных, ОтборПриемник)
	
	ПостфиксыПоИменамПапокПолей = Новый Структура();
	ПостфиксыПоИменамПапокПолей.Вставить(
		ИсточникиДанныхСервер.ИмяПапкиПолейИсточникаДанных(),
		?(ИнверсияИсточниковДанных, "Кт", "Дт"));
	ПостфиксыПоИменамПапокПолей.Вставить(
		ИсточникиДанныхСервер.ИмяПапкиПолейКорИсточникаДанных(),
		?(ИнверсияИсточниковДанных, "Дт", "Кт"));
	
	Для Каждого ЭлементОтбораИсточника Из ОтборИсточник.Элементы Цикл
		Если НЕ ЭлементОтбораИсточника.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		ТипЭлементаОтбора = ТипЗнч(ЭлементОтбораИсточника);
		ЭлементОтбораПриемника = ОтборПриемник.Элементы.Добавить(ТипЭлементаОтбора);
		
		Если ТипЭлементаОтбора = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПутьКДанным = Строка(ЭлементОтбораИсточника.ЛевоеЗначение);
			ЧастиПутиКДанным = СтрРазделить(ПутьКДанным, ".");
			ИмяПапкиПолей = ЧастиПутиКДанным[0];
			Постфикс = "";
			
			Если ПостфиксыПоИменамПапокПолей.Свойство(ИмяПапкиПолей, Постфикс) Тогда
				ЧастиПутиКДанным.Удалить(0);
			Иначе
				Постфикс = ?(ИнверсияИсточниковДанных, "Кт", "Дт");
			КонецЕсли;
			
			Если ИмяПапкиПолей = ИсточникиДанныхСервер.ИмяПапкиПолейКорИсточникаДанных() Тогда
				ПрефиксИменПолей = ИсточникиДанныхСервер.ПрефиксИменПолейКорИсточникаДанных();
				ДлинаПрефиксаИмен = СтрДлина(ПрефиксИменПолей);
				Если Лев(ЧастиПутиКДанным[0], ДлинаПрефиксаИмен) = ПрефиксИменПолей Тогда
					ЧастиПутиКДанным[0] = Сред(ЧастиПутиКДанным[0], ДлинаПрефиксаИмен + 1);
				КонецЕсли;
			КонецЕсли;
			
			ЧастиПутиКДанным[0] = ЧастиПутиКДанным[0] + Постфикс;
			ПутьКДанным = СтрСоединить(ЧастиПутиКДанным, ".");
			ЗаполнитьЗначенияСвойств(ЭлементОтбораПриемника, ЭлементОтбораИсточника,, "ЛевоеЗначение");
			ЭлементОтбораПриемника.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭлементОтбораПриемника, ЭлементОтбораИсточника);
			ДобавитьОтборПравилаВОтборКомпоновкиДанных(ОтборИсточник, ИнверсияИсточниковДанных, ОтборПриемник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеАналитикиКорреспонденций

Функция ВыраженияАналитикиРегистра(ВыборкаИмяРегистра, ПараметрыЗапроса)
	
	ВыраженияАналитикиРегистра = Новый Массив();
	ВыборкаВыраженияАналитики = ВыборкаИмяРегистра.Выбрать();
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	
	Пока ВыборкаВыраженияАналитики.Следующий() Цикл
		Для НомерВыражения = 1 По МаксимальноеКоличествоАналитик Цикл
			ВыражениеАналитики = ВыборкаВыраженияАналитики["ВыражениеАналитики" + НомерВыражения];
			Если ЗначениеЗаполнено(ВыражениеАналитики) Тогда
				НормализоватьВыражениеАналитики(ВыражениеАналитики, ПараметрыЗапроса);
				Если ВыраженияАналитикиРегистра.Найти(ВыражениеАналитики) = Неопределено Тогда
					ВыраженияАналитикиРегистра.Добавить(ВыражениеАналитики);
				КонецЕсли;
				Если ПараметрыЗапроса.ВсеВыраженияАналитики[ВыражениеАналитики] = Неопределено Тогда
					ИмяВыражения = "Выражение" + СтрЗаменить(ВыражениеАналитики, ".", "");
					ПараметрыЗапроса.ВсеВыраженияАналитики.Вставить(ВыражениеАналитики, ИмяВыражения);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ВыраженияАналитикиРегистра;
	
КонецФункции

Процедура НормализоватьВыражениеАналитики(ВыражениеАналитики, ПараметрыЗапроса)
	
	Если СтрНачинаетсяС(ВыражениеАналитики, ПараметрыЗапроса.ИмяПапкиПолей) Тогда
		ВыражениеАналитики = Сред(ВыражениеАналитики, ПараметрыЗапроса.ДлинаИмениПапкиПолей + 2);
	КонецЕсли;
	
	Если СтрНачинаетсяС(ВыражениеАналитики, ПараметрыЗапроса.ИмяПапкиКорПолей) Тогда
		ВыражениеАналитики = Сред(ВыражениеАналитики, ПараметрыЗапроса.ДлинаИмениПапкиКорПолей + 2);
		Если СтрНачинаетсяС(ВыражениеАналитики, ПараметрыЗапроса.ПрефиксИменКорПолей) Тогда
			ВыражениеАналитики = Сред(ВыражениеАналитики, ПараметрыЗапроса.ДлинаПрефиксаИменКорПолей + 1);
		КонецЕсли;
	КонецЕсли;
	
	ВыражениеАналитики = СтрЗаменить(ВыражениеАналитики, "_", ".");
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиВыборкиВыражений(ВыборкаПолей, ГруппировкаПолей, ВыраженияАналитикиРегистра, ВсеВыраженияАналитики)
	
	Для Каждого ВыражениеАналитики Из ВыраженияАналитикиРегистра Цикл
		ПутьКДанным = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ВыражениеАналитики);
		ПсевдонимВыражения = ВсеВыраженияАналитики[ВыражениеАналитики];
		ВыборкаПолей.Добавить(ПутьКДанным + " КАК " + ПсевдонимВыражения);
		ГруппировкаПолей.Добавить(ПутьКДанным);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиВыборкиРесурсов(ВыборкаРесурсов, ВыборкаИмяИсточника)
	
	ВыборкаИменаРесурсов = ВыборкаИмяИсточника.Выбрать();
	
	Пока ВыборкаИменаРесурсов.Следующий() Цикл
		ИмяРесурса = ВыборкаИменаРесурсов.ИмяРесурса;
		ПутьКДанным = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПутьКДаннымСПсевдонимомИсточника(ИмяРесурса);
		ПсевдонимРесурса = "Ресурс" + ИмяРесурса;
		ВыборкаРесурсов.Добавить(СтрШаблон("СУММА(%1) КАК %2", ПутьКДанным, ПсевдонимРесурса));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТаблицыФактическихДанных

Функция ТаблицаЗапросаАналитики(РезультатЗапроса)
	
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	ОбязательныеПоляИндекса = "Период,Регистратор,ИдентификаторФинЗаписи,ИдентификаторСтроки,ИмяРегистра,ОбъектУчета,Организация,РеквизитСторно";
	
	ТаблицаЗапроса.Индексы.Добавить(ОбязательныеПоляИндекса + ",ЭтоДебет,ЭтоСторно");
	ТаблицаЗапроса.Индексы.Добавить(ОбязательныеПоляИндекса + ",ЭтоКредит,ЭтоСторно");
	ТаблицаЗапроса.Индексы.Добавить(ОбязательныеПоляИндекса + ",НастройкаХозОперации,ЭтоДебет,ЭтоСторно");
	ТаблицаЗапроса.Индексы.Добавить(ОбязательныеПоляИндекса + ",НастройкаХозОперации,ЭтоКредит,ЭтоСторно");
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

Функция СтрокиАналитикиДвижения(ВыборкаКорреспонденции,
		ВыборкаЗначенияАналитики, ВыборкаВыраженияАналитики, ТаблицыАналитики, ПараметрыЗапроса, ДтКт)
	
	ИмяРегистра = ВыборкаКорреспонденции["ИмяРегистра" + ДтКт];
	ЭтоИсточникДанных = ВыборкаКорреспонденции.ИсточникДанныхКорреспонденции = ДтКт;
	
	Если ЭтоИсточникДанных ИЛИ ВыборкаКорреспонденции.ПолучитьКорАналитику Тогда
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Период", ВыборкаКорреспонденции.Период);
		СтруктураПоиска.Вставить("Регистратор", ВыборкаКорреспонденции.Регистратор);
		СтруктураПоиска.Вставить("ИдентификаторФинЗаписи", ВыборкаКорреспонденции.ИдентификаторФинЗаписи);
		СтруктураПоиска.Вставить("ИдентификаторСтроки", ВыборкаКорреспонденции["ИдентификаторСтроки" + ДтКт]);
		СтруктураПоиска.Вставить("ИмяРегистра", ИмяРегистра);
		СтруктураПоиска.Вставить("ОбъектУчета", ВыборкаКорреспонденции["ОбъектУчета" + ДтКт]);
		СтруктураПоиска.Вставить("Организация", ВыборкаКорреспонденции.Организация);
		СтруктураПоиска.Вставить("РеквизитСторно", ВыборкаКорреспонденции.РеквизитСторно);
		
		Если ВыборкаКорреспонденции.УчитыватьХозОперацию Тогда
			СтруктураПоиска.Вставить("НастройкаХозОперации", ВыборкаКорреспонденции.НастройкаХозОперации);
		КонецЕсли;
		
		Если ДтКт = "Дт" Тогда
			СтруктураПоиска.Вставить("ЭтоКредит", Ложь);
		Иначе
			СтруктураПоиска.Вставить("ЭтоДебет", Ложь);
		КонецЕсли;
		
		СтруктураПоиска.Вставить("ЭтоСторно", ВыборкаКорреспонденции["ЭтоСторно" + ДтКт]);
		СтрокиАналитики = ТаблицыАналитики[ИмяРегистра].Скопировать(СтруктураПоиска); // ТаблицаЗначений -
		
		ВыполнитьДополнительныйОтборСтрокАналитики(ВыборкаКорреспонденции, СтрокиАналитики, ДтКт);
		
		Если ЭтоИсточникДанных Тогда
			ВыборкаЗначенияАналитики.Сбросить();
			СтруктураПоиска = Новый Структура("ПравилоПолученияФакта", ВыборкаКорреспонденции.ПравилоПолученияФакта);
			ПолучитьЗначенияАналитики = ВыборкаЗначенияАналитики.НайтиСледующий(СтруктураПоиска);
		Иначе
			ПолучитьЗначенияАналитики = Ложь;
		КонецЕсли;
		
		ВыборкаВыраженияАналитики.Сбросить();
		СтруктураПоиска = Новый Структура(
			"ПравилоПолученияФакта,ОбъектУчетаДт,ОбъектУчетаКт",
			ВыборкаКорреспонденции.ПравилоПолученияФакта,
			ВыборкаКорреспонденции.ОбъектУчетаДт,
			ВыборкаКорреспонденции.ОбъектУчетаКт);
		ПолучитьВыраженияАналитики = ВыборкаВыраженияАналитики.НайтиСледующий(СтруктураПоиска);
		
		МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
		ИменаКолонокАналитики = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Подразделение");
		
		Для НомерАналитики = 1 По МаксимальноеКоличествоАналитик Цикл
			ИмяКолонкиАналитика = "Аналитика" + НомерАналитики;
			СтрокиАналитики.Колонки.Добавить(ИмяКолонкиАналитика);
			
			Если ПолучитьЗначенияАналитики Тогда
				ЗначениеАналитики = ВыборкаЗначенияАналитики["ЗначениеАналитики" + НомерАналитики];
			Иначе
				ЗначениеАналитики = Null;
			КонецЕсли;
			
			Если ЗначениеАналитики = Null И ПолучитьВыраженияАналитики Тогда
				ВыражениеАналитики = ВыборкаВыраженияАналитики["ВыражениеАналитики" + НомерАналитики];
				КорИсточникАналитики = ВыборкаВыраженияАналитики["КорИсточникАналитики" + НомерАналитики];
				
				Если ЗначениеЗаполнено(ВыражениеАналитики)
				 И (ЭтоИсточникДанных И НЕ КорИсточникАналитики 
					ИЛИ НЕ ЭтоИсточникДанных И КорИсточникАналитики) Тогда
					НормализоватьВыражениеАналитики(ВыражениеАналитики, ПараметрыЗапроса);
					ИмяКолонкиВыражения = ПараметрыЗапроса.ВсеВыраженияАналитики[ВыражениеАналитики];
				Иначе
					ИмяКолонкиВыражения = Null;
				КонецЕсли;
			Иначе
				ИмяКолонкиВыражения = Null;
			КонецЕсли;
			
			Для Каждого СтрокаАналитики Из СтрокиАналитики Цикл
				Если ЗначениеАналитики <> Null Тогда
					СтрокаАналитики[ИмяКолонкиАналитика] = ЗначениеАналитики;
				ИначеЕсли ЗначениеЗаполнено(ИмяКолонкиВыражения) Тогда
					Если ЗначениеЗаполнено(СтрокаАналитики[ИмяКолонкиВыражения]) Тогда
						СтрокаАналитики[ИмяКолонкиАналитика] = СтрокаАналитики[ИмяКолонкиВыражения];
					Иначе
						СтрокаАналитики[ИмяКолонкиАналитика] = Неопределено;
					КонецЕсли;
				Иначе
					СтрокаАналитики[ИмяКолонкиАналитика] = Неопределено;
				КонецЕсли;
				
				Если НомерАналитики = 1 И НЕ ЗначениеЗаполнено(СтрокаАналитики.Подразделение) Тогда
					СтрокаАналитики.Подразделение = Неопределено;
				КонецЕсли;
			КонецЦикла;
			ИменаКолонокАналитики.Добавить(ИмяКолонкиАналитика);
		КонецЦикла;
		
		Если СтрокиАналитики.Количество() > 1 Тогда
			ИменаКолонокРесурсов = Новый Массив();
			Для Каждого Колонка Из СтрокиАналитики.Колонки Цикл
				Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
					ИменаКолонокРесурсов.Добавить(Колонка.Имя);
				КонецЕсли;
			КонецЦикла;
			КолонкиГруппировки = СтрСоединить(ИменаКолонокАналитики, ",");
			КолонкиСуммирования = СтрСоединить(ИменаКолонокРесурсов, ",");
			СтрокиАналитики.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
			ВыполнитьОтборСтрокАналитикиПоСуммам(ВыборкаКорреспонденции, СтрокиАналитики, ДтКт);
		КонецЕсли;
	Иначе
		СтрокиАналитики = Новый ТаблицаЗначений();
	КонецЕсли;
	
	Возврат СтрокиАналитики;
	
КонецФункции

// Условия отбора в этой процедуре должны соответствовать дополнительным условиям соединения записей в процедуре формирования корреспонденций
//
Процедура ВыполнитьДополнительныйОтборСтрокАналитики(ВыборкаКорреспонденции, СтрокиАналитики, ДтКт)
	
	Если НЕ ВыборкаКорреспонденции.УчитыватьХозОперацию Тогда
		КоличествоСтрок = СтрокиАналитики.Количество();
		Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
			СтрокаАналитики = СтрокиАналитики[КоличествоСтрок - ОбратныйИндекс];
			Если ЗначениеЗаполнено(СтрокаАналитики.НастройкаХозОперации)
				И СтрокаАналитики.НастройкаХозОперации <> ВыборкаКорреспонденции.НастройкаХозОперации Тогда
				СтрокиАналитики.Удалить(СтрокаАналитики);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВыполнитьОтборСтрокАналитикиПоСуммам(ВыборкаКорреспонденции, СтрокиАналитики, ДтКт);
	
КонецПроцедуры

Процедура ВыполнитьОтборСтрокАналитикиПоСуммам(ВыборкаКорреспонденции, СтрокиАналитики, ДтКт)
	
	Если СтрокиАналитики.Количество() > 1
	И НЕ ВыборкаКорреспонденции["СложнаяПроводка" + ДтКт] Тогда
		АналитикаССуммамиДвижения = Новый Массив();
		
		Для Каждого СтрокаАналитики Из СтрокиАналитики Цикл
			Если СтрокаАналитики.СуммаУпр = ВыборкаКорреспонденции["СуммаДвиженияУпр" + ДтКт]
			   И СтрокаАналитики.СуммаРегл = ВыборкаКорреспонденции["СуммаДвиженияРегл" + ДтКт] Тогда
				АналитикаССуммамиДвижения.Добавить(СтрокаАналитики);
			КонецЕсли;
		КонецЦикла;
		
		Если АналитикаССуммамиДвижения.Количество() = 1 Тогда
			КоличествоСтрок = СтрокиАналитики.Количество();
			Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
				СтрокаАналитики = СтрокиАналитики[КоличествоСтрок - ОбратныйИндекс];
				Если СтрокаАналитики <> АналитикаССуммамиДвижения[0] Тогда
					СтрокиАналитики.Удалить(СтрокаАналитики);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПоказателяИсточникаДанных(ВыборкаРесурсыПоказателей, ОписаниеПравила)
	
	ОписаниеПоказателя = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НовоеОписаниеПоказателя();
	
	СтруктураПоиска = Новый Структура("ОбъектУчета,Показатель",
		ОписаниеПравила.ИсточникДанных, ОписаниеПравила.ИсточникСуммыОперации);
	
	ВыборкаРесурсыПоказателей.Сбросить();
	
	Пока ВыборкаРесурсыПоказателей.НайтиСледующий(СтруктураПоиска) Цикл
		ТаблицаРесурсов = ОписаниеПоказателя[ВыборкаРесурсыПоказателей.ГруппаРесурсов]; // ТаблицаЗначений -
		ЗаполнитьЗначенияСвойств(ТаблицаРесурсов.Добавить(), ВыборкаРесурсыПоказателей);
	КонецЦикла;
	
	Возврат ОписаниеПоказателя;
	
КонецФункции

Функция БалансныйПоказательИсточника(ОписаниеПоказателя)
	
	БалансныйПоказательИсточника = Истина;
	
	Для Каждого КлючИЗначение Из ОписаниеПоказателя Цикл
		ТаблицаРесурсов = КлючИЗначение.Значение;
		Если ТаблицаРесурсов.Количество() > 0 Тогда
			БалансныйПоказательИсточника = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат БалансныйПоказательИсточника;
	
КонецФункции

Функция ЗначенияРесурсовПоказателя(ВыборкаКорреспонденции, ОписаниеПоказателя, АналитикаИсточникаДанных, ПараметрыПолученияФакта, ДтКт)
	
	ЗначенияРесурсов = НовыеЗначенияРесурсовПоказателя(ПараметрыПолученияФакта);
	БалансныйПоказательИсточника = БалансныйПоказательИсточника(ОписаниеПоказателя);
	
	Если БалансныйПоказательИсточника И АналитикаИсточникаДанных.Количество() = 1 Тогда
		НоваяСтрока = ЗначенияРесурсов.Добавить();
		НоваяСтрока.СуммаУпр = ВыборкаКорреспонденции.СуммаУпр;
		НоваяСтрока.СуммаРегл = ВыборкаКорреспонденции.СуммаРегл;
		НоваяСтрока.СуммаВал = ВыборкаКорреспонденции["СуммаВал" + ДтКт];
		НоваяСтрока.Количество = ВыборкаКорреспонденции["Количество" + ДтКт];
	Иначе
		Для Каждого СтрокаАналитики Из АналитикаИсточникаДанных Цикл
			НоваяСтрока = ЗначенияРесурсов.Добавить();
			Если БалансныйПоказательИсточника Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаАналитики);
			Иначе
				Для Каждого КлючИЗначение Из ОписаниеПоказателя Цикл
					ГруппаРесурсов = КлючИЗначение.Ключ;
					ТаблицаРесурсов = КлючИЗначение.Значение;
					ЗначениеРесурсов = 0;
					
					Для Каждого СтрокаРесурса Из ТаблицаРесурсов Цикл
						ИмяКолонкиРесурса = "Ресурс" + СтрокаРесурса.ИмяРесурса;
						ЗначениеРесурса = СтрокаАналитики[ИмяКолонкиРесурса] * СтрокаРесурса.Коэффициент;
						ЗначениеРесурсов = ЗначениеРесурсов + ЗначениеРесурса;
					КонецЦикла;
					
					Если ВыборкаКорреспонденции["ЭтоСторно" + ДтКт] И ЗначениеРесурсов < 0 Тогда
						ЗначениеРесурсов = - ЗначениеРесурсов;
					КонецЕсли;
					
					ИмяЗначения = ИмяЗначенияГруппыРесурсов(ГруппаРесурсов);
					НоваяСтрока[ИмяЗначения] = ЗначениеРесурсов;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗначенияРесурсов.ЗаполнитьЗначения(ВыборкаКорреспонденции["Валюта" + ДтКт], "Валюта");
	
	Возврат ЗначенияРесурсов;
	
КонецФункции

Процедура ПересчитатьРесурсыНебалансногоПоказателяСложнойКорреспонденции(ВыборкаКорреспонденции, ВыборкаСложныеКорреспонденции, ЗначенияРесурсов)
	
	КоэффициентыРаспределенияУпр = Новый Массив();
	КоэффициентыРаспределенияРегл = Новый Массив();
	ИндексТекущейКорреспонденции = 0;
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Период", ВыборкаКорреспонденции.Период);
	СтруктураПоиска.Вставить("Регистратор", ВыборкаКорреспонденции.Регистратор);
	СтруктураПоиска.Вставить("ИдентификаторФинЗаписи", ВыборкаКорреспонденции.ИдентификаторФинЗаписи);
	СтруктураПоиска.Вставить("Организация", ВыборкаКорреспонденции.Организация);
	СтруктураПоиска.Вставить("РеквизитСторно", ВыборкаКорреспонденции.РеквизитСторно);
	
	Если ВыборкаКорреспонденции.УчитыватьХозОперацию Тогда
		СтруктураПоиска.Вставить("НастройкаХозОперации", ВыборкаКорреспонденции.НастройкаХозОперации);
	КонецЕсли;
	
	ВыборкаСложныеКорреспонденции.Сбросить();
	
	Пока ВыборкаСложныеКорреспонденции.НайтиСледующий(СтруктураПоиска) Цикл
		Если ВыборкаСложныеКорреспонденции.СуммаДвиженияУпр <> 0 Тогда
			КоэффициентыРаспределенияУпр.Добавить(ВыборкаСложныеКорреспонденции.СуммаУпр);
		Иначе
			КоэффициентыРаспределенияУпр.Добавить(ВыборкаСложныеКорреспонденции.СуммаРегл);
		КонецЕсли;
			
		Если ВыборкаСложныеКорреспонденции.СуммаДвиженияРегл <> 0 Тогда
			КоэффициентыРаспределенияРегл.Добавить(ВыборкаСложныеКорреспонденции.СуммаРегл);
		Иначе
			КоэффициентыРаспределенияРегл.Добавить(ВыборкаСложныеКорреспонденции.СуммаУпр);
		КонецЕсли;
		
		Если ВыборкаКорреспонденции.НомерЗаписи = ВыборкаСложныеКорреспонденции.НомерЗаписи Тогда
			ИндексТекущейКорреспонденции = КоэффициентыРаспределенияУпр.Количество() - 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Колонка Из ЗначенияРесурсов.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			ИтогРесурса = ЗначенияРесурсов.Итог(Колонка.Имя);
			ТочностьРаспределения = Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			
			Если Колонка.Имя = "СуммаРегл" Тогда
				КоэффициентыРаспределения = КоэффициентыРаспределенияРегл;
			Иначе
				КоэффициентыРаспределения = КоэффициентыРаспределенияУпр;
			КонецЕсли;
			
			Если ИтогРесурса <> 0 Тогда
				РаспределениеИтога = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					ИтогРесурса, КоэффициентыРаспределения, ТочностьРаспределения);
			Иначе
				РаспределениеИтога = Неопределено;
			КонецЕсли;
			
			Если РаспределениеИтога = Неопределено Тогда
				РаспределениеРесурса = Неопределено;
			Иначе
				ЗначениеРесурса = РаспределениеИтога[ИндексТекущейКорреспонденции];
				Если ЗначениеРесурса <> 0 Тогда
					РаспределениеРесурса = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
						ЗначениеРесурса, ЗначенияРесурсов.ВыгрузитьКолонку(Колонка.Имя), ТочностьРаспределения);
				Иначе
					РаспределениеРесурса = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
			Если РаспределениеРесурса = Неопределено Тогда
				ЗначенияРесурсов.ЗаполнитьЗначения(0, Колонка.Имя);
			Иначе
				ЗначенияРесурсов.ЗагрузитьКолонку(РаспределениеРесурса, Колонка.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьРесурсыБалансногоПоказателяСложнойКорреспонденции(ВыборкаКорреспонденции, ЗначенияРесурсов, ДтКт)
	
	Для Каждого Колонка Из ЗначенияРесурсов.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			Если Колонка.Имя = "СуммаВал" ИЛИ Колонка.Имя = "Количество" Тогда
				СуффиксИмениРесурса = ДтКт;
			Иначе
				СуффиксИмениРесурса = "";
			КонецЕсли;
			
			ЗначениеРесурса = ВыборкаКорреспонденции[Колонка.Имя + СуффиксИмениРесурса];
			ТочностьРаспределения = Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			
			Если ЗначениеРесурса <> 0 Тогда
				РаспределениеРесурса = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					ЗначениеРесурса, ЗначенияРесурсов.ВыгрузитьКолонку(Колонка.Имя), ТочностьРаспределения);
			Иначе
				РаспределениеРесурса = Неопределено;
			КонецЕсли;
			
			Если РаспределениеРесурса = Неопределено Тогда
				ЗначенияРесурсов.ЗаполнитьЗначения(0, Колонка.Имя);
			Иначе
				ЗначенияРесурсов.ЗагрузитьКолонку(РаспределениеРесурса, Колонка.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДанныеПростойАналитики(ВыборкаКорреспонденции, ТаблицаФактическихДанных, ЗначенияРесурсов,
	АналитикаИсточникаДанных, АналитикаКорИсточникаДанных, ПараметрыПолученияФакта, ОписаниеПравила)
	
	ДтКт = ВыборкаКорреспонденции.ИсточникДанныхКорреспонденции;
	СтрокаАналитикиИсточника = АналитикаИсточникаДанных[0];
	СтрокаАналитикиКорИсточника = ?(ВыборкаКорреспонденции.ПолучитьКорАналитику,
		АналитикаКорИсточникаДанных[0], Неопределено);
	СтрокаЗначенийРесурсов = ЗначенияРесурсов[0];
	
	СтрокаФактическихДанных = ТаблицаФактическихДанных.Добавить();
	
	ЗаполнитьРеквизитыФактическихДанных(СтрокаФактическихДанных, ВыборкаКорреспонденции, ОписаниеПравила);
	ЗаполнитьАналитикуФактическихДанных(СтрокаФактическихДанных, СтрокаАналитикиИсточника, СтрокаАналитикиКорИсточника, ОписаниеПравила);
	ЗаполнитьРесурсыФактическихДанных(СтрокаФактическихДанных, ВыборкаКорреспонденции, СтрокаЗначенийРесурсов, ПараметрыПолученияФакта, ОписаниеПравила);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыФактическихДанных(СтрокаФактическихДанных, ВыборкаКорреспонденции, ОписаниеПравила)
	
	ЗаполнитьЗначенияСвойств(СтрокаФактическихДанных, ВыборкаКорреспонденции, "Период,Регистратор,Организация");
	ЗаполнитьЗначенияСвойств(СтрокаФактическихДанных, ОписаниеПравила);
	
	СтрокаФактическихДанных.ПериодКурса = ВыборкаКорреспонденции.Период;
	СтрокаФактическихДанных.Сценарий = Справочники.Сценарии.ФактическиеДанные;
	
КонецПроцедуры

Процедура ЗаполнитьАналитикуФактическихДанных(СтрокаФактическихДанных, СтрокаАналитикиИсточника, СтрокаАналитикиКорИсточника, ОписаниеПравила)
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	
	Для НомерАналитики = 1 По МаксимальноеКоличествоАналитик Цикл
		ИмяКолонкиАналитика = "Аналитика" + НомерАналитики;
		ИмяКолонкиВидАналитики = "ВидАналитики" + НомерАналитики;
		
		Если НЕ ЗначениеЗаполнено(ОписаниеПравила[ИмяКолонкиВидАналитики]) Тогда
			СтрокаФактическихДанных[ИмяКолонкиАналитика] = Неопределено;
		ИначеЕсли ЗначениеЗаполнено(СтрокаАналитикиИсточника[ИмяКолонкиАналитика]) Тогда
			СтрокаФактическихДанных[ИмяКолонкиАналитика] = СтрокаАналитикиИсточника[ИмяКолонкиАналитика];
		ИначеЕсли СтрокаАналитикиКорИсточника <> Неопределено
			И ЗначениеЗаполнено(СтрокаАналитикиКорИсточника[ИмяКолонкиАналитика]) Тогда
			СтрокаФактическихДанных[ИмяКолонкиАналитика] = СтрокаАналитикиКорИсточника[ИмяКолонкиАналитика];
		Иначе
			СтрокаФактическихДанных[ИмяКолонкиАналитика] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаФактическихДанных.Подразделение = СтрокаАналитикиИсточника.Подразделение;
	
КонецПроцедуры

Процедура ЗаполнитьРесурсыФактическихДанных(СтрокаФактическихДанных, ВыборкаКорреспонденции, СтрокаЗначенийРесурсов, ПараметрыПолученияФакта, ОписаниеПравила)
	
	ВалютыОперативногоУчета = ФинансовыйУчетПоДаннымБалансовыхРегистров.ВалютыОперативногоУчета(ВыборкаКорреспонденции.Организация);
	ФункциональнаяСумма = ФункциональнаяСумма(СтрокаЗначенийРесурсов, ВалютыОперативногоУчета, ПараметрыПолученияФакта);
	КоэффициентПравила = КоэффициентПравила(ВыборкаКорреспонденции, ОписаниеПравила);
	
	СтрокаФактическихДанных.ВалютаФункциональная = ФункциональнаяСумма.Валюта;
	СтрокаФактическихДанных.СуммаВФункциональнойВалюте = ФункциональнаяСумма.Сумма * КоэффициентПравила;
	
	СтрокаФактическихДанных.СуммаУпр = СтрокаЗначенийРесурсов.СуммаУпр * КоэффициентПравила;
	СтрокаФактическихДанных.СуммаРегл = СтрокаЗначенийРесурсов.СуммаРегл * КоэффициентПравила;
	
	СтрокаФактическихДанных.Валюта = СтрокаЗначенийРесурсов.Валюта;
	СтрокаФактическихДанных.СуммаВВалюте = СтрокаЗначенийРесурсов.СуммаВал * КоэффициентПравила;
	СтрокаФактическихДанных.Количество = СтрокаЗначенийРесурсов.Количество * КоэффициентПравила;
	
	СтрокаФактическихДанных.ВалютаХранения = СтрокаЗначенийРесурсов.Валюта;
	СтрокаФактическихДанных.СуммаВВалютеХранения = СтрокаЗначенийРесурсов.СуммаВал * КоэффициентПравила;
	
КонецПроцедуры

Функция ФункциональнаяСумма(ЗначенияРесурсов, ВалютыОперативногоУчета, ПараметрыПолученияФакта)
	
	Если ПараметрыПолученияФакта.ФункциональнаяВалюта = Перечисления.ВидыУчетаВФункциональнойВалюте.ВВалютеУпр Тогда
		Сумма = ЗначенияРесурсов.СуммаУпр;
		ВалютаРесурса = ВалютыОперативногоУчета.ВалютаУпр;
	Иначе //ПараметрыПолученияФакта.ФункциональнаяВалюта = Перечисления.ВидыУчетаВФункциональнойВалюте.ВВалютеРегл
		Сумма = ЗначенияРесурсов.СуммаРегл;
		ВалютаРесурса = ВалютыОперативногоУчета.ВалютаРегл;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Сумма", Сумма);
	Результат.Вставить("Валюта", ВалютаРесурса);
	
	Возврат Результат;
	
КонецФункции

Функция КоэффициентПравила(ВыборкаКорреспонденции, ОписаниеПравила)
	
	Если ВыборкаКорреспонденции.ИнверсияФактическихДанных
		И ВыборкаКорреспонденции.ИнвертироватьКорреспонденцию Тогда
		КоэффициентПравила = ОписаниеПравила.Коэффициент;
	ИначеЕсли ВыборкаКорреспонденции.ИнверсияФактическихДанных
		ИЛИ ВыборкаКорреспонденции.ИнвертироватьКорреспонденцию Тогда
		КоэффициентПравила = - ОписаниеПравила.Коэффициент;
	Иначе 
		КоэффициентПравила = ОписаниеПравила.Коэффициент;
	КонецЕсли;
	
	Возврат КоэффициентПравила;
	
КонецФункции

Процедура ПолучитьДанныеСложнойАналитики(ВыборкаКорреспонденции, ТаблицаФактическихДанных, ЗначенияРесурсов,
	АналитикаИсточникаДанных, АналитикаКорИсточникаДанных, ПараметрыПолученияФакта, ОписаниеПравила)
	
	ДтКт = ВыборкаКорреспонденции.ИсточникДанныхКорреспонденции;
	КорДтКт = ВыборкаКорреспонденции.КорИсточникДанныхКорреспонденции;
	
	Если АналитикаИсточникаДанных.Количество() > 1 Тогда
		МногоАналитик = Новый Структура("ДтКт,СтрокиАналитики", ДтКт, АналитикаИсточникаДанных);
		СтрокаАналитикиКорИсточника = ?(ВыборкаКорреспонденции.ПолучитьКорАналитику,
			АналитикаКорИсточникаДанных[0], Неопределено);
		ОднаАналитика = Новый Структура("ДтКт,СтрокаАналитики", КорДтКт, СтрокаАналитикиКорИсточника);
		РесурсыИсточникаДанных = ЗначенияРесурсов;
	Иначе
		МногоАналитик = Новый Структура("ДтКт,СтрокиАналитики", КорДтКт, АналитикаКорИсточникаДанных);
		ОднаАналитика = Новый Структура("ДтКт,СтрокаАналитики", ДтКт, АналитикаИсточникаДанных[0]);
		
		ПустойПоказатель = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НовоеОписаниеПоказателя();
		ЗначенияКорРесурсов = ЗначенияРесурсовПоказателя(ВыборкаКорреспонденции, ПустойПоказатель, АналитикаКорИсточникаДанных, ПараметрыПолученияФакта, КорДтКт);
		
		Если ВыборкаКорреспонденции["СложнаяПроводка" + КорДтКт] Тогда
			ПересчитатьРесурсыБалансногоПоказателяСложнойКорреспонденции(ВыборкаКорреспонденции, ЗначенияКорРесурсов, КорДтКт);
		КонецЕсли;
		
		РаспределитьРесурсыПоказателяСложнойАналитики(ЗначенияРесурсов, ЗначенияКорРесурсов);
		РесурсыИсточникаДанных = ЗначенияКорРесурсов;
	КонецЕсли;
	
	ИндексСтрокиРесурсов = 0;
	
	Для Каждого СтрокаАналитики Из МногоАналитик.СтрокиАналитики Цикл
		СтрокаФактическихДанных = ТаблицаФактическихДанных.Добавить();
		СтрокаЗначенийРесурсов = РесурсыИсточникаДанных[ИндексСтрокиРесурсов];
		
		Если МногоАналитик.ДтКт = ДтКт Тогда
			СтрокаАналитикиИсточника = СтрокаАналитики;
			СтрокаАналитикиКорИсточника = ОднаАналитика.СтрокаАналитики;
		Иначе
			СтрокаАналитикиИсточника = ОднаАналитика.СтрокаАналитики;
			СтрокаАналитикиКорИсточника = СтрокаАналитики;
		КонецЕсли;
		
		ЗаполнитьРеквизитыФактическихДанных(СтрокаФактическихДанных, ВыборкаКорреспонденции, ОписаниеПравила);
		ЗаполнитьАналитикуФактическихДанных(СтрокаФактическихДанных, СтрокаАналитикиИсточника, СтрокаАналитикиКорИсточника, ОписаниеПравила);
		ЗаполнитьРесурсыФактическихДанных(СтрокаФактическихДанных, ВыборкаКорреспонденции, СтрокаЗначенийРесурсов, ПараметрыПолученияФакта, ОписаниеПравила);
		
		ИндексСтрокиРесурсов = ИндексСтрокиРесурсов + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьРесурсыПоказателяСложнойАналитики(ЗначенияРесурсов, ЗначенияКорРесурсов)
	
	СтрокаЗначенийРесурсов = ЗначенияРесурсов[0];
	КоэффициентыРаспределенияУпр = ЗначенияКорРесурсов.ВыгрузитьКолонку("СуммаУпр");
	КоэффициентыРаспределенияРегл = ЗначенияКорРесурсов.ВыгрузитьКолонку("СуммаРегл");
	
	Если ЗначенияКорРесурсов.Итог("СуммаУпр") = 0 Тогда
		КоэффициентыРаспределенияУпр = КоэффициентыРаспределенияРегл;
	КонецЕсли;
	
	Если ЗначенияКорРесурсов.Итог("СуммаРегл") = 0 Тогда
		КоэффициентыРаспределенияРегл = КоэффициентыРаспределенияУпр;
	КонецЕсли;
	
	Для Каждого Колонка Из ЗначенияКорРесурсов.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			ЗначениеРесурса = СтрокаЗначенийРесурсов[Колонка.Имя];
			ТочностьРаспределения = Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			
			Если Колонка.Имя = "СуммаРегл" Тогда
				КоэффициентыРаспределения = КоэффициентыРаспределенияРегл;
			Иначе
				КоэффициентыРаспределения = КоэффициентыРаспределенияУпр;
			КонецЕсли;
			
			Если ЗначениеРесурса <> 0 Тогда
				РаспределениеРесурса = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					ЗначениеРесурса, КоэффициентыРаспределения, ТочностьРаспределения);
			Иначе
				РаспределениеРесурса = Неопределено;
			КонецЕсли;
			
			Если РаспределениеРесурса = Неопределено Тогда
				ЗначенияКорРесурсов.ЗаполнитьЗначения(0, Колонка.Имя);
			Иначе
				ЗначенияКорРесурсов.ЗагрузитьКолонку(РаспределениеРесурса, Колонка.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗначенияКорРесурсов.ЗаполнитьЗначения(СтрокаЗначенийРесурсов.Валюта, "Валюта");
	
КонецПроцедуры

Функция НовыеЗначенияРесурсовПоказателя(ПараметрыПолученияФакта)
	
	ОписаниеТипаСуммы = ОбщегоНазначения.ОписаниеТипаЧисло(
		ПараметрыПолученияФакта.ДлинаСуммы, ПараметрыПолученияФакта.ТочностьСуммы);
	ОписаниеТипаКоличества = ОбщегоНазначения.ОписаниеТипаЧисло(
		ПараметрыПолученияФакта.ДлинаКоличества, ПараметрыПолученияФакта.ТочностьКоличества);
	
	ЗначенияРесурсов = Новый ТаблицаЗначений();
	ЗначенияРесурсов.Колонки.Добавить("СуммаУпр", ОписаниеТипаСуммы);
	ЗначенияРесурсов.Колонки.Добавить("СуммаРегл", ОписаниеТипаСуммы);
	ЗначенияРесурсов.Колонки.Добавить("СуммаВал", ОписаниеТипаСуммы);
	ЗначенияРесурсов.Колонки.Добавить("Количество", ОписаниеТипаКоличества);
	ЗначенияРесурсов.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	Возврат ЗначенияРесурсов;
	
КонецФункции

#КонецОбласти

#КонецОбласти
