&НаКлиенте
Процедура Разр_ДобавитьПоШтрихкодуВместо(Команда)	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяСобытияОповещения", "ЯрлыкКоробаСчитанОтчетПереработчика");
	ПараметрыФормы.Вставить("ТекстПодсказки", "Сканируйте штрихкод ярлыка короба.");

	ОткрытьФорму(
		"ОбщаяФорма.Разр_ВводШтрихкодаОдиночный",
		ПараметрыФормы,
		ЭтаФорма
	);
КонецПроцедуры

&НаКлиенте
Процедура Разр_ДобавитьПоШтрихкодамВместо(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяСобытияОповещения", "ЯрлыкиКоробаСчитаныОтчетПереработчика");
	ПараметрыФормы.Вставить("ТекстПодсказки", "Укажите количество и сканируйте штрихкоды ярлыков коробов.");

	ОткрытьФорму(
		"ОбщаяФорма.Разр_ВводШтрихкодаМассовый",
		ПараметрыФормы,
		ЭтаФорма
	);
КонецПроцедуры

&НаКлиенте
Процедура Разр_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Настройки = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.НастройкиПоУмолчанию();

	// Здесь можно переопределить имена ТЧ для конкретного документа
	Настройки.ИмяТЧНоменклатуры = "ВыходныеИзделия";
	Настройки.ИмяТЧШтрихкодов = "Разр_Штрихкоды";
	Настройки.ИмяТЧСерий = "";
	Настройки.ИмяСобытияОповещения = ИмяСобытия;	
	
	// Переносим спецификацию из данных ярлыка в строку ВыходныеИзделия.
	Настройки.ПоляИзЯрлыкаВСтроку.Добавить("Спецификация");
	Настройки.ПоляИзЯрлыкаВСтроку.Добавить("НомерГруппыЗатрат");
	
	// Строки с разными спецификациями не должны объединяться.
	Настройки.КлючевыеПоляСтрок.Добавить("Спецификация");
	Настройки.КлючевыеПоляСтрок.Добавить("НомерГруппыЗатрат");
	
	Если ИмяСобытия = "ЯрлыкКоробаСчитанОтчетПереработчика" Тогда

		Результат = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.ДобавитьНоменклатуруПоЯрлыку(
			Объект,
			Параметр,
			Настройки
		);

		Если Результат.Изменено Тогда
			Модифицированность = Истина;
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ЯрлыкиКоробаСчитаныОтчетПереработчика" Тогда

		Если Параметр = Неопределено 
			Или Не Параметр.Свойство("Ярлыки") Тогда

			ПоказатьПредупреждение(, "Не получены данные массового сканирования.");
			Возврат;

		КонецЕсли;

		Результат = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.ДобавитьНоменклатурыПоЯрлыкам(
			Объект,
			Параметр.Ярлыки,
			Настройки
		);

		Если Результат.Изменено Тогда
			Модифицированность = Истина;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Разр_ЗаполнитьМатериалыПоПродукцииВместо(Команда)
	ЗаполнитьМатериалыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ИЛи Модифицированность = Истина ТОгда
		Сообщить("Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Объект.МатериалыИРаботы.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетПереработчика2_5ВыходныеИзделия.НомерСтроки КАК НомерСтроки,
	|	ОтчетПереработчика2_5ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ОтчетПереработчика2_5ВыходныеИзделия.Серия КАК Серия,
	|	ОтчетПереработчика2_5ВыходныеИзделия.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ОтчетПереработчика2_5ВыходныеИзделия.Упаковка КАК Упаковка,
	|	ОтчетПереработчика2_5ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ОтчетПереработчика2_5ВыходныеИзделия.Количество КАК Количество,
	|	СтатьиКалькуляции.Ссылка КАК СтатьяКалькуляции,
	|	1 КАК НомерГруппыЗатрат
	|ИЗ
	|	Документ.ОтчетПереработчика2_5.ВыходныеИзделия КАК ОтчетПереработчика2_5ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Наименование = ""На стерилизацию"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиКалькуляции КАК СтатьиКалькуляции
	|		ПО (СтатьиКалькуляции.Наименование = ""Стерилизация Дт 25,01"")
	|ГДЕ
	|	ОтчетПереработчика2_5ВыходныеИзделия.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.МатериалыИРаботы.Загрузить(ТЗ);
	
	Модифицированность = Истина;
	

КонецПроцедуры // ЗаполнитьМатериалыНаСервере()

&НаКлиенте
Процедура Разр_ЗаполнитьУслугиПоПродукцииВместо(Команда)
	ЗаполнитьУслугиНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьУслугиНаСервере()
    Если Не ЗначениеЗаполнено(Объект.Ссылка) ИЛи Модифицированность = Истина ТОгда
		Сообщить("Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Объект.Услуги.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетПереработчика2_5ВыходныеИзделия.НомерСтроки КАК НомерСтроки,
	|	Услуга.Ссылка КАК Номенклатура,
	|	Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОтчетПереработчика2_5ВыходныеИзделия.КоличествоУпаковок КАК Количество,
	|	Услуга.СтавкаНДС КАК СтавкаНДС,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК ВидЦеныПоставщика,
	|	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена * ОтчетПереработчика2_5ВыходныеИзделия.КоличествоУпаковок КАК Сумма,
	|	Услуга.СтавкаНДС.Ставка * ЦеныНоменклатурыПоставщиковСрезПоследних.Цена * ОтчетПереработчика2_5ВыходныеИзделия.КоличествоУпаковок / 100 КАК СуммаНДС,
	|	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена * ОтчетПереработчика2_5ВыходныеИзделия.КоличествоУпаковок * (100 + Услуга.СтавкаНДС.Ставка) / 100 КАК СуммаСНДС,
	|	ЦеныНоменклатурыПоставщиковСрезПоследних.ВидЦеныПоставщика КАК ВидЦеныПоставщика1
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Документ.ОтчетПереработчика2_5.ВыходныеИзделия КАК ОтчетПереработчика2_5ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Услуга
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&Дата, ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	|			ПО Услуга.Ссылка = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
	|		ПО (Услуга.Код = ""00-00001904"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ОтчетПереработчика2_5ВыходныеИзделия.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (ВЫБОР
	|				КОГДА ОтчетПереработчика2_5ВыходныеИзделия.Упаковка.Наименование = ""кор""
	|					ТОГДА НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""ВидЦеныДляСтерилизацииКор""
	|				КОГДА ОтчетПереработчика2_5ВыходныеИзделия.Упаковка.Наименование = ""кор.мал""
	|					ТОГДА НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""ВидЦеныДляСтерилизацииКорМал""
	|			КОНЕЦ)
	|ГДЕ
	|	ОтчетПереработчика2_5ВыходныеИзделия.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.НомерСтроки КАК НомерСтроки,
	|	ВТ1.Номенклатура КАК Номенклатура,
	|	ВТ1.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ1.Количество КАК Количество,
	|	ВТ1.СтавкаНДС КАК СтавкаНДС,
	|	ВТ1.Цена КАК Цена,
	|	ВТ1.Сумма КАК Сумма,
	|	ВТ1.СуммаНДС КАК СуммаНДС,
	|	ВТ1.СуммаСНДС КАК СуммаСНДС,
	|	ВТ1.ВидЦеныПоставщика1 КАК ВидЦеныПоставщика,
	|	1 КАК НомерГруппыЗатрат,
	|	СтатьиКалькуляции.Ссылка КАК СтатьяКалькуляции
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиКалькуляции КАК СтатьиКалькуляции
	|		ПО (СтатьиКалькуляции.Наименование = ""Стерилизация Дт 25,01"")
	|ГДЕ
	|	ВТ1.ВидЦеныПоставщика1.Наименование = ВТ1.ВидЦеныПоставщика";
	
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	Запрос.Параметры.Вставить("Дата", Объект.Дата);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.Услуги.Загрузить(ТЗ);
	
	Модифицированность = Истина;	

КонецПроцедуры // ЗаполнитьУслугиНаСервере()

&НаКлиенте
Процедура ОбновитьДоступностьТЧ_ТОвары()
    Элементы.ВыходныеИзделия.ТолькоПросмотр = Объект.Разр_Штрихкоды.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура Разр_ПриОткрытииПосле(Отказ)
	ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура Разр_Разр_ШтрихкодыПриИзмененииВместо(Элемент)
	ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура Разр_ОчиститьТабличныеЧастиВместо(Команда)
	Оповещение = Новый ОписаниеОповещения(
		"ПослеВопросаОчиститьЗаполнениеПоШтрихкодам",
		ЭтаФорма
	);

	ПоказатьВопрос(
		Оповещение,
		"Очистить штрихкоды и продукцию, материлы, услуги, заполненные по штрихкодам?",
		РежимДиалогаВопрос.ДаНет
	);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОчиститьЗаполнениеПоШтрихкодам(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Объект.Разр_Штрихкоды.Очистить();
	Объект.ВыходныеИзделия.Очистить();
	Объект.МатериалыИРаботы.Очистить();
	Объект.Услуги.Очистить();

	Модифицированность = Истина;
	
	ОбновитьДоступностьТЧ_ТОвары();

КонецПроцедуры

