////////////////////////////////////////////////////////////////////////////////
// Подсистема "Переработка на стороне".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ГруппыЗатрат

// Добавляет тексты проверок настроек товаров РНПТ
// 
// Параметры:
// 	ТекстыЗапроса - Массив из Строка
// 	Дата - Дата - дата документа
//
Процедура ДобавитьТекстПроверкиПоРНПТ(ТекстыЗапроса, Дата) Экспорт
	
	//++ Локализация
	Если Не УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстПроверкиНеУказаноПрослеживаемоеИзделие());
	ТекстыЗапроса.Добавить(ТекстПроверкиНеУказанПрослеживаемыйМатериал());
	//-- Локализация
	
КонецПроцедуры

// Выводит сообщения об ошибках заполнения групп затрат
// 
// Параметры:
// 	Выборка - ВыборкаИзРезультатаЗапроса
// 	ПредставлениеГруппЗатрат - Соответствие
// 	Отказ - Булево
//
Процедура СообщитьОшибкиЗаполненияГруппЗатрат(Выборка, ПредставлениеГруппЗатрат, Отказ) Экспорт
	
	//++ Локализация
	
	ШаблонНеУказанПрослеживаемыйМатериал =
		НСтр("ru = 'Для группы затрат ""%1"" должен быть указан материал, прослеживаемый по РНПТ, так как в ней указано изделие, прослеживаемое по РНПТ.';
			|en = 'For the ""%1"" cost group, the material must be traceable by goods batch registration number, as the group contains a finished product which is traceable by goods batch registration number.'");
	
	ШаблонНеУказаноПрослеживаемоеИзделие =
		НСтр("ru = 'Для группы затрат ""%1"" должно быть указано изделие, прослеживаемое по РНПТ, так как в ней указан материал, прослеживаемый по РНПТ.';
			|en = 'For the ""%1"" cost group, the finished product must be traceable by goods batch registration number, as the group contains a material which is traceable by goods batch registration number.'");
	
	Если Выборка.ТипПроверки = "НеУказаноПрослеживаемоеИзделие" Тогда
		
		ТекстСообщения =
			СтрШаблон(
				ШаблонНеУказаноПрослеживаемоеИзделие,
				ПредставлениеГруппЗатрат[Выборка.НомерГруппыЗатрат]);
		
		// Отказ не прокидывается, поскольку возможен сценарий выбытия прослеживаемых комплектующих.
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,,
			Выборка.ИмяТаблицы,
			"Объект");
		
	КонецЕсли;
	
	Если Выборка.ТипПроверки = "НеУказанПрослеживаемыйМатериал" Тогда
		
		ТекстСообщения =
			СтрШаблон(
				ШаблонНеУказанПрослеживаемыйМатериал,
				ПредставлениеГруппЗатрат[Выборка.НомерГруппыЗатрат]);
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,,
			Выборка.ИмяТаблицы,
			"Объект",
			Отказ);
		
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГруппыЗатрат

//++ Локализация

Функция ТекстПроверкиНеУказаноПрослеживаемоеИзделие()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ИмяТаблицыВыходныеИзделия                    КАК ИмяТаблицы,
	|	&СинонимТЧВыходныеИзделия                     КАК СинонимТЧ,
	|	0                                             КАК НомерСтроки,
	|	ИмпортныеМатериалыДокумента.НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	|	""НеУказаноПрослеживаемоеИзделие""            КАК ТипПроверки
	|ИЗ
	|	ВтИмпортныеМатериалыДокумента КАК ИмпортныеМатериалыДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтИмпортныеИзделияДокумента КАК ИмпортныеИзделияДокумента
	|	ПО ИмпортныеМатериалыДокумента.НомерГруппыЗатрат = ИмпортныеИзделияДокумента.НомерГруппыЗатрат
	|	И ИмпортныеИзделияДокумента.Прослеживаемый
	|
	|ГДЕ
	|	ИмпортныеМатериалыДокумента.Прослеживаемый
	|	И ИмпортныеИзделияДокумента.НомерГруппыЗатрат ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ИмпортныеМатериалыДокумента.НомерГруппыЗатрат
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПроверкиНеУказанПрослеживаемыйМатериал()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ИмяТаблицыМатериалыИРаботы                 КАК ИмяТаблицы,
	|	&СинонимТЧМатериалыИРаботы                  КАК СинонимТЧ,
	|	0                                           КАК НомерСтроки,
	|	ИмпортныеИзделияДокумента.НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	|	""НеУказанПрослеживаемыйМатериал""          КАК ТипПроверки
	|ИЗ
	|	ВтИмпортныеИзделияДокумента КАК ИмпортныеИзделияДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтИмпортныеМатериалыДокумента КАК ИмпортныеМатериалыДокумента
	|	ПО ИмпортныеМатериалыДокумента.НомерГруппыЗатрат = ИмпортныеИзделияДокумента.НомерГруппыЗатрат
	|	И ИмпортныеМатериалыДокумента.Прослеживаемый
	|
	|ГДЕ
	|	ИмпортныеИзделияДокумента.Прослеживаемый
	|	И ИмпортныеМатериалыДокумента.НомерГруппыЗатрат ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ИмпортныеИзделияДокумента.НомерГруппыЗатрат
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//-- Локализация

#КонецОбласти

#КонецОбласти