#Область ПрограммныйИнтерфейс

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - См. ПроведениеДокументов.СвойстваДокумента
//
// Возвращаемое значение:
//  Структура - См. ПроведениеДокументов.ПараметрыУчетногоМеханизма
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	Если Не Документ.ДинамическаяСтруктура Тогда
		Возврат Параметры;
	КонецЕсли;
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.ЗаказыНаПроизводство);
	КонецЕсли;
	
	Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.СтруктураЗаказа);
	Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.ТрудозатратыСтруктурыЗаказа);
	
	Возврат Параметры;
	
КонецФункции

// Возвращает тексты запросов для сторнирования движений при исправлении документов
// 
// Параметры:
// 	МетаданныеДокумента - ОбъектМетаданныхДокумент - Метаданные документа, который проводится.
// 
// Возвращаемое значение:
// 	Соответствие - Соответствие полного имени регистра тексту запроса сторнирования
//
Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт
	
	ТекстыЗапросов = Новый Соответствие();
	
	Возврат ТекстыЗапросов;
	
КонецФункции

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие - соответствие имен таблиц изменения регистров и текстов запросов.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам производства.
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ЗаказыНаПроизводство");
	
КонецПроцедуры

// Процедура формирования движений по регистру.
//
// Параметры:
//  ТаблицыДляДвижений		 - Структура				 - таблицы данных документа
//  Документ				 - ДокументСсылка			 - ссылка на документ
//  МенеджерВременныхТаблиц	 - МенеджерВременныхТаблиц	 - менеджер временных таблиц документа
//  Отказ					 - Булево					 - признак отказа от проведения документа.
//  РассчитыватьИзменения	 - Булево					 - Истина, если есть необходимость выполнения расчета результата изменений движений.
//
Процедура ЗаписатьДанные(ТаблицыДляДвижений, Документ, МенеджерВременныхТаблиц, Отказ, РассчитыватьИзменения = Истина) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторДокумента = Документ.УникальныйИдентификатор();
	
	ТаблицаСтруктураЗаказа = Неопределено;
	
	Если ТаблицыДляДвижений.Свойство("Таблица" + "СтруктураЗаказа", ТаблицаСтруктураЗаказа) Тогда
		ЗаписатьНоменклатуру(ИдентификаторДокумента, ТаблицаСтруктураЗаказа, РассчитыватьИзменения);
	КонецЕсли;
	
	ТаблицаТрудозатратыСтруктурыЗаказа = Неопределено;
	
	Если ТаблицыДляДвижений.Свойство("Таблица" + "ТрудозатратыСтруктурыЗаказа", ТаблицаТрудозатратыСтруктурыЗаказа) Тогда
		ЗаписатьТрудозатраты(ИдентификаторДокумента, ТаблицаТрудозатратыСтруктурыЗаказа);
	КонецЕсли;
	
КонецПроцедуры

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
	
	Возврат; // в текущей конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

// Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
	
	Возврат; // в текущей конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Проведение

Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Возврат; // в текущей конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Возврат; // в текущей конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

#КонецОбласти

#Область ЗаказНаПроизводства

// Подготовка данных к расчету динамической структуры заказа на производство.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  ДополнительныеСвойства - Структура - доп. свойства документа.
//  Отказ - Булево - признак отказа от записи
//
Процедура ЗаказНаПроизводствоПередЗаписью(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Не Документ.ДинамическаяСтруктура Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьКлючНоменклатурыВСтрокахТабличнойЧасти(Документ, "Продукция");
	
	МенеджерВременныхТаблицСтруктураЗаказа = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСтруктураЗаказа;
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.УстановитьПараметр("ЭтоНовый", Документ.ЭтоНовый());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.Номенклатура                                               КАК Номенклатура,
		|	ТабличнаяЧасть.Характеристика                                             КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧасть.Номенклатура.ТипНоменклатуры В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|			И НЕ ТабличнаяЧасть.СписатьНаРасходы ТОГДА
		|		ТабличнаяЧасть.Склад
		|	КОГДА ТабличнаяЧасть.СписатьНаРасходы
		|		ИЛИ ТабличнаяЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|		ТабличнаяЧасть.Подразделение
		|	ИНАЧЕ
		|		НЕОПРЕДЕЛЕНО
		|	КОНЕЦ                                                                     КАК Склад,
		|	ТабличнаяЧасть.Назначение                                                 КАК Назначение,
		|	ТабличнаяЧасть.Ссылка                                                     КАК ЗаказНаПроизводство,
		|	ТабличнаяЧасть.КлючНоменклатура                                           КАК КлючНоменклатура,
		|	ТабличнаяЧасть.Спецификация                                               КАК Спецификация,
		|	ТабличнаяЧасть.ДатаПотребности                                            КАК ДатаПотребности,
		|	ТабличнаяЧасть.Количество                                                 КАК Количество
		|ПОМЕСТИТЬ ПродукцияЗаказаПередЗаписью
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|		И НЕ ТабличнаяЧасть.Отменено
		|		И НЕ &ЭтоНовый";
	Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("МенеджерВременныхТаблицСтруктураЗаказа", МенеджерВременныхТаблицСтруктураЗаказа);
	
КонецПроцедуры

// Запись данных к расчету динамической структуры заказа на производство.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  ДополнительныеСвойства - Структура - доп. свойства документа.
//  Отказ - Булево - признак отказа от записи
//
Процедура ЗаказНаПроизводствоПриЗаписи(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Не Документ.ДинамическаяСтруктура Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблицСтруктураЗаказа = ДополнительныеСвойства.МенеджерВременныхТаблицСтруктураЗаказа;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицСтруктураЗаказа;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Номенклатура         КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика       КАК Характеристика,
	|	ТаблицаИзменений.Склад                КАК Склад,
	|	ТаблицаИзменений.Назначение           КАК Назначение,
	|	ТаблицаИзменений.ЗаказНаПроизводство  КАК ЗаказНаПроизводство,
	|	ТаблицаИзменений.КлючНоменклатура     КАК КлючНоменклатура,
	|	ТаблицаИзменений.Спецификация         КАК Спецификация,
	|	ТаблицаИзменений.ДатаПотребности      КАК ДатаПотребности,
	|	СУММА(ТаблицаИзменений.Количество)          КАК Количество,
	|	СУММА(ТаблицаИзменений.КоличествоИзменение) КАК КоличествоИзменение
	|ПОМЕСТИТЬ ПродукцияЗаказаИзменения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура                                               КАК Номенклатура,
	|		ТабличнаяЧасть.Характеристика                                             КАК Характеристика,
	|		ТабличнаяЧасть.Склад                                                      КАК Склад,
	|		ТабличнаяЧасть.Назначение                                                 КАК Назначение,
	|		ТабличнаяЧасть.ЗаказНаПроизводство                                        КАК ЗаказНаПроизводство,
	|		ТабличнаяЧасть.КлючНоменклатура                                           КАК КлючНоменклатура,
	|		ТабличнаяЧасть.Спецификация                                               КАК Спецификация,
	|		ТабличнаяЧасть.ДатаПотребности                                            КАК ДатаПотребности,
	|		0                                                                         КАК Количество,
	|		-ТабличнаяЧасть.Количество                                                КАК КоличествоИзменение
	|	ИЗ
	|		ПродукцияЗаказаПередЗаписью КАК ТабличнаяЧасть
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабличнаяЧасть.Номенклатура                                               КАК Номенклатура,
	|		ТабличнаяЧасть.Характеристика                                             КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ТабличнаяЧасть.Номенклатура.ТипНоменклатуры В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|				И НЕ ТабличнаяЧасть.СписатьНаРасходы ТОГДА
	|			ТабличнаяЧасть.Склад
	|		КОГДА ТабличнаяЧасть.СписатьНаРасходы
	|			ИЛИ ТабличнаяЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|			ТабличнаяЧасть.Подразделение
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|		КОНЕЦ                                                                     КАК Склад,
	|		ТабличнаяЧасть.Назначение                                                 КАК Назначение,
	|		ТабличнаяЧасть.Ссылка                                                     КАК ЗаказНаПроизводство,
	|		ТабличнаяЧасть.КлючНоменклатура                                           КАК КлючНоменклатура,
	|		ТабличнаяЧасть.Спецификация                                               КАК Спецификация,
	|		ТабличнаяЧасть.ДатаПотребности                                            КАК ДатаПотребности,
	|		ТабличнаяЧасть.Количество                                                 КАК Количество,
	|		ТабличнаяЧасть.Количество                                                 КАК КоличествоИзменение
	|	ИЗ
	|		Документ.ЗаказНаПроизводство2_2.Продукция КАК ТабличнаяЧасть
	|	ГДЕ
	|		ТабличнаяЧасть.Ссылка = &Ссылка
	|			И НЕ ТабличнаяЧасть.Отменено
	|
	|) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Склад,
	|	ТаблицаИзменений.Назначение,
	|	ТаблицаИзменений.ЗаказНаПроизводство,
	|	ТаблицаИзменений.КлючНоменклатура,
	|	ТаблицаИзменений.Спецификация,
	|	ТаблицаИзменений.ДатаПотребности
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КоличествоИзменение) <> 0
	|";
	Запрос.Выполнить().Пустой();
	
	ЗаписатьЗаданияКРасчетуГрафикаПроизводства(Документ, ДополнительныеСвойства, МенеджерВременныхТаблицСтруктураЗаказа);
	
	ОбновитьГрафикВыпускаПродукцииПриЗаписиЗаказа(Документ, МенеджерВременныхТаблицСтруктураЗаказа);
	
	МенеджерВременныхТаблицСтруктураЗаказа.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапПроизводства

// Подготовка данных к расчету динамической структуры заказа на производство.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  ДополнительныеСвойства - Структура - доп. свойства документа.
//  Отказ - Булево - признак отказа от записи
//
Процедура ЭтапПроизводстваПередЗаписью(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Не Документ.ДинамическаяСтруктура Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьКлючНоменклатурыВСтрокахТабличнойЧасти(Документ, "ОбеспечениеМатериаламиИРаботами,ВыходныеИзделия,ПобочныеИзделия");
	
	УстановитьКлючВидаРаботВСтрокахТабличнойЧасти(Документ, "Трудозатраты");
	
КонецПроцедуры

// Запись данных к расчету динамической структуры заказа на производство.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  ДополнительныеСвойства - Структура - доп. свойства документа.
//  Отказ - Булево - признак отказа от записи
//
Процедура ЭтапПроизводстваПриЗаписи(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Не Документ.ДинамическаяСтруктура Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииОбеспечения

// Формирует задания на расчет структуры заказа на производство на основе движений по регистрам обеспечения.
//
// Параметры:
//  Документ - ДокументОбъект - регистратор движений регистров
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц, содержащий таблицы изменений регистров.
//
Процедура СформироватьЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасовПриЗаписиДокумента(Документ, МенеджерВременныхТаблиц) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Или РаспределениеЗапасов.ДосчитыватьРегистрРегламентнымЗаданием() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьРасчет = Ложь;
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ЗапасыИПотребностиИзменение") Тогда
		ЗапуститьРасчет = Истина;
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Очередь               КАК Очередь,
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад          КАК Склад,
		|	Таблица.Назначение     КАК Назначение
		|ИЗ
		|	ЗапасыИПотребностиИзменение КАК Таблица
		|ГДЕ
		|	Таблица.Склад НЕ В (
		|		НЕОПРЕДЕЛЕНО,
		|		ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|");
		ОчередьРасчетаСтруктурыЗаказов = 0;
		Документ.ДополнительныеСвойства.Свойство("ОчередьРасчетаСтруктурыЗаказов", ОчередьРасчетаСтруктурыЗаказов);
		Запрос.УстановитьПараметр("Очередь", ОчередьРасчетаСтруктурыЗаказов);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов.ДобавитьЗадания(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если ЗапуститьРасчет Тогда
		СтруктураЗаказа.ЗапуститьРасчет();
	КонецЕсли;

КонецПроцедуры

// Формирует задания на расчет структуры заказа на производство при пакетном формировании этапов.
//
// Параметры:
//  Ссылки	 - Массив	 - сформированные этапы производства.
//  Очередь	 - Число	 - текущий номер очереди расчета структуры заказа.
//
Процедура СформироватьЗаданияПакетноеФормированиеЭтапов(Ссылки, Очередь) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	Идентификаторы = Новый Массив();
	
	Для каждого Ссылка Из Ссылки Цикл
		Идентификаторы.Добавить(Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	
	// для снижения количества тактов пересчета структуры материалы помещаем в следующую очередь (материалы нужно обрабатывать после изделий)
	ОчередьМатериалы = ?(Очередь = 0, 0, Очередь + 1);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Очередь                            КАК Очередь,
		|	СтруктураЗаказа.Номенклатура        КАК Номенклатура,
		|	СтруктураЗаказа.Характеристика      КАК Характеристика,
		|	СтруктураЗаказа.Склад               КАК Склад,
		|	СтруктураЗаказа.Назначение          КАК Назначение,
		|	ВЫБОР
		|		КОГДА СтруктураЗаказа.ВидСтроки <> ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление) ТОГДА
		|			Неопределено
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(СтруктураЗаказа.Этап КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства.ОсновноеИзделиеНоменклатура
		|	КОНЕЦ КАК НоменклатураПродукции
		|ИЗ
		|	РегистрСведений.СтруктураЗаказа КАК СтруктураЗаказа
		|ГДЕ
		|	СтруктураЗаказа.КлючНабор В(&Идентификаторы) И СтруктураЗаказа.КОбеспечению <> 0";
	Запрос.УстановитьПараметр("Очередь", ОчередьМатериалы);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов.ДобавитьЗадания(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область Подстановки

// Формирует текст поля для получения назначения свободного выпуска
// 
// Параметры:
// 	ПутьКПолюЗаказ - Строка - путь к полю "Заказ на производство"
// Возвращаемое значение:
// 	Строка - Описание
Функция ТекстПоляНазначениеСвободногоВыпуска(ПутьКПолюЗаказ = "Таблица.ЗаказНаПроизводство") Экспорт
	
	ТекстПоля =
		"ВЫБОР
		|	КОГДА Заказы.ХозяйственнаяОперация В (
		//++ Устарело_Переработка24
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья),
		//-- Устарело_Переработка24
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья2_5))
		|			И Заказы.ВариантОбособления В ( ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.НаправлениеДеятельности),
		|											ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции),
		|											ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.ЗаказНаПроизводство),
		|											ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.ДоговорДавальца))
		|	
		|		ТОГДА
		|			Заказы.Назначение
		|	
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|КОНЕЦ";
	
	ТекстПоля = СтрЗаменить(ТекстПоля, "Заказы", ПутьКПолюЗаказ);
	
	Возврат ТекстПоля;
	
КонецФункции

// Формирует текст поля для получения назначения материалов заказа
// 
// Параметры:
// 	ПутьКПолюЗаказ - Строка - путь к полю "Заказ на производство"
// 	ПутьКПолюНазначение - Строка - путь к полю "Назначение продукции"
// Возвращаемое значение:
// 	Строка - Описание
Функция ТекстПоляНазначениеМатериалов(ПутьКПолюЗаказ = "Таблица.ЗаказНаПроизводство", ПутьКПолюНазначение = "Таблица.Назначение") Экспорт
	
	ТекстПоля =
		"ВЫБОР
		|	КОГДА
		|		Заказы.ВариантОбособления = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции)
		|		   И &НазначениеПродукция <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		//++ Устарело_Переработка24
		|		   И Заказы.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья)
		//-- Устарело_Переработка24
		|		ТОГДА &НазначениеПродукция
		|	ИНАЧЕ ВЫБОР
		|			КОГДА Заказы.ВариантОбособления В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.НаправлениеДеятельности),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.ЗаказНаПроизводство),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.ЭтапПроизводства),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленияМатериаловВПроизводстве.ДоговорДавальца))
		|				ТОГДА Заказы.Назначение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		КОНЕЦ
		|	КОНЕЦ";
	
	ТекстПоля = СтрЗаменить(
		ТекстПоля,
		"&НазначениеПродукция",
		СтрЗаменить(
			"ВЫБОР
			|	КОГДА Заказы.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
			|		ТОГДА
			|			Заказы.НазначениеПродукция
			|		ИНАЧЕ
			|			&Назначение
			|КОНЕЦ",
			"&Назначение",
			ПутьКПолюНазначение));
	ТекстПоля = СтрЗаменить(ТекстПоля, "Заказы", ПутьКПолюЗаказ);
	
	Возврат ТекстПоля;
	
КонецФункции

// Формирует текст поля для проверки статуса заказа на производства
// 
// Параметры:
// 	ПутьКПолюЗаказ - Строка - путь к полю "Заказ"
// Возвращаемое значение:
// 	Строка - Описание
Функция ТекстПоляЗаказПереданКПроизводству(ПутьКПолюЗаказ = "") Экспорт
	
	ТекстПоля =
	"(Таблица.Проведен
	|	И Таблица.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству)
	|)";
	
	Если Не ПустаяСтрока(ПутьКПолюЗаказ) Тогда
		ТекстПоля = СтрЗаменить(ТекстПоля, "Таблица", ПутьКПолюЗаказ);
	КонецЕсли;
	
	Возврат ТекстПоля;
	
КонецФункции

#КонецОбласти

#Область Прочее

Процедура УстановитьКлючНоменклатурыВСтрокахТабличнойЧасти(Документ, ИменаТЧ, НуженКонтроль = Истина) Экспорт
	
	Если ПустаяСтрока(ИменаТЧ) Тогда
		МассивТЧ = Новый Массив();
	Иначе
		МассивТЧ = СтрРазделить(ИменаТЧ, ",", Ложь);
	КонецЕсли;
	
	Для Каждого ИмяТЧ Из МассивТЧ Цикл
	
		НовыеСтроки = Документ[ИмяТЧ].НайтиСтроки(Новый Структура("КлючНоменклатура", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
		
		Для каждого НоваяСтрока Из НовыеСтроки Цикл
			НоваяСтрока.КлючНоменклатура = Новый УникальныйИдентификатор();
		КонецЦикла;
		
		Если НуженКонтроль Тогда
		
			Проверка = Документ[ИмяТЧ].Выгрузить(, "КлючНоменклатура"); // ТаблицаЗначений
			Проверка.Колонки.Добавить("Счетчик");
			Проверка.ЗаполнитьЗначения(1, "Счетчик");
			Проверка.Свернуть("КлючНоменклатура", "Счетчик");
			Если Проверка.Количество() <> Проверка.НайтиСтроки(Новый Структура("Счетчик", 1)).Количество() Тогда
				ТекстОшибки = НСтр("ru = 'Внутренние идентификаторы строк не должны повторяться!';
									|en = 'Internal row IDs must not be repeated.'");
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьКлючВидаРаботВСтрокахТабличнойЧасти(Документ, ИмяТЧ, НуженКонтроль = Истина) Экспорт
	
	НовыеСтроки = Документ[ИмяТЧ].НайтиСтроки(Новый Структура("КлючВидРабот", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	
	Для каждого НоваяСтрока Из НовыеСтроки Цикл
		НоваяСтрока.КлючВидРабот = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	Если НуженКонтроль Тогда
	
		Проверка = Документ[ИмяТЧ].Выгрузить(, "КлючВидРабот"); // ТаблицаЗначений
		Проверка.Колонки.Добавить("Счетчик");
		Проверка.ЗаполнитьЗначения(1, "Счетчик");
		Проверка.Свернуть("КлючВидРабот", "Счетчик");
		Если Проверка.Количество() <> Проверка.НайтиСтроки(Новый Структура("Счетчик", 1)).Количество() Тогда
			ТекстОшибки = НСтр("ru = 'Внутренние идентификаторы строк не должны повторяться!';
								|en = 'Internal row IDs must not be repeated.'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьКлючиСтрокВТабличнойЧасти(Документ, ИменаТЧ, ИмяПоля) Экспорт
	
	ПустойКлючСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Если ПустаяСтрока(ИменаТЧ) Тогда
		МассивТЧ = Новый Массив();
	Иначе
		МассивТЧ = СтрРазделить(ИменаТЧ, ",", Ложь);
	КонецЕсли;
	
	Для Каждого ИмяТЧ Из МассивТЧ Цикл
	
		Для каждого Строка Из Документ[ИмяТЧ] Цикл
			Строка[ИмяПоля] = ПустойКлючСтроки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаписатьНоменклатуру(ИдентификаторДокумента, ДвиженияДокумента, РассчитыватьИзменения = Истина)
	
	Если РассчитыватьИзменения Тогда
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Движения.Номенклатура              КАК Номенклатура,
		|	Движения.Характеристика            КАК Характеристика,
		|	Движения.Склад                     КАК Склад,
		|	Движения.Назначение                КАК Назначение,
		|	Движения.ЗаказНаПроизводство       КАК ЗаказНаПроизводство,
		|	Движения.КлючНоменклатура          КАК КлючНоменклатура,
		|	Движения.КлючПартия                КАК КлючПартия,
		|	Движения.ВидСтроки                 КАК ВидСтроки,
		|	Движения.ЗаказНаПоступление        КАК ЗаказНаПоступление,
		|	Движения.ДатаПоступления           КАК ДатаПоступления,
		|	Движения.КлючНабор                 КАК КлючНабор,
		|	Движения.Уровень                   КАК Уровень,
		|	Движения.ДлительностьДоВыпуска     КАК ДлительностьДоВыпуска,
		|	Движения.Подразделение             КАК Подразделение,
		|	Движения.Этап                      КАК Этап,
		|	Движения.Спецификация              КАК Спецификация,
		|	Движения.СпецификацияПолуфабриката КАК СпецификацияПолуфабриката,
		|	Движения.НазначениеСтруктуры       КАК НазначениеСтруктуры,
		|	Движения.Запущено                  КАК Запущено,
		|	Движения.КОбеспечению              КАК КОбеспечению,
		|	Движения.Готово                    КАК Готово,
		|	Движения.НеОбеспечивать            КАК НеОбеспечивать
		|
		|ПОМЕСТИТЬ СтруктураЗаказаДвиженияПередЗаписью
		|ИЗ
		|	РегистрСведений.СтруктураЗаказа КАК Движения
		|ГДЕ
		|	Движения.КлючНабор = &ИдентификаторДокумента
		|";
		Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
		
		Блокировка = Новый БлокировкаДанных();
		Блокировка.Добавить("РегистрСведений.СтруктураЗаказа").УстановитьЗначение("КлючНабор", ИдентификаторДокумента);
		Блокировка.Заблокировать();
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СтруктураЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КлючНабор.Установить(ИдентификаторДокумента);
	НаборЗаписей.Загрузить(ДвиженияДокумента);
	НаборЗаписей.Записать(Истина);
	
	Если РассчитыватьИзменения Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИзменений.Номенклатура КАК Номенклатура,
		|	ТаблицаИзменений.Характеристика КАК Характеристика,
		|	ТаблицаИзменений.Склад КАК Склад,
		|	ТаблицаИзменений.Назначение КАК Назначение,
		|	ТаблицаИзменений.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ИЗ (
		|	ВЫБРАТЬ
		|		Движения.Номенклатура КАК Номенклатура,
		|		Движения.Характеристика КАК Характеристика,
		|		Движения.Склад КАК Склад,
		|		Движения.Назначение КАК Назначение,
		|		Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		Движения.КлючНоменклатура КАК КлючНоменклатура,
		|		Движения.КлючПартия КАК КлючПартия,
		|		Движения.ВидСтроки КАК ВидСтроки,
		|		Движения.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|		Движения.ДатаПоступления КАК ДатаПоступления,
		|		Движения.КлючНабор КАК КлючНабор,
		|		Движения.Уровень КАК Уровень,
		|		Движения.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
		|		Движения.Подразделение КАК Подразделение,
		|		Движения.Этап КАК Этап,
		|		Движения.Спецификация КАК Спецификация,
		|		Движения.СпецификацияПолуфабриката КАК СпецификацияПолуфабриката,
		|		Движения.НазначениеСтруктуры КАК НазначениеСтруктуры,
		|		-Движения.КОбеспечению КАК КОбеспечению
		|	ИЗ
		|		СтруктураЗаказаДвиженияПередЗаписью КАК Движения
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Движения.Номенклатура КАК Номенклатура,
		|		Движения.Характеристика КАК Характеристика,
		|		Движения.Склад КАК Склад,
		|		Движения.Назначение КАК Назначение,
		|		Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		Движения.КлючНоменклатура КАК КлючНоменклатура,
		|		Движения.КлючПартия КАК КлючПартия,
		|		Движения.ВидСтроки КАК ВидСтроки,
		|		Движения.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|		Движения.ДатаПоступления КАК ДатаПоступления,
		|		Движения.КлючНабор КАК КлючНабор,
		|		Движения.Уровень КАК Уровень,
		|		Движения.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска,
		|		Движения.Подразделение КАК Подразделение,
		|		Движения.Этап КАК Этап,
		|		Движения.Спецификация КАК Спецификация,
		|		Движения.СпецификацияПолуфабриката КАК СпецификацияПолуфабриката,
		|		Движения.НазначениеСтруктуры КАК НазначениеСтруктуры,
		|		Движения.КОбеспечению КАК КОбеспечению
		|	ИЗ
		|		РегистрСведений.СтруктураЗаказа КАК Движения
		|	ГДЕ
		|		Движения.КлючНабор = &ИдентификаторДокумента) КАК ТаблицаИзменений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.Номенклатура,
		|	ТаблицаИзменений.Характеристика,
		|	ТаблицаИзменений.Склад,
		|	ТаблицаИзменений.Назначение,
		|	ТаблицаИзменений.ЗаказНаПроизводство,
		|	ТаблицаИзменений.КлючНоменклатура,
		|	ТаблицаИзменений.КлючПартия,
		|	ТаблицаИзменений.ВидСтроки,
		|	ТаблицаИзменений.ЗаказНаПоступление,
		|	ТаблицаИзменений.ДатаПоступления,
		|	ТаблицаИзменений.КлючНабор,
		|	ТаблицаИзменений.Уровень,
		|	ТаблицаИзменений.ДлительностьДоВыпуска,
		|	ТаблицаИзменений.Подразделение,
		|	ТаблицаИзменений.Этап,
		|	ТаблицаИзменений.Спецификация,
		|	ТаблицаИзменений.СпецификацияПолуфабриката,
		|	ТаблицаИзменений.НазначениеСтруктуры
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаИзменений.КОбеспечению) <> 0
		|;
		|УНИЧТОЖИТЬ СтруктураЗаказаДвиженияПередЗаписью
		|;";
		РезультатЗапроса = Запрос.ВыполнитьПакет();
	
		ЕстьИзменения = НЕ РезультатЗапроса[0].Пустой();
		Если ЕстьИзменения Тогда
			РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов.ДобавитьЗадания(РезультатЗапроса[0].Выгрузить());
			СтруктураЗаказа.ЗапуститьРасчет();
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры

Процедура ЗаписатьТрудозатраты(ИдентификаторДокумента, ДвиженияДокумента)
	
	НаборЗаписей = РегистрыСведений.ТрудозатратыСтруктурыЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КлючНабор.Установить(ИдентификаторДокумента);
	НаборЗаписей.Загрузить(ДвиженияДокумента);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#Область ГрафикПроизводства

Процедура ЗаписатьЗаданияКРасчетуГрафикаПроизводства(Документ, ДополнительныеСвойства, МенеджерВременныхТаблиц)
	
	Если ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.Проведен
		ИЛИ ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Документ.Статус <> Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	ИспользуетсяГрафикПроизводства = УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства();

	Если ИспользуетсяГрафикПроизводства Тогда
		
		Если Документ.НачатьНеРанее <> ДополнительныеСвойства.ДанныеДокументаПередЗаписью.НачатьНеРанее Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Документ.Приоритет <> ДополнительныеСвойства.ДанныеДокументаПередЗаписью.Приоритет Тогда
			ЕстьИзменения = ЕстьИзменения Или Справочники.Приоритеты.СравнитьПриоритеты(Документ.Приоритет, ДополнительныеСвойства.ДанныеДокументаПередЗаписью.Приоритет) > 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	(ВЫБРАТЬ
		|		Таблица.ЗаказНаПроизводство   КАК ЗаказНаПроизводство,
		|		Таблица.КлючНоменклатура      КАК КлючНоменклатура,
		|		1                             КАК ЕстьЗапись,
		|		Таблица.ДатаПотребности       КАК ДатаПотребности
		|	ИЗ
		|		ПродукцияЗаказаИзменения КАК Таблица) КАК ТаблицаИзменений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.ЗаказНаПроизводство,
		|	ТаблицаИзменений.КлючНоменклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаИзменений.ЕстьЗапись) > 1 И КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаИзменений.ДатаПотребности) > 1");

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЕстьИзменения = ЕстьИзменения Или Не Запрос.Выполнить().Пустой();
	
	Если ЕстьИзменения Тогда
		РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.ДобавитьЗадание(Документ.Ссылка,,, Не ИспользуетсяГрафикПроизводства);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьГрафикВыпускаПродукцииПриЗаписиЗаказа(Документ, МенеджерВременныхТаблиц)
	
	Если Не УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства() Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить("РегистрСведений.ГрафикВыпускаПродукцииЗаказа").УстановитьЗначение("ЗаказНаПроизводство", Документ.Ссылка);
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ГрафикВыпускаПродукцииЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказНаПроизводство.Установить(Документ.Ссылка);
	
	Если Не Документ.Проведен ИЛИ НЕ Документ.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству Тогда 

		НаборЗаписей.Записать(Истина); // используется только в статусе "К производству"
		
	Иначе
		
		РезультатЗапроса = МенеджерВременныхТаблиц.Таблицы.Найти("ПродукцияЗаказаИзменения").ПолучитьДанные();
	
		Если Не РезультатЗапроса.Пустой() Тогда
			
			МассивУдаляемыхСтрок = Новый Массив();
			
			ИзмененныеСтроки = РезультатЗапроса.Выгрузить();
			ИзмененныеСтроки.Индексы.Добавить("КлючНоменклатура");
		
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				Если ИзмененныеСтроки.Найти(Запись.КлючНоменклатура, "КлючНоменклатура") = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				МассивУдаляемыхСтрок.Добавить(Запись);
			КонецЦикла;
			
			Для Каждого Запись Из МассивУдаляемыхСтрок Цикл
				НаборЗаписей.Удалить(Запись);
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет график выпуска продукции заказа после расчета графика производства.
//
// Параметры:
//  Ссылка - ДокументСсылка.ЗаказНаПроизводство2_2
//
Процедура ОбновитьГрафикВыпускаПродукцииПослеРасчетаГрафикаПроизводства(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|
		|	СтруктураЗаказа.Номенклатура         КАК Номенклатура,
		|	СтруктураЗаказа.Характеристика       КАК Характеристика,
		|	СтруктураЗаказа.Склад                КАК Склад,
		|	СтруктураЗаказа.Назначение           КАК Назначение,
		|	СтруктураЗаказа.ЗаказНаПроизводство  КАК ЗаказНаПроизводство,
		|	СтруктураЗаказа.КлючНоменклатура     КАК КлючНоменклатура,
		|	СтруктураЗаказа.КлючПартия           КАК КлючПартия,
		|	СУММА(СтруктураЗаказа.Заказано + СтруктураЗаказа.Готово) КАК Требуется,
		|	СУММА(СтруктураЗаказа.Запланировано + СтруктураЗаказа.РаспределеноИзПартийОбособленно + СтруктураЗаказа.РаспределеноИзПартий) КАК Запланировано
		|
		|ПОМЕСТИТЬ СтруктураЗаказа
		|ИЗ
		|	РегистрСведений.СтруктураЗаказа КАК СтруктураЗаказа
		|
		|ГДЕ
		|	СтруктураЗаказа.ЗаказНаПроизводство = &Ссылка
		|	И СтруктураЗаказа.ВидСтроки В (
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтруктураЗаказа.Номенклатура,
		|	СтруктураЗаказа.Характеристика,
		|	СтруктураЗаказа.Склад,
		|	СтруктураЗаказа.Назначение,
		|	СтруктураЗаказа.ЗаказНаПроизводство,
		|	СтруктураЗаказа.КлючНоменклатура,
		|	СтруктураЗаказа.КлючПартия
		|
		|ИМЕЮЩИЕ
		|	СУММА(СтруктураЗаказа.Заказано + СтруктураЗаказа.Готово) > 0
		|		ИЛИ СУММА(СтруктураЗаказа.Запланировано + СтруктураЗаказа.РаспределеноИзПартийОбособленно + СтруктураЗаказа.РаспределеноИзПартий) > 0
		|;
		|
		|ВЫБРАТЬ
		|
		|	СтруктураЗаказа.Номенклатура                              КАК Номенклатура,
		|	СтруктураЗаказа.Характеристика                            КАК Характеристика,
		|	СтруктураЗаказа.Склад                                     КАК Склад,
		|	СтруктураЗаказа.Назначение                                КАК Назначение,
		|	СтруктураЗаказа.ЗаказНаПроизводство                       КАК ЗаказНаПроизводство,
		|	СтруктураЗаказа.КлючНоменклатура                          КАК КлючНоменклатура,
		|	НАЧАЛОПЕРИОДА(ГрафикПроизводства.Окончание, ДЕНЬ)         КАК ДатаГрафика,
		|	СтруктураЗаказа.Запланировано                             КАК Запланировано
		|
		|ПОМЕСТИТЬ ГрафикВыпуска
		|ИЗ
		|	СтруктураЗаказа КАК СтруктураЗаказа
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикПроизводства
		|		ПО ГрафикПроизводства.ЗаказНаПроизводство = СтруктураЗаказа.ЗаказНаПроизводство
		|		 И ГрафикПроизводства.КлючПартия          = СтруктураЗаказа.КлючПартия
		|		 И ГрафикПроизводства.Этап                = ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
		// Рабочий график (см. РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик)
		|		 И ГрафикПроизводства.СтатусГрафика = 0
		|
		|ГДЕ
		|	СтруктураЗаказа.Запланировано > 0
		|;
		|
		|ВЫБРАТЬ
		|
		|	СтруктураЗаказа.Номенклатура                              КАК Номенклатура,
		|	СтруктураЗаказа.Характеристика                            КАК Характеристика,
		|	СтруктураЗаказа.Склад                                     КАК Склад,
		|	СтруктураЗаказа.Назначение                                КАК Назначение,
		|	СтруктураЗаказа.ЗаказНаПроизводство                       КАК ЗаказНаПроизводство,
		|	СтруктураЗаказа.КлючНоменклатура                          КАК КлючНоменклатура,
		|	ISNULL(ТабЧасть.ДатаПотребности, ДАТАВРЕМЯ(1,1,1))        КАК ДатаГрафика,
		|	СтруктураЗаказа.Требуется                                 КАК Требуется
		|
		|ПОМЕСТИТЬ ПродукцияЗаказа
		|ИЗ
		|	СтруктураЗаказа КАК СтруктураЗаказа
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыНаПроизводство КАК ТабЧасть
		|		ПО ТабЧасть.Номенклатура        = СтруктураЗаказа.Номенклатура
		|		 И ТабЧасть.Характеристика      = СтруктураЗаказа.Характеристика
		|		 И ТабЧасть.Склад               = СтруктураЗаказа.Склад
		|		 И ТабЧасть.Назначение          = СтруктураЗаказа.Назначение
		|		 И ТабЧасть.ЗаказНаПроизводство = СтруктураЗаказа.ЗаказНаПроизводство
		|		 И ТабЧасть.КлючНоменклатура    = СтруктураЗаказа.КлючНоменклатура
		|
		|ГДЕ
		|	СтруктураЗаказа.Требуется > 0
		|;
		|
		|ВЫБРАТЬ
		|
		|	ГрафикВыпуска.Номенклатура                              КАК Номенклатура,
		|	ГрафикВыпуска.Характеристика                            КАК Характеристика,
		|	ГрафикВыпуска.Склад                                     КАК Склад,
		|	ГрафикВыпуска.Назначение                                КАК Назначение,
		|	ГрафикВыпуска.ЗаказНаПроизводство                       КАК ЗаказНаПроизводство,
		|	ГрафикВыпуска.КлючНоменклатура                          КАК КлючНоменклатура,
		|	ГрафикВыпуска.ДатаГрафика                               КАК ДатаГрафика,
		|	СУММА(ГрафикВыпуска.Запланировано)                      КАК Количество
		|
		|ИЗ
		|	ГрафикВыпуска КАК ГрафикВыпуска
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикВыпуска.Номенклатура,
		|	ГрафикВыпуска.Характеристика,
		|	ГрафикВыпуска.Склад,
		|	ГрафикВыпуска.Назначение,
		|	ГрафикВыпуска.ЗаказНаПроизводство,
		|	ГрафикВыпуска.КлючНоменклатура,
		|	ГрафикВыпуска.ДатаГрафика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|
		|	ПродукцияЗаказа.Номенклатура                            КАК Номенклатура,
		|	ПродукцияЗаказа.Характеристика                          КАК Характеристика,
		|	ПродукцияЗаказа.Склад                                   КАК Склад,
		|	ПродукцияЗаказа.Назначение                              КАК Назначение,
		|	ПродукцияЗаказа.ЗаказНаПроизводство                     КАК ЗаказНаПроизводство,
		|	ПродукцияЗаказа.КлючНоменклатура                        КАК КлючНоменклатура,
		|	МАКСИМУМ(ПродукцияЗаказа.ДатаГрафика)                   КАК ДатаГрафика,
		|	МАКСИМУМ(ПродукцияЗаказа.Требуется)
		|		- СУММА(ISNULL(ГрафикВыпуска.Запланировано, 0))     КАК Количество
		|
		|ИЗ
		|	ПродукцияЗаказа КАК ПродукцияЗаказа
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикВыпуска КАК ГрафикВыпуска
		|		ПО ПродукцияЗаказа.Номенклатура        = ГрафикВыпуска.Номенклатура
		|		 И ПродукцияЗаказа.Характеристика      = ГрафикВыпуска.Характеристика
		|		 И ПродукцияЗаказа.Склад               = ГрафикВыпуска.Склад
		|		 И ПродукцияЗаказа.Назначение          = ГрафикВыпуска.Назначение
		|		 И ПродукцияЗаказа.ЗаказНаПроизводство = ГрафикВыпуска.ЗаказНаПроизводство
		|		 И ПродукцияЗаказа.КлючНоменклатура    = ГрафикВыпуска.КлючНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродукцияЗаказа.Номенклатура,
		|	ПродукцияЗаказа.Характеристика,
		|	ПродукцияЗаказа.Склад,
		|	ПродукцияЗаказа.Назначение,
		|	ПродукцияЗаказа.ЗаказНаПроизводство,
		|	ПродукцияЗаказа.КлючНоменклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ПродукцияЗаказа.Требуется)
		|		- СУММА(ISNULL(ГрафикВыпуска.Запланировано, 0)) > 0
		|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕслИ;
	
	НаборЗаписей = РегистрыСведений.ГрафикВыпускаПродукцииЗаказа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказНаПроизводство.Установить(Ссылка);
	НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
