////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Списание ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ФормаДокумента

Процедура ПрослеживаемыеТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) Экспорт
	
	//++ Локализация
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.КодОперацииВыбытия = ПредопределенноеЗначение("Справочник.КодыОперацийПрослеживаемости.ЗахоронениеОбезвреживаниеУтилизацияТовара");
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
