
#Область ПрограммныйИнтерфейс

// Вызывается после выполнения обработчика ПриОткрытии формы печати документов (ОбщаяФорма.ПечатьДокументов).
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма ОбщаяФорма.ПечатьДокументов.
//
Процедура ПечатьДокументовПослеОткрытия(Форма) Экспорт
	
	//++ Локализация
	ЗарплатаКадрыКлиент.ПечатьДокументовПослеОткрытия(Форма);
	//-- Локализация
	
КонецПроцедуры

//++ НЕ УТКА

//++ Устарело_Производство21
#Область ДокументМаршрутныйЛистПроизводства

// Открывает форму для формирования печатной формы маршрутного листа.
//
// Параметры:
//  ОписаниеКоманды - Структура - сведения о выполняемой команде.
//
// Возвращаемое значение:
//	Неопределено
//
Функция ПечатьМаршрутныйЛистПроизводства(ОписаниеКоманды) Экспорт
	
	ОткрытьФорму(
		"Документ.МаршрутныйЛистПроизводства.Форма.ПараметрыПечатиМаршрутногоЛиста",
		Новый Структура("Объекты", ОписаниеКоманды.ОбъектыПечати),
		ОписаниеКоманды.Форма)
	
КонецФункции

// Формирует и выводит печатные формы маршрутных карт изготовления продукции по заказам на производство.
//
// Параметры:
//  ДанныеОПродукции - Массив - содержит структуры с ключами:
//		* Заказ - ДокументСсылка.ЗаказНаПроизводство - заказ, данные которого необходимо вывести на печать.
//		* КодСтроки - Число - код строки продукции заказа на производство.
//
Процедура ПечатьМаршрутныхКартНаПродукцию(ДанныеОПродукции) Экспорт
	
	Если ДанныеОПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляПечати = ОперативныйУчетПроизводстваВызовСервера.ПодготовитьДанныеДляПечатиМаршрутнойКартыНаПродукцию(ДанныеОПродукции);
	
	Если ДанныеДляПечати.ЕстьПолуфабрикаты Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьМаршрутныхКартНаПродукциюЗавершение", ЭтотОбъект);
		ПараметрыФормы = Новый Структура("АдресХранилища", ДанныеДляПечати.АдресХранилища);
		ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ПечатьМаршрутныхКартНаПродукцию", ПараметрыФормы,,,,,ОписаниеОповещения);
	Иначе
		ПечатьМаршрутныхКартНаПродукциюЗавершение(ДанныеДляПечати, Неопределено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
//-- Устарело_Производство21

#Область ЗаказНаПроизводство2_2

// Открывает форму для формирования печатной формы этапа производства.
//
// Параметры:
//  ОписаниеКоманды - Структура - сведения о выполняемой команде.
//
// Возвращаемое значение:
//	Неопределено
//
Функция ПечатьЗаданиеНаПроизводство(ОписаниеКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати);
	
	ОткрытьФорму(
		"Документ.ЭтапПроизводства2_2.Форма.ПараметрыПечатиЗаданиеНаПроизводство",
		ПараметрыФормы,
		ОписаниеКоманды.Форма);
	
КонецФункции

// Открывает форму для формирования печатной формы партии этапа производства.
//
// Параметры:
//  ОписаниеКоманды - Структура - сведения о выполняемой команде.
//
// Возвращаемое значение:
//	Неопределено
//
Функция ПечатьЛистСопровожденияПартииПроизводства(ОписаниеКоманды) Экспорт
	
	ОткрытьФорму(
		"Документ.ЭтапПроизводства2_2.Форма.ПараметрыПечатиЛистСопровожденияПартииПроизводства",
		Новый Структура("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати),
		ОписаниеКоманды.Форма);
	
КонецФункции

#КонецОбласти

#Область РабочиеЦентры

// Открывает форму для формирования этикетки рабочего центра или выводит печатный форму.
//
// Параметры:
//  ОписаниеКоманды - Структура - сведения о выполняемой команде.
//
// Возвращаемое значение:
//	Неопределено
//
Функция ПечатьЭтикеткаРабочегоЦентра(ОписаниеКоманды) Экспорт
	
	Если ОписаниеКоманды.Форма.ИмяФормы = "Справочник.РабочиеЦентры.Форма.ФормаЭлемента" Тогда
	
		ОткрытьФорму(
			"Справочник.РабочиеЦентры.Форма.ПараметрыПечатиЭтикеткаРабочегоЦентра",
			Новый Структура("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати),
			ОписаниеКоманды.Форма);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

//-- НЕ УТКА

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТКА

//++ Устарело_Производство21

// Продолжение процедуры ПечатьМаршрутныхКартНаПродукцию
Процедура ПечатьМаршрутныхКартНаПродукциюЗавершение(ДанныеДляПечати, ДополнительныеПараметры) Экспорт

	Если ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли; 
		
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнительныеПараметры",
		Новый Структура("ДанныеДляПечати", ДанныеДляПечати.ДанныеДляПечати));
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Документ.ЗаказНаПроизводство",
		"МаршрутнаяКартаНаПродукцию",
		ДанныеДляПечати.МассивОбъектов,
		Неопределено,
		ПараметрыПечати);
		
КонецПроцедуры

//-- Устарело_Производство21

//-- НЕ УТКА

#КонецОбласти
