#Область СлужебныеПроцедурыИФункции

// Возвращает строковое представление статуса.
//
// Возвращаемое значение:
//   Строка
//
Функция СтатусДубльЗаменить() Экспорт
	Возврат НСтр("ru = 'Дубль, заменить ссылки и удалить';
				|en = 'Duplicate, replace links and delete'");
КонецФункции

// Возвращает строковое представление статуса.
//
// Возвращаемое значение:
//   Строка
//
Функция СтатусДубльНеУдалять() Экспорт
	Возврат НСтр("ru = 'Дубль, не удалять';
				|en = 'Duplicate, do not delete'");
КонецФункции

// Возвращает строковое представление статуса.
//
// Возвращаемое значение:
//   Строка
//
Функция СтатусТребуетсяПодтверждение() Экспорт
	Возврат НСтр("ru = 'Требуется подтверждение';
				|en = 'Confirmation is required'");
КонецФункции

// Возвращает строковое представление статуса.
//
// Возвращаемое значение:
//   Строка
//
Функция СтатусОригинал() Экспорт
	Возврат НСтр("ru = 'Оригинал';
				|en = 'Original'");
КонецФункции

// Возвращает строковое представление статуса.
//
// Возвращаемое значение:
//   Строка
//
Функция СтатусНеЯвляетсяДублем() Экспорт
	Возврат НСтр("ru = 'Не является дублем';
				|en = 'Not duplicate'");
КонецФункции

Процедура УстановитьСостояниеПоляОтчета(ПолеОтчета, Видимость) Экспорт
	
	ОтображениеСостояния = ПолеОтчета.ОтображениеСостояния;
	
	Если Видимость Тогда
		ОтображениеСостояния.Текст = НСтр("ru = 'Изменились настройки. Нажмите ""Сформировать"" для получения отчета.';
											|en = 'Settings changed. To run the report, click ""Generate"".'");
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Иначе
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	КонецЕсли;
	ОтображениеСостояния.Видимость = Видимость;
	
КонецПроцедуры

#КонецОбласти