////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Имущественные налоги".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ЗемельныйНалог

// Настройка льготы по земельному налогу.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма.
//  ДанныеНастройки - ДокументОбъект.ПараметрыНачисленияЗемельногоНалога - Данные настройки.
//  ОбработкаНастройки - ОписаниеОповещения - Обработка настройки.
Процедура НастройкаЛьготыПоЗемельномуНалогу(Форма, ДанныеНастройки, ОбработкаНастройки) Экспорт

	Объект = Форма.Объект;
	
	ПараметрыЛьготы = Новый Структура(
	"НалоговаяСтавка,
	|ВариантУменьшенияСуммыНалога,
	|ЛьготнаяСтавка,
	|ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
	|ДоляНеОблагаемойНалогомПлощадиЧислитель,
	|КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395,
	|КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391,
	|НалоговаяЛьготаПоНалоговойБазе,
	|НеОблагаемаяНалогомСумма,
	|ПроцентУменьшенияСуммыНалога,
	|СнижениеНалоговойСтавки,
	|СниженнаяНалоговаяСтавка,
	|СуммаУменьшенияСуммыНалога,
	|УменьшениеНалоговойБазыНаСумму,
	|УменьшениеНалоговойБазыПоСтатье391,
	|Период,
	|ОснованиеЛьготыПоНалоговойБазе,
	|НачалоДействияЛьготыПоНалоговойБазе,
	|ОкончаниеДействияЛьготыПоНалоговойБазе,
	|ОснованиеЛьготыСнижениеСтавки,
	|НачалоДействияЛьготыСнижениеСтавки,
	|ОкончаниеДействияЛьготыСнижениеСтавки,
	|ОснованиеЛьготыСнижениеСуммыНалога,
	|НачалоДействияЛьготыСнижениеСуммыНалога,
	|ОкончаниеДействияЛьготыСнижениеСуммыНалога");
	ЗаполнитьЗначенияСвойств(ПараметрыЛьготы, ДанныеНастройки);
	
	ПараметрыЛьготы.Период = Объект.Дата;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЛьготы);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("ДанныеНастройки", ДанныеНастройки);
	ДопПараметры.Вставить("ОбработкаНастройки", ОбработкаНастройки);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаЛьготыПоЗемельномуНалогуЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.НастройкаЛьготыПоЗемельномуНалогу", 
		ПараметрыФормы, Форма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура НастройкаЛьготыПоЗемельномуНалогуЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") 
		ИЛИ ДопПараметры.Форма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Форма.Модифицированность = Истина;
	
	ЗаполнитьЗначенияСвойств(ДопПараметры.ДанныеНастройки, Результат);
	
	ВыполнитьОбработкуОповещения(ДопПараметры.ОбработкаНастройки, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ТранспортныйНалог

// Настройка льготы по земельному налогу.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма.
//  ДанныеНастройки -СтрокаТабличнойЧасти - Данные настройки.
//  ОбработкаНастройки - ОписаниеОповещения - Обработка настройки.
Процедура НастройкаЛьготыПоТранспортномуНалогу(Форма, ДанныеНастройки, ОбработкаНастройки) Экспорт

	//@skip-check structure-consructor-too-many-keys
	ПараметрыЛьготы = Новый Структура(
	"Период,
	|ДатаПараметров,
	|НалоговаяСтавка,
	|СтавкаОпределяетсяАвтоматически,
	|ЛьготнаяСтавка,
	|СуммаУменьшения,
	|НачалоДействияЛьготы,
	|ОкончаниеДействияЛьготы,
	|ОснованиеЛьготы,
	|ВидТранспортногоСредства");
	ЗаполнитьЗначенияСвойств(ПараметрыЛьготы, ДанныеНастройки);
	
	ПараметрыЛьготы.Период = ДанныеНастройки.ДатаПараметров;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЛьготы);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("ДанныеНастройки", ДанныеНастройки);
	ДопПараметры.Вставить("ОбработкаНастройки", ОбработкаНастройки);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкаЛьготыПоТранспортномуНалогуЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.НастройкаЛьготыПоТранспортномуНалогу", 
		ПараметрыФормы, Форма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура НастройкаЛьготыПоТранспортномуНалогуЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") 
		ИЛИ ДопПараметры.Форма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Форма.Модифицированность = Истина;
	
	ЗаполнитьЗначенияСвойств(ДопПараметры.ДанныеНастройки, Результат);
	
	ВыполнитьОбработкуОповещения(ДопПараметры.ОбработкаНастройки, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ВыбратьКодИзКлассификатора(ИмяКода, НазваниеМакета, НазваниеОбъекта, Дата, ТекущийКод, ОбработкаВыбора) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОбъекта", "РегистрСведений");
	ПараметрыФормы.Вставить("НазваниеОбъекта", НазваниеОбъекта);
	ПараметрыФормы.Вставить("НазваниеМакета", НазваниеМакета);
	ПараметрыФормы.Вставить("ТекущийПериод", Дата);
	ПараметрыФормы.Вставить("ТекущийКод", ТекущийКод);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяКода", ИмяКода);
	ДопПараметры.Вставить("ТекущийКод", ТекущийКод);
	ДопПараметры.Вставить("ТекущийКод", ТекущийКод);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОбработкаВыбора);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти