////////////////////////////////////////////////////////////////////////////////
// Управление производством: содержит процедуры для управления производством.
// Модуль входит в подсистему "УправлениеПредприятием".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует представление заказа на производство.
//
// Параметры:
//  Ссылка	 - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ на производство
//  Префикс	 - Строка								 - префикс.
// 
// Возвращаемое значение:
//  Строка - представление заказа на производство.
//
Функция ПредставлениеЗаказа(Ссылка, Префикс = Неопределено) Экспорт
	
	Возврат Документы.ЗаказНаПроизводство2_2.ПредставлениеЗаказа(Ссылка, Префикс);
	
КонецФункции

// Формирует представление этапа производства по данным документа.
//
// Параметры:
//  ДанныеЭтапа - см. Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа.
// 
// Возвращаемое значение:
//  Строка - представление этапа производства.
//
Функция ПредставлениеЭтапа(ДанныеЭтапа) Экспорт
	
	Возврат Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа(ДанныеЭтапа);
	
КонецФункции

// Устанавливает дату с учетом переданной отметки
//
// Параметры:
//  Отметка		 - Булево	 - отметка
//  ПолеДата	 - Дата		 - реквизит, в котором нужно установить дату
//  ДатаСобытия	 - Дата		 - устанавливаемая дата
//  Затереть	 - Булево	 - признак, что дату нужно установить принудительно.
//
Процедура УстановитьДатуПоОтметке(Отметка, ПолеДата, ДатаСобытия = Неопределено, Затереть = Ложь) Экспорт
	
	УправлениеПроизводством.УстановитьДатуПоОтметке(
				Отметка,
				ПолеДата, ДатаСобытия, Затереть);
	
КонецПроцедуры

// Возвращает значения заполнения нового этапа производства
//
// Параметры:
//  Распоряжение				 - ДокументСсылка.ЗаказНаПроизводство2_2 			 - заказ на производство
//  НазначениеПродукция			 - СправочникСсылка.Назначения						 - назначение продукции ( при обособлении по целевому назначению )
//  ПартияПроизводства			 - СправочникСсылка.ПартииПроизводства				 - партия производства
//  ТипПроизводственногоПроцесса - ПеречислениеСсылка.ТипыПроизводственныхПроцессов	 - тип производственного процесса.
//  Спецификация				 - СправочникСсылка.РесурсныеСпецификации			 - ресурсная спецификация.
// 
// Возвращаемое значение:
//  Структура - значения заполнения нового этапа производства:
//   * Распоряжение                     - ДокументСсылка.ЗаказНаПроизводство2_2 -
//   * ДинамическаяСтруктура            - Булево -
//   * Организация                      - СправочникСсылка.Организации -
//   * ХозяйственнаяОперация            - ПеречислениеСсылка.ХозяйственныеОперации -
//   * НаправлениеДеятельности          - СправочникСсылка.НаправленияДеятельности -
//   * Партнер                          - СправочникСсылка.Партнеры -
//   * Договор                          - СправочникСсылка.ДоговорыКонтрагентов -
//   * ВыпускПодДеятельность            - ПеречислениеСсылка.ТипыНалогообложенияНДС -
//   * ОперацияКакРаспоряжениеВыработки - см. УправлениеПроизводством.ИспользуетсяОперацияКакРаспоряжениеВыработки
//   * ВидЦены                          - см. Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ
//   * Валюта                           - см. ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета
//   * ВариантПриемкиТоваров            - ПеречислениеСсылка.ВариантыПриемкиТоваров -
//   * НазначениеПродукция              - СправочникСсылка.Назначения -
//   * ПартияПроизводства               - СправочникСсылка.ПартииПроизводства -
//   * ТипПроизводственногоПроцесса     - ПеречислениеСсылка.ТипыПроизводственныхПроцессов -
//   * Спецификация                     - СправочникСсылка.РесурсныеСпецификации -
//   * ОтветственноеПодразделение       - см. Справочники.РесурсныеСпецификации.ОтветственноеПодразделение
//
Функция ЗначенияЗаполненияНовогоЭтапаПроизводства(Распоряжение,
													НазначениеПродукция,
													ПартияПроизводства,
													ТипПроизводственногоПроцесса,
													Спецификация) Экспорт
	
	Результат = РеквизитыНовогоЭтапаПроизводства();
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("Распоряжение", "Ссылка");
	ИменаРеквизитов.Вставить("ДинамическаяСтруктура");
	ИменаРеквизитов.Вставить("Организация");
	ИменаРеквизитов.Вставить("ХозяйственнаяОперация");
	ИменаРеквизитов.Вставить("НаправлениеДеятельности");
	ИменаРеквизитов.Вставить("Партнер");
	ИменаРеквизитов.Вставить("Договор");
	ИменаРеквизитов.Вставить("ВыпускПодДеятельность", "ЗаказПодДеятельность");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Результат, ЗначенияРеквизитов);
	
	Если ЗначениеЗаполнено(НазначениеПродукция) Тогда
		НаправлениеДеятельности = УправлениеПроизводствомПовтИсп.НаправлениеДеятельностиНазначенияПродукции(НазначениеПродукция);
		Результат.НаправлениеДеятельности = НаправлениеДеятельности;
	КонецЕсли;
	
	ОтветственноеПодразделение = Справочники.РесурсныеСпецификации.ОтветственноеПодразделение(Спецификация);
	Результат.ОтветственноеПодразделение = ОтветственноеПодразделение;
	
	Результат.НазначениеПродукция = НазначениеПродукция;
	Результат.ПартияПроизводства = ПартияПроизводства;
	Результат.ТипПроизводственногоПроцесса = ТипПроизводственногоПроцесса;
	Результат.Спецификация = Спецификация;
	
	Возврат Результат;
	
КонецФункции

// Перечень реквизитов для заполнения нового этапа производства.
// Заполнены значения реквизитов, не зависящих от данных.
// 
// Возвращаемое значение:
//  Структура - Реквизиты нового этапа производства:
// * Распоряжение - Неопределено
// * ДинамическаяСтруктура - Неопределено
// * Организация - Неопределено
// * ХозяйственнаяОперация - Неопределено
// * НаправлениеДеятельности - Неопределено
// * Партнер - Неопределено
// * Договор - Неопределено
// * ВыпускПодДеятельность - Неопределено
// * НазначениеПродукция - Неопределено
// * ПартияПроизводства - Неопределено
// * ТипПроизводственногоПроцесса - Неопределено
// * Спецификация - Неопределено
// * ОтветственноеПодразделение - Неопределено
// * ОперацияКакРаспоряжениеВыработки - Булево - 
// * ВидЦены - СправочникСсылка.ВидыЦен, Неопределено - 
// * Валюта - СправочникСсылка.Валюты, Неопределено - 
// * ВариантПриемкиТоваров - ПеречислениеСсылка.ВариантыПриемкиТоваров
//
Функция РеквизитыНовогоЭтапаПроизводства() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Распоряжение", Неопределено);
	Результат.Вставить("ДинамическаяСтруктура", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("ХозяйственнаяОперация", Неопределено);
	Результат.Вставить("НаправлениеДеятельности", Неопределено);
	Результат.Вставить("Партнер", Неопределено);
	Результат.Вставить("Договор", Неопределено);
	Результат.Вставить("ВыпускПодДеятельность", Неопределено);
	Результат.Вставить("НазначениеПродукция", Неопределено);
	Результат.Вставить("ПартияПроизводства", Неопределено);
	Результат.Вставить("ТипПроизводственногоПроцесса", Неопределено);
	Результат.Вставить("Спецификация", Неопределено);
	Результат.Вставить("ОтветственноеПодразделение", Неопределено);
	
	ОперацияКакРаспоряжениеВыработки = УправлениеПроизводством.ИспользуетсяОперацияКакРаспоряжениеВыработки(
		ТекущаяДатаСеанса());
	Результат.Вставить("ОперацияКакРаспоряжениеВыработки", ОперацияКакРаспоряжениеВыработки);
	
	ВидЦены = Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ();
	Результат.Вставить("ВидЦены", ВидЦены);
	
	Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(
		Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
	Результат.Вставить("Валюта", Валюта);
	
	ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
	Результат.Вставить("ВариантПриемкиТоваров", ВариантПриемкиТоваров);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  МассивСсылок - Массив из ДокументСсылка.ЭтапПроизводства2_2 - список этапов производства.
// 
// Возвращаемое значение:
//  Соответствие из СправочникСсылка.СтруктураПредприятия - подразделения-исполнители этапов производства.
//
Функция ПодразделенияИсполнители(МассивСсылок) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСсылок, "Подразделение");
	
КонецФункции

// Параметры:
//  МассивЭтапов - Массив из ДокументСсылка.ЭтапПроизводства2_2
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЭтапПроизводства2_2 - список доступных для удаления этапов производства
//
Функция СписокДоступныхДляУдаленияЭтаповПроизводства(МассивЭтапов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ЭтапПроизводства2_2.ТекстЗапросаСписокДоступныхДляУдаленияЭтаповПроизводства();
	Запрос.УстановитьПараметр("МассивСсылок", МассивЭтапов);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Параметры:
//  ПартияПроизводства - см. Документы.ЭтапПроизводства2_2.ЭтапПоШтрихкодуПартииПроизводства.ПартияПроизводства
// 
// Возвращаемое значение:
//  ДокументСсылка.ЭтапПроизводства2_2, Неопределено -
//
Функция ЭтапПоШтрихкодуПартииПроизводства(ПартияПроизводства) Экспорт
	
	Возврат Документы.ЭтапПроизводства2_2.ЭтапПоШтрихкодуПартииПроизводства(ПартияПроизводства);
	
КонецФункции

// Возвращаемое значение:
//  Булево -
//
Функция ДинамическаяСтруктураЗаказовНаПроизводство() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство");
	
КонецФункции

#КонецОбласти
